--- crates/tracewake-core/src/events/envelope.rs
+++ replace decode_vec -> Result<Vec<String>, EventEnvelopeParseError> with Ok(vec![])
@@ -1167,21 +1167,17 @@
     values
         .iter()
         .map(|value| encode(value))
         .collect::<Vec<_>>()
         .join(";")
 }
 
 fn decode_vec(value: &str) -> Result<Vec<String>, EventEnvelopeParseError> {
-    if value.is_empty() {
-        Ok(Vec::new())
-    } else {
-        value.split(';').map(decode).collect()
-    }
+    Ok(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 fn encode(value: &str) -> String {
     value
         .as_bytes()
         .iter()
         .map(|byte| format!("{byte:02x}"))
         .collect()
