*** crates/tracewake-content/src/load.rs:114:5: replace registry_for_primary_bytes -> Result<tracewake_core::actions::ActionRegistry, SerializationError> with Ok(Default::default())

*** mutation diff:
--- crates/tracewake-content/src/load.rs
+++ replace registry_for_primary_bytes -> Result<tracewake_core::actions::ActionRegistry, SerializationError> with Ok(Default::default())
@@ -106,20 +106,17 @@
         epistemic_projection,
         seed_event_log,
     })
 }
 
 fn registry_for_primary_bytes(
     bytes: &[u8],
 ) -> Result<tracewake_core::actions::ActionRegistry, SerializationError> {
-    let text = std::str::from_utf8(bytes)
-        .map_err(|_| SerializationError::BadLine("non-utf8 fixture".to_string()))?;
-    let scope = fixture_scope_from_raw_lines(text)?;
-    Ok(registry_for_fixture_scope(scope))
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn fixture_scope_from_raw_lines(text: &str) -> Result<FixtureScope, SerializationError> {
     let mut scope = None;
     for line in text.lines() {
         let mut parts = line.split('|');
         match (parts.next(), parts.next(), parts.next()) {
             (Some("fixture_scope"), Some("phase1"), None) => {

---- fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture stdout ----

thread 'fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture' (9367) panicked at crates/tracewake-content/tests/fixtures_load.rs:661:6:

---- fixture_scope_raw_lines_drive_loader_registry_and_fail_closed stdout ----

thread 'fixture_scope_raw_lines_drive_loader_registry_and_fail_closed' (9369) panicked at crates/tracewake-content/tests/fixtures_load.rs:816:6:

---- fixture_fingerprint_reprices_secondary_file_bytes stdout ----

thread 'fixture_fingerprint_reprices_secondary_file_bytes' (9368) panicked at crates/tracewake-content/tests/fixtures_load.rs:629:6:

failures:
    all_fixtures_load_deterministically_and_validate
    fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture
    fixture_fingerprint_reprices_secondary_file_bytes
    fixture_scope_raw_lines_drive_loader_registry_and_fail_closed
    fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering
    phase3a_load_emits_authored_prehistory_seed_events
    seed_event_log_order_and_projection_provenance_are_causal_and_stable
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food
    stale_workplace_notice_superseded_by_newer_001

test result: FAILED. 25 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
