*** crates/tracewake-content/src/load.rs:125:13: delete match arm (Some("fixture_scope"), Some("phase1"), None) in fixture_scope_from_raw_lines

*** mutation diff:
--- crates/tracewake-content/src/load.rs
+++ delete match arm (Some("fixture_scope"), Some("phase1"), None) in fixture_scope_from_raw_lines
@@ -117,23 +117,17 @@
     Ok(registry_for_fixture_scope(scope))
 }
 
 fn fixture_scope_from_raw_lines(text: &str) -> Result<FixtureScope, SerializationError> {
     let mut scope = None;
     for line in text.lines() {
         let mut parts = line.split('|');
         match (parts.next(), parts.next(), parts.next()) {
-            (Some("fixture_scope"), Some("phase1"), None) => {
-                if scope.replace(FixtureScope::Phase1).is_some() {
-                    return Err(SerializationError::BadLine(
-                        "duplicate fixture_scope".to_string(),
-                    ));
-                }
-            }
+             /* ~ changed by cargo-mutants ~ */
             (Some("fixture_scope"), Some("phase2a_historical"), None) => {
                 if scope.replace(FixtureScope::Phase2AHistorical).is_some() {
                     return Err(SerializationError::BadLine(
                         "duplicate fixture_scope".to_string(),
                     ));
                 }
             }
             (Some("fixture_scope"), Some("phase3a_historical"), None) => {

---- load::tests::shuffled_input_paths_load_to_same_canonical_world stdout ----

thread 'load::tests::shuffled_input_paths_load_to_same_canonical_world' (12140) panicked at crates/tracewake-content/src/load.rs:503:10:
called `Result::unwrap()` on an `Err` value: Serialization(BadLine("fixture_scope|phase1"))

failures:
    load::tests::shuffled_input_paths_load_to_same_canonical_world

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
