*** crates/tracewake-content/src/load.rs:132:13: delete match arm (Some("fixture_scope"), Some("phase2a_historical"), None) in fixture_scope_from_raw_lines

*** mutation diff:
--- crates/tracewake-content/src/load.rs
+++ delete match arm (Some("fixture_scope"), Some("phase2a_historical"), None) in fixture_scope_from_raw_lines
@@ -124,23 +124,17 @@
         match (parts.next(), parts.next(), parts.next()) {
             (Some("fixture_scope"), Some("phase1"), None) => {
                 if scope.replace(FixtureScope::Phase1).is_some() {
                     return Err(SerializationError::BadLine(
                         "duplicate fixture_scope".to_string(),
                     ));
                 }
             }
-            (Some("fixture_scope"), Some("phase2a_historical"), None) => {
-                if scope.replace(FixtureScope::Phase2AHistorical).is_some() {
-                    return Err(SerializationError::BadLine(
-                        "duplicate fixture_scope".to_string(),
-                    ));
-                }
-            }
+             /* ~ changed by cargo-mutants ~ */
             (Some("fixture_scope"), Some("phase3a_historical"), None) => {
                 if scope.replace(FixtureScope::Phase3AHistorical).is_some() {
                     return Err(SerializationError::BadLine(
                         "duplicate fixture_scope".to_string(),
                     ));
                 }
             }
             (Some("fixture_scope"), ..) => {

---- fixture_scope_raw_lines_drive_loader_registry_and_fail_closed stdout ----

thread 'fixture_scope_raw_lines_drive_loader_registry_and_fail_closed' (14531) panicked at crates/tracewake-content/tests/fixtures_load.rs:829:6:
called `Result::unwrap()` on an `Err` value: Serialization(BadLine("fixture_scope|phase2a_historical"))

---- all_fixtures_load_deterministically_and_validate stdout ----

thread 'all_fixtures_load_deterministically_and_validate' (14527) panicked at crates/tracewake-content/tests/fixtures_load.rs:598:10:
called `Result::unwrap()` on an `Err` value: Serialization(BadLine("fixture_scope|phase2a_historical"))

failures:
    all_fixtures_load_deterministically_and_validate
    fixture_scope_raw_lines_drive_loader_registry_and_fail_closed

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
