*** crates/tracewake-content/src/load.rs:139:13: delete match arm (Some("fixture_scope"), Some("phase3a_historical"), None) in fixture_scope_from_raw_lines

*** mutation diff:
--- crates/tracewake-content/src/load.rs
+++ delete match arm (Some("fixture_scope"), Some("phase3a_historical"), None) in fixture_scope_from_raw_lines
@@ -131,23 +131,17 @@
             }
             (Some("fixture_scope"), Some("phase2a_historical"), None) => {
                 if scope.replace(FixtureScope::Phase2AHistorical).is_some() {
                     return Err(SerializationError::BadLine(
                         "duplicate fixture_scope".to_string(),
                     ));
                 }
             }
-            (Some("fixture_scope"), Some("phase3a_historical"), None) => {
-                if scope.replace(FixtureScope::Phase3AHistorical).is_some() {
-                    return Err(SerializationError::BadLine(
-                        "duplicate fixture_scope".to_string(),
-                    ));
-                }
-            }
+             /* ~ changed by cargo-mutants ~ */
             (Some("fixture_scope"), ..) => {
                 return Err(SerializationError::BadLine(line.to_string()));
             }
             _ => {}
         }
     }
     scope.ok_or(SerializationError::MissingField("fixture_scope"))
 }

---- fixture_scope_raw_lines_drive_loader_registry_and_fail_closed stdout ----

thread 'fixture_scope_raw_lines_drive_loader_registry_and_fail_closed' (16917) panicked at crates/tracewake-content/tests/fixtures_load.rs:846:6:
called `Result::unwrap()` on an `Err` value: Serialization(BadLine("fixture_scope|phase3a_historical"))

---- fixtures_load_location_embedded_marker_id_rejected_001 stdout ----

thread 'fixtures_load_location_embedded_marker_id_rejected_001' (16923) panicked at crates/tracewake-content/tests/fixtures_load.rs:1309:9:
location-embedded shortcut marker must fail validation, got Serialization(BadLine("fixture_scope|phase3a_historical"))

---- fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering stdout ----

thread 'fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering' (16925) panicked at crates/tracewake-content/tests/fixtures_load.rs:1238:6:
called `Result::unwrap()` on an `Err` value: Serialization(BadLine("fixture_scope|phase3a_historical"))

failures:
    all_fixtures_load_deterministically_and_validate
    fixture_scope_raw_lines_drive_loader_registry_and_fail_closed
    fixtures_load_location_embedded_marker_id_rejected_001
    fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering
    fixtures_load_unsupported_schema_version_rejected_001
    phase3a_load_emits_authored_prehistory_seed_events
    seed_event_log_order_and_projection_provenance_are_causal_and_stable
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food
    stale_workplace_notice_superseded_by_newer_001

test result: FAILED. 25 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
