*** crates/tracewake-content/src/load.rs:146:13: delete match arm (Some("fixture_scope"), ..) in fixture_scope_from_raw_lines

*** mutation diff:
--- crates/tracewake-content/src/load.rs
+++ delete match arm (Some("fixture_scope"), ..) in fixture_scope_from_raw_lines
@@ -138,19 +138,17 @@
             }
             (Some("fixture_scope"), Some("phase3a_historical"), None) => {
                 if scope.replace(FixtureScope::Phase3AHistorical).is_some() {
                     return Err(SerializationError::BadLine(
                         "duplicate fixture_scope".to_string(),
                     ));
                 }
             }
-            (Some("fixture_scope"), ..) => {
-                return Err(SerializationError::BadLine(line.to_string()));
-            }
+             /* ~ changed by cargo-mutants ~ */
             _ => {}
         }
     }
     scope.ok_or(SerializationError::MissingField("fixture_scope"))
 }
 
 fn seed_epistemic_projection(
     manifest_id: ContentManifestId,

---- fixture_scope_raw_lines_drive_loader_registry_and_fail_closed stdout ----

thread 'fixture_scope_raw_lines_drive_loader_registry_and_fail_closed' (19303) panicked at crates/tracewake-content/tests/fixtures_load.rs:909:9:
scope_unknown_rejected should fail with BadLine("fixture_scope|future_scope"), got Serialization(MissingField("fixture_scope"))

failures:
    fixture_scope_raw_lines_drive_loader_registry_and_fail_closed

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
