*** crates/tracewake-content/src/load.rs:175:5: replace seed_event_log -> EventLog with Default::default()

*** mutation diff:
--- crates/tracewake-content/src/load.rs
+++ replace seed_event_log -> EventLog with Default::default()
@@ -167,109 +167,17 @@
             })?;
             projection.record_applied_event(event.event_id.clone());
         }
     }
     Ok(projection)
 }
 
 fn seed_event_log(fixture: &FixtureSchema, manifest_id: ContentManifestId) -> EventLog {
-    let mut log = EventLog::new();
-    let mut sequence = 0_u64;
-
-    for belief in &fixture.initial_beliefs {
-        let event_id = EventId::new(format!(
-            "event_seed_initial_belief_{}",
-            belief.belief_id.as_str()
-        ))
-        .expect("fixture belief ids form valid seed event ids");
-        let source_event_id = match &belief.source {
-            SourceRef::Event(event_id) => event_id.as_str().to_string(),
-            SourceRef::Action(action_id) => action_id.as_str().to_string(),
-            SourceRef::Cause(_) => "cause_authored_prehistory".to_string(),
-        };
-        let mut event = seed_event(
-            event_id,
-            EventKind::InitialBeliefSeeded,
-            belief.holder_actor_id.clone(),
-            None,
-            sequence,
-            manifest_id.clone(),
-        );
-        event.payload = vec![
-            PayloadField::new("schema_version", EVENT_SCHEMA_V1),
-            PayloadField::new("source_kind", belief.source_kind.stable_id()),
-            PayloadField::new("belief_id", belief.belief_id.as_str()),
-            PayloadField::new("holder_actor_id", belief.holder_actor_id.as_str()),
-            PayloadField::new("proposition", belief.proposition.serialize_canonical()),
-            PayloadField::new("stance", belief.stance.stable_id()),
-            PayloadField::new("confidence", belief.confidence.serialize_canonical()),
-            PayloadField::new("source_event_id", source_event_id),
-            PayloadField::new("acquired_tick", belief.acquired_tick.value().to_string()),
-        ];
-        if let Some(channel) = belief.channel {
-            event
-                .payload
-                .push(PayloadField::new("channel", channel.stable_id()));
-        }
-        event.effects_summary = format!(
-            "authored prehistory seeded belief {} for {}",
-            belief.belief_id.as_str(),
-            belief.holder_actor_id.as_str()
-        );
-        log.append(event).expect("seed belief event is versioned");
-        sequence += 1;
-    }
-
-    for home in &fixture.homes {
-        append_starting_belief(
-            &mut log,
-            &mut sequence,
-            manifest_id.clone(),
-            home.actor_id.clone(),
-            "home_place",
-            home.place_id.as_str(),
-            home.place_id.as_str(),
-        );
-    }
-
-    for sleep_place in &fixture.sleep_places {
-        append_starting_belief(
-            &mut log,
-            &mut sequence,
-            manifest_id.clone(),
-            sleep_place.actor_id.clone(),
-            "sleep_place",
-            sleep_place.sleep_place_id.as_str(),
-            sleep_place.place_id.as_str(),
-        );
-    }
-
-    for edge in &fixture.known_food_sources {
-        let food = fixture
-            .food_supplies
-            .iter()
-            .find(|food| food.food_supply_id == edge.food_supply_id)
-            .expect("known food source references are validated before seed log construction");
-        append_starting_belief(
-            &mut log,
-            &mut sequence,
-            manifest_id.clone(),
-            edge.actor_id.clone(),
-            "household_food_source",
-            food.food_supply_id.as_str(),
-            serialize_location(&food.location),
-        );
-    }
-
-    for workplace in &fixture.workplaces {
-        append_role_assignment_notices(&mut log, &mut sequence, manifest_id.clone(), workplace);
-    }
-
-    log
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 fn serialize_location(location: &tracewake_core::location::Location) -> String {
     match location {
         tracewake_core::location::Location::AtPlace(place_id) => {
             format!("place:{}", place_id.as_str())
         }
         tracewake_core::location::Location::InContainer(container_id) => {

---- seed_event_log_order_and_projection_provenance_are_causal_and_stable stdout ----

thread 'seed_event_log_order_and_projection_provenance_are_causal_and_stable' (24523) panicked at crates/tracewake-content/tests/fixtures_load.rs:925:5:
assertion `left == right` failed
  left: 0
 right: 5

---- phase3a_load_emits_authored_prehistory_seed_events stdout ----

thread 'phase3a_load_emits_authored_prehistory_seed_events' (24521) panicked at crates/tracewake-content/tests/fixtures_load.rs:775:10:
workplace assignment notice is seeded

failures:
    phase3a_load_emits_authored_prehistory_seed_events
    seed_event_log_order_and_projection_provenance_are_causal_and_stable

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
