*** crates/tracewake-content/src/load.rs:219:18: replace += with -= in seed_event_log

*** mutation diff:
--- crates/tracewake-content/src/load.rs
+++ replace += with -= in seed_event_log
@@ -211,17 +211,17 @@
                 .push(PayloadField::new("channel", channel.stable_id()));
         }
         event.effects_summary = format!(
             "authored prehistory seeded belief {} for {}",
             belief.belief_id.as_str(),
             belief.holder_actor_id.as_str()
         );
         log.append(event).expect("seed belief event is versioned");
-        sequence += 1;
+        sequence -= /* ~ changed by cargo-mutants ~ */ 1;
     }
 
     for home in &fixture.homes {
         append_starting_belief(
             &mut log,
             &mut sequence,
             manifest_id.clone(),
             home.actor_id.clone(),

---- fixture_fingerprint_reprices_secondary_file_bytes stdout ----

thread 'fixture_fingerprint_reprices_secondary_file_bytes' (26885) panicked at crates/tracewake-content/src/load.rs:219:9:
attempt to subtract with overflow

---- fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture stdout ----

thread 'fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture' (26884) panicked at crates/tracewake-content/src/load.rs:219:9:
attempt to subtract with overflow

---- seed_event_log_order_and_projection_provenance_are_causal_and_stable stdout ----

thread 'seed_event_log_order_and_projection_provenance_are_causal_and_stable' (26909) panicked at crates/tracewake-content/src/load.rs:219:9:
attempt to subtract with overflow

failures:
    all_fixtures_load_deterministically_and_validate
    fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture
    fixture_fingerprint_reprices_secondary_file_bytes
    seed_event_log_order_and_projection_provenance_are_causal_and_stable

test result: FAILED. 30 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
