*** crates/tracewake-content/src/load.rs:219:18: replace += with *= in seed_event_log

*** mutation diff:
--- crates/tracewake-content/src/load.rs
+++ replace += with *= in seed_event_log
@@ -211,17 +211,17 @@
                 .push(PayloadField::new("channel", channel.stable_id()));
         }
         event.effects_summary = format!(
             "authored prehistory seeded belief {} for {}",
             belief.belief_id.as_str(),
             belief.holder_actor_id.as_str()
         );
         log.append(event).expect("seed belief event is versioned");
-        sequence += 1;
+        sequence *= /* ~ changed by cargo-mutants ~ */ 1;
     }
 
     for home in &fixture.homes {
         append_starting_belief(
             &mut log,
             &mut sequence,
             manifest_id.clone(),
             home.actor_id.clone(),

---- seed_event_log_order_and_projection_provenance_are_causal_and_stable stdout ----

thread 'seed_event_log_order_and_projection_provenance_are_causal_and_stable' (29295) panicked at crates/tracewake-content/tests/fixtures_load.rs:936:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    seed_event_log_order_and_projection_provenance_are_causal_and_stable

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
