*** crates/tracewake-content/src/load.rs:250:46: replace == with != in seed_event_log

*** mutation diff:
--- crates/tracewake-content/src/load.rs
+++ replace == with != in seed_event_log
@@ -242,17 +242,17 @@
             sleep_place.place_id.as_str(),
         );
     }
 
     for edge in &fixture.known_food_sources {
         let food = fixture
             .food_supplies
             .iter()
-            .find(|food| food.food_supply_id == edge.food_supply_id)
+            .find(|food| food.food_supply_id != /* ~ changed by cargo-mutants ~ */ edge.food_supply_id)
             .expect("known food source references are validated before seed log construction");
         append_starting_belief(
             &mut log,
             &mut sequence,
             manifest_id.clone(),
             edge.actor_id.clone(),
             "household_food_source",
             food.food_supply_id.as_str(),

---- phase3a_load_emits_authored_prehistory_seed_events stdout ----

thread 'phase3a_load_emits_authored_prehistory_seed_events' (31679) panicked at crates/tracewake-content/src/load.rs:251:14:
known food source references are validated before seed log construction

---- all_fixtures_load_deterministically_and_validate stdout ----

thread 'all_fixtures_load_deterministically_and_validate' (31654) panicked at crates/tracewake-content/src/load.rs:251:14:
known food source references are validated before seed log construction

failures:
    all_fixtures_load_deterministically_and_validate
    phase3a_load_emits_authored_prehistory_seed_events

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
