*** crates/tracewake-content/src/load.rs:271:5: replace serialize_location -> String with String::new()

*** mutation diff:
--- crates/tracewake-content/src/load.rs
+++ replace serialize_location -> String with String::new()
@@ -263,27 +263,17 @@
     for workplace in &fixture.workplaces {
         append_role_assignment_notices(&mut log, &mut sequence, manifest_id.clone(), workplace);
     }
 
     log
 }
 
 fn serialize_location(location: &tracewake_core::location::Location) -> String {
-    match location {
-        tracewake_core::location::Location::AtPlace(place_id) => {
-            format!("place:{}", place_id.as_str())
-        }
-        tracewake_core::location::Location::InContainer(container_id) => {
-            format!("container:{}", container_id.as_str())
-        }
-        tracewake_core::location::Location::CarriedBy(actor_id) => {
-            format!("actor:{}", actor_id.as_str())
-        }
-    }
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn append_starting_belief(
     log: &mut EventLog,
     sequence: &mut u64,
     manifest_id: ContentManifestId,
     actor_id: ActorId,
     belief_kind: &str,

---- partial_food_source_knowledge_seeds_only_authored_actor_edge stdout ----

thread 'partial_food_source_knowledge_seeds_only_authored_actor_edge' (1650) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2073:5:
assertion failed: mara_known.known_food_sources().contains("food_shared_pantry")

---- planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit stdout ----

thread 'planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit' (1655) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1603:6:
called `Result::unwrap()` on an `Err` value: NoApplicableMethod { family: EatMeal, reason: "no actor-known method inputs for eat_meal" }

failures:
    partial_food_source_knowledge_seeds_only_authored_actor_edge
    planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit

test result: FAILED. 40 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.51s

*** result: Failure(101)
