*** crates/tracewake-content/src/load.rs:322:15: replace += with -= in append_starting_belief

*** mutation diff:
--- crates/tracewake-content/src/load.rs
+++ replace += with -= in append_starting_belief
@@ -314,17 +314,17 @@
         PayloadField::new("value", value),
     ];
     event.effects_summary = format!(
         "authored prehistory recorded {belief_kind} for {}",
         actor_id.as_str()
     );
     log.append(event)
         .expect("starting belief seed event is versioned");
-    *sequence += 1;
+    *sequence -= /* ~ changed by cargo-mutants ~ */ 1;
 }
 
 fn append_role_assignment_notices(
     log: &mut EventLog,
     sequence: &mut u64,
     manifest_id: ContentManifestId,
     workplace: &WorkplaceSchema,
 ) {

---- fixture_scope_raw_lines_drive_loader_registry_and_fail_closed stdout ----

thread 'fixture_scope_raw_lines_drive_loader_registry_and_fail_closed' (8871) panicked at crates/tracewake-content/src/load.rs:322:5:
attempt to subtract with overflow

---- fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering stdout ----

thread 'fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering' (8879) panicked at crates/tracewake-content/src/load.rs:322:5:
attempt to subtract with overflow

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (8895) panicked at crates/tracewake-content/src/load.rs:322:5:
attempt to subtract with overflow

failures:
    all_fixtures_load_deterministically_and_validate
    fixture_scope_raw_lines_drive_loader_registry_and_fail_closed
    fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering
    phase3a_load_emits_authored_prehistory_seed_events
    seed_event_log_order_and_projection_provenance_are_causal_and_stable
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food
    stale_workplace_notice_superseded_by_newer_001

test result: FAILED. 27 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
