*** crates/tracewake-content/src/load.rs:322:15: replace += with *= in append_starting_belief

*** mutation diff:
--- crates/tracewake-content/src/load.rs
+++ replace += with *= in append_starting_belief
@@ -314,17 +314,17 @@
         PayloadField::new("value", value),
     ];
     event.effects_summary = format!(
         "authored prehistory recorded {belief_kind} for {}",
         actor_id.as_str()
     );
     log.append(event)
         .expect("starting belief seed event is versioned");
-    *sequence += 1;
+    *sequence *= /* ~ changed by cargo-mutants ~ */ 1;
 }
 
 fn append_role_assignment_notices(
     log: &mut EventLog,
     sequence: &mut u64,
     manifest_id: ContentManifestId,
     workplace: &WorkplaceSchema,
 ) {

---- seed_event_log_order_and_projection_provenance_are_causal_and_stable stdout ----

thread 'seed_event_log_order_and_projection_provenance_are_causal_and_stable' (11280) panicked at crates/tracewake-content/tests/fixtures_load.rs:936:9:
assertion `left == right` failed
  left: 1
 right: 2

failures:
    seed_event_log_order_and_projection_provenance_are_causal_and_stable

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
