*** crates/tracewake-content/src/load.rs:331:5: replace append_role_assignment_notices with ()

*** mutation diff:
--- crates/tracewake-content/src/load.rs
+++ replace append_role_assignment_notices with ()
@@ -323,47 +323,17 @@
 }
 
 fn append_role_assignment_notices(
     log: &mut EventLog,
     sequence: &mut u64,
     manifest_id: ContentManifestId,
     workplace: &WorkplaceSchema,
 ) {
-    for actor_id in &workplace.assigned_actor_ids {
-        let mut event = seed_event(
-            EventId::new(format!(
-                "event_seed_role_assignment_notice_{}_{}",
-                actor_id.as_str(),
-                workplace.workplace_id.as_str()
-            ))
-            .expect("fixture ids form valid role-assignment event ids"),
-            EventKind::RoleAssignmentNoticeRecorded,
-            actor_id.clone(),
-            Some(workplace.place_id.clone()),
-            *sequence,
-            manifest_id.clone(),
-        );
-        event.payload = vec![
-            PayloadField::new("schema_version", EVENT_SCHEMA_V1),
-            PayloadField::new("source_kind", "authored_prehistory"),
-            PayloadField::new("actor_id", actor_id.as_str()),
-            PayloadField::new("workplace_id", workplace.workplace_id.as_str()),
-            PayloadField::new("place_id", workplace.place_id.as_str()),
-            PayloadField::new("access_open", workplace.role_notice_access_open.to_string()),
-        ];
-        event.effects_summary = format!(
-            "authored prehistory recorded workplace assignment {} for {}",
-            workplace.workplace_id.as_str(),
-            actor_id.as_str()
-        );
-        log.append(event)
-            .expect("role assignment seed event is versioned");
-        *sequence += 1;
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn seed_event(
     event_id: EventId,
     event_type: EventKind,
     actor_id: ActorId,
     place_id: Option<PlaceId>,
     sequence: u64,

---- phase3a_load_emits_authored_prehistory_seed_events stdout ----

thread 'phase3a_load_emits_authored_prehistory_seed_events' (13664) panicked at crates/tracewake-content/tests/fixtures_load.rs:775:10:
workplace assignment notice is seeded

---- seed_event_log_order_and_projection_provenance_are_causal_and_stable stdout ----

thread 'seed_event_log_order_and_projection_provenance_are_causal_and_stable' (13666) panicked at crates/tracewake-content/tests/fixtures_load.rs:925:5:
assertion `left == right` failed
  left: 3
 right: 5

failures:
    phase3a_load_emits_authored_prehistory_seed_events
    seed_event_log_order_and_projection_provenance_are_causal_and_stable

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
