*** crates/tracewake-content/src/load.rs:360:19: replace += with -= in append_role_assignment_notices

*** mutation diff:
--- crates/tracewake-content/src/load.rs
+++ replace += with -= in append_role_assignment_notices
@@ -352,17 +352,17 @@
         ];
         event.effects_summary = format!(
             "authored prehistory recorded workplace assignment {} for {}",
             workplace.workplace_id.as_str(),
             actor_id.as_str()
         );
         log.append(event)
             .expect("role assignment seed event is versioned");
-        *sequence += 1;
+        *sequence -= /* ~ changed by cargo-mutants ~ */ 1;
     }
 }
 
 fn seed_event(
     event_id: EventId,
     event_type: EventKind,
     actor_id: ActorId,
     place_id: Option<PlaceId>,

---- seed_event_log_order_and_projection_provenance_are_causal_and_stable stdout ----

thread 'seed_event_log_order_and_projection_provenance_are_causal_and_stable' (16052) panicked at crates/tracewake-content/tests/fixtures_load.rs:936:9:
assertion `left == right` failed
  left: 2
 right: 4

failures:
    seed_event_log_order_and_projection_provenance_are_causal_and_stable

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
