*** crates/tracewake-content/src/load.rs:396:5: replace registry_for_fixture_scope -> tracewake_core::actions::ActionRegistry with Default::default()

*** mutation diff:
--- crates/tracewake-content/src/load.rs
+++ replace registry_for_fixture_scope -> tracewake_core::actions::ActionRegistry with Default::default()
@@ -388,34 +388,17 @@
     );
     event.actor_id = Some(actor_id.clone());
     event.participants = vec![actor_id.to_string()];
     event.place_id = place_id;
     event
 }
 
 pub fn registry_for_fixture_scope(scope: FixtureScope) -> tracewake_core::actions::ActionRegistry {
-    let mut registry = tracewake_core::actions::ActionRegistry::new();
-    registry.register_phase1_movement_open_close();
-    registry.register_phase1_take_place();
-    registry.register_phase1_inspect_wait();
-    match scope {
-        FixtureScope::Phase1 => {}
-        FixtureScope::Phase2AHistorical => {
-            registry.register_phase2a_epistemics();
-        }
-        FixtureScope::Phase3AHistorical => {
-            registry.register_phase2a_epistemics();
-            registry.register_phase3a_sleep();
-            registry.register_phase3a_eat();
-            registry.register_phase3a_work();
-            registry.register_phase3a_continue_routine();
-        }
-    }
-    registry
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::schema::{
         ActorSchema, ContainerSchema, FixtureSchema, FixtureScope, InitialNeedSchema, ItemSchema,
         NeedModelSchema, PlaceSchema,

---- fixture_fingerprint_reprices_secondary_file_bytes stdout ----

thread 'fixture_fingerprint_reprices_secondary_file_bytes' (21225) panicked at crates/tracewake-content/tests/fixtures_load.rs:629:6:

---- fixture_scope_raw_lines_drive_loader_registry_and_fail_closed stdout ----

thread 'fixture_scope_raw_lines_drive_loader_registry_and_fail_closed' (21226) panicked at crates/tracewake-content/tests/fixtures_load.rs:816:6:

---- fixtures_declare_scope_and_phase1_registry_excludes_later_actions stdout ----

thread 'fixtures_declare_scope_and_phase1_registry_excludes_later_actions' (21230) panicked at crates/tracewake-content/tests/fixtures_load.rs:1034:9:
Phase 1 registry must expose move

failures:
    all_fixtures_load_deterministically_and_validate
    fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture
    fixture_fingerprint_reprices_secondary_file_bytes
    fixture_scope_raw_lines_drive_loader_registry_and_fail_closed
    fixtures_declare_scope_and_phase1_registry_excludes_later_actions
    fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering
    phase3a_load_emits_authored_prehistory_seed_events
    seed_event_log_order_and_projection_provenance_are_causal_and_stable
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food
    stale_workplace_notice_superseded_by_newer_001

test result: FAILED. 24 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
