*** crates/tracewake-content/src/manifest.rs:55:5: replace stable_fingerprint -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-content/src/manifest.rs
+++ replace stable_fingerprint -> String with "xyzzy".into()
@@ -47,22 +47,17 @@
         payload.extend_from_slice(b"\n--bytes--\n");
         payload.extend_from_slice(bytes);
         payload.extend_from_slice(b"\n");
     }
     payload
 }
 
 pub fn stable_fingerprint(bytes: &[u8]) -> String {
-    let mut hash = 0xcbf2_9ce4_8422_2325_u64;
-    for byte in bytes {
-        hash ^= u64::from(*byte);
-        hash = hash.wrapping_mul(0x0000_0100_0000_01b3);
-    }
-    format!("twf1-{hash:016x}")
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn manifest_carries_identity_and_fingerprint() {

---- manifest::tests::manifest_carries_identity_and_fingerprint stdout ----

thread 'manifest::tests::manifest_carries_identity_and_fingerprint' (31325) panicked at crates/tracewake-content/src/manifest.rs:81:9:
assertion failed: manifest.content_fingerprint.starts_with("twf1-")

---- manifest::tests::manifest_fingerprint_reprices_raw_file_bytes stdout ----

thread 'manifest::tests::manifest_fingerprint_reprices_raw_file_bytes' (31326) panicked at crates/tracewake-content/src/manifest.rs:101:9:
assertion `left != right` failed
  left: "xyzzy"
 right: "xyzzy"

failures:
    manifest::tests::manifest_carries_identity_and_fingerprint
    manifest::tests::manifest_fingerprint_reprices_raw_file_bytes

test result: FAILED. 34 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
