*** crates/tracewake-content/src/manifest.rs:57:14: replace ^= with |= in stable_fingerprint

*** mutation diff:
--- crates/tracewake-content/src/manifest.rs
+++ replace ^= with |= in stable_fingerprint
@@ -49,17 +49,17 @@
         payload.extend_from_slice(b"\n");
     }
     payload
 }
 
 pub fn stable_fingerprint(bytes: &[u8]) -> String {
     let mut hash = 0xcbf2_9ce4_8422_2325_u64;
     for byte in bytes {
-        hash ^= u64::from(*byte);
+        hash |= /* ~ changed by cargo-mutants ~ */ u64::from(*byte);
         hash = hash.wrapping_mul(0x0000_0100_0000_01b3);
     }
     format!("twf1-{hash:016x}")
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;

---- fixture_fingerprints_match_frozen_goldens stdout ----

thread 'fixture_fingerprints_match_frozen_goldens' (894) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:260:5:
fixture fingerprint goldens diverged:
aged_food_record_surfaces_as_remembered_belief_not_observation_001 fingerprint changed: expected twf1-5594c16c721cde82, actual twf1-618c899273b8404d
container_item_move_001 fingerprint changed: expected twf1-bc90d56dcf16b9d3, actual twf1-acbb033659bb04fd
debug_attach_001 fingerprint changed: expected twf1-7818100e3c7b9fd1, actual twf1-092469e13584ccfd
debug_omniscience_excluded_001 fingerprint changed: expected twf1-87f6032bf6fbdfba, actual twf1-8d683979c07f1a1d
door_access_001 fingerprint changed: expected twf1-eb38689018fcec34, actual twf1-6a29095779c99f7d
embodied_exits_require_perceived_or_known_route_001 fingerprint changed: expected twf1-2fd542c243164d0b, ac

failures:
    fixture_fingerprints_match_frozen_goldens

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.58s

*** result: Failure(101)
