*** crates/tracewake-content/src/manifest.rs:57:14: replace ^= with &= in stable_fingerprint

*** mutation diff:
--- crates/tracewake-content/src/manifest.rs
+++ replace ^= with &= in stable_fingerprint
@@ -49,17 +49,17 @@
         payload.extend_from_slice(b"\n");
     }
     payload
 }
 
 pub fn stable_fingerprint(bytes: &[u8]) -> String {
     let mut hash = 0xcbf2_9ce4_8422_2325_u64;
     for byte in bytes {
-        hash ^= u64::from(*byte);
+        hash &= /* ~ changed by cargo-mutants ~ */ u64::from(*byte);
         hash = hash.wrapping_mul(0x0000_0100_0000_01b3);
     }
     format!("twf1-{hash:016x}")
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;

---- manifest::tests::manifest_fingerprint_reprices_raw_file_bytes stdout ----

thread 'manifest::tests::manifest_fingerprint_reprices_raw_file_bytes' (2837) panicked at crates/tracewake-content/src/manifest.rs:106:9:
assertion `left != right` failed
  left: "twf1-0000000000000000"
 right: "twf1-0000000000000000"

failures:
    manifest::tests::manifest_fingerprint_reprices_raw_file_bytes

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
