*** crates/tracewake-content/src/schema.rs:213:5: replace content_field_registry -> &'static[ContentFieldRegistration] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/tracewake-content/src/schema.rs
+++ replace content_field_registry -> &'static[ContentFieldRegistration] with Vec::leak(Vec::new())
@@ -205,17 +205,17 @@
         canonical_serialization_key: "day_window",
         validation_phase: ValidationPhase::State,
         forbidden_construct_policy: ForbiddenConstructPolicy::TypedSchedule,
         diagnostic_code: "bad_tick_order",
     },
 ];
 
 pub fn content_field_registry() -> &'static [ContentFieldRegistration] {
-    CONTENT_FIELD_REGISTRY
+    Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn content_field_by_schema_field(
     schema_field: &str,
 ) -> Option<&'static ContentFieldRegistration> {
     CONTENT_FIELD_REGISTRY
         .iter()
         .find(|registration| registration.schema_field == schema_field)

---- content_new_field_requires_typed_validation_and_canonical_serialization_metadata stdout ----

thread 'content_new_field_requires_typed_validation_and_canonical_serialization_metadata' (4976) panicked at crates/tracewake-content/tests/forbidden_content.rs:573:5:
assertion `left == right` failed: every FixtureSchema field must have a content field registration
 right: {}

---- content_serialization_is_canonical_independent_of_authoring_order stdout ----

thread 'content_serialization_is_canonical_independent_of_authoring_order' (4978) panicked at crates/tracewake-content/tests/forbidden_content.rs:650:9:
serialized tag fixture is not backed by the typed registry

failures:
    content_new_field_requires_typed_validation_and_canonical_serialization_metadata
    content_serialization_is_canonical_independent_of_authoring_order

test result: FAILED. 22 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
