*** crates/tracewake-content/src/schema.rs:219:5: replace content_field_by_schema_field -> Option<&'static ContentFieldRegistration> with None

*** mutation diff:
--- crates/tracewake-content/src/schema.rs
+++ replace content_field_by_schema_field -> Option<&'static ContentFieldRegistration> with None
@@ -211,19 +211,17 @@
 
 pub fn content_field_registry() -> &'static [ContentFieldRegistration] {
     CONTENT_FIELD_REGISTRY
 }
 
 pub fn content_field_by_schema_field(
     schema_field: &str,
 ) -> Option<&'static ContentFieldRegistration> {
-    CONTENT_FIELD_REGISTRY
-        .iter()
-        .find(|registration| registration.schema_field == schema_field)
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn content_field_by_canonical_key(
     canonical_key: &str,
 ) -> Option<&'static ContentFieldRegistration> {
     CONTENT_FIELD_REGISTRY
         .iter()
         .find(|registration| registration.canonical_serialization_key == canonical_key)

---- load::tests::shuffled_input_paths_load_to_same_canonical_world stdout ----

thread 'load::tests::shuffled_input_paths_load_to_same_canonical_world' (7183) panicked at crates/tracewake-content/src/schema.rs:232:28:
FixtureSchema field fixture_id must be registered

---- serialization::tests::fixture_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::fixture_serialization_round_trips_byte_identically' (7188) panicked at crates/tracewake-content/src/schema.rs:232:28:
FixtureSchema field fixture_id must be registered

---- validate::tests::action_affordances_must_resolve_to_known_action_and_supported_target stdout ----

thread 'validate::tests::action_affordances_must_resolve_to_known_action_and_supported_target' (7189) panicked at crates/tracewake-content/src/schema.rs:232:28:
FixtureSchema field fixture_id must be registered

failures:
    load::tests::shuffled_input_paths_load_to_same_canonical_world
    serialization::tests::fixture_serialization_round_trips_byte_identically
    validate::tests::action_affordances_must_resolve_to_known_action_and_supported_target
    validate::tests::deterministic_ordering_hazards_sort_errors
    validate::tests::display_label_script_marker_is_rejected
    validate::tests::excessive_need_tuning_magnitude_is_rejected_against_need_max
    validate::tests::fixture_initial_need_out_of_band_rejected_001
    validate::tests::fixture_missing_actor_need_seed_rejected_001
    validate::tests::fixture_output_tag_script_marker_rejected_001
    validate::tests::fixture_relief_zero_and_need_gate_out_of_band_are_rejected_001
    validate::tests::fixture_schema_v1_golden_bytes_load_001
    validate::tests::fixture_schema_version_unsupported_rejected_001

test result: FAILED. 13 passed; 23 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
