*** crates/tracewake-content/src/schema.rs:221:56: replace == with != in content_field_by_schema_field

*** mutation diff:
--- crates/tracewake-content/src/schema.rs
+++ replace == with != in content_field_by_schema_field
@@ -213,17 +213,17 @@
     CONTENT_FIELD_REGISTRY
 }
 
 pub fn content_field_by_schema_field(
     schema_field: &str,
 ) -> Option<&'static ContentFieldRegistration> {
     CONTENT_FIELD_REGISTRY
         .iter()
-        .find(|registration| registration.schema_field == schema_field)
+        .find(|registration| registration.schema_field != /* ~ changed by cargo-mutants ~ */ schema_field)
 }
 
 pub fn content_field_by_canonical_key(
     canonical_key: &str,
 ) -> Option<&'static ContentFieldRegistration> {
     CONTENT_FIELD_REGISTRY
         .iter()
         .find(|registration| registration.canonical_serialization_key == canonical_key)

---- load::tests::shuffled_input_paths_load_to_same_canonical_world stdout ----

thread 'load::tests::shuffled_input_paths_load_to_same_canonical_world' (9399) panicked at crates/tracewake-content/src/load.rs:509:10:
called `Result::unwrap()` on an `Err` value: Serialization(MissingField("fixture_scope"))

---- serialization::tests::fixture_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::fixture_serialization_round_trips_byte_identically' (9404) panicked at crates/tracewake-content/src/serialization.rs:891:50:
called `Result::unwrap()` on an `Err` value: BadLine("fixture|5|3")

---- validate::tests::fixture_schema_version_unsupported_rejected_001 stdout ----

thread 'validate::tests::fixture_schema_version_unsupported_rejected_001' (9416) panicked at crates/tracewake-content/src/validate.rs:3114:9:
assertion `left == right` failed
  left: None
 right: Some((ParseSchema, "fixture.schema_version"))

failures:
    load::tests::shuffled_input_paths_load_to_same_canonical_world
    serialization::tests::fixture_serialization_round_trips_byte_identically
    validate::tests::fixture_schema_v1_golden_bytes_load_001
    validate::tests::fixture_schema_version_unsupported_rejected_001
    validate::tests::fixture_serialization_golden_bytes_are_pinned_001
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 28 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
