*** crates/tracewake-content/src/schema.rs:227:5: replace content_field_by_canonical_key -> Option<&'static ContentFieldRegistration> with None

*** mutation diff:
--- crates/tracewake-content/src/schema.rs
+++ replace content_field_by_canonical_key -> Option<&'static ContentFieldRegistration> with None
@@ -219,19 +219,17 @@
     CONTENT_FIELD_REGISTRY
         .iter()
         .find(|registration| registration.schema_field == schema_field)
 }
 
 pub fn content_field_by_canonical_key(
     canonical_key: &str,
 ) -> Option<&'static ContentFieldRegistration> {
-    CONTENT_FIELD_REGISTRY
-        .iter()
-        .find(|registration| registration.canonical_serialization_key == canonical_key)
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn canonical_key_for_schema_field(schema_field: &str) -> &'static str {
     content_field_by_schema_field(schema_field)
         .unwrap_or_else(|| panic!("FixtureSchema field {schema_field} must be registered"))
         .canonical_serialization_key
 }

---- load::tests::shuffled_input_paths_load_to_same_canonical_world stdout ----

thread 'load::tests::shuffled_input_paths_load_to_same_canonical_world' (11470) panicked at crates/tracewake-content/src/load.rs:509:10:

---- validate::tests::fixture_schema_v1_golden_bytes_load_001 stdout ----

thread 'validate::tests::fixture_schema_v1_golden_bytes_load_001' (11486) panicked at crates/tracewake-content/src/validate.rs:3087:81:

failures:
    load::tests::shuffled_input_paths_load_to_same_canonical_world
    validate::tests::fixture_schema_v1_golden_bytes_load_001

test result: FAILED. 34 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
