*** crates/tracewake-content/src/schema.rs:233:5: replace canonical_key_for_schema_field -> &'static str with ""

*** mutation diff:
--- crates/tracewake-content/src/schema.rs
+++ replace canonical_key_for_schema_field -> &'static str with ""
@@ -225,19 +225,17 @@
     canonical_key: &str,
 ) -> Option<&'static ContentFieldRegistration> {
     CONTENT_FIELD_REGISTRY
         .iter()
         .find(|registration| registration.canonical_serialization_key == canonical_key)
 }
 
 pub fn canonical_key_for_schema_field(schema_field: &str) -> &'static str {
-    content_field_by_schema_field(schema_field)
-        .unwrap_or_else(|| panic!("FixtureSchema field {schema_field} must be registered"))
-        .canonical_serialization_key
+    "" /* ~ changed by cargo-mutants ~ */
 }
 
 #[derive(Clone, Debug, PartialEq, Eq)]
 pub struct FixtureSchema {
     pub fixture_id: FixtureId,
     pub schema_version: SchemaVersion,
     pub fixture_scope: FixtureScope,
     pub need_model: NeedModelSchema,

---- load::tests::shuffled_input_paths_load_to_same_canonical_world stdout ----

thread 'load::tests::shuffled_input_paths_load_to_same_canonical_world' (15792) panicked at crates/tracewake-content/src/load.rs:509:10:
called `Result::unwrap()` on an `Err` value: Serialization(MissingField("fixture_scope"))

---- serialization::tests::fixture_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::fixture_serialization_round_trips_byte_identically' (15797) panicked at crates/tracewake-content/src/serialization.rs:891:50:
called `Result::unwrap()` on an `Err` value: BadLine("|strongbox_001")

---- validate::tests::fixture_schema_v1_golden_bytes_load_001 stdout ----

thread 'validate::tests::fixture_schema_v1_golden_bytes_load_001' (15808) panicked at crates/tracewake-content/src/validate.rs:3087:81:

failures:
    load::tests::shuffled_input_paths_load_to_same_canonical_world
    serialization::tests::fixture_serialization_round_trips_byte_identically
    validate::tests::fixture_schema_v1_golden_bytes_load_001
    validate::tests::fixture_schema_version_unsupported_rejected_001
    validate::tests::fixture_serialization_golden_bytes_are_pinned_001
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 28 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
