*** crates/tracewake-content/src/schema.rs:277:9: replace FixtureScope::stable_id -> &'static str with "xyzzy"

*** mutation diff:
--- crates/tracewake-content/src/schema.rs
+++ replace FixtureScope::stable_id -> &'static str with "xyzzy"
@@ -269,21 +269,17 @@
 pub enum FixtureScope {
     Phase1,
     Phase2AHistorical,
     Phase3AHistorical,
 }
 
 impl FixtureScope {
     pub const fn stable_id(self) -> &'static str {
-        match self {
-            Self::Phase1 => "phase1",
-            Self::Phase2AHistorical => "phase2a_historical",
-            Self::Phase3AHistorical => "phase3a_historical",
-        }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq)]
 pub struct ActorSchema {
     pub actor_id: ActorId,
     pub current_place_id: PlaceId,
 }

---- load::tests::shuffled_input_paths_load_to_same_canonical_world stdout ----

thread 'load::tests::shuffled_input_paths_load_to_same_canonical_world' (22005) panicked at crates/tracewake-content/src/load.rs:509:10:
called `Result::unwrap()` on an `Err` value: Serialization(BadLine("fixture_scope|xyzzy"))

---- serialization::tests::fixture_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::fixture_serialization_round_trips_byte_identically' (22010) panicked at crates/tracewake-content/src/serialization.rs:891:50:
called `Result::unwrap()` on an `Err` value: BadLine("bad fixture scope xyzzy")

---- validate::tests::fixture_serialization_golden_bytes_are_pinned_001 stdout ----

thread 'validate::tests::fixture_serialization_golden_bytes_are_pinned_001' (22023) panicked at crates/tracewake-content/src/validate.rs:3216:13:
assertion `left == right` failed: phase1 serialization golden changed

failures:
    load::tests::shuffled_input_paths_load_to_same_canonical_world
    serialization::tests::fixture_serialization_round_trips_byte_identically
    validate::tests::fixture_schema_v1_golden_bytes_load_001
    validate::tests::fixture_schema_version_unsupported_rejected_001
    validate::tests::fixture_serialization_golden_bytes_are_pinned_001
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 28 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
