*** crates/tracewake-content/src/schema.rs:541:9: replace FixtureSchema::populate_known_food_sources_for_all_actors with ()

*** mutation diff:
--- crates/tracewake-content/src/schema.rs
+++ replace FixtureSchema::populate_known_food_sources_for_all_actors with ()
@@ -533,31 +533,17 @@
             template.failure_modes.sort();
             template.fallback_rules.sort();
             template.debug_labels.sort();
             template.interruption_points.sort();
         }
     }
 
     pub fn populate_known_food_sources_for_all_actors(&mut self) {
-        self.known_food_sources = self
-            .actors
-            .iter()
-            .flat_map(|actor| {
-                self.food_supplies
-                    .iter()
-                    .map(move |food| KnownFoodSourceSchema {
-                        actor_id: actor.actor_id.clone(),
-                        food_supply_id: food.food_supply_id.clone(),
-                    })
-            })
-            .collect();
-        self.known_food_sources.sort_by(|left, right| {
-            (&left.actor_id, &left.food_supply_id).cmp(&(&right.actor_id, &right.food_supply_id))
-        });
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn to_physical_state(&self) -> PhysicalState {
         let mut actors = BTreeMap::new();
         let mut places = BTreeMap::new();
         let mut doors = BTreeMap::new();
         let mut containers = BTreeMap::new();
         let mut items = BTreeMap::new();

---- validate::tests::fixture_serialization_golden_bytes_are_pinned_001 stdout ----

thread 'validate::tests::fixture_serialization_golden_bytes_are_pinned_001' (26451) panicked at crates/tracewake-content/src/validate.rs:3216:13:
assertion `left == right` failed: phase3a serialization golden changed

failures:
    validate::tests::fixture_serialization_golden_bytes_are_pinned_001

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
