*** crates/tracewake-content/src/schema.rs:714:9: replace FixtureSchema::to_agent_state -> AgentState with Default::default()

*** mutation diff:
--- crates/tracewake-content/src/schema.rs
+++ replace FixtureSchema::to_agent_state -> AgentState with Default::default()
@@ -706,115 +706,17 @@
     ///
     /// ```compile_fail
     /// use tracewake_content::schema::FixtureSchema;
     ///
     /// let fixture: FixtureSchema = todo!();
     /// let _agent_state = fixture.to_agent_state();
     /// ```
     pub fn to_agent_state(&self, _validation: FixtureValidationToken) -> AgentState {
-        let mut needs_by_actor: BTreeMap<_, BTreeMap<_, _>> = BTreeMap::new();
-        let mut intentions = BTreeMap::new();
-        let mut active_intention_by_actor = BTreeMap::new();
-        let mut active_intention_candidates: BTreeMap<ActorId, (SimTick, IntentionId)> =
-            BTreeMap::new();
-        let mut routine_executions = BTreeMap::new();
-        for need in &self.initial_needs {
-            needs_by_actor
-                .entry(need.actor_id.clone())
-                .or_default()
-                .insert(
-                    need.kind,
-                    NeedState::initial(
-                        need.kind,
-                        i32::from(need.value),
-                        NeedChangeCause::FixtureInitial,
-                    ),
-                );
-        }
-        for actor in &self.actors {
-            needs_by_actor.entry(actor.actor_id.clone()).or_default();
-        }
-        for assignment in &self.routine_assignments {
-            let template = self
-                .routine_templates
-                .iter()
-                .find(|template| template.template_id == assignment.template_id)
-                .expect("validated routine assignment references existing template");
-            let actor_suffix = routine_assignment_actor_suffix(&assignment.actor_id);
-            let family_suffix = routine_family_assignment_suffix(template.family);
-            let intention_id =
-                IntentionId::new(format!("intention_{actor_suffix}_{family_suffix}")).unwrap();
-            let routine_execution_id =
-                RoutineExecutionId::new(format!("routine_exec_{actor_suffix}_{family_suffix}"))
-                    .unwrap();
-            let trace_id =
-                DecisionTraceId::new(format!("trace_{actor_suffix}_{family_suffix}")).unwrap();
-            let goal_id =
-                CandidateGoalId::new(format!("goal_{actor_suffix}_{family_suffix}")).unwrap();
-            let current_step = template.steps.first().map(|step| match step.proposed() {
-                RoutineStepProposal::Action(action_id) => action_id.as_str().to_string(),
-                RoutineStepProposal::Wait(reason) => reason.to_string(),
-                RoutineStepProposal::Diagnostic(diagnostic) => diagnostic.stable_id().to_string(),
-            });
-            let intention = Intention::adopt(
-                intention_id.clone(),
-                assignment.actor_id.clone(),
-                IntentionSource::FixtureRoutineAssignment,
-                goal_id,
-                Some(template.template_id.clone()),
-                current_step,
-                8,
-                assignment.start_tick,
-                trace_id.clone(),
-            );
-            active_intention_candidates
-                .entry(assignment.actor_id.clone())
-                .and_modify(|(start_tick, active_intention_id)| {
-                    if assignment.start_tick < *start_tick {
-                        *start_tick = assignment.start_tick;
-                        *active_intention_id = intention_id.clone();
-                    }
-                })
-                .or_insert((assignment.start_tick, intention_id.clone()));
-            assert!(
-                intentions.insert(intention_id, intention).is_none(),
-                "validated routine assignments produce unique intention IDs"
-            );
-            assert!(
-                routine_executions
-                    .insert(
-                        routine_execution_id.clone(),
-                        RoutineExecution::new(
-                            routine_execution_id,
-                            assignment.actor_id.clone(),
-                            template.template_id.clone(),
-                            template.family,
-                            assignment.start_tick,
-                            Some(assignment.start_tick.next()),
-                            Some(assignment.end_tick),
-                            template.reservable_resource.clone(),
-                            trace_id,
-                        ),
-                    )
-                    .is_none(),
-                "validated routine assignments produce unique routine execution IDs"
-            );
-        }
-        for (actor_id, (_start_tick, intention_id)) in active_intention_candidates {
-            active_intention_by_actor.insert(actor_id, intention_id);
-        }
-        AgentState::from_seed_parts(
-            needs_by_actor,
-            intentions,
-            active_intention_by_actor,
-            routine_executions,
-            BTreeMap::new(),
-            BTreeMap::new(),
-        )
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 pub(crate) fn routine_assignment_actor_suffix(actor_id: &ActorId) -> &str {
     actor_id
         .as_str()
         .strip_prefix("actor_")
         .unwrap_or(actor_id.as_str())

---- fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering stdout ----

thread 'fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering' (28697) panicked at crates/tracewake-content/tests/fixtures_load.rs:1249:54:
no entry found for key

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (28713) panicked at crates/tracewake-content/tests/fixtures_load.rs:1217:5:
assertion failed: report.ordinary_pipeline_events > 0

failures:
    fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
