*** crates/tracewake-content/src/schema.rs:740:55: replace == with != in FixtureSchema::to_agent_state

*** mutation diff:
--- crates/tracewake-content/src/schema.rs
+++ replace == with != in FixtureSchema::to_agent_state
@@ -732,17 +732,17 @@
         }
         for actor in &self.actors {
             needs_by_actor.entry(actor.actor_id.clone()).or_default();
         }
         for assignment in &self.routine_assignments {
             let template = self
                 .routine_templates
                 .iter()
-                .find(|template| template.template_id == assignment.template_id)
+                .find(|template| template.template_id != /* ~ changed by cargo-mutants ~ */ assignment.template_id)
                 .expect("validated routine assignment references existing template");
             let actor_suffix = routine_assignment_actor_suffix(&assignment.actor_id);
             let family_suffix = routine_family_assignment_suffix(template.family);
             let intention_id =
                 IntentionId::new(format!("intention_{actor_suffix}_{family_suffix}")).unwrap();
             let routine_execution_id =
                 RoutineExecutionId::new(format!("routine_exec_{actor_suffix}_{family_suffix}"))
                     .unwrap();

---- fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering stdout ----

thread 'fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering' (30803) panicked at crates/tracewake-content/src/schema.rs:741:18:
validated routine assignment references existing template

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (30819) panicked at crates/tracewake-content/src/schema.rs:741:18:
validated routine assignment references existing template

---- seed_event_log_order_and_projection_provenance_are_causal_and_stable stdout ----

thread 'seed_event_log_order_and_projection_provenance_are_causal_and_stable' (30818) panicked at crates/tracewake-content/src/schema.rs:741:18:
validated routine assignment references existing template

failures:
    all_fixtures_load_deterministically_and_validate
    fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering
    phase3a_load_emits_authored_prehistory_seed_events
    seed_event_log_order_and_projection_provenance_are_causal_and_stable
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 29 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
