*** crates/tracewake-content/src/schema.rs:772:46: replace < with == in FixtureSchema::to_agent_state

*** mutation diff:
--- crates/tracewake-content/src/schema.rs
+++ replace < with == in FixtureSchema::to_agent_state
@@ -764,17 +764,17 @@
                 current_step,
                 8,
                 assignment.start_tick,
                 trace_id.clone(),
             );
             active_intention_candidates
                 .entry(assignment.actor_id.clone())
                 .and_modify(|(start_tick, active_intention_id)| {
-                    if assignment.start_tick < *start_tick {
+                    if assignment.start_tick == /* ~ changed by cargo-mutants ~ */ *start_tick {
                         *start_tick = assignment.start_tick;
                         *active_intention_id = intention_id.clone();
                     }
                 })
                 .or_insert((assignment.start_tick, intention_id.clone()));
             assert!(
                 intentions.insert(intention_id, intention).is_none(),
                 "validated routine assignments produce unique intention IDs"

---- routine_assignment_start_tick_boundaries_select_authoritative_active_intention stdout ----

thread 'routine_assignment_start_tick_boundaries_select_authoritative_active_intention' (532) panicked at crates/tracewake-content/tests/schema_conformance.rs:288:5:
assertion `left == right` failed: later-ordered assignment below the current bound must replace the active candidate
  left: "intention_tomas_work"
 right: "intention_tomas_sleep"

failures:
    routine_assignment_start_tick_boundaries_select_authoritative_active_intention

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
