*** crates/tracewake-content/src/schema.rs:817:5: replace routine_assignment_actor_suffix -> &str with ""

*** mutation diff:
--- crates/tracewake-content/src/schema.rs
+++ replace routine_assignment_actor_suffix -> &str with ""
@@ -809,20 +809,17 @@
             routine_executions,
             BTreeMap::new(),
             BTreeMap::new(),
         )
     }
 }
 
 pub(crate) fn routine_assignment_actor_suffix(actor_id: &ActorId) -> &str {
-    actor_id
-        .as_str()
-        .strip_prefix("actor_")
-        .unwrap_or(actor_id.as_str())
+    "" /* ~ changed by cargo-mutants ~ */
 }
 
 pub(crate) fn routine_family_assignment_suffix(family: RoutineFamily) -> &'static str {
     match family {
         RoutineFamily::MorningWake => "wake",
         RoutineFamily::EatMeal => "eat",
         RoutineFamily::GoToWork => "go_work",
         RoutineFamily::WorkBlock => "work",

---- fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture stdout ----

thread 'fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture' (6966) panicked at crates/tracewake-content/tests/fixtures_load.rs:661:6:

---- fixture_fingerprint_reprices_secondary_file_bytes stdout ----

thread 'fixture_fingerprint_reprices_secondary_file_bytes' (6967) panicked at crates/tracewake-content/tests/fixtures_load.rs:629:6:

---- all_fixtures_load_deterministically_and_validate stdout ----

thread 'all_fixtures_load_deterministically_and_validate' (6964) panicked at crates/tracewake-content/tests/fixtures_load.rs:591:54:

failures:
    all_fixtures_load_deterministically_and_validate
    fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture
    fixture_fingerprint_reprices_secondary_file_bytes
    phase2a_fixtures_are_registered_and_script_free
    seed_event_log_order_and_projection_provenance_are_causal_and_stable
    valid_epistemic_seed_validates_and_round_trips_canonically

test result: FAILED. 28 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
