*** crates/tracewake-content/src/schema.rs:824:5: replace routine_family_assignment_suffix -> &'static str with ""

*** mutation diff:
--- crates/tracewake-content/src/schema.rs
+++ replace routine_family_assignment_suffix -> &'static str with ""
@@ -816,28 +816,17 @@
 pub(crate) fn routine_assignment_actor_suffix(actor_id: &ActorId) -> &str {
     actor_id
         .as_str()
         .strip_prefix("actor_")
         .unwrap_or(actor_id.as_str())
 }
 
 pub(crate) fn routine_family_assignment_suffix(family: RoutineFamily) -> &'static str {
-    match family {
-        RoutineFamily::MorningWake => "wake",
-        RoutineFamily::EatMeal => "eat",
-        RoutineFamily::GoToWork => "go_work",
-        RoutineFamily::WorkBlock => "work",
-        RoutineFamily::ReturnHome => "return_home",
-        RoutineFamily::SleepNight => "sleep",
-        RoutineFamily::FindFood => "find_food",
-        RoutineFamily::LeaveUnsafePlace => "leave_unsafe",
-        RoutineFamily::ContinueCurrentIntention => "continue",
-        RoutineFamily::Wait | RoutineFamily::IdleWithReason => "wait",
-    }
+    "" /* ~ changed by cargo-mutants ~ */
 }
 
 impl RoutineTemplateSchema {
     pub fn to_template(
         &self,
     ) -> Result<tracewake_core::agent::RoutineTemplate, tracewake_core::agent::RoutineTemplateError>
     {
         tracewake_core::agent::RoutineTemplate::new(

---- phase3a_load_emits_authored_prehistory_seed_events stdout ----

thread 'phase3a_load_emits_authored_prehistory_seed_events' (11201) panicked at crates/tracewake-content/tests/fixtures_load.rs:761:6:

---- all_fixtures_load_deterministically_and_validate stdout ----

thread 'all_fixtures_load_deterministically_and_validate' (11176) panicked at crates/tracewake-content/tests/fixtures_load.rs:591:54:

failures:
    all_fixtures_load_deterministically_and_validate
    phase3a_load_emits_authored_prehistory_seed_events

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
