*** crates/tracewake-content/src/serialization.rs:316:13: delete match arm ["need_model", awake_hunger_delta_per_tick, awake_fatigue_delta_per_tick] in deserialize_fixture

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ delete match arm ["need_model", awake_hunger_delta_per_tick, awake_fatigue_delta_per_tick] in deserialize_fixture
@@ -308,22 +308,17 @@
     let mut day_windows = Vec::new();
 
     for line in text.lines() {
         let parts = line.split('|').collect::<Vec<_>>();
         match parts.as_slice() {
             ["fixture", id] => fixture_id = Some(FixtureId::new(*id)?),
             ["schema", version] => schema_version = Some(SchemaVersion::new(*version)?),
             ["fixture_scope", scope] => fixture_scope = Some(parse_fixture_scope(scope)?),
-            ["need_model", awake_hunger_delta_per_tick, awake_fatigue_delta_per_tick] => {
-                need_model = Some(NeedModelSchema {
-                    awake_hunger_delta_per_tick: parse_i32(awake_hunger_delta_per_tick)?,
-                    awake_fatigue_delta_per_tick: parse_i32(awake_fatigue_delta_per_tick)?,
-                })
-            }
+             /* ~ changed by cargo-mutants ~ */
             ["actor", actor_id, place_id] => actors.push(ActorSchema {
                 actor_id: ActorId::new(*actor_id)?,
                 current_place_id: PlaceId::new(*place_id)?,
             }),
             ["place", place_id, label, adjacent, visibility_default] => places.push(PlaceSchema {
                 place_id: PlaceId::new(*place_id)?,
                 display_label: decode(label)?,
                 adjacent_place_ids: split_ids(adjacent, |part| PlaceId::new(part))?,

---- load::tests::shuffled_input_paths_load_to_same_canonical_world stdout ----

thread 'load::tests::shuffled_input_paths_load_to_same_canonical_world' (28503) panicked at crates/tracewake-content/src/load.rs:509:10:
called `Result::unwrap()` on an `Err` value: Validation(ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: ParseSchema, path: "fixture.line", code: "bad_line", message: "bad fixture line need_model|5|3" }] } })

---- serialization::tests::fixture_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::fixture_serialization_round_trips_byte_identically' (28508) panicked at crates/tracewake-content/src/serialization.rs:886:50:
called `Result::unwrap()` on an `Err` value: BadLine("need_model|5|3")

---- validate::tests::fixture_food_supply_negative_servings_rejected_001 stdout ----

thread 'validate::tests::fixture_food_supply_negative_servings_rejected_001' (28514) panicked at crates/tracewake-content/src/validate.rs:3226:9:
assertion failed: errors.report.errors.iter().any(|error|
        { error.code == "bad_number" && error.path == "fixture.number" })

failures:
    load::tests::shuffled_input_paths_load_to_same_canonical_world
    serialization::tests::fixture_serialization_round_trips_byte_identically
    validate::tests::fixture_food_supply_negative_servings_rejected_001
    validate::tests::fixture_schema_v1_golden_bytes_load_001
    validate::tests::fixture_schema_version_unsupported_rejected_001
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 28 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
