*** crates/tracewake-content/src/serialization.rs:332:13: delete match arm ["door", door_id, endpoint_a, endpoint_b, is_open, is_locked] in deserialize_fixture

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ delete match arm ["door", door_id, endpoint_a, endpoint_b, is_open, is_locked] in deserialize_fixture
@@ -324,25 +324,17 @@
                 current_place_id: PlaceId::new(*place_id)?,
             }),
             ["place", place_id, label, adjacent, visibility_default] => places.push(PlaceSchema {
                 place_id: PlaceId::new(*place_id)?,
                 display_label: decode(label)?,
                 adjacent_place_ids: split_ids(adjacent, |part| PlaceId::new(part))?,
                 visibility_default: parse_visibility_default(visibility_default)?,
             }),
-            ["door", door_id, endpoint_a, endpoint_b, is_open, is_locked] => {
-                doors.push(DoorSchema {
-                    door_id: DoorId::new(*door_id)?,
-                    endpoint_a: PlaceId::new(*endpoint_a)?,
-                    endpoint_b: PlaceId::new(*endpoint_b)?,
-                    is_open: parse_bool(is_open)?,
-                    is_locked: parse_bool(is_locked)?,
-                })
-            }
+             /* ~ changed by cargo-mutants ~ */
             ["container", container_id, place_id, is_open, is_locked, contents_visible_when_closed, contents] => {
                 containers.push(ContainerSchema {
                     container_id: ContainerId::new(*container_id)?,
                     place_id: PlaceId::new(*place_id)?,
                     is_open: parse_bool(is_open)?,
                     is_locked: parse_bool(is_locked)?,
                     contents_visible_when_closed: parse_bool(contents_visible_when_closed)?,
                     contents: split_ids(contents, |part| ItemId::new(part))?,

---- validate::tests::fixture_schema_version_unsupported_rejected_001 stdout ----

thread 'validate::tests::fixture_schema_version_unsupported_rejected_001' (2265) panicked at crates/tracewake-content/src/validate.rs:3114:9:
assertion `left == right` failed
  left: None
 right: Some((ParseSchema, "fixture.schema_version"))

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (2275) panicked at crates/tracewake-content/src/validate.rs:3685:49:

---- validate::tests::valid_fixture_produces_initial_world stdout ----

thread 'validate::tests::valid_fixture_produces_initial_world' (2281) panicked at crates/tracewake-content/src/validate.rs:3076:63:

failures:
    validate::tests::fixture_schema_version_unsupported_rejected_001
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 32 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
