*** crates/tracewake-content/src/serialization.rs:351:13: delete match arm ["item", item_id, portable, location] in deserialize_fixture

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ delete match arm ["item", item_id, portable, location] in deserialize_fixture
@@ -343,21 +343,17 @@
                     container_id: ContainerId::new(*container_id)?,
                     place_id: PlaceId::new(*place_id)?,
                     is_open: parse_bool(is_open)?,
                     is_locked: parse_bool(is_locked)?,
                     contents_visible_when_closed: parse_bool(contents_visible_when_closed)?,
                     contents: split_ids(contents, |part| ItemId::new(part))?,
                 })
             }
-            ["item", item_id, portable, location] => items.push(ItemSchema {
-                item_id: ItemId::new(*item_id)?,
-                portable: parse_bool(portable)?,
-                location: deserialize_location(location)?,
-            }),
+             /* ~ changed by cargo-mutants ~ */
             ["affordance", action_id, target_id] => affordances.push(ActionAffordanceSchema {
                 action_id: ActionId::new(*action_id)?,
                 target_id: (*target_id).to_string(),
             }),
             ["initial_belief", belief_id, holder_actor_id, proposition, stance, confidence, source_kind, source_id, channel, acquired_tick, last_verified_tick, privacy_scope, schema_version] => {
                 initial_beliefs.push(InitialBeliefSchema {
                     belief_id: BeliefId::new(*belief_id)?,
                     holder_actor_id: ActorId::new(*holder_actor_id)?,

---- load::tests::shuffled_input_paths_load_to_same_canonical_world stdout ----

thread 'load::tests::shuffled_input_paths_load_to_same_canonical_world' (6391) panicked at crates/tracewake-content/src/load.rs:509:10:

---- serialization::tests::fixture_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::fixture_serialization_round_trips_byte_identically' (6396) panicked at crates/tracewake-content/src/serialization.rs:887:50:
called `Result::unwrap()` on an `Err` value: BadLine("item|coin_stack_01|true|in:strongbox_tomas")

---- validate::tests::fixture_schema_version_unsupported_rejected_001 stdout ----

thread 'validate::tests::fixture_schema_version_unsupported_rejected_001' (6408) panicked at crates/tracewake-content/src/validate.rs:3114:9:
assertion `left == right` failed
  left: None
 right: Some((ParseSchema, "fixture.schema_version"))

failures:
    load::tests::shuffled_input_paths_load_to_same_canonical_world
    serialization::tests::fixture_serialization_round_trips_byte_identically
    validate::tests::fixture_schema_version_unsupported_rejected_001
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 30 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
