*** crates/tracewake-content/src/serialization.rs:356:13: delete match arm ["affordance", action_id, target_id] in deserialize_fixture

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ delete match arm ["affordance", action_id, target_id] in deserialize_fixture
@@ -348,20 +348,17 @@
                     contents: split_ids(contents, |part| ItemId::new(part))?,
                 })
             }
             ["item", item_id, portable, location] => items.push(ItemSchema {
                 item_id: ItemId::new(*item_id)?,
                 portable: parse_bool(portable)?,
                 location: deserialize_location(location)?,
             }),
-            ["affordance", action_id, target_id] => affordances.push(ActionAffordanceSchema {
-                action_id: ActionId::new(*action_id)?,
-                target_id: (*target_id).to_string(),
-            }),
+             /* ~ changed by cargo-mutants ~ */
             ["initial_belief", belief_id, holder_actor_id, proposition, stance, confidence, source_kind, source_id, channel, acquired_tick, last_verified_tick, privacy_scope, schema_version] => {
                 initial_beliefs.push(InitialBeliefSchema {
                     belief_id: BeliefId::new(*belief_id)?,
                     holder_actor_id: ActorId::new(*holder_actor_id)?,
                     proposition: Proposition::from_str(&decode(proposition)?)?,
                     stance: parse_stance(stance)?,
                     confidence: parse_confidence(confidence)?,
                     source_kind: parse_source_kind(source_kind)?,

---- validate::tests::fixture_schema_version_unsupported_rejected_001 stdout ----

thread 'validate::tests::fixture_schema_version_unsupported_rejected_001' (8481) panicked at crates/tracewake-content/src/validate.rs:3114:9:
assertion `left == right` failed
  left: None
 right: Some((ParseSchema, "fixture.schema_version"))

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (8491) panicked at crates/tracewake-content/src/validate.rs:3685:49:

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (8492) panicked at crates/tracewake-content/src/validate.rs:3650:59:

failures:
    validate::tests::fixture_schema_version_unsupported_rejected_001
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 32 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
