*** crates/tracewake-content/src/serialization.rs:376:13: delete match arm ["initial_need", actor_id, kind, value] in deserialize_fixture

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ delete match arm ["initial_need", actor_id, kind, value] in deserialize_fixture
@@ -368,21 +368,17 @@
                     source: parse_source(source_kind, source_id)?,
                     channel: parse_optional_channel(channel)?,
                     acquired_tick: parse_tick(acquired_tick)?,
                     last_verified_tick: parse_optional_tick(last_verified_tick)?,
                     privacy_scope: parse_privacy_scope(privacy_scope)?,
                     schema_version: SchemaVersion::new(*schema_version)?,
                 })
             }
-            ["initial_need", actor_id, kind, value] => initial_needs.push(InitialNeedSchema {
-                actor_id: ActorId::new(*actor_id)?,
-                kind: parse_need_kind(kind)?,
-                value: parse_u16(value)?,
-            }),
+             /* ~ changed by cargo-mutants ~ */
             ["home", actor_id, place_id] => homes.push(HomeSchema {
                 actor_id: ActorId::new(*actor_id)?,
                 place_id: PlaceId::new(*place_id)?,
             }),
             ["sleep_place", actor_id, place_id, sleep_place_id, access_open, duration_ticks, fatigue_recovery_per_tick, hunger_rise_per_tick] => {
                 sleep_places.push(SleepPlaceSchema {
                     actor_id: ActorId::new(*actor_id)?,
                     place_id: PlaceId::new(*place_id)?,

---- load::tests::shuffled_input_paths_load_to_same_canonical_world stdout ----

thread 'load::tests::shuffled_input_paths_load_to_same_canonical_world' (12643) panicked at crates/tracewake-content/src/load.rs:509:10:
called `Result::unwrap()` on an `Err` value: Validation(ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: ParseSchema, path: "fixture.line", code: "bad_line", message: "bad fixture line initial_need|actor_tomas|hunger|100" }] } })

---- serialization::tests::fixture_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::fixture_serialization_round_trips_byte_identically' (12648) panicked at crates/tracewake-content/src/serialization.rs:887:50:
called `Result::unwrap()` on an `Err` value: BadLine("initial_need|actor_tomas|hunger|100")

---- validate::tests::fixture_schema_v1_golden_bytes_load_001 stdout ----

thread 'validate::tests::fixture_schema_v1_golden_bytes_load_001' (12659) panicked at crates/tracewake-content/src/validate.rs:3087:81:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: ParseSchema, path: "fixture.line", code: "bad_line", message: "bad fixture line initial_need|actor_tomas|hunger|100" }] } }

failures:
    load::tests::shuffled_input_paths_load_to_same_canonical_world
    serialization::tests::fixture_serialization_round_trips_byte_identically
    validate::tests::fixture_schema_v1_golden_bytes_load_001
    validate::tests::fixture_schema_version_unsupported_rejected_001
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 29 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
