*** crates/tracewake-content/src/serialization.rs:381:13: delete match arm ["home", actor_id, place_id] in deserialize_fixture

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ delete match arm ["home", actor_id, place_id] in deserialize_fixture
@@ -373,20 +373,17 @@
                     schema_version: SchemaVersion::new(*schema_version)?,
                 })
             }
             ["initial_need", actor_id, kind, value] => initial_needs.push(InitialNeedSchema {
                 actor_id: ActorId::new(*actor_id)?,
                 kind: parse_need_kind(kind)?,
                 value: parse_u16(value)?,
             }),
-            ["home", actor_id, place_id] => homes.push(HomeSchema {
-                actor_id: ActorId::new(*actor_id)?,
-                place_id: PlaceId::new(*place_id)?,
-            }),
+             /* ~ changed by cargo-mutants ~ */
             ["sleep_place", actor_id, place_id, sleep_place_id, access_open, duration_ticks, fatigue_recovery_per_tick, hunger_rise_per_tick] => {
                 sleep_places.push(SleepPlaceSchema {
                     actor_id: ActorId::new(*actor_id)?,
                     place_id: PlaceId::new(*place_id)?,
                     sleep_place_id: SleepAffordanceId::new(*sleep_place_id)?,
                     access_open: parse_bool(access_open)?,
                     duration_ticks: parse_u64(duration_ticks)?,
                     fatigue_recovery_per_tick: parse_i32(fatigue_recovery_per_tick)?,

---- fixtures_load_location_embedded_marker_id_rejected_001 stdout ----

thread 'fixtures_load_location_embedded_marker_id_rejected_001' (14760) panicked at crates/tracewake-content/tests/fixtures_load.rs:1311:5:
assertion failed: failure.report.errors.iter().any(|error|
        {
            error.phase == ValidationPhase::NoScript &&
                    error.code == "authored_shortcut_effect" &&
                error.path == "food_supplies[0].location.place_id"
        })

---- fixtures_load_phase3a_missing_need_model_is_rejected stdout ----

thread 'fixtures_load_phase3a_missing_need_model_is_rejected' (14763) panicked at crates/tracewake-content/tests/fixtures_load.rs:1452:5:
assertion failed: report.errors.iter().any(|error|
        error.code == "missing_field" && error.path == "fixture.need_model")

---- fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering stdout ----

thread 'fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering' (14762) panicked at crates/tracewake-content/tests/fixtures_load.rs:1238:6:
called `Result::unwrap()` on an `Err` value: Validation(ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: ParseSchema, path: "fixture.line", code: "bad_line", message: "bad fixture line home|actor_tomas|home_tomas" }] } })

failures:
    all_fixtures_load_deterministically_and_validate
    fixtures_load_location_embedded_marker_id_rejected_001
    fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering
    fixtures_load_phase3a_missing_need_model_is_rejected
    fixtures_load_phase3a_missing_sleep_tuning_fields_are_rejected
    fixtures_load_unsupported_schema_version_rejected_001
    phase3a_load_emits_authored_prehistory_seed_events
    seed_event_log_order_and_projection_provenance_are_causal_and_stable
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food
    stale_workplace_notice_superseded_by_newer_001

test result: FAILED. 24 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
