*** crates/tracewake-content/src/serialization.rs:385:13: delete match arm ["sleep_place", actor_id, place_id, sleep_place_id, access_open, duration_ticks, fatigue_recovery_per_tick, hunger_rise_per_tick] in deserialize_fixture

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ delete match arm ["sleep_place", actor_id, place_id, sleep_place_id, access_open, duration_ticks, fatigue_recovery_per_tick, hunger_rise_per_tick] in deserialize_fixture
@@ -377,27 +377,17 @@
                 actor_id: ActorId::new(*actor_id)?,
                 kind: parse_need_kind(kind)?,
                 value: parse_u16(value)?,
             }),
             ["home", actor_id, place_id] => homes.push(HomeSchema {
                 actor_id: ActorId::new(*actor_id)?,
                 place_id: PlaceId::new(*place_id)?,
             }),
-            ["sleep_place", actor_id, place_id, sleep_place_id, access_open, duration_ticks, fatigue_recovery_per_tick, hunger_rise_per_tick] => {
-                sleep_places.push(SleepPlaceSchema {
-                    actor_id: ActorId::new(*actor_id)?,
-                    place_id: PlaceId::new(*place_id)?,
-                    sleep_place_id: SleepAffordanceId::new(*sleep_place_id)?,
-                    access_open: parse_bool(access_open)?,
-                    duration_ticks: parse_u64(duration_ticks)?,
-                    fatigue_recovery_per_tick: parse_i32(fatigue_recovery_per_tick)?,
-                    hunger_rise_per_tick: parse_i32(hunger_rise_per_tick)?,
-                })
-            }
+             /* ~ changed by cargo-mutants ~ */
             ["food_supply", food_supply_id, location, servings, hunger_reduction_per_serving] => {
                 food_supplies.push(FoodSupplySchema {
                     food_supply_id: FoodSupplyId::new(*food_supply_id)?,
                     location: deserialize_location(location)?,
                     servings: parse_u32(servings)?,
                     hunger_reduction_per_serving: parse_i32(hunger_reduction_per_serving)?,
                 })
             }

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (16848) panicked at crates/tracewake-content/src/validate.rs:3650:59:

failures:
    validate::tests::phase3a_valid_routine_content_is_accepted

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
