*** crates/tracewake-content/src/serialization.rs:410:13: delete match arm ["workplace", workplace_id, place_id, assigned_actor_ids, work_duration_ticks, fatigue_delta_per_tick, hunger_delta_per_tick, max_fatigue_to_start, max_hunger_to_start, access_open, role_notice_access_open, output_tag] in deserialize_fixture

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ delete match arm ["workplace", workplace_id, place_id, assigned_actor_ids, work_duration_ticks, fatigue_delta_per_tick, hunger_delta_per_tick, max_fatigue_to_start, max_hunger_to_start, access_open, role_notice_access_open, output_tag] in deserialize_fixture
@@ -402,31 +402,17 @@
                 })
             }
             ["known_food_source", actor_id, food_supply_id] => {
                 known_food_sources.push(KnownFoodSourceSchema {
                     actor_id: ActorId::new(*actor_id)?,
                     food_supply_id: FoodSupplyId::new(*food_supply_id)?,
                 })
             }
-            ["workplace", workplace_id, place_id, assigned_actor_ids, work_duration_ticks, fatigue_delta_per_tick, hunger_delta_per_tick, max_fatigue_to_start, max_hunger_to_start, access_open, role_notice_access_open, output_tag] => {
-                workplaces.push(WorkplaceSchema {
-                    workplace_id: WorkplaceId::new(*workplace_id)?,
-                    place_id: PlaceId::new(*place_id)?,
-                    assigned_actor_ids: split_ids(assigned_actor_ids, |part| ActorId::new(part))?,
-                    work_duration_ticks: parse_u64(work_duration_ticks)?,
-                    fatigue_delta_per_tick: parse_i32(fatigue_delta_per_tick)?,
-                    hunger_delta_per_tick: parse_i32(hunger_delta_per_tick)?,
-                    max_fatigue_to_start: parse_i32(max_fatigue_to_start)?,
-                    max_hunger_to_start: parse_i32(max_hunger_to_start)?,
-                    access_open: parse_bool(access_open)?,
-                    role_notice_access_open: parse_bool(role_notice_access_open)?,
-                    output_tag: decode(output_tag)?,
-                })
-            }
+             /* ~ changed by cargo-mutants ~ */
             ["routine_template", template_id, family, applicability_conditions, preconditions, steps, min_duration_ticks, max_duration_ticks, interruption_points, failure_modes, fallback_rules, debug_labels, reservable_resource] => {
                 routine_templates.push(RoutineTemplateSchema {
                     template_id: RoutineTemplateId::new(*template_id)?,
                     family: parse_routine_family(family)?,
                     applicability_conditions: split_encoded(applicability_conditions)?
                         .into_iter()
                         .map(parse_routine_condition)
                         .collect::<Result<Vec<_>, _>>()?,

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (23096) panicked at crates/tracewake-content/src/validate.rs:3650:59:

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (23095) panicked at crates/tracewake-content/src/validate.rs:3685:49:

failures:
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted

test result: FAILED. 34 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
