*** crates/tracewake-content/src/serialization.rs:425:13: delete match arm ["routine_template", template_id, family, applicability_conditions, preconditions, steps, min_duration_ticks, max_duration_ticks, interruption_points, failure_modes, fallback_rules, debug_labels, reservable_resource] in deserialize_fixture

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ delete match arm ["routine_template", template_id, family, applicability_conditions, preconditions, steps, min_duration_ticks, max_duration_ticks, interruption_points, failure_modes, fallback_rules, debug_labels, reservable_resource] in deserialize_fixture
@@ -417,48 +417,17 @@
                     hunger_delta_per_tick: parse_i32(hunger_delta_per_tick)?,
                     max_fatigue_to_start: parse_i32(max_fatigue_to_start)?,
                     max_hunger_to_start: parse_i32(max_hunger_to_start)?,
                     access_open: parse_bool(access_open)?,
                     role_notice_access_open: parse_bool(role_notice_access_open)?,
                     output_tag: decode(output_tag)?,
                 })
             }
-            ["routine_template", template_id, family, applicability_conditions, preconditions, steps, min_duration_ticks, max_duration_ticks, interruption_points, failure_modes, fallback_rules, debug_labels, reservable_resource] => {
-                routine_templates.push(RoutineTemplateSchema {
-                    template_id: RoutineTemplateId::new(*template_id)?,
-                    family: parse_routine_family(family)?,
-                    applicability_conditions: split_encoded(applicability_conditions)?
-                        .into_iter()
-                        .map(parse_routine_condition)
-                        .collect::<Result<Vec<_>, _>>()?,
-                    preconditions: split_encoded(preconditions)?
-                        .into_iter()
-                        .map(parse_routine_condition)
-                        .collect::<Result<Vec<_>, _>>()?,
-                    steps: split_encoded(steps)?
-                        .into_iter()
-                        .map(|step| {
-                            RoutineStep::deserialize_canonical(step.as_bytes())
-                                .map_err(|error| SerializationError::BadLine(format!("{error}")))
-                        })
-                        .collect::<Result<Vec<_>, _>>()?,
-                    min_duration_ticks: parse_u64(min_duration_ticks)?,
-                    max_duration_ticks: parse_u64(max_duration_ticks)?,
-                    interruption_points: split_usize(interruption_points)?,
-                    failure_modes: split_encoded(failure_modes)?,
-                    fallback_rules: split_encoded(fallback_rules)?,
-                    debug_labels: split_encoded(debug_labels)?,
-                    reservable_resource: if reservable_resource.is_empty() {
-                        None
-                    } else {
-                        Some(decode(reservable_resource)?)
-                    },
-                })
-            }
+             /* ~ changed by cargo-mutants ~ */
             ["routine_assignment", actor_id, template_id, start_tick, end_tick] => {
                 routine_assignments.push(RoutineAssignmentSchema {
                     actor_id: ActorId::new(*actor_id)?,
                     template_id: RoutineTemplateId::new(*template_id)?,
                     start_tick: parse_tick(start_tick)?,
                     end_tick: parse_tick(end_tick)?,
                 })
             }

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (25167) panicked at crates/tracewake-content/src/validate.rs:3685:49:

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (25168) panicked at crates/tracewake-content/src/validate.rs:3650:59:

failures:
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted

test result: FAILED. 34 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
