*** crates/tracewake-content/src/serialization.rs:457:13: delete match arm ["routine_assignment", actor_id, template_id, start_tick, end_tick] in deserialize_fixture

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ delete match arm ["routine_assignment", actor_id, template_id, start_tick, end_tick] in deserialize_fixture
@@ -449,24 +449,17 @@
                     debug_labels: split_encoded(debug_labels)?,
                     reservable_resource: if reservable_resource.is_empty() {
                         None
                     } else {
                         Some(decode(reservable_resource)?)
                     },
                 })
             }
-            ["routine_assignment", actor_id, template_id, start_tick, end_tick] => {
-                routine_assignments.push(RoutineAssignmentSchema {
-                    actor_id: ActorId::new(*actor_id)?,
-                    template_id: RoutineTemplateId::new(*template_id)?,
-                    start_tick: parse_tick(start_tick)?,
-                    end_tick: parse_tick(end_tick)?,
-                })
-            }
+             /* ~ changed by cargo-mutants ~ */
             ["day_window", actor_id, start_tick, end_tick] => day_windows.push(DayWindowSchema {
                 actor_id: ActorId::new(*actor_id)?,
                 start_tick: parse_tick(start_tick)?,
                 end_tick: parse_tick(end_tick)?,
             }),
             _ => return Err(SerializationError::BadLine(line.to_string())),
         }
     }

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (27238) panicked at crates/tracewake-content/src/validate.rs:3685:49:

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (27239) panicked at crates/tracewake-content/src/validate.rs:3650:59:

failures:
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted

test result: FAILED. 34 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
