*** crates/tracewake-content/src/serialization.rs:465:13: delete match arm ["day_window", actor_id, start_tick, end_tick] in deserialize_fixture

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ delete match arm ["day_window", actor_id, start_tick, end_tick] in deserialize_fixture
@@ -457,21 +457,17 @@
             ["routine_assignment", actor_id, template_id, start_tick, end_tick] => {
                 routine_assignments.push(RoutineAssignmentSchema {
                     actor_id: ActorId::new(*actor_id)?,
                     template_id: RoutineTemplateId::new(*template_id)?,
                     start_tick: parse_tick(start_tick)?,
                     end_tick: parse_tick(end_tick)?,
                 })
             }
-            ["day_window", actor_id, start_tick, end_tick] => day_windows.push(DayWindowSchema {
-                actor_id: ActorId::new(*actor_id)?,
-                start_tick: parse_tick(start_tick)?,
-                end_tick: parse_tick(end_tick)?,
-            }),
+             /* ~ changed by cargo-mutants ~ */
             _ => return Err(SerializationError::BadLine(line.to_string())),
         }
     }
 
     let mut fixture = FixtureSchema {
         fixture_id: fixture_id.ok_or(SerializationError::MissingField("fixture"))?,
         schema_version: schema_version.ok_or(SerializationError::MissingField("schema"))?,
         fixture_scope: fixture_scope.ok_or(SerializationError::MissingField("fixture_scope"))?,

---- fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering stdout ----

thread 'fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering' (29330) panicked at crates/tracewake-content/tests/fixtures_load.rs:1238:6:
called `Result::unwrap()` on an `Err` value: Validation(ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: ParseSchema, path: "fixture.line", code: "bad_line", message: "bad fixture line day_window|actor_tomas|0|100" }] } })

---- fixtures_load_phase3a_missing_need_model_is_rejected stdout ----

thread 'fixtures_load_phase3a_missing_need_model_is_rejected' (29331) panicked at crates/tracewake-content/tests/fixtures_load.rs:1452:5:
assertion failed: report.errors.iter().any(|error|
        error.code == "missing_field" && error.path == "fixture.need_model")

---- fixtures_load_location_embedded_marker_id_rejected_001 stdout ----

thread 'fixtures_load_location_embedded_marker_id_rejected_001' (29328) panicked at crates/tracewake-content/tests/fixtures_load.rs:1311:5:
assertion failed: failure.report.errors.iter().any(|error|
        {
            error.phase == ValidationPhase::NoScript &&
                    error.code == "authored_shortcut_effect" &&
                error.path == "food_supplies[0].location.place_id"
        })

failures:
    all_fixtures_load_deterministically_and_validate
    fixtures_load_location_embedded_marker_id_rejected_001
    fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering
    fixtures_load_phase3a_missing_need_model_is_rejected
    fixtures_load_unsupported_schema_version_rejected_001
    phase3a_load_emits_authored_prehistory_seed_events
    seed_event_log_order_and_projection_provenance_are_causal_and_stable
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food
    stale_workplace_notice_superseded_by_newer_001

test result: FAILED. 25 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
