*** crates/tracewake-content/src/serialization.rs:502:9: delete match arm "phase1" in parse_fixture_scope

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ delete match arm "phase1" in parse_fixture_scope
@@ -494,17 +494,17 @@
         day_windows,
     };
     fixture.canonicalize();
     Ok(fixture)
 }
 
 fn parse_fixture_scope(value: &str) -> Result<FixtureScope, SerializationError> {
     match value {
-        "phase1" => Ok(FixtureScope::Phase1),
+         /* ~ changed by cargo-mutants ~ */
         "phase2a_historical" => Ok(FixtureScope::Phase2AHistorical),
         "phase3a_historical" => Ok(FixtureScope::Phase3AHistorical),
         _ => Err(SerializationError::BadLine(format!(
             "bad fixture scope {value}"
         ))),
     }
 }

---- load::tests::shuffled_input_paths_load_to_same_canonical_world stdout ----

thread 'load::tests::shuffled_input_paths_load_to_same_canonical_world' (31533) panicked at crates/tracewake-content/src/load.rs:509:10:
called `Result::unwrap()` on an `Err` value: Validation(ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: ParseSchema, path: "fixture.line", code: "bad_line", message: "bad fixture line bad fixture scope phase1" }] } })

---- serialization::tests::fixture_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::fixture_serialization_round_trips_byte_identically' (31538) panicked at crates/tracewake-content/src/serialization.rs:891:50:
called `Result::unwrap()` on an `Err` value: BadLine("bad fixture scope phase1")

---- validate::tests::fixture_schema_v1_golden_bytes_load_001 stdout ----

thread 'validate::tests::fixture_schema_v1_golden_bytes_load_001' (31549) panicked at crates/tracewake-content/src/validate.rs:3087:81:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: ParseSchema, path: "fixture.line", code: "bad_line", message: "bad fixture line bad fixture scope phase1" }] } }

failures:
    load::tests::shuffled_input_paths_load_to_same_canonical_world
    serialization::tests::fixture_serialization_round_trips_byte_identically
    validate::tests::fixture_schema_v1_golden_bytes_load_001
    validate::tests::fixture_schema_version_unsupported_rejected_001
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 31 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
