*** crates/tracewake-content/src/serialization.rs:503:9: delete match arm "phase2a_historical" in parse_fixture_scope

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ delete match arm "phase2a_historical" in parse_fixture_scope
@@ -495,17 +495,17 @@
     };
     fixture.canonicalize();
     Ok(fixture)
 }
 
 fn parse_fixture_scope(value: &str) -> Result<FixtureScope, SerializationError> {
     match value {
         "phase1" => Ok(FixtureScope::Phase1),
-        "phase2a_historical" => Ok(FixtureScope::Phase2AHistorical),
+         /* ~ changed by cargo-mutants ~ */
         "phase3a_historical" => Ok(FixtureScope::Phase3AHistorical),
         _ => Err(SerializationError::BadLine(format!(
             "bad fixture scope {value}"
         ))),
     }
 }
 
 fn parse_visibility_default(value: &str) -> Result<VisibilityDefault, SerializationError> {

---- fixture_scope_raw_lines_drive_loader_registry_and_fail_closed stdout ----

thread 'fixture_scope_raw_lines_drive_loader_registry_and_fail_closed' (1176) panicked at crates/tracewake-content/tests/fixtures_load.rs:829:6:

---- all_fixtures_load_deterministically_and_validate stdout ----

thread 'all_fixtures_load_deterministically_and_validate' (1172) panicked at crates/tracewake-content/tests/fixtures_load.rs:591:54:

---- phase2a_fixtures_are_registered_and_script_free stdout ----

thread 'phase2a_fixtures_are_registered_and_script_free' (1196) panicked at crates/tracewake-content/tests/fixtures_load.rs:1546:56:

failures:
    all_fixtures_load_deterministically_and_validate
    fixture_scope_raw_lines_drive_loader_registry_and_fail_closed
    phase2a_fixtures_are_registered_and_script_free

test result: FAILED. 31 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
