*** crates/tracewake-content/src/serialization.rs:504:9: delete match arm "phase3a_historical" in parse_fixture_scope

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ delete match arm "phase3a_historical" in parse_fixture_scope
@@ -496,17 +496,17 @@
     fixture.canonicalize();
     Ok(fixture)
 }
 
 fn parse_fixture_scope(value: &str) -> Result<FixtureScope, SerializationError> {
     match value {
         "phase1" => Ok(FixtureScope::Phase1),
         "phase2a_historical" => Ok(FixtureScope::Phase2AHistorical),
-        "phase3a_historical" => Ok(FixtureScope::Phase3AHistorical),
+         /* ~ changed by cargo-mutants ~ */
         _ => Err(SerializationError::BadLine(format!(
             "bad fixture scope {value}"
         ))),
     }
 }
 
 fn parse_visibility_default(value: &str) -> Result<VisibilityDefault, SerializationError> {
     match value {

---- validate::tests::fixture_food_supply_negative_servings_rejected_001 stdout ----

thread 'validate::tests::fixture_food_supply_negative_servings_rejected_001' (3253) panicked at crates/tracewake-content/src/validate.rs:3226:9:
assertion failed: errors.report.errors.iter().any(|error|
        { error.code == "bad_number" && error.path == "fixture.number" })

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (3270) panicked at crates/tracewake-content/src/validate.rs:3650:59:

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (3269) panicked at crates/tracewake-content/src/validate.rs:3685:49:

failures:
    validate::tests::fixture_food_supply_negative_servings_rejected_001
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted

test result: FAILED. 33 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
