*** crates/tracewake-content/src/serialization.rs:513:9: delete match arm "visible" in parse_visibility_default

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ delete match arm "visible" in parse_visibility_default
@@ -505,17 +505,17 @@
         _ => Err(SerializationError::BadLine(format!(
             "bad fixture scope {value}"
         ))),
     }
 }
 
 fn parse_visibility_default(value: &str) -> Result<VisibilityDefault, SerializationError> {
     match value {
-        "visible" => Ok(VisibilityDefault::Visible),
+         /* ~ changed by cargo-mutants ~ */
         "concealed" => Ok(VisibilityDefault::Concealed),
         _ => Err(SerializationError::BadLine(format!(
             "bad place visibility_default {value}"
         ))),
     }
 }
 
 pub fn serialize_event_log(log: &EventLog) -> Vec<u8> {

---- load::tests::shuffled_input_paths_load_to_same_canonical_world stdout ----

thread 'load::tests::shuffled_input_paths_load_to_same_canonical_world' (5458) panicked at crates/tracewake-content/src/load.rs:509:10:

---- serialization::tests::fixture_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::fixture_serialization_round_trips_byte_identically' (5463) panicked at crates/tracewake-content/src/serialization.rs:891:50:
called `Result::unwrap()` on an `Err` value: BadLine("bad place visibility_default visible")

---- validate::tests::fixture_food_supply_negative_servings_rejected_001 stdout ----

thread 'validate::tests::fixture_food_supply_negative_servings_rejected_001' (5469) panicked at crates/tracewake-content/src/validate.rs:3226:9:
assertion failed: errors.report.errors.iter().any(|error|
        { error.code == "bad_number" && error.path == "fixture.number" })

failures:
    load::tests::shuffled_input_paths_load_to_same_canonical_world
    serialization::tests::fixture_serialization_round_trips_byte_identically
    validate::tests::fixture_food_supply_negative_servings_rejected_001
    validate::tests::fixture_schema_v1_golden_bytes_load_001
    validate::tests::fixture_schema_version_unsupported_rejected_001
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 28 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
