*** crates/tracewake-content/src/serialization.rs:514:9: delete match arm "concealed" in parse_visibility_default

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ delete match arm "concealed" in parse_visibility_default
@@ -506,17 +506,17 @@
             "bad fixture scope {value}"
         ))),
     }
 }
 
 fn parse_visibility_default(value: &str) -> Result<VisibilityDefault, SerializationError> {
     match value {
         "visible" => Ok(VisibilityDefault::Visible),
-        "concealed" => Ok(VisibilityDefault::Concealed),
+         /* ~ changed by cargo-mutants ~ */
         _ => Err(SerializationError::BadLine(format!(
             "bad place visibility_default {value}"
         ))),
     }
 }
 
 pub fn serialize_event_log(log: &EventLog) -> Vec<u8> {
     log.serialize_canonical()

---- all_fixtures_load_deterministically_and_validate stdout ----

thread 'all_fixtures_load_deterministically_and_validate' (7566) panicked at crates/tracewake-content/tests/fixtures_load.rs:591:54:

failures:
    all_fixtures_load_deterministically_and_validate

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
