*** crates/tracewake-content/src/serialization.rs:522:5: replace serialize_event_log -> Vec<u8> with vec![]

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ replace serialize_event_log -> Vec<u8> with vec![]
@@ -514,17 +514,17 @@
         "concealed" => Ok(VisibilityDefault::Concealed),
         _ => Err(SerializationError::BadLine(format!(
             "bad place visibility_default {value}"
         ))),
     }
 }
 
 pub fn serialize_event_log(log: &EventLog) -> Vec<u8> {
-    log.serialize_canonical()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn deserialize_event_log(bytes: &[u8]) -> Result<EventLog, SerializationError> {
     EventLog::deserialize_canonical(bytes).map_err(SerializationError::EventLog)
 }
 
 fn serialize_location(location: &Location) -> String {
     match location {

---- serialized_event_log_replays_to_identical_state stdout ----

thread 'serialized_event_log_replays_to_identical_state' (9765) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:432:5:
nonempty event logs must serialize to nonempty canonical bytes

failures:
    serialized_event_log_replays_to_identical_state

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.61s

*** result: Failure(101)
