*** crates/tracewake-content/src/serialization.rs:522:5: replace serialize_event_log -> Vec<u8> with vec![1]

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ replace serialize_event_log -> Vec<u8> with vec![1]
@@ -514,17 +514,17 @@
         "concealed" => Ok(VisibilityDefault::Concealed),
         _ => Err(SerializationError::BadLine(format!(
             "bad place visibility_default {value}"
         ))),
     }
 }
 
 pub fn serialize_event_log(log: &EventLog) -> Vec<u8> {
-    log.serialize_canonical()
+    vec![1] /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn deserialize_event_log(bytes: &[u8]) -> Result<EventLog, SerializationError> {
     EventLog::deserialize_canonical(bytes).map_err(SerializationError::EventLog)
 }
 
 fn serialize_location(location: &Location) -> String {
     match location {

---- serialization::tests::event_log_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::event_log_serialization_round_trips_byte_identically' (13885) panicked at crates/tracewake-content/src/serialization.rs:920:73:
called `Result::unwrap()` on an `Err` value: EventLog(BadHex)

failures:
    serialization::tests::event_log_serialization_round_trips_byte_identically

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
