*** crates/tracewake-content/src/serialization.rs:526:5: replace deserialize_event_log -> Result<EventLog, SerializationError> with Ok(Default::default())

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ replace deserialize_event_log -> Result<EventLog, SerializationError> with Ok(Default::default())
@@ -518,17 +518,17 @@
     }
 }
 
 pub fn serialize_event_log(log: &EventLog) -> Vec<u8> {
     log.serialize_canonical()
 }
 
 pub fn deserialize_event_log(bytes: &[u8]) -> Result<EventLog, SerializationError> {
-    EventLog::deserialize_canonical(bytes).map_err(SerializationError::EventLog)
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn serialize_location(location: &Location) -> String {
     match location {
         Location::AtPlace(id) => format!("at:{}", id.as_str()),
         Location::InContainer(id) => format!("in:{}", id.as_str()),
         Location::CarriedBy(id) => format!("carried:{}", id.as_str()),
     }

---- serialization::tests::event_log_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::event_log_serialization_round_trips_byte_identically' (15956) panicked at crates/tracewake-content/src/serialization.rs:922:9:
assertion `left == right` failed
 right: []

failures:
    serialization::tests::event_log_serialization_round_trips_byte_identically

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
