*** crates/tracewake-content/src/serialization.rs:530:5: replace serialize_location -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ replace serialize_location -> String with "xyzzy".into()
@@ -522,21 +522,17 @@
     log.serialize_canonical()
 }
 
 pub fn deserialize_event_log(bytes: &[u8]) -> Result<EventLog, SerializationError> {
     EventLog::deserialize_canonical(bytes).map_err(SerializationError::EventLog)
 }
 
 fn serialize_location(location: &Location) -> String {
-    match location {
-        Location::AtPlace(id) => format!("at:{}", id.as_str()),
-        Location::InContainer(id) => format!("in:{}", id.as_str()),
-        Location::CarriedBy(id) => format!("carried:{}", id.as_str()),
-    }
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 fn deserialize_location(value: &str) -> Result<Location, SerializationError> {
     let (kind, id) = value
         .split_once(':')
         .ok_or_else(|| SerializationError::BadLine(value.to_string()))?;
     match kind {
         "at" => Ok(Location::AtPlace(PlaceId::new(id)?)),

---- load::tests::shuffled_input_paths_load_to_same_canonical_world stdout ----

thread 'load::tests::shuffled_input_paths_load_to_same_canonical_world' (20094) panicked at crates/tracewake-content/src/load.rs:509:10:
called `Result::unwrap()` on an `Err` value: Validation(ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: ParseSchema, path: "fixture.line", code: "bad_line", message: "bad fixture line xyzzy" }] } })

---- serialization::tests::fixture_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::fixture_serialization_round_trips_byte_identically' (20099) panicked at crates/tracewake-content/src/serialization.rs:887:50:
called `Result::unwrap()` on an `Err` value: BadLine("xyzzy")

---- validate::tests::fixture_schema_version_unsupported_rejected_001 stdout ----

thread 'validate::tests::fixture_schema_version_unsupported_rejected_001' (20111) panicked at crates/tracewake-content/src/validate.rs:3114:9:
assertion `left == right` failed
  left: None
 right: Some((ParseSchema, "fixture.schema_version"))

failures:
    load::tests::shuffled_input_paths_load_to_same_canonical_world
    serialization::tests::fixture_serialization_round_trips_byte_identically
    validate::tests::fixture_schema_version_unsupported_rejected_001
    validate::tests::fixture_serialization_golden_bytes_are_pinned_001
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 29 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
