*** crates/tracewake-content/src/serialization.rs:542:9: delete match arm "at" in deserialize_location

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ delete match arm "at" in deserialize_location
@@ -534,17 +534,17 @@
     }
 }
 
 fn deserialize_location(value: &str) -> Result<Location, SerializationError> {
     let (kind, id) = value
         .split_once(':')
         .ok_or_else(|| SerializationError::BadLine(value.to_string()))?;
     match kind {
-        "at" => Ok(Location::AtPlace(PlaceId::new(id)?)),
+         /* ~ changed by cargo-mutants ~ */
         "in" => Ok(Location::InContainer(ContainerId::new(id)?)),
         "carried" => Ok(Location::CarriedBy(ActorId::new(id)?)),
         _ => Err(SerializationError::BadLine(value.to_string())),
     }
 }
 
 fn channel_id(channel: Channel) -> &'static str {
     channel.stable_id()

---- validate::tests::fixture_food_supply_negative_servings_rejected_001 stdout ----

thread 'validate::tests::fixture_food_supply_negative_servings_rejected_001' (22321) panicked at crates/tracewake-content/src/validate.rs:3226:9:
assertion failed: errors.report.errors.iter().any(|error|
        { error.code == "bad_number" && error.path == "fixture.number" })

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (22337) panicked at crates/tracewake-content/src/validate.rs:3685:49:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Serialization, path: "fixture", code: "serialization_error", message: "fixture serialization failed: BadLine(\"at:shop_front\")" }] } }

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (22338) panicked at crates/tracewake-content/src/validate.rs:3650:59:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Serialization, path: "fixture", code: "serialization_error", message: "fixture serialization failed: BadLine(\"at:shop_front\")" }] } }

failures:
    validate::tests::fixture_food_supply_negative_servings_rejected_001
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted

test result: FAILED. 33 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
