*** crates/tracewake-content/src/serialization.rs:543:9: delete match arm "in" in deserialize_location

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ delete match arm "in" in deserialize_location
@@ -535,17 +535,17 @@
 }
 
 fn deserialize_location(value: &str) -> Result<Location, SerializationError> {
     let (kind, id) = value
         .split_once(':')
         .ok_or_else(|| SerializationError::BadLine(value.to_string()))?;
     match kind {
         "at" => Ok(Location::AtPlace(PlaceId::new(id)?)),
-        "in" => Ok(Location::InContainer(ContainerId::new(id)?)),
+         /* ~ changed by cargo-mutants ~ */
         "carried" => Ok(Location::CarriedBy(ActorId::new(id)?)),
         _ => Err(SerializationError::BadLine(value.to_string())),
     }
 }
 
 fn channel_id(channel: Channel) -> &'static str {
     channel.stable_id()
 }

---- load::tests::shuffled_input_paths_load_to_same_canonical_world stdout ----

thread 'load::tests::shuffled_input_paths_load_to_same_canonical_world' (24381) panicked at crates/tracewake-content/src/load.rs:509:10:
called `Result::unwrap()` on an `Err` value: Validation(ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: ParseSchema, path: "fixture.line", code: "bad_line", message: "bad fixture line in:strongbox_tomas" }] } })

---- serialization::tests::fixture_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::fixture_serialization_round_trips_byte_identically' (24386) panicked at crates/tracewake-content/src/serialization.rs:891:50:
called `Result::unwrap()` on an `Err` value: BadLine("in:strongbox_tomas")

---- validate::tests::fixture_schema_version_unsupported_rejected_001 stdout ----

thread 'validate::tests::fixture_schema_version_unsupported_rejected_001' (24398) panicked at crates/tracewake-content/src/validate.rs:3114:9:
assertion `left == right` failed
  left: None
 right: Some((ParseSchema, "fixture.schema_version"))

failures:
    load::tests::shuffled_input_paths_load_to_same_canonical_world
    serialization::tests::fixture_serialization_round_trips_byte_identically
    validate::tests::fixture_schema_version_unsupported_rejected_001
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 30 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
