*** crates/tracewake-content/src/serialization.rs:544:9: delete match arm "carried" in deserialize_location

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ delete match arm "carried" in deserialize_location
@@ -536,17 +536,17 @@
 
 fn deserialize_location(value: &str) -> Result<Location, SerializationError> {
     let (kind, id) = value
         .split_once(':')
         .ok_or_else(|| SerializationError::BadLine(value.to_string()))?;
     match kind {
         "at" => Ok(Location::AtPlace(PlaceId::new(id)?)),
         "in" => Ok(Location::InContainer(ContainerId::new(id)?)),
-        "carried" => Ok(Location::CarriedBy(ActorId::new(id)?)),
+         /* ~ changed by cargo-mutants ~ */
         _ => Err(SerializationError::BadLine(value.to_string())),
     }
 }
 
 fn channel_id(channel: Channel) -> &'static str {
     channel.stable_id()
 }

---- phase2a_fixtures_are_registered_and_script_free stdout ----

thread 'phase2a_fixtures_are_registered_and_script_free' (26512) panicked at crates/tracewake-content/tests/fixtures_load.rs:1546:56:

---- all_fixtures_load_deterministically_and_validate stdout ----

thread 'all_fixtures_load_deterministically_and_validate' (26488) panicked at crates/tracewake-content/tests/fixtures_load.rs:591:54:

failures:
    all_fixtures_load_deterministically_and_validate
    phase2a_fixtures_are_registered_and_script_free

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
