*** crates/tracewake-content/src/serialization.rs:550:5: replace channel_id -> &'static str with ""

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ replace channel_id -> &'static str with ""
@@ -542,17 +542,17 @@
         "at" => Ok(Location::AtPlace(PlaceId::new(id)?)),
         "in" => Ok(Location::InContainer(ContainerId::new(id)?)),
         "carried" => Ok(Location::CarriedBy(ActorId::new(id)?)),
         _ => Err(SerializationError::BadLine(value.to_string())),
     }
 }
 
 fn channel_id(channel: Channel) -> &'static str {
-    channel.stable_id()
+    "" /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_optional_channel(value: &str) -> Result<Option<Channel>, SerializationError> {
     if value.is_empty() {
         Ok(None)
     } else {
         parse_channel(value).map(Some)
     }

---- phase2a_fixtures_are_registered_and_script_free stdout ----

thread 'phase2a_fixtures_are_registered_and_script_free' (28618) panicked at crates/tracewake-content/tests/fixtures_load.rs:1546:56:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Serialization, path: "fixture", code: "serialization_drift", message: "fixture serialization changed canonical content" }] } }

---- all_fixtures_load_deterministically_and_validate stdout ----

thread 'all_fixtures_load_deterministically_and_validate' (28594) panicked at crates/tracewake-content/tests/fixtures_load.rs:591:54:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Serialization, path: "fixture", code: "serialization_drift", message: "fixture serialization changed canonical content" }] } }

failures:
    all_fixtures_load_deterministically_and_validate
    phase2a_fixtures_are_registered_and_script_free

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
