*** crates/tracewake-content/src/serialization.rs:554:5: replace parse_optional_channel -> Result<Option<Channel>, SerializationError> with Ok(None)

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ replace parse_optional_channel -> Result<Option<Channel>, SerializationError> with Ok(None)
@@ -546,21 +546,17 @@
     }
 }
 
 fn channel_id(channel: Channel) -> &'static str {
     channel.stable_id()
 }
 
 fn parse_optional_channel(value: &str) -> Result<Option<Channel>, SerializationError> {
-    if value.is_empty() {
-        Ok(None)
-    } else {
-        parse_channel(value).map(Some)
-    }
+    Ok(None) /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_channel(value: &str) -> Result<Channel, SerializationError> {
     match value {
         "direct_sight" => Ok(Channel::DirectSight),
         "touch_or_search" => Ok(Channel::TouchOrSearch),
         "simple_sound" => Ok(Channel::SimpleSound),
         "absence_marker" => Ok(Channel::AbsenceMarker),

---- phase2a_fixtures_are_registered_and_script_free stdout ----

thread 'phase2a_fixtures_are_registered_and_script_free' (362) panicked at crates/tracewake-content/tests/fixtures_load.rs:1546:56:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Serialization, path: "fixture", code: "serialization_drift", message: "fixture serialization changed canonical content" }] } }

---- all_fixtures_load_deterministically_and_validate stdout ----

thread 'all_fixtures_load_deterministically_and_validate' (338) panicked at crates/tracewake-content/tests/fixtures_load.rs:591:54:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Serialization, path: "fixture", code: "serialization_drift", message: "fixture serialization changed canonical content" }] } }

failures:
    all_fixtures_load_deterministically_and_validate
    phase2a_fixtures_are_registered_and_script_free

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
