*** crates/tracewake-content/src/serialization.rs:567:9: delete match arm "reading_placeholder_schema_only" in parse_channel

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ delete match arm "reading_placeholder_schema_only" in parse_channel
@@ -559,17 +559,17 @@
 }
 
 fn parse_channel(value: &str) -> Result<Channel, SerializationError> {
     match value {
         "direct_sight" => Ok(Channel::DirectSight),
         "touch_or_search" => Ok(Channel::TouchOrSearch),
         "simple_sound" => Ok(Channel::SimpleSound),
         "absence_marker" => Ok(Channel::AbsenceMarker),
-        "reading_placeholder_schema_only" => Ok(Channel::ReadingPlaceholderSchemaOnly),
+         /* ~ changed by cargo-mutants ~ */
         _ => Err(SerializationError::BadLine(format!("bad channel {value}"))),
     }
 }
 
 fn parse_stance(value: &str) -> Result<Stance, SerializationError> {
     match value {
         "believes_true" => Ok(Stance::BelievesTrue),
         "believes_false" => Ok(Stance::BelievesFalse),

---- serialization_round_trips_spine_variant_matrix stdout ----

thread 'serialization_round_trips_spine_variant_matrix' (11412) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:385:46:
called `Result::unwrap()` on an `Err` value: BadLine("bad channel reading_placeholder_schema_only")

failures:
    serialization_round_trips_spine_variant_matrix

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.58s

*** result: Failure(101)
