*** crates/tracewake-content/src/serialization.rs:594:5: replace parse_tick -> Result<SimTick, SerializationError> with Ok(Default::default())

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ replace parse_tick -> Result<SimTick, SerializationError> with Ok(Default::default())
@@ -586,17 +586,17 @@
         value
             .parse::<u16>()
             .map_err(|_| SerializationError::BadU64(value.to_string()))?,
     )
     .map_err(Into::into)
 }
 
 fn parse_tick(value: &str) -> Result<SimTick, SerializationError> {
-    parse_u64(value).map(SimTick::new)
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_optional_tick(value: &str) -> Result<Option<SimTick>, SerializationError> {
     if value.is_empty() {
         Ok(None)
     } else {
         parse_tick(value).map(Some)
     }

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (26615) panicked at crates/tracewake-content/src/validate.rs:3685:49:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Serialization, path: "fixture", code: "serialization_drift", message: "fixture serialization changed canonical content" }] } }

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (26616) panicked at crates/tracewake-content/src/validate.rs:3650:59:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Serialization, path: "fixture", code: "serialization_drift", message: "fixture serialization changed canonical content" }] } }

failures:
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted

test result: FAILED. 34 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
