*** crates/tracewake-content/src/serialization.rs:598:5: replace parse_optional_tick -> Result<Option<SimTick>, SerializationError> with Ok(None)

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ replace parse_optional_tick -> Result<Option<SimTick>, SerializationError> with Ok(None)
@@ -590,21 +590,17 @@
     .map_err(Into::into)
 }
 
 fn parse_tick(value: &str) -> Result<SimTick, SerializationError> {
     parse_u64(value).map(SimTick::new)
 }
 
 fn parse_optional_tick(value: &str) -> Result<Option<SimTick>, SerializationError> {
-    if value.is_empty() {
-        Ok(None)
-    } else {
-        parse_tick(value).map(Some)
-    }
+    Ok(None) /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_u16(value: &str) -> Result<u16, SerializationError> {
     value
         .parse::<u16>()
         .map_err(|_| SerializationError::BadU64(value.to_string()))
 }

---- serialization_round_trips_spine_variant_matrix stdout ----

thread 'serialization_round_trips_spine_variant_matrix' (28787) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:388:5:
assertion `left == right` failed

failures:
    serialization_round_trips_spine_variant_matrix

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.63s

*** result: Failure(101)
