*** crates/tracewake-content/src/serialization.rs:598:5: replace parse_optional_tick -> Result<Option<SimTick>, SerializationError> with Ok(Some(Default::default()))

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ replace parse_optional_tick -> Result<Option<SimTick>, SerializationError> with Ok(Some(Default::default()))
@@ -590,21 +590,17 @@
     .map_err(Into::into)
 }
 
 fn parse_tick(value: &str) -> Result<SimTick, SerializationError> {
     parse_u64(value).map(SimTick::new)
 }
 
 fn parse_optional_tick(value: &str) -> Result<Option<SimTick>, SerializationError> {
-    if value.is_empty() {
-        Ok(None)
-    } else {
-        parse_tick(value).map(Some)
-    }
+    Ok(Some(Default::default())) /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_u16(value: &str) -> Result<u16, SerializationError> {
     value
         .parse::<u16>()
         .map_err(|_| SerializationError::BadU64(value.to_string()))
 }

---- valid_epistemic_seed_validates_and_round_trips_canonically stdout ----

thread 'valid_epistemic_seed_validates_and_round_trips_canonically' (30901) panicked at crates/tracewake-content/tests/fixtures_load.rs:1708:52:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Serialization, path: "fixture", code: "serialization_drift", message: "fixture serialization changed canonical content" }] } }

---- phase2a_fixtures_are_registered_and_script_free stdout ----

thread 'phase2a_fixtures_are_registered_and_script_free' (30893) panicked at crates/tracewake-content/tests/fixtures_load.rs:1546:56:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Serialization, path: "fixture", code: "serialization_drift", message: "fixture serialization changed canonical content" }] } }

---- all_fixtures_load_deterministically_and_validate stdout ----

thread 'all_fixtures_load_deterministically_and_validate' (30869) panicked at crates/tracewake-content/tests/fixtures_load.rs:591:54:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Serialization, path: "fixture", code: "serialization_drift", message: "fixture serialization changed canonical content" }] } }

failures:
    all_fixtures_load_deterministically_and_validate
    phase2a_fixtures_are_registered_and_script_free
    valid_epistemic_seed_validates_and_round_trips_canonically

test result: FAILED. 31 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
