*** crates/tracewake-content/src/serialization.rs:606:5: replace parse_u16 -> Result<u16, SerializationError> with Ok(0)

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ replace parse_u16 -> Result<u16, SerializationError> with Ok(0)
@@ -598,19 +598,17 @@
     if value.is_empty() {
         Ok(None)
     } else {
         parse_tick(value).map(Some)
     }
 }
 
 fn parse_u16(value: &str) -> Result<u16, SerializationError> {
-    value
-        .parse::<u16>()
-        .map_err(|_| SerializationError::BadU64(value.to_string()))
+    Ok(0) /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_u32(value: &str) -> Result<u32, SerializationError> {
     value
         .parse::<u32>()
         .map_err(|_| SerializationError::BadU64(value.to_string()))
 }

---- serialization::tests::fixture_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::fixture_serialization_round_trips_byte_identically' (476) panicked at crates/tracewake-content/src/serialization.rs:892:9:
assertion `left == right` failed

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (498) panicked at crates/tracewake-content/src/validate.rs:3685:49:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Serialization, path: "fixture", code: "serialization_drift", message: "fixture serialization changed canonical content" }] } }

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (499) panicked at crates/tracewake-content/src/validate.rs:3650:59:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Serialization, path: "fixture", code: "serialization_drift", message: "fixture serialization changed canonical content" }] } }

failures:
    serialization::tests::fixture_serialization_round_trips_byte_identically
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 32 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
