*** crates/tracewake-content/src/serialization.rs:612:5: replace parse_u32 -> Result<u32, SerializationError> with Ok(1)

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ replace parse_u32 -> Result<u32, SerializationError> with Ok(1)
@@ -604,19 +604,17 @@
 
 fn parse_u16(value: &str) -> Result<u16, SerializationError> {
     value
         .parse::<u16>()
         .map_err(|_| SerializationError::BadU64(value.to_string()))
 }
 
 fn parse_u32(value: &str) -> Result<u32, SerializationError> {
-    value
-        .parse::<u32>()
-        .map_err(|_| SerializationError::BadU64(value.to_string()))
+    Ok(1) /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_u64(value: &str) -> Result<u64, SerializationError> {
     value
         .parse::<u64>()
         .map_err(|_| SerializationError::BadU64(value.to_string()))
 }

---- validate::tests::fixture_food_supply_negative_servings_rejected_001 stdout ----

thread 'validate::tests::fixture_food_supply_negative_servings_rejected_001' (6696) panicked at crates/tracewake-content/src/validate.rs:3226:9:
assertion failed: errors.report.errors.iter().any(|error|
        { error.code == "bad_number" && error.path == "fixture.number" })

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (6712) panicked at crates/tracewake-content/src/validate.rs:3685:49:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Serialization, path: "fixture", code: "serialization_drift", message: "fixture serialization changed canonical content" }] } }

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (6713) panicked at crates/tracewake-content/src/validate.rs:3650:59:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Serialization, path: "fixture", code: "serialization_drift", message: "fixture serialization changed canonical content" }] } }

failures:
    validate::tests::fixture_food_supply_negative_servings_rejected_001
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted

test result: FAILED. 33 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
