*** crates/tracewake-content/src/serialization.rs:618:5: replace parse_u64 -> Result<u64, SerializationError> with Ok(0)

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ replace parse_u64 -> Result<u64, SerializationError> with Ok(0)
@@ -610,19 +610,17 @@
 
 fn parse_u32(value: &str) -> Result<u32, SerializationError> {
     value
         .parse::<u32>()
         .map_err(|_| SerializationError::BadU64(value.to_string()))
 }
 
 fn parse_u64(value: &str) -> Result<u64, SerializationError> {
-    value
-        .parse::<u64>()
-        .map_err(|_| SerializationError::BadU64(value.to_string()))
+    Ok(0) /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_i32(value: &str) -> Result<i32, SerializationError> {
     value
         .parse::<i32>()
         .map_err(|_| SerializationError::BadU64(value.to_string()))
 }

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (8784) panicked at crates/tracewake-content/src/validate.rs:3650:59:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Serialization, path: "fixture", code: "serialization_drift", message: "fixture serialization changed canonical content" }] } }

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (8783) panicked at crates/tracewake-content/src/validate.rs:3685:49:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Serialization, path: "fixture", code: "serialization_drift", message: "fixture serialization changed canonical content" }] } }

failures:
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted

test result: FAILED. 34 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
