*** crates/tracewake-content/src/serialization.rs:624:5: replace parse_i32 -> Result<i32, SerializationError> with Ok(-1)

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ replace parse_i32 -> Result<i32, SerializationError> with Ok(-1)
@@ -616,19 +616,17 @@
 
 fn parse_u64(value: &str) -> Result<u64, SerializationError> {
     value
         .parse::<u64>()
         .map_err(|_| SerializationError::BadU64(value.to_string()))
 }
 
 fn parse_i32(value: &str) -> Result<i32, SerializationError> {
-    value
-        .parse::<i32>()
-        .map_err(|_| SerializationError::BadU64(value.to_string()))
+    Ok(-1) /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_need_kind(value: &str) -> Result<NeedKind, SerializationError> {
     match value {
         "hunger" => Ok(NeedKind::Hunger),
         "fatigue" => Ok(NeedKind::Fatigue),
         "safety" => Ok(NeedKind::Safety),
         _ => Err(SerializationError::BadLine(format!(

---- load::tests::shuffled_input_paths_load_to_same_canonical_world stdout ----

thread 'load::tests::shuffled_input_paths_load_to_same_canonical_world' (17040) panicked at crates/tracewake-content/src/load.rs:509:10:

---- serialization::tests::fixture_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::fixture_serialization_round_trips_byte_identically' (17045) panicked at crates/tracewake-content/src/serialization.rs:892:9:
assertion `left == right` failed

---- validate::tests::fixture_schema_v1_golden_bytes_load_001 stdout ----

thread 'validate::tests::fixture_schema_v1_golden_bytes_load_001' (17056) panicked at crates/tracewake-content/src/validate.rs:3087:81:

failures:
    load::tests::shuffled_input_paths_load_to_same_canonical_world
    serialization::tests::fixture_serialization_round_trips_byte_identically
    validate::tests::fixture_schema_v1_golden_bytes_load_001
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 30 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
