*** crates/tracewake-content/src/serialization.rs:631:9: delete match arm "hunger" in parse_need_kind

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ delete match arm "hunger" in parse_need_kind
@@ -623,17 +623,17 @@
 fn parse_i32(value: &str) -> Result<i32, SerializationError> {
     value
         .parse::<i32>()
         .map_err(|_| SerializationError::BadU64(value.to_string()))
 }
 
 fn parse_need_kind(value: &str) -> Result<NeedKind, SerializationError> {
     match value {
-        "hunger" => Ok(NeedKind::Hunger),
+         /* ~ changed by cargo-mutants ~ */
         "fatigue" => Ok(NeedKind::Fatigue),
         "safety" => Ok(NeedKind::Safety),
         _ => Err(SerializationError::BadLine(format!(
             "bad need kind {value}"
         ))),
     }
 }

---- load::tests::shuffled_input_paths_load_to_same_canonical_world stdout ----

thread 'load::tests::shuffled_input_paths_load_to_same_canonical_world' (19256) panicked at crates/tracewake-content/src/load.rs:509:10:
called `Result::unwrap()` on an `Err` value: Validation(ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: ParseSchema, path: "fixture.line", code: "bad_line", message: "bad fixture line bad need kind hunger" }] } })

---- serialization::tests::fixture_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::fixture_serialization_round_trips_byte_identically' (19261) panicked at crates/tracewake-content/src/serialization.rs:891:50:
called `Result::unwrap()` on an `Err` value: BadLine("bad need kind hunger")

---- validate::tests::fixture_schema_v1_golden_bytes_load_001 stdout ----

thread 'validate::tests::fixture_schema_v1_golden_bytes_load_001' (19272) panicked at crates/tracewake-content/src/validate.rs:3087:81:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: ParseSchema, path: "fixture.line", code: "bad_line", message: "bad fixture line bad need kind hunger" }] } }

failures:
    load::tests::shuffled_input_paths_load_to_same_canonical_world
    serialization::tests::fixture_serialization_round_trips_byte_identically
    validate::tests::fixture_schema_v1_golden_bytes_load_001
    validate::tests::fixture_schema_version_unsupported_rejected_001
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 29 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
