*** crates/tracewake-content/src/serialization.rs:642:9: delete match arm "morning_wake" in parse_routine_family

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ delete match arm "morning_wake" in parse_routine_family
@@ -634,17 +634,17 @@
         _ => Err(SerializationError::BadLine(format!(
             "bad need kind {value}"
         ))),
     }
 }
 
 fn parse_routine_family(value: &str) -> Result<RoutineFamily, SerializationError> {
     match value {
-        "morning_wake" => Ok(RoutineFamily::MorningWake),
+         /* ~ changed by cargo-mutants ~ */
         "eat_meal" => Ok(RoutineFamily::EatMeal),
         "go_to_work" => Ok(RoutineFamily::GoToWork),
         "work_block" => Ok(RoutineFamily::WorkBlock),
         "return_home" => Ok(RoutineFamily::ReturnHome),
         "sleep_night" => Ok(RoutineFamily::SleepNight),
         "find_food" => Ok(RoutineFamily::FindFood),
         "leave_unsafe_place" => Ok(RoutineFamily::LeaveUnsafePlace),
         "continue_current_intention" => Ok(RoutineFamily::ContinueCurrentIntention),

---- serialization_round_trips_spine_variant_matrix stdout ----

thread 'serialization_round_trips_spine_variant_matrix' (25742) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:385:46:
called `Result::unwrap()` on an `Err` value: BadLine("bad routine family morning_wake")

failures:
    serialization_round_trips_spine_variant_matrix

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.63s

*** result: Failure(101)
