*** crates/tracewake-content/src/serialization.rs:643:9: delete match arm "eat_meal" in parse_routine_family

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ delete match arm "eat_meal" in parse_routine_family
@@ -635,17 +635,17 @@
             "bad need kind {value}"
         ))),
     }
 }
 
 fn parse_routine_family(value: &str) -> Result<RoutineFamily, SerializationError> {
     match value {
         "morning_wake" => Ok(RoutineFamily::MorningWake),
-        "eat_meal" => Ok(RoutineFamily::EatMeal),
+         /* ~ changed by cargo-mutants ~ */
         "go_to_work" => Ok(RoutineFamily::GoToWork),
         "work_block" => Ok(RoutineFamily::WorkBlock),
         "return_home" => Ok(RoutineFamily::ReturnHome),
         "sleep_night" => Ok(RoutineFamily::SleepNight),
         "find_food" => Ok(RoutineFamily::FindFood),
         "leave_unsafe_place" => Ok(RoutineFamily::LeaveUnsafePlace),
         "continue_current_intention" => Ok(RoutineFamily::ContinueCurrentIntention),
         "wait" => Ok(RoutineFamily::Wait),

---- phase3a_load_emits_authored_prehistory_seed_events stdout ----

thread 'phase3a_load_emits_authored_prehistory_seed_events' (27849) panicked at crates/tracewake-content/tests/fixtures_load.rs:761:6:
called `Result::unwrap()` on an `Err` value: Validation(ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: ParseSchema, path: "fixture.line", code: "bad_line", message: "bad fixture line bad routine family eat_meal" }] } })

---- all_fixtures_load_deterministically_and_validate stdout ----

thread 'all_fixtures_load_deterministically_and_validate' (27824) panicked at crates/tracewake-content/tests/fixtures_load.rs:591:54:

failures:
    all_fixtures_load_deterministically_and_validate
    phase3a_load_emits_authored_prehistory_seed_events

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
