*** crates/tracewake-content/src/serialization.rs:644:9: delete match arm "go_to_work" in parse_routine_family

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ delete match arm "go_to_work" in parse_routine_family
@@ -636,17 +636,17 @@
         ))),
     }
 }
 
 fn parse_routine_family(value: &str) -> Result<RoutineFamily, SerializationError> {
     match value {
         "morning_wake" => Ok(RoutineFamily::MorningWake),
         "eat_meal" => Ok(RoutineFamily::EatMeal),
-        "go_to_work" => Ok(RoutineFamily::GoToWork),
+         /* ~ changed by cargo-mutants ~ */
         "work_block" => Ok(RoutineFamily::WorkBlock),
         "return_home" => Ok(RoutineFamily::ReturnHome),
         "sleep_night" => Ok(RoutineFamily::SleepNight),
         "find_food" => Ok(RoutineFamily::FindFood),
         "leave_unsafe_place" => Ok(RoutineFamily::LeaveUnsafePlace),
         "continue_current_intention" => Ok(RoutineFamily::ContinueCurrentIntention),
         "wait" => Ok(RoutineFamily::Wait),
         "idle_with_reason" => Ok(RoutineFamily::IdleWithReason),

---- all_fixtures_load_deterministically_and_validate stdout ----

thread 'all_fixtures_load_deterministically_and_validate' (29930) panicked at crates/tracewake-content/tests/fixtures_load.rs:591:54:

failures:
    all_fixtures_load_deterministically_and_validate

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
