*** crates/tracewake-content/src/serialization.rs:646:9: delete match arm "return_home" in parse_routine_family

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ delete match arm "return_home" in parse_routine_family
@@ -638,17 +638,17 @@
 }
 
 fn parse_routine_family(value: &str) -> Result<RoutineFamily, SerializationError> {
     match value {
         "morning_wake" => Ok(RoutineFamily::MorningWake),
         "eat_meal" => Ok(RoutineFamily::EatMeal),
         "go_to_work" => Ok(RoutineFamily::GoToWork),
         "work_block" => Ok(RoutineFamily::WorkBlock),
-        "return_home" => Ok(RoutineFamily::ReturnHome),
+         /* ~ changed by cargo-mutants ~ */
         "sleep_night" => Ok(RoutineFamily::SleepNight),
         "find_food" => Ok(RoutineFamily::FindFood),
         "leave_unsafe_place" => Ok(RoutineFamily::LeaveUnsafePlace),
         "continue_current_intention" => Ok(RoutineFamily::ContinueCurrentIntention),
         "wait" => Ok(RoutineFamily::Wait),
         "idle_with_reason" => Ok(RoutineFamily::IdleWithReason),
         _ => Err(SerializationError::BadLine(format!(
             "bad routine family {value}"

---- serialization_round_trips_spine_variant_matrix stdout ----

thread 'serialization_round_trips_spine_variant_matrix' (1731) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:385:46:
called `Result::unwrap()` on an `Err` value: BadLine("bad routine family return_home")

failures:
    serialization_round_trips_spine_variant_matrix

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.63s

*** result: Failure(101)
