*** crates/tracewake-content/src/serialization.rs:647:9: delete match arm "sleep_night" in parse_routine_family

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ delete match arm "sleep_night" in parse_routine_family
@@ -639,17 +639,17 @@
 
 fn parse_routine_family(value: &str) -> Result<RoutineFamily, SerializationError> {
     match value {
         "morning_wake" => Ok(RoutineFamily::MorningWake),
         "eat_meal" => Ok(RoutineFamily::EatMeal),
         "go_to_work" => Ok(RoutineFamily::GoToWork),
         "work_block" => Ok(RoutineFamily::WorkBlock),
         "return_home" => Ok(RoutineFamily::ReturnHome),
-        "sleep_night" => Ok(RoutineFamily::SleepNight),
+         /* ~ changed by cargo-mutants ~ */
         "find_food" => Ok(RoutineFamily::FindFood),
         "leave_unsafe_place" => Ok(RoutineFamily::LeaveUnsafePlace),
         "continue_current_intention" => Ok(RoutineFamily::ContinueCurrentIntention),
         "wait" => Ok(RoutineFamily::Wait),
         "idle_with_reason" => Ok(RoutineFamily::IdleWithReason),
         _ => Err(SerializationError::BadLine(format!(
             "bad routine family {value}"
         ))),

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (3804) panicked at crates/tracewake-content/src/validate.rs:3685:49:

failures:
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
