*** crates/tracewake-content/src/serialization.rs:651:9: delete match arm "wait" in parse_routine_family

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ delete match arm "wait" in parse_routine_family
@@ -643,17 +643,17 @@
         "eat_meal" => Ok(RoutineFamily::EatMeal),
         "go_to_work" => Ok(RoutineFamily::GoToWork),
         "work_block" => Ok(RoutineFamily::WorkBlock),
         "return_home" => Ok(RoutineFamily::ReturnHome),
         "sleep_night" => Ok(RoutineFamily::SleepNight),
         "find_food" => Ok(RoutineFamily::FindFood),
         "leave_unsafe_place" => Ok(RoutineFamily::LeaveUnsafePlace),
         "continue_current_intention" => Ok(RoutineFamily::ContinueCurrentIntention),
-        "wait" => Ok(RoutineFamily::Wait),
+         /* ~ changed by cargo-mutants ~ */
         "idle_with_reason" => Ok(RoutineFamily::IdleWithReason),
         _ => Err(SerializationError::BadLine(format!(
             "bad routine family {value}"
         ))),
     }
 }
 
 fn parse_routine_condition(value: String) -> Result<RoutineCondition, SerializationError> {

---- forbidden_content_serialization_truncated_and_malformed_lists_fail_loudly stdout ----

thread 'forbidden_content_serialization_truncated_and_malformed_lists_fail_loudly' (12391) panicked at crates/tracewake-content/tests/forbidden_content.rs:327:5:
missing malformed-list diagnostic: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: ParseSchema, path: "fixture.line", code: "bad_line", message: "bad fixture line bad routine family wait" }] }

failures:
    forbidden_content_serialization_truncated_and_malformed_lists_fail_loudly

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
