*** crates/tracewake-content/src/serialization.rs:652:9: delete match arm "idle_with_reason" in parse_routine_family

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ delete match arm "idle_with_reason" in parse_routine_family
@@ -644,17 +644,17 @@
         "go_to_work" => Ok(RoutineFamily::GoToWork),
         "work_block" => Ok(RoutineFamily::WorkBlock),
         "return_home" => Ok(RoutineFamily::ReturnHome),
         "sleep_night" => Ok(RoutineFamily::SleepNight),
         "find_food" => Ok(RoutineFamily::FindFood),
         "leave_unsafe_place" => Ok(RoutineFamily::LeaveUnsafePlace),
         "continue_current_intention" => Ok(RoutineFamily::ContinueCurrentIntention),
         "wait" => Ok(RoutineFamily::Wait),
-        "idle_with_reason" => Ok(RoutineFamily::IdleWithReason),
+         /* ~ changed by cargo-mutants ~ */
         _ => Err(SerializationError::BadLine(format!(
             "bad routine family {value}"
         ))),
     }
 }
 
 fn parse_routine_condition(value: String) -> Result<RoutineCondition, SerializationError> {
     RoutineCondition::parse(&value)

---- serialization_round_trips_spine_variant_matrix stdout ----

thread 'serialization_round_trips_spine_variant_matrix' (14562) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:385:46:
called `Result::unwrap()` on an `Err` value: BadLine("bad routine family idle_with_reason")

failures:
    serialization_round_trips_spine_variant_matrix

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.65s

*** result: Failure(101)
