*** crates/tracewake-content/src/serialization.rs:665:5: replace source_id -> String with String::new()

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ replace source_id -> String with String::new()
@@ -657,21 +657,17 @@
 }
 
 fn parse_routine_condition(value: String) -> Result<RoutineCondition, SerializationError> {
     RoutineCondition::parse(&value)
         .ok_or_else(|| SerializationError::BadLine(format!("bad routine condition {value}")))
 }
 
 fn source_id(source: &SourceRef) -> String {
-    match source {
-        SourceRef::Event(event_id) => event_id.as_str().to_string(),
-        SourceRef::Action(action_id) => action_id.as_str().to_string(),
-        SourceRef::Cause(cause) => stable_event_cause_id(cause),
-    }
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn stable_event_cause_id(cause: &EventCause) -> String {
     match cause {
         EventCause::Event(id) => format!("event:{}", id.as_str()),
         EventCause::Proposal(id) => format!("proposal:{}", id.as_str()),
         EventCause::ValidationReport(id) => format!("validation_report:{}", id.as_str()),
         EventCause::Process(id) => format!("process:{}", id.as_str()),

---- validate::tests::fixture_serialization_golden_bytes_are_pinned_001 stdout ----

thread 'validate::tests::fixture_serialization_golden_bytes_are_pinned_001' (16771) panicked at crates/tracewake-content/src/validate.rs:3216:13:
assertion `left == right` failed: phase2a serialization golden changed

failures:
    validate::tests::fixture_serialization_golden_bytes_are_pinned_001

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
