*** crates/tracewake-content/src/serialization.rs:673:5: replace stable_event_cause_id -> String with String::new()

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ replace stable_event_cause_id -> String with String::new()
@@ -665,22 +665,17 @@
     match source {
         SourceRef::Event(event_id) => event_id.as_str().to_string(),
         SourceRef::Action(action_id) => action_id.as_str().to_string(),
         SourceRef::Cause(cause) => stable_event_cause_id(cause),
     }
 }
 
 fn stable_event_cause_id(cause: &EventCause) -> String {
-    match cause {
-        EventCause::Event(id) => format!("event:{}", id.as_str()),
-        EventCause::Proposal(id) => format!("proposal:{}", id.as_str()),
-        EventCause::ValidationReport(id) => format!("validation_report:{}", id.as_str()),
-        EventCause::Process(id) => format!("process:{}", id.as_str()),
-    }
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_source(kind: &str, id: &str) -> Result<SourceRef, SerializationError> {
     if id.is_empty() {
         return Err(SerializationError::BadLine(
             "initial_belief source_id must not be empty".to_string(),
         ));
     }

---- source_ref_cause_uses_stable_typed_canonical_encoding stdout ----

thread 'source_ref_cause_uses_stable_typed_canonical_encoding' (20960) panicked at crates/tracewake-content/tests/fixtures_load.rs:571:5:
assertion failed: rendered.contains("process:process_fixture_cause")

failures:
    source_ref_cause_uses_stable_typed_canonical_encoding

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
