*** crates/tracewake-content/src/serialization.rs:697:9: delete match arm "authored_prehistory" in parse_source_kind

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ delete match arm "authored_prehistory" in parse_source_kind
@@ -689,17 +689,17 @@
         _ => Err(SerializationError::BadLine(format!(
             "bad source kind {kind}"
         ))),
     }
 }
 
 fn parse_source_kind(value: &str) -> Result<InitialBeliefSourceKind, SerializationError> {
     match value {
-        "authored_prehistory" => Ok(InitialBeliefSourceKind::AuthoredPrehistory),
+         /* ~ changed by cargo-mutants ~ */
         _ => Err(SerializationError::BadLine(format!(
             "bad source kind {value}"
         ))),
     }
 }
 
 fn serialize_privacy_scope(scope: &PrivacyScope) -> String {
     match scope {

---- fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture stdout ----

thread 'fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture' (27541) panicked at crates/tracewake-content/tests/fixtures_load.rs:661:6:
called `Result::unwrap()` on an `Err` value: Validation(ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: ParseSchema, path: "fixture.line", code: "bad_line", message: "bad fixture line bad source kind authored_prehistory" }] } })

---- fixture_fingerprint_reprices_secondary_file_bytes stdout ----

thread 'fixture_fingerprint_reprices_secondary_file_bytes' (27542) panicked at crates/tracewake-content/tests/fixtures_load.rs:629:6:
called `Result::unwrap()` on an `Err` value: Validation(ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: ParseSchema, path: "fixture.line", code: "bad_line", message: "bad fixture line bad source kind authored_prehistory" }] } })

---- seed_event_log_order_and_projection_provenance_are_causal_and_stable stdout ----

thread 'seed_event_log_order_and_projection_provenance_are_causal_and_stable' (27566) panicked at crates/tracewake-content/tests/fixtures_load.rs:920:74:
called `Result::unwrap()` on an `Err` value: Validation(ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: ParseSchema, path: "fixture.line", code: "bad_line", message: "bad fixture line bad source kind authored_prehistory" }] } })

failures:
    all_fixtures_load_deterministically_and_validate
    fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture
    fixture_fingerprint_reprices_secondary_file_bytes
    phase2a_fixtures_are_registered_and_script_free
    seed_event_log_order_and_projection_provenance_are_causal_and_stable
    valid_epistemic_seed_validates_and_round_trips_canonically

test result: FAILED. 28 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
