*** crates/tracewake-content/src/serialization.rs:705:5: replace serialize_privacy_scope -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ replace serialize_privacy_scope -> String with "xyzzy".into()
@@ -697,21 +697,17 @@
         "authored_prehistory" => Ok(InitialBeliefSourceKind::AuthoredPrehistory),
         _ => Err(SerializationError::BadLine(format!(
             "bad source kind {value}"
         ))),
     }
 }
 
 fn serialize_privacy_scope(scope: &PrivacyScope) -> String {
-    match scope {
-        PrivacyScope::ActorPrivate(actor_id) => format!("actor:{}", actor_id.as_str()),
-        PrivacyScope::PublicPlaceholder => "public".to_string(),
-        PrivacyScope::InstitutionPlaceholder(value) => format!("institution:{}", encode(value)),
-    }
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_privacy_scope(value: &str) -> Result<PrivacyScope, SerializationError> {
     if value == "public" {
         return Ok(PrivacyScope::PublicPlaceholder);
     }
     let (kind, id) = value
         .split_once(':')

---- validate::tests::fixture_serialization_golden_bytes_are_pinned_001 stdout ----

thread 'validate::tests::fixture_serialization_golden_bytes_are_pinned_001' (31698) panicked at crates/tracewake-content/src/validate.rs:3216:13:
assertion `left == right` failed: phase2a serialization golden changed

failures:
    validate::tests::fixture_serialization_golden_bytes_are_pinned_001

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
