*** crates/tracewake-content/src/serialization.rs:713:14: replace == with != in parse_privacy_scope

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ replace == with != in parse_privacy_scope
@@ -705,17 +705,17 @@
     match scope {
         PrivacyScope::ActorPrivate(actor_id) => format!("actor:{}", actor_id.as_str()),
         PrivacyScope::PublicPlaceholder => "public".to_string(),
         PrivacyScope::InstitutionPlaceholder(value) => format!("institution:{}", encode(value)),
     }
 }
 
 fn parse_privacy_scope(value: &str) -> Result<PrivacyScope, SerializationError> {
-    if value == "public" {
+    if value != /* ~ changed by cargo-mutants ~ */ "public" {
         return Ok(PrivacyScope::PublicPlaceholder);
     }
     let (kind, id) = value
         .split_once(':')
         .ok_or_else(|| SerializationError::BadLine(value.to_string()))?;
     match kind {
         "actor" => Ok(PrivacyScope::ActorPrivate(ActorId::new(id)?)),
         "institution" => Ok(PrivacyScope::InstitutionPlaceholder(decode(id)?)),

---- fixture_fingerprint_reprices_secondary_file_bytes stdout ----

thread 'fixture_fingerprint_reprices_secondary_file_bytes' (1467) panicked at crates/tracewake-content/tests/fixtures_load.rs:629:6:

---- fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture stdout ----

thread 'fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture' (1466) panicked at crates/tracewake-content/tests/fixtures_load.rs:661:6:

---- valid_epistemic_seed_validates_and_round_trips_canonically stdout ----

thread 'valid_epistemic_seed_validates_and_round_trips_canonically' (1496) panicked at crates/tracewake-content/tests/fixtures_load.rs:1708:52:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Serialization, path: "fixture", code: "serialization_drift", message: "fixture serialization changed canonical content" }] } }

failures:
    all_fixtures_load_deterministically_and_validate
    fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture
    fixture_fingerprint_reprices_secondary_file_bytes
    phase2a_fixtures_are_registered_and_script_free
    seed_event_log_order_and_projection_provenance_are_causal_and_stable
    valid_epistemic_seed_validates_and_round_trips_canonically

test result: FAILED. 28 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
