*** crates/tracewake-content/src/serialization.rs:720:9: delete match arm "actor" in parse_privacy_scope

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ delete match arm "actor" in parse_privacy_scope
@@ -712,17 +712,17 @@
 fn parse_privacy_scope(value: &str) -> Result<PrivacyScope, SerializationError> {
     if value == "public" {
         return Ok(PrivacyScope::PublicPlaceholder);
     }
     let (kind, id) = value
         .split_once(':')
         .ok_or_else(|| SerializationError::BadLine(value.to_string()))?;
     match kind {
-        "actor" => Ok(PrivacyScope::ActorPrivate(ActorId::new(id)?)),
+         /* ~ changed by cargo-mutants ~ */
         "institution" => Ok(PrivacyScope::InstitutionPlaceholder(decode(id)?)),
         _ => Err(SerializationError::BadLine(value.to_string())),
     }
 }
 
 fn split_ids<T>(
     value: &str,
     parse: impl Fn(&str) -> Result<T, tracewake_core::ids::IdError>,

---- fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture stdout ----

thread 'fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture' (3572) panicked at crates/tracewake-content/tests/fixtures_load.rs:661:6:
called `Result::unwrap()` on an `Err` value: Validation(ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: ParseSchema, path: "fixture.line", code: "bad_line", message: "bad fixture line actor:actor_tomas" }] } })

---- fixture_fingerprint_reprices_secondary_file_bytes stdout ----

thread 'fixture_fingerprint_reprices_secondary_file_bytes' (3573) panicked at crates/tracewake-content/tests/fixtures_load.rs:629:6:
called `Result::unwrap()` on an `Err` value: Validation(ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: ParseSchema, path: "fixture.line", code: "bad_line", message: "bad fixture line actor:actor_tomas" }] } })

---- seed_event_log_order_and_projection_provenance_are_causal_and_stable stdout ----

thread 'seed_event_log_order_and_projection_provenance_are_causal_and_stable' (3597) panicked at crates/tracewake-content/tests/fixtures_load.rs:920:74:
called `Result::unwrap()` on an `Err` value: Validation(ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: ParseSchema, path: "fixture.line", code: "bad_line", message: "bad fixture line actor:actor_tomas" }] } })

failures:
    all_fixtures_load_deterministically_and_validate
    fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture
    fixture_fingerprint_reprices_secondary_file_bytes
    phase2a_fixtures_are_registered_and_script_free
    seed_event_log_order_and_projection_provenance_are_causal_and_stable
    valid_epistemic_seed_validates_and_round_trips_canonically

test result: FAILED. 28 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
