*** crates/tracewake-content/src/serialization.rs:721:9: delete match arm "institution" in parse_privacy_scope

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ delete match arm "institution" in parse_privacy_scope
@@ -713,17 +713,17 @@
     if value == "public" {
         return Ok(PrivacyScope::PublicPlaceholder);
     }
     let (kind, id) = value
         .split_once(':')
         .ok_or_else(|| SerializationError::BadLine(value.to_string()))?;
     match kind {
         "actor" => Ok(PrivacyScope::ActorPrivate(ActorId::new(id)?)),
-        "institution" => Ok(PrivacyScope::InstitutionPlaceholder(decode(id)?)),
+         /* ~ changed by cargo-mutants ~ */
         _ => Err(SerializationError::BadLine(value.to_string())),
     }
 }
 
 fn split_ids<T>(
     value: &str,
     parse: impl Fn(&str) -> Result<T, tracewake_core::ids::IdError>,
 ) -> Result<Vec<T>, SerializationError> {

---- serialization_round_trips_spine_variant_matrix stdout ----

thread 'serialization_round_trips_spine_variant_matrix' (5769) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:385:46:
called `Result::unwrap()` on an `Err` value: BadLine("institution:76696c6c6167655f6e6f746963655f626f617264")

failures:
    serialization_round_trips_spine_variant_matrix

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.64s

*** result: Failure(101)
