*** crates/tracewake-content/src/serialization.rs:730:5: replace split_ids -> Result<Vec<T>, SerializationError> with Ok(vec![])

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ replace split_ids -> Result<Vec<T>, SerializationError> with Ok(vec![])
@@ -722,24 +722,17 @@
         _ => Err(SerializationError::BadLine(value.to_string())),
     }
 }
 
 fn split_ids<T>(
     value: &str,
     parse: impl Fn(&str) -> Result<T, tracewake_core::ids::IdError>,
 ) -> Result<Vec<T>, SerializationError> {
-    if value.is_empty() {
-        Ok(Vec::new())
-    } else {
-        value
-            .split(',')
-            .map(|part| parse(part).map_err(Into::into))
-            .collect()
-    }
+    Ok(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 fn join<'a>(values: impl Iterator<Item = &'a str>) -> String {
     values.collect::<Vec<_>>().join(",")
 }
 
 fn join_encoded(values: &[String]) -> String {
     values

---- serialization::tests::fixture_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::fixture_serialization_round_trips_byte_identically' (7820) panicked at crates/tracewake-content/src/serialization.rs:887:9:
assertion `left == right` failed

---- load::tests::shuffled_input_paths_load_to_same_canonical_world stdout ----

thread 'load::tests::shuffled_input_paths_load_to_same_canonical_world' (7815) panicked at crates/tracewake-content/src/load.rs:509:10:

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (7842) panicked at crates/tracewake-content/src/validate.rs:3685:49:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Serialization, path: "fixture", code: "serialization_drift", message: "fixture serialization changed canonical content" }] } }

failures:
    load::tests::shuffled_input_paths_load_to_same_canonical_world
    serialization::tests::fixture_serialization_round_trips_byte_identically
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 31 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
