*** crates/tracewake-content/src/serialization.rs:741:5: replace join -> String with String::new()

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ replace join -> String with String::new()
@@ -733,17 +733,17 @@
         value
             .split(',')
             .map(|part| parse(part).map_err(Into::into))
             .collect()
     }
 }
 
 fn join<'a>(values: impl Iterator<Item = &'a str>) -> String {
-    values.collect::<Vec<_>>().join(",")
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn join_encoded(values: &[String]) -> String {
     values
         .iter()
         .map(|value| encode(value))
         .collect::<Vec<_>>()
         .join(",")

---- load::tests::shuffled_input_paths_load_to_same_canonical_world stdout ----

thread 'load::tests::shuffled_input_paths_load_to_same_canonical_world' (10031) panicked at crates/tracewake-content/src/load.rs:509:10:

---- validate::tests::fixture_serialization_golden_bytes_are_pinned_001 stdout ----

thread 'validate::tests::fixture_serialization_golden_bytes_are_pinned_001' (10049) panicked at crates/tracewake-content/src/validate.rs:3216:13:
assertion `left == right` failed: phase1 serialization golden changed

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (10058) panicked at crates/tracewake-content/src/validate.rs:3685:49:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Serialization, path: "fixture", code: "serialization_drift", message: "fixture serialization changed canonical content" }] } }

failures:
    load::tests::shuffled_input_paths_load_to_same_canonical_world
    validate::tests::fixture_serialization_golden_bytes_are_pinned_001
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 31 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
