*** crates/tracewake-content/src/serialization.rs:741:5: replace join -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ replace join -> String with "xyzzy".into()
@@ -733,17 +733,17 @@
         value
             .split(',')
             .map(|part| parse(part).map_err(Into::into))
             .collect()
     }
 }
 
 fn join<'a>(values: impl Iterator<Item = &'a str>) -> String {
-    values.collect::<Vec<_>>().join(",")
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 fn join_encoded(values: &[String]) -> String {
     values
         .iter()
         .map(|value| encode(value))
         .collect::<Vec<_>>()
         .join(",")

---- load::tests::shuffled_input_paths_load_to_same_canonical_world stdout ----

thread 'load::tests::shuffled_input_paths_load_to_same_canonical_world' (12102) panicked at crates/tracewake-content/src/load.rs:509:10:

---- validate::tests::fixture_schema_v1_golden_bytes_load_001 stdout ----

thread 'validate::tests::fixture_schema_v1_golden_bytes_load_001' (12118) panicked at crates/tracewake-content/src/validate.rs:3087:81:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Serialization, path: "fixture", code: "serialization_drift", message: "fixture serialization changed canonical content" }] } }

---- validate::tests::fixture_serialization_golden_bytes_are_pinned_001 stdout ----

thread 'validate::tests::fixture_serialization_golden_bytes_are_pinned_001' (12120) panicked at crates/tracewake-content/src/validate.rs:3216:13:
assertion `left == right` failed: phase1 serialization golden changed

failures:
    load::tests::shuffled_input_paths_load_to_same_canonical_world
    validate::tests::fixture_schema_v1_golden_bytes_load_001
    validate::tests::fixture_serialization_golden_bytes_are_pinned_001
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 30 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
