*** crates/tracewake-content/src/serialization.rs:753:5: replace split_encoded -> Result<Vec<String>, SerializationError> with Ok(vec!["xyzzy".into()])

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ replace split_encoded -> Result<Vec<String>, SerializationError> with Ok(vec!["xyzzy".into()])
@@ -745,21 +745,17 @@
     values
         .iter()
         .map(|value| encode(value))
         .collect::<Vec<_>>()
         .join(",")
 }
 
 fn split_encoded(value: &str) -> Result<Vec<String>, SerializationError> {
-    if value.is_empty() {
-        Ok(Vec::new())
-    } else {
-        value.split(',').map(decode).collect()
-    }
+    Ok(vec!["xyzzy".into()]) /* ~ changed by cargo-mutants ~ */
 }
 
 fn join_usize(values: &[usize]) -> String {
     values
         .iter()
         .map(usize::to_string)
         .collect::<Vec<_>>()
         .join(",")

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (22484) panicked at crates/tracewake-content/src/validate.rs:3685:49:

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (22485) panicked at crates/tracewake-content/src/validate.rs:3650:59:

failures:
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted

test result: FAILED. 34 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
