*** crates/tracewake-content/src/serialization.rs:761:5: replace join_usize -> String with String::new()

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ replace join_usize -> String with String::new()
@@ -753,21 +753,17 @@
     if value.is_empty() {
         Ok(Vec::new())
     } else {
         value.split(',').map(decode).collect()
     }
 }
 
 fn join_usize(values: &[usize]) -> String {
-    values
-        .iter()
-        .map(usize::to_string)
-        .collect::<Vec<_>>()
-        .join(",")
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn split_usize(value: &str) -> Result<Vec<usize>, SerializationError> {
     if value.is_empty() {
         Ok(Vec::new())
     } else {
         value
             .split(',')

---- validate::tests::fixture_serialization_golden_bytes_are_pinned_001 stdout ----

thread 'validate::tests::fixture_serialization_golden_bytes_are_pinned_001' (24546) panicked at crates/tracewake-content/src/validate.rs:3216:13:
assertion `left == right` failed: phase3a serialization golden changed

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (24555) panicked at crates/tracewake-content/src/validate.rs:3685:49:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Serialization, path: "fixture", code: "serialization_drift", message: "fixture serialization changed canonical content" }] } }

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (24556) panicked at crates/tracewake-content/src/validate.rs:3650:59:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Serialization, path: "fixture", code: "serialization_drift", message: "fixture serialization changed canonical content" }] } }

failures:
    validate::tests::fixture_serialization_golden_bytes_are_pinned_001
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted

test result: FAILED. 33 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
