*** crates/tracewake-content/src/serialization.rs:769:5: replace split_usize -> Result<Vec<usize>, SerializationError> with Ok(vec![])

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ replace split_usize -> Result<Vec<usize>, SerializationError> with Ok(vec![])
@@ -761,27 +761,17 @@
     values
         .iter()
         .map(usize::to_string)
         .collect::<Vec<_>>()
         .join(",")
 }
 
 fn split_usize(value: &str) -> Result<Vec<usize>, SerializationError> {
-    if value.is_empty() {
-        Ok(Vec::new())
-    } else {
-        value
-            .split(',')
-            .map(|part| {
-                part.parse::<usize>()
-                    .map_err(|_| SerializationError::BadU64(part.to_string()))
-            })
-            .collect()
-    }
+    Ok(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_bool(value: &str) -> Result<bool, SerializationError> {
     match value {
         "true" => Ok(true),
         "false" => Ok(false),
         _ => Err(SerializationError::BadBool(value.to_string())),
     }

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (28697) panicked at crates/tracewake-content/src/validate.rs:3685:49:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Serialization, path: "fixture", code: "serialization_drift", message: "fixture serialization changed canonical content" }] } }

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (28698) panicked at crates/tracewake-content/src/validate.rs:3650:59:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Serialization, path: "fixture", code: "serialization_drift", message: "fixture serialization changed canonical content" }] } }

failures:
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted

test result: FAILED. 34 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
