*** crates/tracewake-content/src/serialization.rs:769:5: replace split_usize -> Result<Vec<usize>, SerializationError> with Ok(vec![0])

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ replace split_usize -> Result<Vec<usize>, SerializationError> with Ok(vec![0])
@@ -761,27 +761,17 @@
     values
         .iter()
         .map(usize::to_string)
         .collect::<Vec<_>>()
         .join(",")
 }
 
 fn split_usize(value: &str) -> Result<Vec<usize>, SerializationError> {
-    if value.is_empty() {
-        Ok(Vec::new())
-    } else {
-        value
-            .split(',')
-            .map(|part| {
-                part.parse::<usize>()
-                    .map_err(|_| SerializationError::BadU64(part.to_string()))
-            })
-            .collect()
-    }
+    Ok(vec![0]) /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_bool(value: &str) -> Result<bool, SerializationError> {
     match value {
         "true" => Ok(true),
         "false" => Ok(false),
         _ => Err(SerializationError::BadBool(value.to_string())),
     }

---- forbidden_content_serialization_truncated_and_malformed_lists_fail_loudly stdout ----

thread 'forbidden_content_serialization_truncated_and_malformed_lists_fail_loudly' (30829) panicked at crates/tracewake-content/tests/forbidden_content.rs:327:5:
missing malformed-list diagnostic: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: State, path: "routine_templates[0].failure_modes[0]", code: "unknown_failure_mode", message: "unknown routine failure mode wait" }] }

failures:
    forbidden_content_serialization_truncated_and_malformed_lists_fail_loudly

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
