*** crates/tracewake-content/src/serialization.rs:783:5: replace parse_bool -> Result<bool, SerializationError> with Ok(false)

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ replace parse_bool -> Result<bool, SerializationError> with Ok(false)
@@ -775,21 +775,17 @@
                 part.parse::<usize>()
                     .map_err(|_| SerializationError::BadU64(part.to_string()))
             })
             .collect()
     }
 }
 
 fn parse_bool(value: &str) -> Result<bool, SerializationError> {
-    match value {
-        "true" => Ok(true),
-        "false" => Ok(false),
-        _ => Err(SerializationError::BadBool(value.to_string())),
-    }
+    Ok(false) /* ~ changed by cargo-mutants ~ */
 }
 
 fn encode(value: &str) -> String {
     value
         .as_bytes()
         .iter()
         .map(|byte| format!("{byte:02x}"))
         .collect()

---- serialization::tests::fixture_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::fixture_serialization_round_trips_byte_identically' (4551) panicked at crates/tracewake-content/src/serialization.rs:890:9:
assertion `left == right` failed

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (4573) panicked at crates/tracewake-content/src/validate.rs:3685:49:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Serialization, path: "fixture", code: "serialization_drift", message: "fixture serialization changed canonical content" }] } }

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (4574) panicked at crates/tracewake-content/src/validate.rs:3650:59:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Serialization, path: "fixture", code: "serialization_drift", message: "fixture serialization changed canonical content" }] } }

failures:
    serialization::tests::fixture_serialization_round_trips_byte_identically
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 32 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
