*** crates/tracewake-content/src/serialization.rs:784:9: delete match arm "true" in parse_bool

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ delete match arm "true" in parse_bool
@@ -776,17 +776,17 @@
                     .map_err(|_| SerializationError::BadU64(part.to_string()))
             })
             .collect()
     }
 }
 
 fn parse_bool(value: &str) -> Result<bool, SerializationError> {
     match value {
-        "true" => Ok(true),
+         /* ~ changed by cargo-mutants ~ */
         "false" => Ok(false),
         _ => Err(SerializationError::BadBool(value.to_string())),
     }
 }
 
 fn encode(value: &str) -> String {
     value
         .as_bytes()

---- serialization::tests::fixture_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::fixture_serialization_round_trips_byte_identically' (6623) panicked at crates/tracewake-content/src/serialization.rs:891:50:
called `Result::unwrap()` on an `Err` value: BadBool("true")

---- load::tests::shuffled_input_paths_load_to_same_canonical_world stdout ----

thread 'load::tests::shuffled_input_paths_load_to_same_canonical_world' (6618) panicked at crates/tracewake-content/src/load.rs:509:10:
called `Result::unwrap()` on an `Err` value: Validation(ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: ParseSchema, path: "fixture.bool", code: "bad_bool", message: "bad bool value true" }] } })

---- validate::tests::fixture_schema_version_unsupported_rejected_001 stdout ----

thread 'validate::tests::fixture_schema_version_unsupported_rejected_001' (6635) panicked at crates/tracewake-content/src/validate.rs:3114:9:
assertion `left == right` failed
  left: None
 right: Some((ParseSchema, "fixture.schema_version"))

failures:
    load::tests::shuffled_input_paths_load_to_same_canonical_world
    serialization::tests::fixture_serialization_round_trips_byte_identically
    validate::tests::fixture_schema_version_unsupported_rejected_001
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 30 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
