*** crates/tracewake-content/src/serialization.rs:799:5: replace decode -> Result<String, SerializationError> with Ok("xyzzy".into())

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ replace decode -> Result<String, SerializationError> with Ok("xyzzy".into())
@@ -791,29 +791,17 @@
     value
         .as_bytes()
         .iter()
         .map(|byte| format!("{byte:02x}"))
         .collect()
 }
 
 fn decode(value: &str) -> Result<String, SerializationError> {
-    if !value.len().is_multiple_of(2) {
-        return Err(SerializationError::BadLine(value.to_string()));
-    }
-    let mut bytes = Vec::new();
-    for chunk in value.as_bytes().chunks_exact(2) {
-        let hex = std::str::from_utf8(chunk)
-            .map_err(|_| SerializationError::BadLine(value.to_string()))?;
-        bytes.push(
-            u8::from_str_radix(hex, 16)
-                .map_err(|_| SerializationError::BadLine(value.to_string()))?,
-        );
-    }
-    String::from_utf8(bytes).map_err(|_| SerializationError::BadLine(value.to_string()))
+    Ok("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use tracewake_core::events::log::EventLog;
     use tracewake_core::events::{EventEnvelope, EventKind};
     use tracewake_core::ids::{ActionId, ContentManifestId, EventId};

---- serialization::tests::fixture_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::fixture_serialization_round_trips_byte_identically' (16978) panicked at crates/tracewake-content/src/serialization.rs:882:9:
assertion `left == right` failed

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (17000) panicked at crates/tracewake-content/src/validate.rs:3685:49:

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (17001) panicked at crates/tracewake-content/src/validate.rs:3650:59:

failures:
    serialization::tests::fixture_serialization_round_trips_byte_identically
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 32 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
