*** crates/tracewake-content/src/serialization.rs:799:8: delete ! in decode

*** mutation diff:
--- crates/tracewake-content/src/serialization.rs
+++ delete ! in decode
@@ -791,17 +791,17 @@
     value
         .as_bytes()
         .iter()
         .map(|byte| format!("{byte:02x}"))
         .collect()
 }
 
 fn decode(value: &str) -> Result<String, SerializationError> {
-    if !value.len().is_multiple_of(2) {
+    if  /* ~ changed by cargo-mutants ~ */value.len().is_multiple_of(2) {
         return Err(SerializationError::BadLine(value.to_string()));
     }
     let mut bytes = Vec::new();
     for chunk in value.as_bytes().chunks_exact(2) {
         let hex = std::str::from_utf8(chunk)
             .map_err(|_| SerializationError::BadLine(value.to_string()))?;
         bytes.push(
             u8::from_str_radix(hex, 16)

---- load::tests::shuffled_input_paths_load_to_same_canonical_world stdout ----

thread 'load::tests::shuffled_input_paths_load_to_same_canonical_world' (19044) panicked at crates/tracewake-content/src/load.rs:509:10:
called `Result::unwrap()` on an `Err` value: Validation(ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: ParseSchema, path: "fixture.line", code: "bad_line", message: "bad fixture line 53686f702066726f6e74" }] } })

---- serialization::tests::fixture_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::fixture_serialization_round_trips_byte_identically' (19049) panicked at crates/tracewake-content/src/serialization.rs:891:50:
called `Result::unwrap()` on an `Err` value: BadLine("53686f702066726f6e74")

---- validate::tests::fixture_food_supply_negative_servings_rejected_001 stdout ----

thread 'validate::tests::fixture_food_supply_negative_servings_rejected_001' (19055) panicked at crates/tracewake-content/src/validate.rs:3226:9:
assertion failed: errors.report.errors.iter().any(|error|
        { error.code == "bad_number" && error.path == "fixture.number" })

failures:
    load::tests::shuffled_input_paths_load_to_same_canonical_world
    serialization::tests::fixture_serialization_round_trips_byte_identically
    validate::tests::fixture_food_supply_negative_servings_rejected_001
    validate::tests::fixture_schema_v1_golden_bytes_load_001
    validate::tests::fixture_schema_version_unsupported_rejected_001
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 28 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
