*** crates/tracewake-content/src/validate.rs:1002:19: replace != with == in validate_topology

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace != with == in validate_topology
@@ -994,17 +994,17 @@
             );
         }
         let a_to_b = adjacency
             .get(&door.endpoint_a)
             .is_some_and(|ids| ids.contains(&door.endpoint_b));
         let b_to_a = adjacency
             .get(&door.endpoint_b)
             .is_some_and(|ids| ids.contains(&door.endpoint_a));
-        if a_to_b != b_to_a {
+        if a_to_b == /* ~ changed by cargo-mutants ~ */ b_to_a {
             errors.push(ContentValidationError::new(
                 ValidationPhase::PhysicalTopology,
                 format!("doors[{index}]"),
                 "door_adjacency_inconsistency",
                 format!(
                     "door {} endpoints must have symmetric adjacency",
                     door.door_id.as_str()
                 ),

---- validate::tests::valid_fixture_produces_initial_world stdout ----

thread 'validate::tests::valid_fixture_produces_initial_world' (6236) panicked at crates/tracewake-content/src/validate.rs:3076:63:

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (6231) panicked at crates/tracewake-content/src/validate.rs:3650:59:

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (6230) panicked at crates/tracewake-content/src/validate.rs:3685:49:

failures:
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 33 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
