*** crates/tracewake-content/src/validate.rs:1017:5: replace validate_state with ()

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace validate_state with ()
@@ -1009,134 +1009,17 @@
                     door.door_id.as_str()
                 ),
             ));
         }
     }
 }
 
 fn validate_state(fixture: &FixtureSchema, errors: &mut Vec<ContentValidationError>) {
-    validate_numeric_i32(
-        fixture.need_model.awake_hunger_delta_per_tick,
-        "need_model.awake_hunger_delta_per_tick",
-        NumericFieldPolicy::PressureNonnegative,
-        errors,
-    );
-    validate_numeric_i32(
-        fixture.need_model.awake_fatigue_delta_per_tick,
-        "need_model.awake_fatigue_delta_per_tick",
-        NumericFieldPolicy::PressureNonnegative,
-        errors,
-    );
-    for (index, need) in fixture.initial_needs.iter().enumerate() {
-        validate_need_band_u16(need.value, format!("initial_needs[{index}].value"), errors);
-    }
-    let seeded_needs = fixture
-        .initial_needs
-        .iter()
-        .map(|need| (need.actor_id.clone(), need.kind))
-        .collect::<BTreeSet<_>>();
-    for actor in &fixture.actors {
-        for kind in [NeedKind::Hunger, NeedKind::Fatigue, NeedKind::Safety] {
-            if !seeded_needs.contains(&(actor.actor_id.clone(), kind)) {
-                errors.push(ContentValidationError::new(
-                    ValidationPhase::State,
-                    format!(
-                        "initial_needs.{}.{}",
-                        actor.actor_id.as_str(),
-                        kind.stable_id()
-                    ),
-                    "missing_actor_need_seed",
-                    format!(
-                        "actor {} must author an initial {} need seed",
-                        actor.actor_id.as_str(),
-                        kind.stable_id()
-                    ),
-                ));
-            }
-        }
-    }
-    for (index, door) in fixture.doors.iter().enumerate() {
-        if door.is_locked && door.is_open {
-            errors.push(ContentValidationError::new(
-                ValidationPhase::State,
-                format!("doors[{index}]"),
-                "locked_open_state",
-                "locked doors must not start open in Phase 1 fixtures",
-            ));
-        }
-    }
-    for (index, container) in fixture.containers.iter().enumerate() {
-        if container.is_locked && container.is_open {
-            errors.push(ContentValidationError::new(
-                ValidationPhase::State,
-                format!("containers[{index}]"),
-                "locked_open_state",
-                "locked containers must not start open in Phase 1 fixtures",
-            ));
-        }
-    }
-    for (index, sleep_place) in fixture.sleep_places.iter().enumerate() {
-        validate_duration_u64(
-            sleep_place.duration_ticks,
-            format!("sleep_places[{index}].duration_ticks"),
-            errors,
-        );
-        validate_numeric_i32(
-            sleep_place.fatigue_recovery_per_tick,
-            format!("sleep_places[{index}].fatigue_recovery_per_tick"),
-            NumericFieldPolicy::ReliefPositive,
-            errors,
-        );
-        validate_numeric_i32(
-            sleep_place.hunger_rise_per_tick,
-            format!("sleep_places[{index}].hunger_rise_per_tick"),
-            NumericFieldPolicy::PressureNonnegative,
-            errors,
-        );
-    }
-    for (index, food) in fixture.food_supplies.iter().enumerate() {
-        validate_numeric_i32(
-            food.hunger_reduction_per_serving,
-            format!("food_supplies[{index}].hunger_reduction_per_serving"),
-            NumericFieldPolicy::ReliefPositive,
-            errors,
-        );
-    }
-    for (index, workplace) in fixture.workplaces.iter().enumerate() {
-        validate_duration_u64(
-            workplace.work_duration_ticks,
-            format!("workplaces[{index}].work_duration_ticks"),
-            errors,
-        );
-        validate_numeric_i32(
-            workplace.fatigue_delta_per_tick,
-            format!("workplaces[{index}].fatigue_delta_per_tick"),
-            NumericFieldPolicy::PressureNonnegative,
-            errors,
-        );
-        validate_numeric_i32(
-            workplace.hunger_delta_per_tick,
-            format!("workplaces[{index}].hunger_delta_per_tick"),
-            NumericFieldPolicy::PressureNonnegative,
-            errors,
-        );
-        validate_numeric_i32(
-            workplace.max_fatigue_to_start,
-            format!("workplaces[{index}].max_fatigue_to_start"),
-            NumericFieldPolicy::NeedBandI32,
-            errors,
-        );
-        validate_numeric_i32(
-            workplace.max_hunger_to_start,
-            format!("workplaces[{index}].max_hunger_to_start"),
-            NumericFieldPolicy::NeedBandI32,
-            errors,
-        );
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 #[allow(dead_code)]
 #[derive(Clone, Copy, Debug, PartialEq, Eq, PartialOrd, Ord)]
 enum NumericFieldPolicy {
     PressureNonnegative,
     ReliefPositive,
     DurationAtLeastOne,

---- validate::tests::fixture_missing_actor_need_seed_rejected_001 stdout ----

thread 'validate::tests::fixture_missing_actor_need_seed_rejected_001' (8286) panicked at crates/tracewake-content/src/validate.rs:3064:62:

---- validate::tests::excessive_need_tuning_magnitude_is_rejected_against_need_max stdout ----

thread 'validate::tests::excessive_need_tuning_magnitude_is_rejected_against_need_max' (8283) panicked at crates/tracewake-content/src/validate.rs:3025:62:

---- validate::tests::fixture_initial_need_out_of_band_rejected_001 stdout ----

thread 'validate::tests::fixture_initial_need_out_of_band_rejected_001' (8285) panicked at crates/tracewake-content/src/validate.rs:3050:62:

failures:
    validate::tests::excessive_need_tuning_magnitude_is_rejected_against_need_max
    validate::tests::fixture_initial_need_out_of_band_rejected_001
    validate::tests::fixture_missing_actor_need_seed_rejected_001
    validate::tests::fixture_relief_zero_and_need_gate_out_of_band_are_rejected_001
    validate::tests::fixture_workplace_zero_duration_rejected_001
    validate::tests::negative_need_tuning_direction_is_rejected

test result: FAILED. 30 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
