*** crates/tracewake-content/src/validate.rs:1039:16: delete ! in validate_state

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ delete ! in validate_state
@@ -1031,17 +1031,17 @@
     }
     let seeded_needs = fixture
         .initial_needs
         .iter()
         .map(|need| (need.actor_id.clone(), need.kind))
         .collect::<BTreeSet<_>>();
     for actor in &fixture.actors {
         for kind in [NeedKind::Hunger, NeedKind::Fatigue, NeedKind::Safety] {
-            if !seeded_needs.contains(&(actor.actor_id.clone(), kind)) {
+            if  /* ~ changed by cargo-mutants ~ */seeded_needs.contains(&(actor.actor_id.clone(), kind)) {
                 errors.push(ContentValidationError::new(
                     ValidationPhase::State,
                     format!(
                         "initial_needs.{}.{}",
                         actor.actor_id.as_str(),
                         kind.stable_id()
                     ),
                     "missing_actor_need_seed",

---- load::tests::shuffled_input_paths_load_to_same_canonical_world stdout ----

thread 'load::tests::shuffled_input_paths_load_to_same_canonical_world' (10344) panicked at crates/tracewake-content/src/load.rs:509:10:

---- validate::tests::fixture_missing_actor_need_seed_rejected_001 stdout ----

thread 'validate::tests::fixture_missing_actor_need_seed_rejected_001' (10357) panicked at crates/tracewake-content/src/validate.rs:3183:9:
assertion failed: report.errors.iter().any(|error|
        {
            error.phase == ValidationPhase::State &&
                    error.code == "missing_actor_need_seed" &&
                error.path == "initial_needs.actor_tomas.safety"
        })

---- validate::tests::fixture_schema_v1_golden_bytes_load_001 stdout ----

thread 'validate::tests::fixture_schema_v1_golden_bytes_load_001' (10360) panicked at crates/tracewake-content/src/validate.rs:3087:81:

failures:
    load::tests::shuffled_input_paths_load_to_same_canonical_world
    validate::tests::fixture_missing_actor_need_seed_rejected_001
    validate::tests::fixture_schema_v1_golden_bytes_load_001
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 30 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
