*** crates/tracewake-content/src/validate.rs:1058:27: replace && with || in validate_state

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace && with || in validate_state
@@ -1050,17 +1050,17 @@
                         actor.actor_id.as_str(),
                         kind.stable_id()
                     ),
                 ));
             }
         }
     }
     for (index, door) in fixture.doors.iter().enumerate() {
-        if door.is_locked && door.is_open {
+        if door.is_locked || /* ~ changed by cargo-mutants ~ */ door.is_open {
             errors.push(ContentValidationError::new(
                 ValidationPhase::State,
                 format!("doors[{index}]"),
                 "locked_open_state",
                 "locked doors must not start open in Phase 1 fixtures",
             ));
         }
     }

---- fixture_fingerprint_reprices_secondary_file_bytes stdout ----

thread 'fixture_fingerprint_reprices_secondary_file_bytes' (12454) panicked at crates/tracewake-content/tests/fixtures_load.rs:629:6:
called `Result::unwrap()` on an `Err` value: Validation(ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: State, path: "doors[0]", code: "locked_open_state", message: "locked doors must not start open in Phase 1 fixtures" }] } })

---- fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture stdout ----

thread 'fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture' (12453) panicked at crates/tracewake-content/tests/fixtures_load.rs:661:6:
called `Result::unwrap()` on an `Err` value: Validation(ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: State, path: "doors[0]", code: "locked_open_state", message: "locked doors must not start open in Phase 1 fixtures" }] } })

---- valid_epistemic_seed_validates_and_round_trips_canonically stdout ----

thread 'valid_epistemic_seed_validates_and_round_trips_canonically' (12483) panicked at crates/tracewake-content/tests/fixtures_load.rs:1708:52:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: State, path: "doors[0]", code: "locked_open_state", message: "locked doors must not start open in Phase 1 fixtures" }] } }

failures:
    all_fixtures_load_deterministically_and_validate
    fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture
    fixture_fingerprint_reprices_secondary_file_bytes
    phase2a_fixtures_are_registered_and_script_free
    valid_epistemic_seed_validates_and_round_trips_canonically

test result: FAILED. 29 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
