*** crates/tracewake-content/src/validate.rs:1068:32: replace && with || in validate_state

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace && with || in validate_state
@@ -1060,17 +1060,17 @@
                 ValidationPhase::State,
                 format!("doors[{index}]"),
                 "locked_open_state",
                 "locked doors must not start open in Phase 1 fixtures",
             ));
         }
     }
     for (index, container) in fixture.containers.iter().enumerate() {
-        if container.is_locked && container.is_open {
+        if container.is_locked || /* ~ changed by cargo-mutants ~ */ container.is_open {
             errors.push(ContentValidationError::new(
                 ValidationPhase::State,
                 format!("containers[{index}]"),
                 "locked_open_state",
                 "locked containers must not start open in Phase 1 fixtures",
             ));
         }
     }

---- fixture_scope_raw_lines_drive_loader_registry_and_fail_closed stdout ----

thread 'fixture_scope_raw_lines_drive_loader_registry_and_fail_closed' (14561) panicked at crates/tracewake-content/tests/fixtures_load.rs:816:6:

---- all_fixtures_load_deterministically_and_validate stdout ----

thread 'all_fixtures_load_deterministically_and_validate' (14557) panicked at crates/tracewake-content/tests/fixtures_load.rs:591:54:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: State, path: "containers[0]", code: "locked_open_state", message: "locked containers must not start open in Phase 1 fixtures" }] } }

---- phase2a_fixtures_are_registered_and_script_free stdout ----

thread 'phase2a_fixtures_are_registered_and_script_free' (14581) panicked at crates/tracewake-content/tests/fixtures_load.rs:1546:56:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: State, path: "containers[0]", code: "locked_open_state", message: "locked containers must not start open in Phase 1 fixtures" }] } }

failures:
    all_fixtures_load_deterministically_and_validate
    fixture_scope_raw_lines_drive_loader_registry_and_fail_closed
    phase2a_fixtures_are_registered_and_script_free

test result: FAILED. 31 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
