*** crates/tracewake-content/src/validate.rs:1301:22: replace < with == in validate_numeric_i32

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace < with == in validate_numeric_i32
@@ -1293,17 +1293,17 @@
     value: i32,
     path: impl Into<String>,
     policy: NumericFieldPolicy,
     errors: &mut Vec<ContentValidationError>,
 ) {
     let path = path.into();
     match policy {
         NumericFieldPolicy::PressureNonnegative => {
-            if value < 0 {
+            if value == /* ~ changed by cargo-mutants ~ */ 0 {
                 errors.push(ContentValidationError::new(
                     ValidationPhase::State,
                     path,
                     "invalid_tuning_direction",
                     "need and routine tuning values must be nonnegative in their modeled direction",
                 ));
             } else if value > i32::from(NEED_MAX) {
                 errors.push(ContentValidationError::new(

---- validate::tests::negative_need_tuning_direction_is_rejected stdout ----

thread 'validate::tests::negative_need_tuning_direction_is_rejected' (18720) panicked at crates/tracewake-content/src/validate.rs:3129:62:

failures:
    validate::tests::negative_need_tuning_direction_is_rejected

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
