*** crates/tracewake-content/src/validate.rs:1301:22: replace < with > in validate_numeric_i32

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace < with > in validate_numeric_i32
@@ -1293,17 +1293,17 @@
     value: i32,
     path: impl Into<String>,
     policy: NumericFieldPolicy,
     errors: &mut Vec<ContentValidationError>,
 ) {
     let path = path.into();
     match policy {
         NumericFieldPolicy::PressureNonnegative => {
-            if value < 0 {
+            if value > /* ~ changed by cargo-mutants ~ */ 0 {
                 errors.push(ContentValidationError::new(
                     ValidationPhase::State,
                     path,
                     "invalid_tuning_direction",
                     "need and routine tuning values must be nonnegative in their modeled direction",
                 ));
             } else if value > i32::from(NEED_MAX) {
                 errors.push(ContentValidationError::new(

---- load::tests::shuffled_input_paths_load_to_same_canonical_world stdout ----

thread 'load::tests::shuffled_input_paths_load_to_same_canonical_world' (20769) panicked at crates/tracewake-content/src/load.rs:509:10:

---- validate::tests::excessive_need_tuning_magnitude_is_rejected_against_need_max stdout ----

thread 'validate::tests::excessive_need_tuning_magnitude_is_rejected_against_need_max' (20779) panicked at crates/tracewake-content/src/validate.rs:3144:9:
assertion failed: errors.report.errors.iter().any(|error|
        {
            error.code == "invalid_tuning_magnitude" &&
                error.path == "need_model.awake_hunger_delta_per_tick"
        })

---- validate::tests::fixture_schema_v1_golden_bytes_load_001 stdout ----

thread 'validate::tests::fixture_schema_v1_golden_bytes_load_001' (20785) panicked at crates/tracewake-content/src/validate.rs:3087:81:

failures:
    load::tests::shuffled_input_paths_load_to_same_canonical_world
    validate::tests::excessive_need_tuning_magnitude_is_rejected_against_need_max
    validate::tests::fixture_schema_v1_golden_bytes_load_001
    validate::tests::negative_need_tuning_direction_is_rejected
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 29 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
