*** crates/tracewake-content/src/validate.rs:1301:22: replace < with <= in validate_numeric_i32

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace < with <= in validate_numeric_i32
@@ -1293,17 +1293,17 @@
     value: i32,
     path: impl Into<String>,
     policy: NumericFieldPolicy,
     errors: &mut Vec<ContentValidationError>,
 ) {
     let path = path.into();
     match policy {
         NumericFieldPolicy::PressureNonnegative => {
-            if value < 0 {
+            if value <= /* ~ changed by cargo-mutants ~ */ 0 {
                 errors.push(ContentValidationError::new(
                     ValidationPhase::State,
                     path,
                     "invalid_tuning_direction",
                     "need and routine tuning values must be nonnegative in their modeled direction",
                 ));
             } else if value > i32::from(NEED_MAX) {
                 errors.push(ContentValidationError::new(

---- validator_branch_matrix_locks_fail_closed_validate_rs_guards stdout ----

thread 'validator_branch_matrix_locks_fail_closed_validate_rs_guards' (22933) panicked at crates/tracewake-content/tests/forbidden_content.rs:296:9:
validate.rs branch lock missing fragment: ifvalue<0{

failures:
    validator_branch_matrix_locks_fail_closed_validate_rs_guards

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
