*** crates/tracewake-content/src/validate.rs:1308:29: replace > with == in validate_numeric_i32

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace > with == in validate_numeric_i32
@@ -1300,17 +1300,17 @@
         NumericFieldPolicy::PressureNonnegative => {
             if value < 0 {
                 errors.push(ContentValidationError::new(
                     ValidationPhase::State,
                     path,
                     "invalid_tuning_direction",
                     "need and routine tuning values must be nonnegative in their modeled direction",
                 ));
-            } else if value > i32::from(NEED_MAX) {
+            } else if value == /* ~ changed by cargo-mutants ~ */ i32::from(NEED_MAX) {
                 errors.push(ContentValidationError::new(
                     ValidationPhase::State,
                     path,
                     "invalid_tuning_magnitude",
                     format!(
                         "need and routine tuning values must not exceed {NEED_MAX} per tick or serving"
                     ),
                 ));

---- validate::tests::excessive_need_tuning_magnitude_is_rejected_against_need_max stdout ----

thread 'validate::tests::excessive_need_tuning_magnitude_is_rejected_against_need_max' (24981) panicked at crates/tracewake-content/src/validate.rs:3142:62:

failures:
    validate::tests::excessive_need_tuning_magnitude_is_rejected_against_need_max

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
