*** crates/tracewake-content/src/validate.rs:1308:29: replace > with < in validate_numeric_i32

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace > with < in validate_numeric_i32
@@ -1300,17 +1300,17 @@
         NumericFieldPolicy::PressureNonnegative => {
             if value < 0 {
                 errors.push(ContentValidationError::new(
                     ValidationPhase::State,
                     path,
                     "invalid_tuning_direction",
                     "need and routine tuning values must be nonnegative in their modeled direction",
                 ));
-            } else if value > i32::from(NEED_MAX) {
+            } else if value < /* ~ changed by cargo-mutants ~ */ i32::from(NEED_MAX) {
                 errors.push(ContentValidationError::new(
                     ValidationPhase::State,
                     path,
                     "invalid_tuning_magnitude",
                     format!(
                         "need and routine tuning values must not exceed {NEED_MAX} per tick or serving"
                     ),
                 ));

---- load::tests::shuffled_input_paths_load_to_same_canonical_world stdout ----

thread 'load::tests::shuffled_input_paths_load_to_same_canonical_world' (27042) panicked at crates/tracewake-content/src/load.rs:509:10:

---- validate::tests::excessive_need_tuning_magnitude_is_rejected_against_need_max stdout ----

thread 'validate::tests::excessive_need_tuning_magnitude_is_rejected_against_need_max' (27052) panicked at crates/tracewake-content/src/validate.rs:3144:9:
assertion failed: errors.report.errors.iter().any(|error|
        {
            error.code == "invalid_tuning_magnitude" &&
                error.path == "need_model.awake_hunger_delta_per_tick"
        })

---- validate::tests::fixture_schema_v1_golden_bytes_load_001 stdout ----

thread 'validate::tests::fixture_schema_v1_golden_bytes_load_001' (27058) panicked at crates/tracewake-content/src/validate.rs:3087:81:

failures:
    load::tests::shuffled_input_paths_load_to_same_canonical_world
    validate::tests::excessive_need_tuning_magnitude_is_rejected_against_need_max
    validate::tests::fixture_schema_v1_golden_bytes_load_001
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 30 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
