*** crates/tracewake-content/src/validate.rs:1339:16: delete ! in validate_numeric_i32

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ delete ! in validate_numeric_i32
@@ -1331,17 +1331,17 @@
                     "invalid_tuning_magnitude",
                     format!(
                         "need and routine tuning values must not exceed {NEED_MAX} per tick or serving"
                     ),
                 ));
             }
         }
         NumericFieldPolicy::NeedBandI32 => {
-            if !(0..=i32::from(NEED_MAX)).contains(&value) {
+            if  /* ~ changed by cargo-mutants ~ */(0..=i32::from(NEED_MAX)).contains(&value) {
                 errors.push(ContentValidationError::new(
                     ValidationPhase::State,
                     path,
                     "invalid_need_band",
                     format!("need-band values must be between 0 and {NEED_MAX}"),
                 ));
             }
         }

---- validate::tests::fixture_relief_zero_and_need_gate_out_of_band_are_rejected_001 stdout ----

thread 'validate::tests::fixture_relief_zero_and_need_gate_out_of_band_are_rejected_001' (7196) panicked at crates/tracewake-content/src/validate.rs:3255:13:

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (7208) panicked at crates/tracewake-content/src/validate.rs:3685:49:

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (7209) panicked at crates/tracewake-content/src/validate.rs:3650:59:

failures:
    validate::tests::fixture_relief_zero_and_need_gate_out_of_band_are_rejected_001
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted

test result: FAILED. 33 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
