*** crates/tracewake-content/src/validate.rs:1361:14: replace == with != in validate_duration_u64

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace == with != in validate_duration_u64
@@ -1353,17 +1353,17 @@
     }
 }
 
 fn validate_duration_u64(
     value: u64,
     path: impl Into<String>,
     errors: &mut Vec<ContentValidationError>,
 ) {
-    if value == 0 {
+    if value != /* ~ changed by cargo-mutants ~ */ 0 {
         errors.push(ContentValidationError::new(
             ValidationPhase::State,
             path,
             "invalid_duration",
             "duration values must be greater than zero",
         ));
     }
 }

---- validate::tests::fixture_workplace_zero_duration_rejected_001 stdout ----

thread 'validate::tests::fixture_workplace_zero_duration_rejected_001' (11342) panicked at crates/tracewake-content/src/validate.rs:3157:9:
assertion failed: errors.report.errors.iter().any(|error|
        {
            error.code == "invalid_duration" &&
                error.path == "workplaces[0].work_duration_ticks"
        })

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (11350) panicked at crates/tracewake-content/src/validate.rs:3685:49:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: State, path: "workplaces[0].work_duration_ticks", code: "invalid_duration", message: "duration values must be greater than zero" }] } }

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (11351) panicked at crates/tracewake-content/src/validate.rs:3650:59:

failures:
    validate::tests::fixture_workplace_zero_duration_rejected_001
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted

test result: FAILED. 33 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
