*** crates/tracewake-content/src/validate.rs:1361:5: replace validate_duration_u64 with ()

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace validate_duration_u64 with ()
@@ -1353,24 +1353,17 @@
     }
 }
 
 fn validate_duration_u64(
     value: u64,
     path: impl Into<String>,
     errors: &mut Vec<ContentValidationError>,
 ) {
-    if value == 0 {
-        errors.push(ContentValidationError::new(
-            ValidationPhase::State,
-            path,
-            "invalid_duration",
-            "duration values must be greater than zero",
-        ));
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn validate_need_band_u16(
     value: u16,
     path: impl Into<String>,
     errors: &mut Vec<ContentValidationError>,
 ) {
     if value > NEED_MAX {

---- validate::tests::fixture_workplace_zero_duration_rejected_001 stdout ----

thread 'validate::tests::fixture_workplace_zero_duration_rejected_001' (9271) panicked at crates/tracewake-content/src/validate.rs:3148:62:

failures:
    validate::tests::fixture_workplace_zero_duration_rejected_001

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
