*** crates/tracewake-content/src/validate.rs:1376:14: replace > with < in validate_need_band_u16

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace > with < in validate_need_band_u16
@@ -1368,17 +1368,17 @@
     }
 }
 
 fn validate_need_band_u16(
     value: u16,
     path: impl Into<String>,
     errors: &mut Vec<ContentValidationError>,
 ) {
-    if value > NEED_MAX {
+    if value < /* ~ changed by cargo-mutants ~ */ NEED_MAX {
         errors.push(ContentValidationError::new(
             ValidationPhase::State,
             path,
             "invalid_need_band",
             format!("need-band values must be between 0 and {NEED_MAX}"),
         ));
     }
 }

---- load::tests::shuffled_input_paths_load_to_same_canonical_world stdout ----

thread 'load::tests::shuffled_input_paths_load_to_same_canonical_world' (17536) panicked at crates/tracewake-content/src/load.rs:509:10:

---- validate::tests::fixture_schema_v1_golden_bytes_load_001 stdout ----

thread 'validate::tests::fixture_schema_v1_golden_bytes_load_001' (17552) panicked at crates/tracewake-content/src/validate.rs:3087:81:

---- validate::tests::fixture_initial_need_out_of_band_rejected_001 stdout ----

thread 'validate::tests::fixture_initial_need_out_of_band_rejected_001' (17548) panicked at crates/tracewake-content/src/validate.rs:3169:9:
assertion failed: errors.report.errors.iter().any(|error|
        {
            error.code == "invalid_need_band" &&
                error.path == "initial_needs[0].value"
        })

failures:
    load::tests::shuffled_input_paths_load_to_same_canonical_world
    validate::tests::fixture_initial_need_out_of_band_rejected_001
    validate::tests::fixture_schema_v1_golden_bytes_load_001
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 30 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
