*** crates/tracewake-content/src/validate.rs:1376:14: replace > with >= in validate_need_band_u16

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace > with >= in validate_need_band_u16
@@ -1368,17 +1368,17 @@
     }
 }
 
 fn validate_need_band_u16(
     value: u16,
     path: impl Into<String>,
     errors: &mut Vec<ContentValidationError>,
 ) {
-    if value > NEED_MAX {
+    if value >= /* ~ changed by cargo-mutants ~ */ NEED_MAX {
         errors.push(ContentValidationError::new(
             ValidationPhase::State,
             path,
             "invalid_need_band",
             format!("need-band values must be between 0 and {NEED_MAX}"),
         ));
     }
 }

---- validator_branch_matrix_locks_fail_closed_validate_rs_guards stdout ----

thread 'validator_branch_matrix_locks_fail_closed_validate_rs_guards' (19700) panicked at crates/tracewake-content/tests/forbidden_content.rs:296:9:
validate.rs branch lock missing fragment: ifvalue>NEED_MAX{

failures:
    validator_branch_matrix_locks_fail_closed_validate_rs_guards

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
