*** crates/tracewake-content/src/validate.rs:1376:5: replace validate_need_band_u16 with ()

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace validate_need_band_u16 with ()
@@ -1368,24 +1368,17 @@
     }
 }
 
 fn validate_need_band_u16(
     value: u16,
     path: impl Into<String>,
     errors: &mut Vec<ContentValidationError>,
 ) {
-    if value > NEED_MAX {
-        errors.push(ContentValidationError::new(
-            ValidationPhase::State,
-            path,
-            "invalid_need_band",
-            format!("need-band values must be between 0 and {NEED_MAX}"),
-        ));
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn validate_action_registry_parity(
     fixture: &FixtureSchema,
     registry: &ActionRegistry,
     errors: &mut Vec<ContentValidationError>,
 ) {
     for (index, affordance) in fixture.affordances.iter().enumerate() {

---- validate::tests::fixture_initial_need_out_of_band_rejected_001 stdout ----

thread 'validate::tests::fixture_initial_need_out_of_band_rejected_001' (13406) panicked at crates/tracewake-content/src/validate.rs:3160:62:

failures:
    validate::tests::fixture_initial_need_out_of_band_rejected_001

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
