*** crates/tracewake-content/src/validate.rs:1391:5: replace validate_action_registry_parity with ()

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace validate_action_registry_parity with ()
@@ -1383,63 +1383,17 @@
     }
 }
 
 fn validate_action_registry_parity(
     fixture: &FixtureSchema,
     registry: &ActionRegistry,
     errors: &mut Vec<ContentValidationError>,
 ) {
-    for (index, affordance) in fixture.affordances.iter().enumerate() {
-        let Some(definition) = registry.get(&affordance.action_id) else {
-            let (code, message) = if let Some(scope) = known_action_scope(&affordance.action_id) {
-                (
-                    "phase_unsupported_action",
-                    format!(
-                        "action {} belongs to {:?} and is outside this fixture scope",
-                        affordance.action_id.as_str(),
-                        scope
-                    ),
-                )
-            } else {
-                (
-                    "unknown_action",
-                    format!("action {} is not registered", affordance.action_id.as_str()),
-                )
-            };
-            errors.push(ContentValidationError::new(
-                ValidationPhase::ActionRegistryParity,
-                format!("affordances[{index}].action_id"),
-                code,
-                message,
-            ));
-            continue;
-        };
-        if target_kind(fixture, affordance.target_id.as_str()).is_none() {
-            errors.push(ContentValidationError::new(
-                ValidationPhase::Referential,
-                format!("affordances[{index}].target_id"),
-                "bad_reference",
-                format!("affordance target {} does not exist", affordance.target_id),
-            ));
-            continue;
-        }
-        if !supports_target_kind(definition.effect.clone(), fixture, affordance) {
-            errors.push(ContentValidationError::new(
-                ValidationPhase::ActionRegistryParity,
-                format!("affordances[{index}].target_id"),
-                "unsupported_action_target",
-                format!(
-                    "action {} does not support target {}",
-                    affordance.action_id.as_str(),
-                    affordance.target_id
-                ),
-            ));
-        }
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn validate_routine_rules(
     fixture: &FixtureSchema,
     registry: &ActionRegistry,
     errors: &mut Vec<ContentValidationError>,
 ) {
     for (template_index, template) in fixture.routine_templates.iter().enumerate() {

---- validate::tests::action_affordances_must_resolve_to_known_action_and_supported_target stdout ----

thread 'validate::tests::action_affordances_must_resolve_to_known_action_and_supported_target' (21744) panicked at crates/tracewake-content/src/validate.rs:3595:62:

---- validate::tests::missing_duplicate_bad_reference_wrong_target_and_double_location_are_rejected stdout ----

thread 'validate::tests::missing_duplicate_bad_reference_wrong_target_and_double_location_are_rejected' (21759) panicked at crates/tracewake-content/src/validate.rs:3538:9:
assertion failed: codes.contains("unsupported_action_target")

failures:
    validate::tests::action_affordances_must_resolve_to_known_action_and_supported_target
    validate::tests::missing_duplicate_bad_reference_wrong_target_and_double_location_are_rejected

test result: FAILED. 34 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
