*** crates/tracewake-content/src/validate.rs:1425:12: delete ! in validate_action_registry_parity

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ delete ! in validate_action_registry_parity
@@ -1417,17 +1417,17 @@
             errors.push(ContentValidationError::new(
                 ValidationPhase::Referential,
                 format!("affordances[{index}].target_id"),
                 "bad_reference",
                 format!("affordance target {} does not exist", affordance.target_id),
             ));
             continue;
         }
-        if !supports_target_kind(definition.effect.clone(), fixture, affordance) {
+        if  /* ~ changed by cargo-mutants ~ */supports_target_kind(definition.effect.clone(), fixture, affordance) {
             errors.push(ContentValidationError::new(
                 ValidationPhase::ActionRegistryParity,
                 format!("affordances[{index}].target_id"),
                 "unsupported_action_target",
                 format!(
                     "action {} does not support target {}",
                     affordance.action_id.as_str(),
                     affordance.target_id

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (23836) panicked at crates/tracewake-content/src/validate.rs:3685:49:

---- validate::tests::valid_fixture_produces_initial_world stdout ----

thread 'validate::tests::valid_fixture_produces_initial_world' (23842) panicked at crates/tracewake-content/src/validate.rs:3076:63:

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (23837) panicked at crates/tracewake-content/src/validate.rs:3650:59:

failures:
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 33 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
