*** crates/tracewake-content/src/validate.rs:1452:47: replace && with || in validate_routine_rules

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace && with || in validate_routine_rules
@@ -1444,17 +1444,17 @@
 ) {
     for (template_index, template) in fixture.routine_templates.iter().enumerate() {
         let has_explicit_diagnostic = template.steps.iter().any(|step| {
             matches!(
                 step.proposed(),
                 RoutineStepProposal::Diagnostic(diagnostic) if !diagnostic.stable_id().is_empty()
             )
         });
-        if template.fallback_rules.is_empty() && !has_explicit_diagnostic {
+        if template.fallback_rules.is_empty() || /* ~ changed by cargo-mutants ~ */ !has_explicit_diagnostic {
             errors.push(ContentValidationError::new(
                 ValidationPhase::State,
                 format!("routine_templates[{template_index}].fallback_rules"),
                 "missing_fallback_or_diagnostic",
                 "routine templates must declare fallback rules or an explicit diagnostic failure",
             ));
         }

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (27979) panicked at crates/tracewake-content/src/validate.rs:3650:59:

failures:
    validate::tests::phase3a_valid_routine_content_is_accepted

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
