*** crates/tracewake-content/src/validate.rs:1452:50: delete ! in validate_routine_rules

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ delete ! in validate_routine_rules
@@ -1444,17 +1444,17 @@
 ) {
     for (template_index, template) in fixture.routine_templates.iter().enumerate() {
         let has_explicit_diagnostic = template.steps.iter().any(|step| {
             matches!(
                 step.proposed(),
                 RoutineStepProposal::Diagnostic(diagnostic) if !diagnostic.stable_id().is_empty()
             )
         });
-        if template.fallback_rules.is_empty() && !has_explicit_diagnostic {
+        if template.fallback_rules.is_empty() &&  /* ~ changed by cargo-mutants ~ */has_explicit_diagnostic {
             errors.push(ContentValidationError::new(
                 ValidationPhase::State,
                 format!("routine_templates[{template_index}].fallback_rules"),
                 "missing_fallback_or_diagnostic",
                 "routine templates must declare fallback rules or an explicit diagnostic failure",
             ));
         }

---- validator_branch_matrix_locks_fail_closed_validate_rs_guards stdout ----

thread 'validator_branch_matrix_locks_fail_closed_validate_rs_guards' (30115) panicked at crates/tracewake-content/tests/forbidden_content.rs:296:9:
validate.rs branch lock missing fragment: iftemplate.fallback_rules.is_empty()&&!has_explicit_diagnostic{

failures:
    validator_branch_matrix_locks_fail_closed_validate_rs_guards

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
