*** crates/tracewake-content/src/validate.rs:1520:16: delete ! in validate_routine_rules

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ delete ! in validate_routine_rules
@@ -1512,17 +1512,17 @@
                     format!("routine_templates[{template_index}].steps[{step_index}]"),
                     code,
                     message,
                 ));
             }
         }
 
         for (mode_index, failure_mode) in template.failure_modes.iter().enumerate() {
-            if !is_known_routine_failure_mode(failure_mode) {
+            if  /* ~ changed by cargo-mutants ~ */is_known_routine_failure_mode(failure_mode) {
                 errors.push(ContentValidationError::new(
                     ValidationPhase::State,
                     format!("routine_templates[{template_index}].failure_modes[{mode_index}]"),
                     "unknown_failure_mode",
                     format!("unknown routine failure mode {failure_mode}"),
                 ));
             }
         }

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (32181) panicked at crates/tracewake-content/src/validate.rs:3650:59:

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (32180) panicked at crates/tracewake-content/src/validate.rs:3685:49:

failures:
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted

test result: FAILED. 34 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
