*** crates/tracewake-content/src/validate.rs:1530:16: delete ! in validate_routine_rules

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ delete ! in validate_routine_rules
@@ -1522,17 +1522,17 @@
                     ValidationPhase::State,
                     format!("routine_templates[{template_index}].failure_modes[{mode_index}]"),
                     "unknown_failure_mode",
                     format!("unknown routine failure mode {failure_mode}"),
                 ));
             }
         }
         for (rule_index, fallback_rule) in template.fallback_rules.iter().enumerate() {
-            if !is_known_routine_fallback_rule(fallback_rule) {
+            if  /* ~ changed by cargo-mutants ~ */is_known_routine_fallback_rule(fallback_rule) {
                 errors.push(ContentValidationError::new(
                     ValidationPhase::State,
                     format!("routine_templates[{template_index}].fallback_rules[{rule_index}]"),
                     "unknown_fallback_rule",
                     format!("unknown routine fallback rule {fallback_rule}"),
                 ));
             }
         }

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (1783) panicked at crates/tracewake-content/src/validate.rs:3685:49:

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (1784) panicked at crates/tracewake-content/src/validate.rs:3650:59:

failures:
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted

test result: FAILED. 34 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
