*** crates/tracewake-content/src/validate.rs:1546:30: replace != with == in validate_phase3a_sleep_surface_contract

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace != with == in validate_phase3a_sleep_surface_contract
@@ -1538,17 +1538,17 @@
         }
     }
 }
 
 fn validate_phase3a_sleep_surface_contract(
     fixture: &FixtureSchema,
     errors: &mut Vec<ContentValidationError>,
 ) {
-    if fixture.fixture_scope != FixtureScope::Phase3AHistorical {
+    if fixture.fixture_scope == /* ~ changed by cargo-mutants ~ */ FixtureScope::Phase3AHistorical {
         return;
     }
     if !has_sleep_routine_template(fixture) || !fixture.sleep_places.is_empty() {
         return;
     }
     if has_explicit_no_sleep_diagnostic(fixture) {
         return;
     }

---- validate::tests::phase3a_sleep_routine_requires_authored_sleep_surface_or_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_routine_requires_authored_sleep_surface_or_diagnostic' (5925) panicked at crates/tracewake-content/src/validate.rs:3662:62:

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (5926) panicked at crates/tracewake-content/src/validate.rs:3690:62:

failures:
    validate::tests::phase3a_sleep_routine_requires_authored_sleep_surface_or_diagnostic
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic

test result: FAILED. 34 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
