*** crates/tracewake-content/src/validate.rs:1546:5: replace validate_phase3a_sleep_surface_contract with ()

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace validate_phase3a_sleep_surface_contract with ()
@@ -1538,31 +1538,17 @@
         }
     }
 }
 
 fn validate_phase3a_sleep_surface_contract(
     fixture: &FixtureSchema,
     errors: &mut Vec<ContentValidationError>,
 ) {
-    if fixture.fixture_scope != FixtureScope::Phase3AHistorical {
-        return;
-    }
-    if !has_sleep_routine_template(fixture) || !fixture.sleep_places.is_empty() {
-        return;
-    }
-    if has_explicit_no_sleep_diagnostic(fixture) {
-        return;
-    }
-    errors.push(ContentValidationError::new(
-        ValidationPhase::State,
-        "sleep_places",
-        "missing_sleep_surface",
-        "Phase 3A sleep-routine fixtures must author a sleep surface or an explicit no-sleep diagnostic",
-    ));
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn has_sleep_routine_template(fixture: &FixtureSchema) -> bool {
     fixture
         .routine_templates
         .iter()
         .any(|template| template.family == RoutineFamily::SleepNight)
 }

---- validate::tests::phase3a_sleep_routine_requires_authored_sleep_surface_or_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_routine_requires_authored_sleep_surface_or_diagnostic' (3853) panicked at crates/tracewake-content/src/validate.rs:3648:62:

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (3854) panicked at crates/tracewake-content/src/validate.rs:3676:62:

failures:
    validate::tests::phase3a_sleep_routine_requires_authored_sleep_surface_or_diagnostic
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic

test result: FAILED. 34 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
