*** crates/tracewake-content/src/validate.rs:1549:45: replace || with && in validate_phase3a_sleep_surface_contract

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace || with && in validate_phase3a_sleep_surface_contract
@@ -1541,17 +1541,17 @@
 
 fn validate_phase3a_sleep_surface_contract(
     fixture: &FixtureSchema,
     errors: &mut Vec<ContentValidationError>,
 ) {
     if fixture.fixture_scope != FixtureScope::Phase3AHistorical {
         return;
     }
-    if !has_sleep_routine_template(fixture) || !fixture.sleep_places.is_empty() {
+    if !has_sleep_routine_template(fixture) && /* ~ changed by cargo-mutants ~ */ !fixture.sleep_places.is_empty() {
         return;
     }
     if has_explicit_no_sleep_diagnostic(fixture) {
         return;
     }
     errors.push(ContentValidationError::new(
         ValidationPhase::State,
         "sleep_places",

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (8034) panicked at crates/tracewake-content/tests/fixtures_load.rs:1172:6:

---- stale_workplace_notice_superseded_by_newer_001 stdout ----

thread 'stale_workplace_notice_superseded_by_newer_001' (8036) panicked at crates/tracewake-content/tests/fixtures_load.rs:1096:6:

---- phase3a_load_emits_authored_prehistory_seed_events stdout ----

thread 'phase3a_load_emits_authored_prehistory_seed_events' (8031) panicked at crates/tracewake-content/tests/fixtures_load.rs:761:6:

failures:
    all_fixtures_load_deterministically_and_validate
    phase3a_load_emits_authored_prehistory_seed_events
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food
    stale_workplace_notice_superseded_by_newer_001

test result: FAILED. 30 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
