*** crates/tracewake-content/src/validate.rs:1564:5: replace has_sleep_routine_template -> bool with true

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace has_sleep_routine_template -> bool with true
@@ -1556,20 +1556,17 @@
         ValidationPhase::State,
         "sleep_places",
         "missing_sleep_surface",
         "Phase 3A sleep-routine fixtures must author a sleep surface or an explicit no-sleep diagnostic",
     ));
 }
 
 fn has_sleep_routine_template(fixture: &FixtureSchema) -> bool {
-    fixture
-        .routine_templates
-        .iter()
-        .any(|template| template.family == RoutineFamily::SleepNight)
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn has_explicit_no_sleep_diagnostic(fixture: &FixtureSchema) -> bool {
     fixture.routine_templates.iter().any(|template| {
         template.steps.iter().any(|step| {
             matches!(
                 step.proposed(),
                 RoutineStepProposal::Diagnostic(diagnostic) if is_no_sleep_diagnostic(*diagnostic)

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (14282) panicked at crates/tracewake-content/tests/fixtures_load.rs:1172:6:

---- stale_workplace_notice_superseded_by_newer_001 stdout ----

thread 'stale_workplace_notice_superseded_by_newer_001' (14284) panicked at crates/tracewake-content/tests/fixtures_load.rs:1096:6:

---- all_fixtures_load_deterministically_and_validate stdout ----

thread 'all_fixtures_load_deterministically_and_validate' (14254) panicked at crates/tracewake-content/tests/fixtures_load.rs:591:54:

failures:
    all_fixtures_load_deterministically_and_validate
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food
    stale_workplace_notice_superseded_by_newer_001

test result: FAILED. 31 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
