*** crates/tracewake-content/src/validate.rs:1564:5: replace has_sleep_routine_template -> bool with false

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace has_sleep_routine_template -> bool with false
@@ -1556,20 +1556,17 @@
         ValidationPhase::State,
         "sleep_places",
         "missing_sleep_surface",
         "Phase 3A sleep-routine fixtures must author a sleep surface or an explicit no-sleep diagnostic",
     ));
 }
 
 fn has_sleep_routine_template(fixture: &FixtureSchema) -> bool {
-    fixture
-        .routine_templates
-        .iter()
-        .any(|template| template.family == RoutineFamily::SleepNight)
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn has_explicit_no_sleep_diagnostic(fixture: &FixtureSchema) -> bool {
     fixture.routine_templates.iter().any(|template| {
         template.steps.iter().any(|step| {
             matches!(
                 step.proposed(),
                 RoutineStepProposal::Diagnostic(diagnostic) if is_no_sleep_diagnostic(*diagnostic)

---- validate::tests::phase3a_sleep_routine_requires_authored_sleep_surface_or_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_routine_requires_authored_sleep_surface_or_diagnostic' (16350) panicked at crates/tracewake-content/src/validate.rs:3659:62:

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (16351) panicked at crates/tracewake-content/src/validate.rs:3687:62:

failures:
    validate::tests::phase3a_sleep_routine_requires_authored_sleep_surface_or_diagnostic
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic

test result: FAILED. 34 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
