*** crates/tracewake-content/src/validate.rs:1567:41: replace == with != in has_sleep_routine_template

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace == with != in has_sleep_routine_template
@@ -1559,17 +1559,17 @@
         "Phase 3A sleep-routine fixtures must author a sleep surface or an explicit no-sleep diagnostic",
     ));
 }
 
 fn has_sleep_routine_template(fixture: &FixtureSchema) -> bool {
     fixture
         .routine_templates
         .iter()
-        .any(|template| template.family == RoutineFamily::SleepNight)
+        .any(|template| template.family != /* ~ changed by cargo-mutants ~ */ RoutineFamily::SleepNight)
 }
 
 fn has_explicit_no_sleep_diagnostic(fixture: &FixtureSchema) -> bool {
     fixture.routine_templates.iter().any(|template| {
         template.steps.iter().any(|step| {
             matches!(
                 step.proposed(),
                 RoutineStepProposal::Diagnostic(diagnostic) if is_no_sleep_diagnostic(*diagnostic)

---- validate::tests::phase3a_sleep_routine_requires_authored_sleep_surface_or_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_routine_requires_authored_sleep_surface_or_diagnostic' (18421) panicked at crates/tracewake-content/src/validate.rs:3662:62:

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (18422) panicked at crates/tracewake-content/src/validate.rs:3690:62:

failures:
    validate::tests::phase3a_sleep_routine_requires_authored_sleep_surface_or_diagnostic
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic

test result: FAILED. 34 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
