*** crates/tracewake-content/src/validate.rs:1571:5: replace has_explicit_no_sleep_diagnostic -> bool with true

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace has_explicit_no_sleep_diagnostic -> bool with true
@@ -1563,24 +1563,17 @@
 fn has_sleep_routine_template(fixture: &FixtureSchema) -> bool {
     fixture
         .routine_templates
         .iter()
         .any(|template| template.family == RoutineFamily::SleepNight)
 }
 
 fn has_explicit_no_sleep_diagnostic(fixture: &FixtureSchema) -> bool {
-    fixture.routine_templates.iter().any(|template| {
-        template.steps.iter().any(|step| {
-            matches!(
-                step.proposed(),
-                RoutineStepProposal::Diagnostic(diagnostic) if is_no_sleep_diagnostic(*diagnostic)
-            )
-        })
-    })
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn is_no_sleep_diagnostic(value: RoutineDiagnosticKind) -> bool {
     matches!(value, RoutineDiagnosticKind::NoSleepAffordance)
 }
 
 fn known_action_scope(action_id: &ActionId) -> Option<ActionScope> {
     match action_id.as_str() {

---- validate::tests::phase3a_sleep_routine_requires_authored_sleep_surface_or_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_routine_requires_authored_sleep_surface_or_diagnostic' (20492) panicked at crates/tracewake-content/src/validate.rs:3655:62:

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (20493) panicked at crates/tracewake-content/src/validate.rs:3683:62:

failures:
    validate::tests::phase3a_sleep_routine_requires_authored_sleep_surface_or_diagnostic
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic

test result: FAILED. 34 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
