*** crates/tracewake-content/src/validate.rs:1582:5: replace is_no_sleep_diagnostic -> bool with true

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace is_no_sleep_diagnostic -> bool with true
@@ -1574,17 +1574,17 @@
                 step.proposed(),
                 RoutineStepProposal::Diagnostic(diagnostic) if is_no_sleep_diagnostic(*diagnostic)
             )
         })
     })
 }
 
 fn is_no_sleep_diagnostic(value: RoutineDiagnosticKind) -> bool {
-    matches!(value, RoutineDiagnosticKind::NoSleepAffordance)
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn known_action_scope(action_id: &ActionId) -> Option<ActionScope> {
     match action_id.as_str() {
         "move" | "open" | "close" | "take" | "place" | "look" | "inspect_place"
         | "inspect_entity" | "wait" => Some(ActionScope::Phase1),
         "check_container" | "truthful_accuse_probe" => Some(ActionScope::Phase2AHistorical),
         "sleep" | "eat" | "work_block" | "continue_routine" => Some(ActionScope::Phase3AHistorical),

---- validator_branch_matrix_locks_fail_closed_validate_rs_guards stdout ----

thread 'validator_branch_matrix_locks_fail_closed_validate_rs_guards' (24701) panicked at crates/tracewake-content/tests/forbidden_content.rs:296:9:
validate.rs branch lock missing fragment: fnis_no_sleep_diagnostic(value:RoutineDiagnosticKind)->bool{matches!(value,RoutineDiagnosticKind::NoSleepAffordance)}

failures:
    validator_branch_matrix_locks_fail_closed_validate_rs_guards

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
