*** crates/tracewake-content/src/validate.rs:1582:5: replace is_no_sleep_diagnostic -> bool with false

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace is_no_sleep_diagnostic -> bool with false
@@ -1574,17 +1574,17 @@
                 step.proposed(),
                 RoutineStepProposal::Diagnostic(diagnostic) if is_no_sleep_diagnostic(*diagnostic)
             )
         })
     })
 }
 
 fn is_no_sleep_diagnostic(value: RoutineDiagnosticKind) -> bool {
-    matches!(value, RoutineDiagnosticKind::NoSleepAffordance)
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn known_action_scope(action_id: &ActionId) -> Option<ActionScope> {
     match action_id.as_str() {
         "move" | "open" | "close" | "take" | "place" | "look" | "inspect_place"
         | "inspect_entity" | "wait" => Some(ActionScope::Phase1),
         "check_container" | "truthful_accuse_probe" => Some(ActionScope::Phase2AHistorical),
         "sleep" | "eat" | "work_block" | "continue_routine" => Some(ActionScope::Phase3AHistorical),

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (26766) panicked at crates/tracewake-content/src/validate.rs:3685:49:

failures:
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
