*** crates/tracewake-content/src/validate.rs:1587:9: delete match arm "move" | "open" | "close" | "take" | "place" | "look" | "inspect_place" | "inspect_entity" | "wait" in known_action_scope

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ delete match arm "move" | "open" | "close" | "take" | "place" | "look" | "inspect_place" | "inspect_entity" | "wait" in known_action_scope
@@ -1579,18 +1579,17 @@
 }
 
 fn is_no_sleep_diagnostic(value: RoutineDiagnosticKind) -> bool {
     matches!(value, RoutineDiagnosticKind::NoSleepAffordance)
 }
 
 fn known_action_scope(action_id: &ActionId) -> Option<ActionScope> {
     match action_id.as_str() {
-        "move" | "open" | "close" | "take" | "place" | "look" | "inspect_place"
-        | "inspect_entity" | "wait" => Some(ActionScope::Phase1),
+         /* ~ changed by cargo-mutants ~ */
         "check_container" | "truthful_accuse_probe" => Some(ActionScope::Phase2AHistorical),
         "sleep" | "eat" | "work_block" | "continue_routine" => Some(ActionScope::Phase3AHistorical),
         _ => None,
     }
 }
 
 fn semantic_action_base(value: &str) -> Option<ActionId> {
     let base = value.split('.').next().unwrap_or(value);

---- validator_branch_matrix_locks_fail_closed_validate_rs_guards stdout ----

thread 'validator_branch_matrix_locks_fail_closed_validate_rs_guards' (31154) panicked at crates/tracewake-content/tests/forbidden_content.rs:296:9:
validate.rs branch lock missing fragment: "move"|"open"|"close"|"take"|"place"|"look"|"inspect_place"|"inspect_entity"|"wait"=>Some(ActionScope::Phase1)

failures:
    validator_branch_matrix_locks_fail_closed_validate_rs_guards

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
