*** crates/tracewake-content/src/validate.rs:1590:9: delete match arm "sleep" | "eat" | "work_block" | "continue_routine" in known_action_scope

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ delete match arm "sleep" | "eat" | "work_block" | "continue_routine" in known_action_scope
@@ -1582,17 +1582,17 @@
     matches!(value, RoutineDiagnosticKind::NoSleepAffordance)
 }
 
 fn known_action_scope(action_id: &ActionId) -> Option<ActionScope> {
     match action_id.as_str() {
         "move" | "open" | "close" | "take" | "place" | "look" | "inspect_place"
         | "inspect_entity" | "wait" => Some(ActionScope::Phase1),
         "check_container" | "truthful_accuse_probe" => Some(ActionScope::Phase2AHistorical),
-        "sleep" | "eat" | "work_block" | "continue_routine" => Some(ActionScope::Phase3AHistorical),
+         /* ~ changed by cargo-mutants ~ */
         _ => None,
     }
 }
 
 fn semantic_action_base(value: &str) -> Option<ActionId> {
     let base = value.split('.').next().unwrap_or(value);
     ActionId::new(base).ok()
 }

---- fixture_scope_raw_lines_drive_loader_registry_and_fail_closed stdout ----

thread 'fixture_scope_raw_lines_drive_loader_registry_and_fail_closed' (2870) panicked at crates/tracewake-content/tests/fixtures_load.rs:877:5:
assertion failed: validation_error_codes(phase2_rejects_phase3_action).contains("phase_unsupported_action")

failures:
    fixture_scope_raw_lines_drive_loader_registry_and_fail_closed

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
