*** crates/tracewake-content/src/validate.rs:1596:5: replace semantic_action_base -> Option<ActionId> with None

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace semantic_action_base -> Option<ActionId> with None
@@ -1588,18 +1588,17 @@
         | "inspect_entity" | "wait" => Some(ActionScope::Phase1),
         "check_container" | "truthful_accuse_probe" => Some(ActionScope::Phase2AHistorical),
         "sleep" | "eat" | "work_block" | "continue_routine" => Some(ActionScope::Phase3AHistorical),
         _ => None,
     }
 }
 
 fn semantic_action_base(value: &str) -> Option<ActionId> {
-    let base = value.split('.').next().unwrap_or(value);
-    ActionId::new(base).ok()
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn contains_direct_state_or_script_marker(value: &str) -> bool {
     value
         .split(|character: char| !character.is_ascii_alphanumeric() && character != '_')
         .any(|token| is_script_key(token) || is_phase3a_shortcut_marker(token))
         || PHASE3A_SHORTCUT_MARKERS
             .iter()

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (4964) panicked at crates/tracewake-content/src/validate.rs:3649:59:

failures:
    validate::tests::phase3a_valid_routine_content_is_accepted

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
