*** crates/tracewake-content/src/validate.rs:1601:5: replace contains_direct_state_or_script_marker -> bool with true

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace contains_direct_state_or_script_marker -> bool with true
@@ -1593,22 +1593,17 @@
 }
 
 fn semantic_action_base(value: &str) -> Option<ActionId> {
     let base = value.split('.').next().unwrap_or(value);
     ActionId::new(base).ok()
 }
 
 fn contains_direct_state_or_script_marker(value: &str) -> bool {
-    value
-        .split(|character: char| !character.is_ascii_alphanumeric() && character != '_')
-        .any(|token| is_script_key(token) || is_phase3a_shortcut_marker(token))
-        || PHASE3A_SHORTCUT_MARKERS
-            .iter()
-            .any(|marker| value.contains(marker))
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn contains_prose_born_fact_marker(value: &str) -> bool {
     let normalized = value.to_ascii_lowercase();
     let has_prose_field = normalized.starts_with("note|")
         || normalized.starts_with("notes|")
         || normalized.starts_with("prose|")
         || normalized.starts_with("description|")

---- validate::tests::phase3a_routine_structure_failures_are_rejected stdout ----

thread 'validate::tests::phase3a_routine_structure_failures_are_rejected' (7177) panicked at crates/tracewake-content/src/validate.rs:3710:9:
assertion failed: codes.contains("unknown_action")

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (7181) panicked at crates/tracewake-content/src/validate.rs:3645:59:

failures:
    validate::tests::phase3a_routine_structure_failures_are_rejected
    validate::tests::phase3a_valid_routine_content_is_accepted

test result: FAILED. 34 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
