*** crates/tracewake-content/src/validate.rs:1601:5: replace contains_direct_state_or_script_marker -> bool with false

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace contains_direct_state_or_script_marker -> bool with false
@@ -1593,22 +1593,17 @@
 }
 
 fn semantic_action_base(value: &str) -> Option<ActionId> {
     let base = value.split('.').next().unwrap_or(value);
     ActionId::new(base).ok()
 }
 
 fn contains_direct_state_or_script_marker(value: &str) -> bool {
-    value
-        .split(|character: char| !character.is_ascii_alphanumeric() && character != '_')
-        .any(|token| is_script_key(token) || is_phase3a_shortcut_marker(token))
-        || PHASE3A_SHORTCUT_MARKERS
-            .iter()
-            .any(|marker| value.contains(marker))
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn contains_prose_born_fact_marker(value: &str) -> bool {
     let normalized = value.to_ascii_lowercase();
     let has_prose_field = normalized.starts_with("note|")
         || normalized.starts_with("notes|")
         || normalized.starts_with("prose|")
         || normalized.starts_with("description|")

---- forbidden_content_hidden_truth_source_cannot_seed_actor_known_planner_input stdout ----

thread 'forbidden_content_hidden_truth_source_cannot_seed_actor_known_planner_input' (9300) panicked at crates/tracewake-content/tests/forbidden_content.rs:482:5:
assertion failed: report.errors.iter().any(|error|
        {
            error.phase == ValidationPhase::NoScript &&
                    error.code == "shortcut_truth_field" &&
                error.path.contains("source_id")
        })

---- forbidden_content_unknown_behavior_looking_routine_field_is_blocking_error stdout ----

thread 'forbidden_content_unknown_behavior_looking_routine_field_is_blocking_error' (9316) panicked at crates/tracewake-content/tests/forbidden_content.rs:372:5:
assertion failed: report.errors.iter().any(|error|
        {
            error.phase == ValidationPhase::NoScript &&
                error.code == "authored_shortcut_effect"
        })

---- validator_branch_matrix_locks_fail_closed_validate_rs_guards stdout ----

thread 'validator_branch_matrix_locks_fail_closed_validate_rs_guards' (9317) panicked at crates/tracewake-content/tests/forbidden_content.rs:296:9:
validate.rs branch lock missing fragment: fncontains_direct_state_or_script_marker(value:&str)->bool{value.split(|character:char|!character.is_ascii_alphanumeric()&&character!='_').any(|token|is_script_key(token)||is_phase3a_shortcut_marker(token))

failures:
    forbidden_content_hidden_truth_source_cannot_seed_actor_known_planner_input
    forbidden_content_unknown_behavior_looking_routine_field_is_blocking_error
    validator_branch_matrix_locks_fail_closed_validate_rs_guards

test result: FAILED. 21 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
