*** crates/tracewake-content/src/validate.rs:1602:69: replace && with || in contains_direct_state_or_script_marker

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace && with || in contains_direct_state_or_script_marker
@@ -1594,17 +1594,17 @@
 
 fn semantic_action_base(value: &str) -> Option<ActionId> {
     let base = value.split('.').next().unwrap_or(value);
     ActionId::new(base).ok()
 }
 
 fn contains_direct_state_or_script_marker(value: &str) -> bool {
     value
-        .split(|character: char| !character.is_ascii_alphanumeric() && character != '_')
+        .split(|character: char| !character.is_ascii_alphanumeric() || /* ~ changed by cargo-mutants ~ */ character != '_')
         .any(|token| is_script_key(token) || is_phase3a_shortcut_marker(token))
         || PHASE3A_SHORTCUT_MARKERS
             .iter()
             .any(|marker| value.contains(marker))
 }
 
 fn contains_prose_born_fact_marker(value: &str) -> bool {
     let normalized = value.to_ascii_lowercase();

---- validator_branch_matrix_locks_fail_closed_validate_rs_guards stdout ----

thread 'validator_branch_matrix_locks_fail_closed_validate_rs_guards' (13579) panicked at crates/tracewake-content/tests/forbidden_content.rs:296:9:
validate.rs branch lock missing fragment: fncontains_direct_state_or_script_marker(value:&str)->bool{value.split(|character:char|!character.is_ascii_alphanumeric()&&character!='_').any(|token|is_script_key(token)||is_phase3a_shortcut_marker(token))

failures:
    validator_branch_matrix_locks_fail_closed_validate_rs_guards

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
