*** crates/tracewake-content/src/validate.rs:1604:9: replace || with && in contains_direct_state_or_script_marker

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace || with && in contains_direct_state_or_script_marker
@@ -1596,17 +1596,17 @@
     let base = value.split('.').next().unwrap_or(value);
     ActionId::new(base).ok()
 }
 
 fn contains_direct_state_or_script_marker(value: &str) -> bool {
     value
         .split(|character: char| !character.is_ascii_alphanumeric() && character != '_')
         .any(|token| is_script_key(token) || is_phase3a_shortcut_marker(token))
-        || PHASE3A_SHORTCUT_MARKERS
+        && /* ~ changed by cargo-mutants ~ */ PHASE3A_SHORTCUT_MARKERS
             .iter()
             .any(|marker| value.contains(marker))
 }
 
 fn contains_prose_born_fact_marker(value: &str) -> bool {
     let normalized = value.to_ascii_lowercase();
     let has_prose_field = normalized.starts_with("note|")
         || normalized.starts_with("notes|")

---- validator_branch_matrix_locks_fail_closed_validate_rs_guards stdout ----

thread 'validator_branch_matrix_locks_fail_closed_validate_rs_guards' (11448) panicked at crates/tracewake-content/tests/forbidden_content.rs:296:9:
validate.rs branch lock missing fragment: .any(|token|is_script_key(token)||is_phase3a_shortcut_marker(token))||PHASE3A_SHORTCUT_MARKERS.iter().any(|marker|value.contains(marker))

failures:
    validator_branch_matrix_locks_fail_closed_validate_rs_guards

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
