*** crates/tracewake-content/src/validate.rs:1610:5: replace contains_prose_born_fact_marker -> bool with false

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace contains_prose_born_fact_marker -> bool with false
@@ -1602,38 +1602,17 @@
         .split(|character: char| !character.is_ascii_alphanumeric() && character != '_')
         .any(|token| is_script_key(token) || is_phase3a_shortcut_marker(token))
         || PHASE3A_SHORTCUT_MARKERS
             .iter()
             .any(|marker| value.contains(marker))
 }
 
 fn contains_prose_born_fact_marker(value: &str) -> bool {
-    let normalized = value.to_ascii_lowercase();
-    let has_prose_field = normalized.starts_with("note|")
-        || normalized.starts_with("notes|")
-        || normalized.starts_with("prose|")
-        || normalized.starts_with("description|")
-        || normalized.starts_with("flavor_text|");
-    let implies_simulation_fact = [
-        "culprit",
-        "true culprit",
-        "hidden truth",
-        "hidden_true",
-        "did it",
-        "stole",
-        "scripted outcome",
-        "outcome",
-        "final event",
-        "must happen",
-        "really happened",
-    ]
-    .iter()
-    .any(|marker| normalized.contains(marker));
-    has_prose_field && implies_simulation_fact
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn is_known_routine_failure_mode(value: &str) -> bool {
     matches!(
         value,
         "access"
             | "actor_not_at_workplace"
             | "food_inaccessible"

---- fixtures_load_raw_line_prose_born_fact_rejected_001 stdout ----

thread 'fixtures_load_raw_line_prose_born_fact_rejected_001' (24192) panicked at crates/tracewake-content/tests/fixtures_load.rs:1346:5:
assertion failed: failure.report.errors.iter().any(|error|
        {
            error.phase == ValidationPhase::NoScript &&
                error.code == "prose_born_fact"
        })

failures:
    fixtures_load_raw_line_prose_born_fact_rejected_001

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
