*** crates/tracewake-content/src/validate.rs:1613:9: replace || with && in contains_prose_born_fact_marker

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace || with && in contains_prose_born_fact_marker
@@ -1605,17 +1605,17 @@
             .iter()
             .any(|marker| value.contains(marker))
 }
 
 fn contains_prose_born_fact_marker(value: &str) -> bool {
     let normalized = value.to_ascii_lowercase();
     let has_prose_field = normalized.starts_with("note|")
         || normalized.starts_with("notes|")
-        || normalized.starts_with("prose|")
+        && /* ~ changed by cargo-mutants ~ */ normalized.starts_with("prose|")
         || normalized.starts_with("description|")
         || normalized.starts_with("flavor_text|");
     let implies_simulation_fact = [
         "culprit",
         "true culprit",
         "hidden truth",
         "hidden_true",
         "did it",

---- fixtures_load_raw_line_prose_born_fact_rejected_001 stdout ----

thread 'fixtures_load_raw_line_prose_born_fact_rejected_001' (30560) panicked at crates/tracewake-content/tests/fixtures_load.rs:1346:5:
assertion failed: failure.report.errors.iter().any(|error|
        {
            error.phase == ValidationPhase::NoScript &&
                error.code == "prose_born_fact"
        })

failures:
    fixtures_load_raw_line_prose_born_fact_rejected_001

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
