*** crates/tracewake-content/src/validate.rs:1614:9: replace || with && in contains_prose_born_fact_marker

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace || with && in contains_prose_born_fact_marker
@@ -1606,17 +1606,17 @@
             .any(|marker| value.contains(marker))
 }
 
 fn contains_prose_born_fact_marker(value: &str) -> bool {
     let normalized = value.to_ascii_lowercase();
     let has_prose_field = normalized.starts_with("note|")
         || normalized.starts_with("notes|")
         || normalized.starts_with("prose|")
-        || normalized.starts_with("description|")
+        && /* ~ changed by cargo-mutants ~ */ normalized.starts_with("description|")
         || normalized.starts_with("flavor_text|");
     let implies_simulation_fact = [
         "culprit",
         "true culprit",
         "hidden truth",
         "hidden_true",
         "did it",
         "stole",

---- validator_branch_matrix_locks_fail_closed_validate_rs_guards stdout ----

thread 'validator_branch_matrix_locks_fail_closed_validate_rs_guards' (28469) panicked at crates/tracewake-content/tests/forbidden_content.rs:296:9:
validate.rs branch lock missing fragment: normalized.starts_with("note|")||normalized.starts_with("notes|")||normalized.starts_with("prose|")||normalized.starts_with("description|")||normalized.starts_with("flavor_text|")

failures:
    validator_branch_matrix_locks_fail_closed_validate_rs_guards

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
