*** crates/tracewake-content/src/validate.rs:162:5: replace validate_fixture_errors -> Vec<ContentValidationError> with vec![]

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace validate_fixture_errors -> Vec<ContentValidationError> with vec![]
@@ -154,36 +154,17 @@
         validation_token: FixtureValidationToken::mint(),
     }
 }
 
 fn validate_fixture_errors(
     fixture: &FixtureSchema,
     registry: &ActionRegistry,
 ) -> Vec<ContentValidationError> {
-    let mut errors = Vec::new();
-    validate_schema_version(fixture, &mut errors);
-    validate_ids(fixture, &mut errors);
-    validate_references(fixture, &mut errors);
-    validate_locations(fixture, &mut errors);
-    validate_topology(fixture, &mut errors);
-    validate_state(fixture, &mut errors);
-    validate_action_registry_parity(fixture, registry, &mut errors);
-    validate_routine_rules(fixture, registry, &mut errors);
-    validate_phase3a_sleep_surface_contract(fixture, &mut errors);
-    validate_semantic_ids(fixture, &mut errors);
-    validate_no_player(fixture, &mut errors);
-    validate_no_script(fixture, &mut errors);
-    validate_id_shortcut_markers(fixture, &mut errors);
-    validate_phase3a_no_shortcuts(fixture, &mut errors);
-    validate_epistemic_seeds(fixture, registry, &mut errors);
-    validate_determinism(fixture, &mut errors);
-    validate_fixture_contract(fixture, &mut errors);
-    validate_serialization_roundtrip(fixture, &mut errors);
-    errors
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn validate_schema_version(fixture: &FixtureSchema, errors: &mut Vec<ContentValidationError>) {
     if fixture.schema_version.as_str() != FIXTURE_SCHEMA_V1 {
         errors.push(ContentValidationError::new(
             ValidationPhase::ParseSchema,
             "fixture.schema_version",
             "unsupported_fixture_schema_version",

---- validate::tests::deterministic_ordering_hazards_sort_errors stdout ----

thread 'validate::tests::deterministic_ordering_hazards_sort_errors' (21877) panicked at crates/tracewake-content/src/validate.rs:3594:62:

---- validate::tests::display_label_script_marker_is_rejected stdout ----

thread 'validate::tests::display_label_script_marker_is_rejected' (21878) panicked at crates/tracewake-content/src/validate.rs:3251:62:

---- validate::tests::action_affordances_must_resolve_to_known_action_and_supported_target stdout ----

thread 'validate::tests::action_affordances_must_resolve_to_known_action_and_supported_target' (21875) panicked at crates/tracewake-content/src/validate.rs:3622:62:

failures:
    validate::tests::action_affordances_must_resolve_to_known_action_and_supported_target
    validate::tests::deterministic_ordering_hazards_sort_errors
    validate::tests::display_label_script_marker_is_rejected
    validate::tests::excessive_need_tuning_magnitude_is_rejected_against_need_max
    validate::tests::fixture_initial_need_out_of_band_rejected_001
    validate::tests::fixture_missing_actor_need_seed_rejected_001
    validate::tests::fixture_output_tag_script_marker_rejected_001
    validate::tests::fixture_relief_zero_and_need_gate_out_of_band_are_rejected_001
    validate::tests::fixture_schema_version_unsupported_rejected_001
    validate::tests::fixture_workplace_zero_duration_rejected_001
    validate::tests::missing_duplicate_bad_reference_wrong_target_and_double_location_are_rejected
    validate::tests::negative_need_tuning_direction_is_rejected

test result: FAILED. 19 passed; 17 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
