*** crates/tracewake-content/src/validate.rs:1631:21: replace && with || in contains_prose_born_fact_marker

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace && with || in contains_prose_born_fact_marker
@@ -1623,17 +1623,17 @@
         "scripted outcome",
         "outcome",
         "final event",
         "must happen",
         "really happened",
     ]
     .iter()
     .any(|marker| normalized.contains(marker));
-    has_prose_field && implies_simulation_fact
+    has_prose_field || /* ~ changed by cargo-mutants ~ */ implies_simulation_fact
 }
 
 fn is_known_routine_failure_mode(value: &str) -> bool {
     matches!(
         value,
         "access"
             | "actor_not_at_workplace"
             | "food_inaccessible"

---- validator_branch_matrix_locks_fail_closed_validate_rs_guards stdout ----

thread 'validator_branch_matrix_locks_fail_closed_validate_rs_guards' (2344) panicked at crates/tracewake-content/tests/forbidden_content.rs:296:9:
validate.rs branch lock missing fragment: has_prose_field&&implies_simulation_fact

failures:
    validator_branch_matrix_locks_fail_closed_validate_rs_guards

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
