*** crates/tracewake-content/src/validate.rs:1635:5: replace is_known_routine_failure_mode -> bool with true

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace is_known_routine_failure_mode -> bool with true
@@ -1627,31 +1627,17 @@
         "really happened",
     ]
     .iter()
     .any(|marker| normalized.contains(marker));
     has_prose_field && implies_simulation_fact
 }
 
 fn is_known_routine_failure_mode(value: &str) -> bool {
-    matches!(
-        value,
-        "access"
-            | "actor_not_at_workplace"
-            | "food_inaccessible"
-            | "food_missing"
-            | "need_blocked"
-            | "no_current_intention"
-            | "no_known_food_sources"
-            | "route_blocked"
-            | "search_blocked"
-            | "sleep_place_blocked"
-            | "step_blocked"
-            | "workplace_closed"
-    )
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn is_known_routine_fallback_rule(value: &str) -> bool {
     matches!(value, "fallback_wait_with_reason" | "wait")
 }
 
 fn supports_target_kind(
     effect: ActionEffect,

---- validate::tests::phase3a_routine_typed_modes_windows_and_direct_ops_are_rejected stdout ----

thread 'validate::tests::phase3a_routine_typed_modes_windows_and_direct_ops_are_rejected' (4407) panicked at crates/tracewake-content/src/validate.rs:3732:9:
assertion failed: codes.contains("unknown_failure_mode")

failures:
    validate::tests::phase3a_routine_typed_modes_windows_and_direct_ops_are_rejected

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
