*** crates/tracewake-content/src/validate.rs:1635:5: replace is_known_routine_failure_mode -> bool with false

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace is_known_routine_failure_mode -> bool with false
@@ -1627,31 +1627,17 @@
         "really happened",
     ]
     .iter()
     .any(|marker| normalized.contains(marker));
     has_prose_field && implies_simulation_fact
 }
 
 fn is_known_routine_failure_mode(value: &str) -> bool {
-    matches!(
-        value,
-        "access"
-            | "actor_not_at_workplace"
-            | "food_inaccessible"
-            | "food_missing"
-            | "need_blocked"
-            | "no_current_intention"
-            | "no_known_food_sources"
-            | "route_blocked"
-            | "search_blocked"
-            | "sleep_place_blocked"
-            | "step_blocked"
-            | "workplace_closed"
-    )
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn is_known_routine_fallback_rule(value: &str) -> bool {
     matches!(value, "fallback_wait_with_reason" | "wait")
 }
 
 fn supports_target_kind(
     effect: ActionEffect,

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (6481) panicked at crates/tracewake-content/src/validate.rs:3671:49:

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (6482) panicked at crates/tracewake-content/src/validate.rs:3636:59:

failures:
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted

test result: FAILED. 34 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
