*** crates/tracewake-content/src/validate.rs:1653:5: replace is_known_routine_fallback_rule -> bool with true

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace is_known_routine_fallback_rule -> bool with true
@@ -1645,17 +1645,17 @@
             | "search_blocked"
             | "sleep_place_blocked"
             | "step_blocked"
             | "workplace_closed"
     )
 }
 
 fn is_known_routine_fallback_rule(value: &str) -> bool {
-    matches!(value, "fallback_wait_with_reason" | "wait")
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn supports_target_kind(
     effect: ActionEffect,
     fixture: &FixtureSchema,
     affordance: &ActionAffordanceSchema,
 ) -> bool {
     match effect {

---- validate::tests::phase3a_routine_typed_modes_windows_and_direct_ops_are_rejected stdout ----

thread 'validate::tests::phase3a_routine_typed_modes_windows_and_direct_ops_are_rejected' (8550) panicked at crates/tracewake-content/src/validate.rs:3747:9:
assertion failed: codes.contains("unknown_fallback_rule")

failures:
    validate::tests::phase3a_routine_typed_modes_windows_and_direct_ops_are_rejected

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
