*** crates/tracewake-content/src/validate.rs:1653:5: replace is_known_routine_fallback_rule -> bool with false

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace is_known_routine_fallback_rule -> bool with false
@@ -1645,17 +1645,17 @@
             | "search_blocked"
             | "sleep_place_blocked"
             | "step_blocked"
             | "workplace_closed"
     )
 }
 
 fn is_known_routine_fallback_rule(value: &str) -> bool {
-    matches!(value, "fallback_wait_with_reason" | "wait")
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn supports_target_kind(
     effect: ActionEffect,
     fixture: &FixtureSchema,
     affordance: &ActionAffordanceSchema,
 ) -> bool {
     match effect {

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (10623) panicked at crates/tracewake-content/src/validate.rs:3685:49:

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (10624) panicked at crates/tracewake-content/src/validate.rs:3650:59:

failures:
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted

test result: FAILED. 34 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
