*** crates/tracewake-content/src/validate.rs:1661:5: replace supports_target_kind -> bool with true

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace supports_target_kind -> bool with true
@@ -1653,66 +1653,17 @@
     matches!(value, "fallback_wait_with_reason" | "wait")
 }
 
 fn supports_target_kind(
     effect: ActionEffect,
     fixture: &FixtureSchema,
     affordance: &ActionAffordanceSchema,
 ) -> bool {
-    match effect {
-        ActionEffect::Move => {
-            parse_place_target(&affordance.target_id).is_some()
-                && fixture
-                    .places
-                    .iter()
-                    .any(|place| place.place_id.as_str() == affordance.target_id)
-        }
-        ActionEffect::Open | ActionEffect::Close => {
-            fixture
-                .doors
-                .iter()
-                .any(|door| door.door_id.as_str() == affordance.target_id)
-                || fixture
-                    .containers
-                    .iter()
-                    .any(|container| container.container_id.as_str() == affordance.target_id)
-        }
-        ActionEffect::CheckContainer => fixture
-            .containers
-            .iter()
-            .any(|container| container.container_id.as_str() == affordance.target_id),
-        ActionEffect::Eat => fixture
-            .food_supplies
-            .iter()
-            .any(|food| food.food_supply_id.as_str() == affordance.target_id),
-        ActionEffect::Sleep => fixture
-            .places
-            .iter()
-            .any(|place| place.place_id.as_str() == affordance.target_id),
-        ActionEffect::Work => fixture
-            .workplaces
-            .iter()
-            .any(|workplace| workplace.workplace_id.as_str() == affordance.target_id),
-        ActionEffect::ContinueRoutine => fixture
-            .routine_templates
-            .iter()
-            .any(|template| template.template_id.as_str() == affordance.target_id),
-        ActionEffect::Take | ActionEffect::Place => fixture
-            .items
-            .iter()
-            .any(|item| item.item_id.as_str() == affordance.target_id),
-        ActionEffect::QueryOnly => {
-            affordance.action_id.as_str() == "inspect_entity"
-                || affordance.action_id.as_str() == "inspect_place"
-                || affordance.action_id.as_str() == "look"
-                || affordance.action_id.as_str() == "truthful_accuse_probe"
-        }
-        ActionEffect::Wait => false,
-    }
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_place_target(value: &str) -> Option<PlaceId> {
     PlaceId::new(value).ok()
 }
 
 fn target_kind(fixture: &FixtureSchema, target_id: &str) -> Option<&'static str> {
     if fixture

---- validate::tests::missing_duplicate_bad_reference_wrong_target_and_double_location_are_rejected stdout ----

thread 'validate::tests::missing_duplicate_bad_reference_wrong_target_and_double_location_are_rejected' (12688) panicked at crates/tracewake-content/src/validate.rs:3535:9:
assertion failed: codes.contains("unsupported_action_target")

failures:
    validate::tests::missing_duplicate_bad_reference_wrong_target_and_double_location_are_rejected

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
