*** crates/tracewake-content/src/validate.rs:1661:5: replace supports_target_kind -> bool with false

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace supports_target_kind -> bool with false
@@ -1653,66 +1653,17 @@
     matches!(value, "fallback_wait_with_reason" | "wait")
 }
 
 fn supports_target_kind(
     effect: ActionEffect,
     fixture: &FixtureSchema,
     affordance: &ActionAffordanceSchema,
 ) -> bool {
-    match effect {
-        ActionEffect::Move => {
-            parse_place_target(&affordance.target_id).is_some()
-                && fixture
-                    .places
-                    .iter()
-                    .any(|place| place.place_id.as_str() == affordance.target_id)
-        }
-        ActionEffect::Open | ActionEffect::Close => {
-            fixture
-                .doors
-                .iter()
-                .any(|door| door.door_id.as_str() == affordance.target_id)
-                || fixture
-                    .containers
-                    .iter()
-                    .any(|container| container.container_id.as_str() == affordance.target_id)
-        }
-        ActionEffect::CheckContainer => fixture
-            .containers
-            .iter()
-            .any(|container| container.container_id.as_str() == affordance.target_id),
-        ActionEffect::Eat => fixture
-            .food_supplies
-            .iter()
-            .any(|food| food.food_supply_id.as_str() == affordance.target_id),
-        ActionEffect::Sleep => fixture
-            .places
-            .iter()
-            .any(|place| place.place_id.as_str() == affordance.target_id),
-        ActionEffect::Work => fixture
-            .workplaces
-            .iter()
-            .any(|workplace| workplace.workplace_id.as_str() == affordance.target_id),
-        ActionEffect::ContinueRoutine => fixture
-            .routine_templates
-            .iter()
-            .any(|template| template.template_id.as_str() == affordance.target_id),
-        ActionEffect::Take | ActionEffect::Place => fixture
-            .items
-            .iter()
-            .any(|item| item.item_id.as_str() == affordance.target_id),
-        ActionEffect::QueryOnly => {
-            affordance.action_id.as_str() == "inspect_entity"
-                || affordance.action_id.as_str() == "inspect_place"
-                || affordance.action_id.as_str() == "look"
-                || affordance.action_id.as_str() == "truthful_accuse_probe"
-        }
-        ActionEffect::Wait => false,
-    }
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_place_target(value: &str) -> Option<PlaceId> {
     PlaceId::new(value).ok()
 }
 
 fn target_kind(fixture: &FixtureSchema, target_id: &str) -> Option<&'static str> {
     if fixture

---- validate::tests::valid_fixture_produces_initial_world stdout ----

thread 'validate::tests::valid_fixture_produces_initial_world' (14771) panicked at crates/tracewake-content/src/validate.rs:3027:63:

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (14766) panicked at crates/tracewake-content/src/validate.rs:3601:59:

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (14765) panicked at crates/tracewake-content/src/validate.rs:3636:49:

failures:
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 33 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
