*** crates/tracewake-content/src/validate.rs:1667:58: replace == with != in supports_target_kind

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace == with != in supports_target_kind
@@ -1659,17 +1659,17 @@
     affordance: &ActionAffordanceSchema,
 ) -> bool {
     match effect {
         ActionEffect::Move => {
             parse_place_target(&affordance.target_id).is_some()
                 && fixture
                     .places
                     .iter()
-                    .any(|place| place.place_id.as_str() == affordance.target_id)
+                    .any(|place| place.place_id.as_str() != /* ~ changed by cargo-mutants ~ */ affordance.target_id)
         }
         ActionEffect::Open | ActionEffect::Close => {
             fixture
                 .doors
                 .iter()
                 .any(|door| door.door_id.as_str() == affordance.target_id)
                 || fixture
                     .containers

---- validator_branch_matrix_locks_fail_closed_validate_rs_guards stdout ----

thread 'validator_branch_matrix_locks_fail_closed_validate_rs_guards' (19033) panicked at crates/tracewake-content/tests/forbidden_content.rs:296:9:
validate.rs branch lock missing fragment: parse_place_target(&affordance.target_id).is_some()&&fixture.places.iter().any(|place|place.place_id.as_str()==affordance.target_id)

failures:
    validator_branch_matrix_locks_fail_closed_validate_rs_guards

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
