*** crates/tracewake-content/src/validate.rs:1673:51: replace == with != in supports_target_kind

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace == with != in supports_target_kind
@@ -1665,17 +1665,17 @@
                     .places
                     .iter()
                     .any(|place| place.place_id.as_str() == affordance.target_id)
         }
         ActionEffect::Open | ActionEffect::Close => {
             fixture
                 .doors
                 .iter()
-                .any(|door| door.door_id.as_str() == affordance.target_id)
+                .any(|door| door.door_id.as_str() != /* ~ changed by cargo-mutants ~ */ affordance.target_id)
                 || fixture
                     .containers
                     .iter()
                     .any(|container| container.container_id.as_str() == affordance.target_id)
         }
         ActionEffect::CheckContainer => fixture
             .containers
             .iter()

---- validate::tests::missing_duplicate_bad_reference_wrong_target_and_double_location_are_rejected stdout ----

thread 'validate::tests::missing_duplicate_bad_reference_wrong_target_and_double_location_are_rejected' (23163) panicked at crates/tracewake-content/src/validate.rs:3584:9:
assertion failed: codes.contains("unsupported_action_target")

failures:
    validate::tests::missing_duplicate_bad_reference_wrong_target_and_double_location_are_rejected

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
