*** crates/tracewake-content/src/validate.rs:1674:17: replace || with && in supports_target_kind

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace || with && in supports_target_kind
@@ -1666,17 +1666,17 @@
                     .iter()
                     .any(|place| place.place_id.as_str() == affordance.target_id)
         }
         ActionEffect::Open | ActionEffect::Close => {
             fixture
                 .doors
                 .iter()
                 .any(|door| door.door_id.as_str() == affordance.target_id)
-                || fixture
+                && /* ~ changed by cargo-mutants ~ */ fixture
                     .containers
                     .iter()
                     .any(|container| container.container_id.as_str() == affordance.target_id)
         }
         ActionEffect::CheckContainer => fixture
             .containers
             .iter()
             .any(|container| container.container_id.as_str() == affordance.target_id),

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (21099) panicked at crates/tracewake-content/src/validate.rs:3650:59:

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (21098) panicked at crates/tracewake-content/src/validate.rs:3685:49:

---- validate::tests::valid_fixture_produces_initial_world stdout ----

thread 'validate::tests::valid_fixture_produces_initial_world' (21104) panicked at crates/tracewake-content/src/validate.rs:3076:63:

failures:
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 33 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
