*** crates/tracewake-content/src/validate.rs:1677:70: replace == with != in supports_target_kind

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace == with != in supports_target_kind
@@ -1669,17 +1669,17 @@
         ActionEffect::Open | ActionEffect::Close => {
             fixture
                 .doors
                 .iter()
                 .any(|door| door.door_id.as_str() == affordance.target_id)
                 || fixture
                     .containers
                     .iter()
-                    .any(|container| container.container_id.as_str() == affordance.target_id)
+                    .any(|container| container.container_id.as_str() != /* ~ changed by cargo-mutants ~ */ affordance.target_id)
         }
         ActionEffect::CheckContainer => fixture
             .containers
             .iter()
             .any(|container| container.container_id.as_str() == affordance.target_id),
         ActionEffect::Eat => fixture
             .food_supplies
             .iter()

---- validate::tests::missing_duplicate_bad_reference_wrong_target_and_double_location_are_rejected stdout ----

thread 'validate::tests::missing_duplicate_bad_reference_wrong_target_and_double_location_are_rejected' (25234) panicked at crates/tracewake-content/src/validate.rs:3584:9:
assertion failed: codes.contains("unsupported_action_target")

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (25240) panicked at crates/tracewake-content/src/validate.rs:3685:49:

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (25241) panicked at crates/tracewake-content/src/validate.rs:3650:59:

failures:
    validate::tests::missing_duplicate_bad_reference_wrong_target_and_double_location_are_rejected
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 32 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
