*** crates/tracewake-content/src/validate.rs:1682:62: replace == with != in supports_target_kind

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace == with != in supports_target_kind
@@ -1674,17 +1674,17 @@
                 || fixture
                     .containers
                     .iter()
                     .any(|container| container.container_id.as_str() == affordance.target_id)
         }
         ActionEffect::CheckContainer => fixture
             .containers
             .iter()
-            .any(|container| container.container_id.as_str() == affordance.target_id),
+            .any(|container| container.container_id.as_str() != /* ~ changed by cargo-mutants ~ */ affordance.target_id),
         ActionEffect::Eat => fixture
             .food_supplies
             .iter()
             .any(|food| food.food_supply_id.as_str() == affordance.target_id),
         ActionEffect::Sleep => fixture
             .places
             .iter()
             .any(|place| place.place_id.as_str() == affordance.target_id),

---- fixture_scope_raw_lines_drive_loader_registry_and_fail_closed stdout ----

thread 'fixture_scope_raw_lines_drive_loader_registry_and_fail_closed' (27324) panicked at crates/tracewake-content/tests/fixtures_load.rs:829:6:

---- all_fixtures_load_deterministically_and_validate stdout ----

thread 'all_fixtures_load_deterministically_and_validate' (27320) panicked at crates/tracewake-content/tests/fixtures_load.rs:591:54:

---- phase2a_fixtures_are_registered_and_script_free stdout ----

thread 'phase2a_fixtures_are_registered_and_script_free' (27344) panicked at crates/tracewake-content/tests/fixtures_load.rs:1546:56:

failures:
    all_fixtures_load_deterministically_and_validate
    fixture_scope_raw_lines_drive_loader_registry_and_fail_closed
    phase2a_fixtures_are_registered_and_script_free

test result: FAILED. 31 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
