*** crates/tracewake-content/src/validate.rs:1686:54: replace == with != in supports_target_kind

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace == with != in supports_target_kind
@@ -1678,17 +1678,17 @@
         }
         ActionEffect::CheckContainer => fixture
             .containers
             .iter()
             .any(|container| container.container_id.as_str() == affordance.target_id),
         ActionEffect::Eat => fixture
             .food_supplies
             .iter()
-            .any(|food| food.food_supply_id.as_str() == affordance.target_id),
+            .any(|food| food.food_supply_id.as_str() != /* ~ changed by cargo-mutants ~ */ affordance.target_id),
         ActionEffect::Sleep => fixture
             .places
             .iter()
             .any(|place| place.place_id.as_str() == affordance.target_id),
         ActionEffect::Work => fixture
             .workplaces
             .iter()
             .any(|workplace| workplace.workplace_id.as_str() == affordance.target_id),

---- phase3a_load_emits_authored_prehistory_seed_events stdout ----

thread 'phase3a_load_emits_authored_prehistory_seed_events' (29451) panicked at crates/tracewake-content/tests/fixtures_load.rs:761:6:

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (29454) panicked at crates/tracewake-content/tests/fixtures_load.rs:1172:6:

---- all_fixtures_load_deterministically_and_validate stdout ----

thread 'all_fixtures_load_deterministically_and_validate' (29426) panicked at crates/tracewake-content/tests/fixtures_load.rs:591:54:

failures:
    all_fixtures_load_deterministically_and_validate
    phase3a_load_emits_authored_prehistory_seed_events
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 31 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
