*** crates/tracewake-content/src/validate.rs:1690:50: replace == with != in supports_target_kind

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace == with != in supports_target_kind
@@ -1682,17 +1682,17 @@
             .any(|container| container.container_id.as_str() == affordance.target_id),
         ActionEffect::Eat => fixture
             .food_supplies
             .iter()
             .any(|food| food.food_supply_id.as_str() == affordance.target_id),
         ActionEffect::Sleep => fixture
             .places
             .iter()
-            .any(|place| place.place_id.as_str() == affordance.target_id),
+            .any(|place| place.place_id.as_str() != /* ~ changed by cargo-mutants ~ */ affordance.target_id),
         ActionEffect::Work => fixture
             .workplaces
             .iter()
             .any(|workplace| workplace.workplace_id.as_str() == affordance.target_id),
         ActionEffect::ContinueRoutine => fixture
             .routine_templates
             .iter()
             .any(|template| template.template_id.as_str() == affordance.target_id),

---- fixture_scope_raw_lines_drive_loader_registry_and_fail_closed stdout ----

thread 'fixture_scope_raw_lines_drive_loader_registry_and_fail_closed' (31536) panicked at crates/tracewake-content/tests/fixtures_load.rs:846:6:

---- all_fixtures_load_deterministically_and_validate stdout ----

thread 'all_fixtures_load_deterministically_and_validate' (31532) panicked at crates/tracewake-content/tests/fixtures_load.rs:591:54:

failures:
    all_fixtures_load_deterministically_and_validate
    fixture_scope_raw_lines_drive_loader_registry_and_fail_closed

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
