*** crates/tracewake-content/src/validate.rs:1694:62: replace == with != in supports_target_kind

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace == with != in supports_target_kind
@@ -1686,17 +1686,17 @@
             .any(|food| food.food_supply_id.as_str() == affordance.target_id),
         ActionEffect::Sleep => fixture
             .places
             .iter()
             .any(|place| place.place_id.as_str() == affordance.target_id),
         ActionEffect::Work => fixture
             .workplaces
             .iter()
-            .any(|workplace| workplace.workplace_id.as_str() == affordance.target_id),
+            .any(|workplace| workplace.workplace_id.as_str() != /* ~ changed by cargo-mutants ~ */ affordance.target_id),
         ActionEffect::ContinueRoutine => fixture
             .routine_templates
             .iter()
             .any(|template| template.template_id.as_str() == affordance.target_id),
         ActionEffect::Take | ActionEffect::Place => fixture
             .items
             .iter()
             .any(|item| item.item_id.as_str() == affordance.target_id),

---- stale_workplace_notice_superseded_by_newer_001 stdout ----

thread 'stale_workplace_notice_superseded_by_newer_001' (1200) panicked at crates/tracewake-content/tests/fixtures_load.rs:1096:6:

---- phase3a_load_emits_authored_prehistory_seed_events stdout ----

thread 'phase3a_load_emits_authored_prehistory_seed_events' (1195) panicked at crates/tracewake-content/tests/fixtures_load.rs:761:6:

---- all_fixtures_load_deterministically_and_validate stdout ----

thread 'all_fixtures_load_deterministically_and_validate' (1170) panicked at crates/tracewake-content/tests/fixtures_load.rs:591:54:

failures:
    all_fixtures_load_deterministically_and_validate
    phase3a_load_emits_authored_prehistory_seed_events
    stale_workplace_notice_superseded_by_newer_001

test result: FAILED. 31 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
