*** crates/tracewake-content/src/validate.rs:1698:59: replace == with != in supports_target_kind

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace == with != in supports_target_kind
@@ -1690,17 +1690,17 @@
             .any(|place| place.place_id.as_str() == affordance.target_id),
         ActionEffect::Work => fixture
             .workplaces
             .iter()
             .any(|workplace| workplace.workplace_id.as_str() == affordance.target_id),
         ActionEffect::ContinueRoutine => fixture
             .routine_templates
             .iter()
-            .any(|template| template.template_id.as_str() == affordance.target_id),
+            .any(|template| template.template_id.as_str() != /* ~ changed by cargo-mutants ~ */ affordance.target_id),
         ActionEffect::Take | ActionEffect::Place => fixture
             .items
             .iter()
             .any(|item| item.item_id.as_str() == affordance.target_id),
         ActionEffect::QueryOnly => {
             affordance.action_id.as_str() == "inspect_entity"
                 || affordance.action_id.as_str() == "inspect_place"
                 || affordance.action_id.as_str() == "look"

---- validator_branch_matrix_locks_fail_closed_validate_rs_guards stdout ----

thread 'validator_branch_matrix_locks_fail_closed_validate_rs_guards' (3333) panicked at crates/tracewake-content/tests/forbidden_content.rs:296:9:
validate.rs branch lock missing fragment: any(|template|template.template_id.as_str()==affordance.target_id)

failures:
    validator_branch_matrix_locks_fail_closed_validate_rs_guards

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
