*** crates/tracewake-content/src/validate.rs:1702:47: replace == with != in supports_target_kind

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace == with != in supports_target_kind
@@ -1694,17 +1694,17 @@
             .any(|workplace| workplace.workplace_id.as_str() == affordance.target_id),
         ActionEffect::ContinueRoutine => fixture
             .routine_templates
             .iter()
             .any(|template| template.template_id.as_str() == affordance.target_id),
         ActionEffect::Take | ActionEffect::Place => fixture
             .items
             .iter()
-            .any(|item| item.item_id.as_str() == affordance.target_id),
+            .any(|item| item.item_id.as_str() != /* ~ changed by cargo-mutants ~ */ affordance.target_id),
         ActionEffect::QueryOnly => {
             affordance.action_id.as_str() == "inspect_entity"
                 || affordance.action_id.as_str() == "inspect_place"
                 || affordance.action_id.as_str() == "look"
                 || affordance.action_id.as_str() == "truthful_accuse_probe"
         }
         ActionEffect::Wait => false,
     }

---- fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture stdout ----

thread 'fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture' (5409) panicked at crates/tracewake-content/tests/fixtures_load.rs:661:6:

---- fixture_fingerprint_reprices_secondary_file_bytes stdout ----

thread 'fixture_fingerprint_reprices_secondary_file_bytes' (5410) panicked at crates/tracewake-content/tests/fixtures_load.rs:629:6:

---- valid_epistemic_seed_validates_and_round_trips_canonically stdout ----

thread 'valid_epistemic_seed_validates_and_round_trips_canonically' (5439) panicked at crates/tracewake-content/tests/fixtures_load.rs:1708:52:

failures:
    all_fixtures_load_deterministically_and_validate
    fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture
    fixture_fingerprint_reprices_secondary_file_bytes
    phase2a_fixtures_are_registered_and_script_free
    valid_epistemic_seed_validates_and_round_trips_canonically

test result: FAILED. 29 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
