*** crates/tracewake-content/src/validate.rs:1707:17: replace || with && in supports_target_kind

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace || with && in supports_target_kind
@@ -1699,17 +1699,17 @@
         ActionEffect::Take | ActionEffect::Place => fixture
             .items
             .iter()
             .any(|item| item.item_id.as_str() == affordance.target_id),
         ActionEffect::QueryOnly => {
             affordance.action_id.as_str() == "inspect_entity"
                 || affordance.action_id.as_str() == "inspect_place"
                 || affordance.action_id.as_str() == "look"
-                || affordance.action_id.as_str() == "truthful_accuse_probe"
+                && /* ~ changed by cargo-mutants ~ */ affordance.action_id.as_str() == "truthful_accuse_probe"
         }
         ActionEffect::Wait => false,
     }
 }
 
 fn parse_place_target(value: &str) -> Option<PlaceId> {
     PlaceId::new(value).ok()
 }

---- all_fixtures_load_deterministically_and_validate stdout ----

thread 'all_fixtures_load_deterministically_and_validate' (7514) panicked at crates/tracewake-content/tests/fixtures_load.rs:591:54:

---- phase2a_fixtures_are_registered_and_script_free stdout ----

thread 'phase2a_fixtures_are_registered_and_script_free' (7538) panicked at crates/tracewake-content/tests/fixtures_load.rs:1546:56:

failures:
    all_fixtures_load_deterministically_and_validate
    phase2a_fixtures_are_registered_and_script_free

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
