*** crates/tracewake-content/src/validate.rs:1714:5: replace parse_place_target -> Option<PlaceId> with None

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace parse_place_target -> Option<PlaceId> with None
@@ -1706,17 +1706,17 @@
                 || affordance.action_id.as_str() == "look"
                 || affordance.action_id.as_str() == "truthful_accuse_probe"
         }
         ActionEffect::Wait => false,
     }
 }
 
 fn parse_place_target(value: &str) -> Option<PlaceId> {
-    PlaceId::new(value).ok()
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn target_kind(fixture: &FixtureSchema, target_id: &str) -> Option<&'static str> {
     if fixture
         .actors
         .iter()
         .any(|actor| actor.actor_id.as_str() == target_id)
     {

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (22272) panicked at crates/tracewake-content/src/validate.rs:3685:49:

---- validate::tests::valid_fixture_produces_initial_world stdout ----

thread 'validate::tests::valid_fixture_produces_initial_world' (22278) panicked at crates/tracewake-content/src/validate.rs:3076:63:

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (22273) panicked at crates/tracewake-content/src/validate.rs:3650:59:

failures:
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 33 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
