*** crates/tracewake-content/src/validate.rs:1718:5: replace target_kind -> Option<&'static str> with None

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace target_kind -> Option<&'static str> with None
@@ -1710,67 +1710,17 @@
     }
 }
 
 fn parse_place_target(value: &str) -> Option<PlaceId> {
     PlaceId::new(value).ok()
 }
 
 fn target_kind(fixture: &FixtureSchema, target_id: &str) -> Option<&'static str> {
-    if fixture
-        .actors
-        .iter()
-        .any(|actor| actor.actor_id.as_str() == target_id)
-    {
-        Some("actor")
-    } else if fixture
-        .places
-        .iter()
-        .any(|place| place.place_id.as_str() == target_id)
-    {
-        Some("place")
-    } else if fixture
-        .doors
-        .iter()
-        .any(|door| door.door_id.as_str() == target_id)
-    {
-        Some("door")
-    } else if fixture
-        .containers
-        .iter()
-        .any(|container| container.container_id.as_str() == target_id)
-    {
-        Some("container")
-    } else if fixture
-        .items
-        .iter()
-        .any(|item| item.item_id.as_str() == target_id)
-    {
-        Some("item")
-    } else if fixture
-        .food_supplies
-        .iter()
-        .any(|food| food.food_supply_id.as_str() == target_id)
-    {
-        Some("food_supply")
-    } else if fixture
-        .workplaces
-        .iter()
-        .any(|workplace| workplace.workplace_id.as_str() == target_id)
-    {
-        Some("workplace")
-    } else if fixture
-        .routine_templates
-        .iter()
-        .any(|template| template.template_id.as_str() == target_id)
-    {
-        Some("routine_template")
-    } else {
-        None
-    }
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn validate_semantic_ids(fixture: &FixtureSchema, errors: &mut Vec<ContentValidationError>) {
     for (index, affordance) in fixture.affordances.iter().enumerate() {
         if affordance.action_id.as_str().parse::<u64>().is_ok() {
             errors.push(ContentValidationError::new(
                 ValidationPhase::SemanticView,
                 format!("affordances[{index}].action_id"),

---- validate::tests::missing_duplicate_bad_reference_wrong_target_and_double_location_are_rejected stdout ----

thread 'validate::tests::missing_duplicate_bad_reference_wrong_target_and_double_location_are_rejected' (24482) panicked at crates/tracewake-content/src/validate.rs:3534:9:
assertion failed: codes.contains("unsupported_action_target")

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (24489) panicked at crates/tracewake-content/src/validate.rs:3600:59:

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (24488) panicked at crates/tracewake-content/src/validate.rs:3635:49:

failures:
    validate::tests::missing_duplicate_bad_reference_wrong_target_and_double_location_are_rejected
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 32 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
