*** crates/tracewake-content/src/validate.rs:1727:46: replace == with != in target_kind

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace == with != in target_kind
@@ -1719,17 +1719,17 @@
         .actors
         .iter()
         .any(|actor| actor.actor_id.as_str() == target_id)
     {
         Some("actor")
     } else if fixture
         .places
         .iter()
-        .any(|place| place.place_id.as_str() == target_id)
+        .any(|place| place.place_id.as_str() != /* ~ changed by cargo-mutants ~ */ target_id)
     {
         Some("place")
     } else if fixture
         .doors
         .iter()
         .any(|door| door.door_id.as_str() == target_id)
     {
         Some("door")

---- fixture_scope_raw_lines_drive_loader_registry_and_fail_closed stdout ----

thread 'fixture_scope_raw_lines_drive_loader_registry_and_fail_closed' (497) panicked at crates/tracewake-content/tests/fixtures_load.rs:846:6:

---- phase2a_fixtures_are_registered_and_script_free stdout ----

thread 'phase2a_fixtures_are_registered_and_script_free' (517) panicked at crates/tracewake-content/tests/fixtures_load.rs:1546:56:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Referential, path: "affordances[2].target_id", code: "bad_reference", message: "affordance target house_tomas does not exist" }] } }

---- all_fixtures_load_deterministically_and_validate stdout ----

thread 'all_fixtures_load_deterministically_and_validate' (493) panicked at crates/tracewake-content/tests/fixtures_load.rs:591:54:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Referential, path: "affordances[2].target_id", code: "bad_reference", message: "affordance target house_tomas does not exist" }] } }

failures:
    all_fixtures_load_deterministically_and_validate
    fixture_scope_raw_lines_drive_loader_registry_and_fail_closed
    phase2a_fixtures_are_registered_and_script_free

test result: FAILED. 31 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
