*** crates/tracewake-content/src/validate.rs:1763:55: replace == with != in target_kind

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace == with != in target_kind
@@ -1755,17 +1755,17 @@
         .workplaces
         .iter()
         .any(|workplace| workplace.workplace_id.as_str() == target_id)
     {
         Some("workplace")
     } else if fixture
         .routine_templates
         .iter()
-        .any(|template| template.template_id.as_str() == target_id)
+        .any(|template| template.template_id.as_str() != /* ~ changed by cargo-mutants ~ */ target_id)
     {
         Some("routine_template")
     } else {
         None
     }
 }
 
 fn validate_semantic_ids(fixture: &FixtureSchema, errors: &mut Vec<ContentValidationError>) {

---- validator_branch_matrix_locks_fail_closed_validate_rs_guards stdout ----

thread 'validator_branch_matrix_locks_fail_closed_validate_rs_guards' (13117) panicked at crates/tracewake-content/tests/forbidden_content.rs:296:9:
validate.rs branch lock missing fragment: any(|template|template.template_id.as_str()==target_id){Some("routine_template")}

failures:
    validator_branch_matrix_locks_fail_closed_validate_rs_guards

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
