*** crates/tracewake-content/src/validate.rs:1772:5: replace validate_semantic_ids with ()

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace validate_semantic_ids with ()
@@ -1764,26 +1764,17 @@
     {
         Some("routine_template")
     } else {
         None
     }
 }
 
 fn validate_semantic_ids(fixture: &FixtureSchema, errors: &mut Vec<ContentValidationError>) {
-    for (index, affordance) in fixture.affordances.iter().enumerate() {
-        if affordance.action_id.as_str().parse::<u64>().is_ok() {
-            errors.push(ContentValidationError::new(
-                ValidationPhase::SemanticView,
-                format!("affordances[{index}].action_id"),
-                "menu_position_action_id",
-                "fixture action IDs must be semantic IDs, not menu positions",
-            ));
-        }
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn validate_no_player(fixture: &FixtureSchema, errors: &mut Vec<ContentValidationError>) {
     for (index, affordance) in fixture.affordances.iter().enumerate() {
         if is_player_key(affordance.action_id.as_str()) {
             errors.push(ContentValidationError::new(
                 ValidationPhase::NoPlayer,
                 format!("affordances[{index}].action_id"),

---- validator_branch_matrix_locks_fail_closed_validate_rs_guards stdout ----

thread 'validator_branch_matrix_locks_fail_closed_validate_rs_guards' (15248) panicked at crates/tracewake-content/tests/forbidden_content.rs:296:9:
validate.rs branch lock missing fragment: fnvalidate_semantic_ids(fixture:&FixtureSchema,errors:&mutVec<ContentValidationError>){for(index,affordance)infixture.affordances.iter().enumerate(){ifaffordance.action_id.as_str().parse::<u64>().is_ok(){

failures:
    validator_branch_matrix_locks_fail_closed_validate_rs_guards

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
