*** crates/tracewake-content/src/validate.rs:1830:29: replace && with || in validate_no_script

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace && with || in validate_no_script
@@ -1822,17 +1822,17 @@
             &affordance.target_id,
             format!("affordances[{index}].target_id"),
             StringScanPolicy::Union,
             errors,
         );
     }
     for (index, belief) in fixture.initial_beliefs.iter().enumerate() {
         let planner_intended = planner_intended_seed_text(belief).any(contains_planner_seed_marker);
-        if planner_intended && belief.channel.is_none() {
+        if planner_intended || /* ~ changed by cargo-mutants ~ */ belief.channel.is_none() {
             errors.push(ContentValidationError::new(
                 ValidationPhase::NoScript,
                 format!("initial_beliefs[{index}]"),
                 "missing_actor_known_provenance",
                 "planner-intended actor-known initial beliefs must declare an observation channel",
             ));
         }
     }

---- fixture_fingerprint_reprices_secondary_file_bytes stdout ----

thread 'fixture_fingerprint_reprices_secondary_file_bytes' (21525) panicked at crates/tracewake-content/tests/fixtures_load.rs:629:6:

---- fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture stdout ----

thread 'fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture' (21524) panicked at crates/tracewake-content/tests/fixtures_load.rs:661:6:

---- all_fixtures_load_deterministically_and_validate stdout ----

thread 'all_fixtures_load_deterministically_and_validate' (21522) panicked at crates/tracewake-content/tests/fixtures_load.rs:591:54:

failures:
    all_fixtures_load_deterministically_and_validate
    fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture
    fixture_fingerprint_reprices_secondary_file_bytes
    phase2a_fixtures_are_registered_and_script_free
    seed_event_log_order_and_projection_provenance_are_causal_and_stable
    valid_epistemic_seed_validates_and_round_trips_canonically

test result: FAILED. 28 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
