*** crates/tracewake-content/src/validate.rs:185:40: replace != with == in validate_schema_version

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace != with == in validate_schema_version
@@ -177,17 +177,17 @@
     validate_epistemic_seeds(fixture, registry, &mut errors);
     validate_determinism(fixture, &mut errors);
     validate_fixture_contract(fixture, &mut errors);
     validate_serialization_roundtrip(fixture, &mut errors);
     errors
 }
 
 fn validate_schema_version(fixture: &FixtureSchema, errors: &mut Vec<ContentValidationError>) {
-    if fixture.schema_version.as_str() != FIXTURE_SCHEMA_V1 {
+    if fixture.schema_version.as_str() == /* ~ changed by cargo-mutants ~ */ FIXTURE_SCHEMA_V1 {
         errors.push(ContentValidationError::new(
             ValidationPhase::ParseSchema,
             "fixture.schema_version",
             "unsupported_fixture_schema_version",
             format!(
                 "unsupported fixture schema version {}",
                 fixture.schema_version.as_str()
             ),

---- load::tests::shuffled_input_paths_load_to_same_canonical_world stdout ----

thread 'load::tests::shuffled_input_paths_load_to_same_canonical_world' (26156) panicked at crates/tracewake-content/src/load.rs:509:10:

---- validate::tests::fixture_schema_version_unsupported_rejected_001 stdout ----

thread 'validate::tests::fixture_schema_version_unsupported_rejected_001' (26173) panicked at crates/tracewake-content/src/validate.rs:3101:62:

---- validate::tests::fixture_schema_v1_golden_bytes_load_001 stdout ----

thread 'validate::tests::fixture_schema_v1_golden_bytes_load_001' (26172) panicked at crates/tracewake-content/src/validate.rs:3087:81:

failures:
    load::tests::shuffled_input_paths_load_to_same_canonical_world
    validate::tests::fixture_schema_v1_golden_bytes_load_001
    validate::tests::fixture_schema_version_unsupported_rejected_001
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 30 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
