*** crates/tracewake-content/src/validate.rs:185:5: replace validate_schema_version with ()

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace validate_schema_version with ()
@@ -177,27 +177,17 @@
     validate_epistemic_seeds(fixture, registry, &mut errors);
     validate_determinism(fixture, &mut errors);
     validate_fixture_contract(fixture, &mut errors);
     validate_serialization_roundtrip(fixture, &mut errors);
     errors
 }
 
 fn validate_schema_version(fixture: &FixtureSchema, errors: &mut Vec<ContentValidationError>) {
-    if fixture.schema_version.as_str() != FIXTURE_SCHEMA_V1 {
-        errors.push(ContentValidationError::new(
-            ValidationPhase::ParseSchema,
-            "fixture.schema_version",
-            "unsupported_fixture_schema_version",
-            format!(
-                "unsupported fixture schema version {}",
-                fixture.schema_version.as_str()
-            ),
-        ));
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn validate_raw_lines(bytes: &[u8]) -> Vec<ContentValidationError> {
     let mut errors = Vec::new();
     let text = match std::str::from_utf8(bytes) {
         Ok(text) => text,
         Err(_) => {
             errors.push(ContentValidationError::new(

---- validate::tests::fixture_schema_version_unsupported_rejected_001 stdout ----

thread 'validate::tests::fixture_schema_version_unsupported_rejected_001' (24102) panicked at crates/tracewake-content/src/validate.rs:3091:62:

failures:
    validate::tests::fixture_schema_version_unsupported_rejected_001

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
