*** crates/tracewake-content/src/validate.rs:2127:5: replace validate_id_shortcut_markers with ()

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace validate_id_shortcut_markers with ()
@@ -2119,252 +2119,17 @@
     IdFieldScanRegistration {
         field: "DayWindowSchema.actor_id",
         policy: StringScanPolicy::Union,
         rationale: "day-window actor references are authored content and must not encode shortcut behavior",
     },
 ];
 
 fn validate_id_shortcut_markers(fixture: &FixtureSchema, errors: &mut Vec<ContentValidationError>) {
-    reject_text_by_policy(
-        fixture.fixture_id.as_str(),
-        "fixture.fixture_id".to_string(),
-        StringScanPolicy::Union,
-        errors,
-    );
-    for (index, actor) in fixture.actors.iter().enumerate() {
-        reject_text_by_policy(
-            actor.actor_id.as_str(),
-            format!("actors[{index}].actor_id"),
-            StringScanPolicy::Union,
-            errors,
-        );
-        reject_text_by_policy(
-            actor.current_place_id.as_str(),
-            format!("actors[{index}].current_place_id"),
-            StringScanPolicy::Union,
-            errors,
-        );
-    }
-    for (index, place) in fixture.places.iter().enumerate() {
-        reject_text_by_policy(
-            place.place_id.as_str(),
-            format!("places[{index}].place_id"),
-            StringScanPolicy::Union,
-            errors,
-        );
-        for (adjacent_index, place_id) in place.adjacent_place_ids.iter().enumerate() {
-            reject_text_by_policy(
-                place_id.as_str(),
-                format!("places[{index}].adjacent_place_ids[{adjacent_index}]"),
-                StringScanPolicy::Union,
-                errors,
-            );
-        }
-    }
-    for (index, door) in fixture.doors.iter().enumerate() {
-        reject_text_by_policy(
-            door.door_id.as_str(),
-            format!("doors[{index}].door_id"),
-            StringScanPolicy::Union,
-            errors,
-        );
-        reject_text_by_policy(
-            door.endpoint_a.as_str(),
-            format!("doors[{index}].endpoint_a"),
-            StringScanPolicy::Union,
-            errors,
-        );
-        reject_text_by_policy(
-            door.endpoint_b.as_str(),
-            format!("doors[{index}].endpoint_b"),
-            StringScanPolicy::Union,
-            errors,
-        );
-    }
-    for (index, container) in fixture.containers.iter().enumerate() {
-        reject_text_by_policy(
-            container.container_id.as_str(),
-            format!("containers[{index}].container_id"),
-            StringScanPolicy::Union,
-            errors,
-        );
-        reject_text_by_policy(
-            container.place_id.as_str(),
-            format!("containers[{index}].place_id"),
-            StringScanPolicy::Union,
-            errors,
-        );
-        for (content_index, item_id) in container.contents.iter().enumerate() {
-            reject_text_by_policy(
-                item_id.as_str(),
-                format!("containers[{index}].contents[{content_index}]"),
-                StringScanPolicy::Union,
-                errors,
-            );
-        }
-    }
-    for (index, item) in fixture.items.iter().enumerate() {
-        reject_text_by_policy(
-            item.item_id.as_str(),
-            format!("items[{index}].item_id"),
-            StringScanPolicy::Union,
-            errors,
-        );
-        reject_location_ids_by_policy(
-            &item.location,
-            format!("items[{index}].location"),
-            StringScanPolicy::Union,
-            errors,
-        );
-    }
-    for (index, affordance) in fixture.affordances.iter().enumerate() {
-        reject_text_by_policy(
-            affordance.action_id.as_str(),
-            format!("affordances[{index}].action_id"),
-            StringScanPolicy::Union,
-            errors,
-        );
-    }
-    for (index, belief) in fixture.initial_beliefs.iter().enumerate() {
-        reject_text_by_policy(
-            belief.belief_id.as_str(),
-            format!("initial_beliefs[{index}].belief_id"),
-            StringScanPolicy::Union,
-            errors,
-        );
-        reject_text_by_policy(
-            belief.holder_actor_id.as_str(),
-            format!("initial_beliefs[{index}].holder_actor_id"),
-            StringScanPolicy::Union,
-            errors,
-        );
-    }
-    for (index, need) in fixture.initial_needs.iter().enumerate() {
-        reject_text_by_policy(
-            need.actor_id.as_str(),
-            format!("initial_needs[{index}].actor_id"),
-            StringScanPolicy::Union,
-            errors,
-        );
-    }
-    for (index, home) in fixture.homes.iter().enumerate() {
-        reject_text_by_policy(
-            home.actor_id.as_str(),
-            format!("homes[{index}].actor_id"),
-            StringScanPolicy::Union,
-            errors,
-        );
-        reject_text_by_policy(
-            home.place_id.as_str(),
-            format!("homes[{index}].place_id"),
-            StringScanPolicy::Union,
-            errors,
-        );
-    }
-    for (index, sleep_place) in fixture.sleep_places.iter().enumerate() {
-        reject_text_by_policy(
-            sleep_place.actor_id.as_str(),
-            format!("sleep_places[{index}].actor_id"),
-            StringScanPolicy::Union,
-            errors,
-        );
-        reject_text_by_policy(
-            sleep_place.place_id.as_str(),
-            format!("sleep_places[{index}].place_id"),
-            StringScanPolicy::Union,
-            errors,
-        );
-        reject_text_by_policy(
-            sleep_place.sleep_place_id.as_str(),
-            format!("sleep_places[{index}].sleep_place_id"),
-            StringScanPolicy::Union,
-            errors,
-        );
-    }
-    for (index, food) in fixture.food_supplies.iter().enumerate() {
-        reject_text_by_policy(
-            food.food_supply_id.as_str(),
-            format!("food_supplies[{index}].food_supply_id"),
-            StringScanPolicy::Union,
-            errors,
-        );
-        reject_location_ids_by_policy(
-            &food.location,
-            format!("food_supplies[{index}].location"),
-            StringScanPolicy::Union,
-            errors,
-        );
-    }
-    for (index, edge) in fixture.known_food_sources.iter().enumerate() {
-        reject_text_by_policy(
-            edge.actor_id.as_str(),
-            format!("known_food_sources[{index}].actor_id"),
-            StringScanPolicy::Union,
-            errors,
-        );
-        reject_text_by_policy(
-            edge.food_supply_id.as_str(),
-            format!("known_food_sources[{index}].food_supply_id"),
-            StringScanPolicy::Union,
-            errors,
-        );
-    }
-    for (index, workplace) in fixture.workplaces.iter().enumerate() {
-        reject_text_by_policy(
-            workplace.workplace_id.as_str(),
-            format!("workplaces[{index}].workplace_id"),
-            StringScanPolicy::Union,
-            errors,
-        );
-        reject_text_by_policy(
-            workplace.place_id.as_str(),
-            format!("workplaces[{index}].place_id"),
-            StringScanPolicy::Union,
-            errors,
-        );
-        for (actor_index, actor_id) in workplace.assigned_actor_ids.iter().enumerate() {
-            reject_text_by_policy(
-                actor_id.as_str(),
-                format!("workplaces[{index}].assigned_actor_ids[{actor_index}]"),
-                StringScanPolicy::Union,
-                errors,
-            );
-        }
-    }
-    for (index, template) in fixture.routine_templates.iter().enumerate() {
-        reject_text_by_policy(
-            template.template_id.as_str(),
-            format!("routine_templates[{index}].template_id"),
-            StringScanPolicy::Union,
-            errors,
-        );
-    }
-    for (index, assignment) in fixture.routine_assignments.iter().enumerate() {
-        reject_text_by_policy(
-            assignment.actor_id.as_str(),
-            format!("routine_assignments[{index}].actor_id"),
-            StringScanPolicy::Union,
-            errors,
-        );
-        reject_text_by_policy(
-            assignment.template_id.as_str(),
-            format!("routine_assignments[{index}].template_id"),
-            StringScanPolicy::Union,
-            errors,
-        );
-    }
-    for (index, window) in fixture.day_windows.iter().enumerate() {
-        reject_text_by_policy(
-            window.actor_id.as_str(),
-            format!("day_windows[{index}].actor_id"),
-            StringScanPolicy::Union,
-            errors,
-        );
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn reject_location_ids_by_policy(
     location: &Location,
     path: String,
     policy: StringScanPolicy,
     errors: &mut Vec<ContentValidationError>,
 ) {

---- fixtures_load_location_embedded_marker_id_rejected_001 stdout ----

thread 'fixtures_load_location_embedded_marker_id_rejected_001' (23638) panicked at crates/tracewake-content/tests/fixtures_load.rs:1311:5:
assertion failed: failure.report.errors.iter().any(|error|
        {
            error.phase == ValidationPhase::NoScript &&
                    error.code == "authored_shortcut_effect" &&
                error.path == "food_supplies[0].location.place_id"
        })

failures:
    fixtures_load_location_embedded_marker_id_rejected_001

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
