*** crates/tracewake-content/src/validate.rs:214:29: replace + with - in validate_raw_lines

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace + with - in validate_raw_lines
@@ -206,17 +206,17 @@
                 "non_utf8",
                 "fixture source must be UTF-8",
             ));
             return errors;
         }
     };
 
     for (index, line) in text.lines().enumerate() {
-        let line_no = index + 1;
+        let line_no = index - /* ~ changed by cargo-mutants ~ */ 1;
         let tag = line.split('|').next().unwrap_or_default();
         if is_forbidden_key(tag) {
             let phase = if is_player_key(tag) {
                 ValidationPhase::NoPlayer
             } else {
                 ValidationPhase::NoScript
             };
             errors.push(ContentValidationError::new(

---- load::tests::shuffled_input_paths_load_to_same_canonical_world stdout ----

thread 'load::tests::shuffled_input_paths_load_to_same_canonical_world' (30442) panicked at crates/tracewake-content/src/validate.rs:214:23:
attempt to subtract with overflow

---- validate::tests::fixture_schema_v1_golden_bytes_load_001 stdout ----

thread 'validate::tests::fixture_schema_v1_golden_bytes_load_001' (30458) panicked at crates/tracewake-content/src/validate.rs:214:23:
attempt to subtract with overflow

---- validate::tests::fixture_schema_version_unsupported_rejected_001 stdout ----

thread 'validate::tests::fixture_schema_version_unsupported_rejected_001' (30459) panicked at crates/tracewake-content/src/validate.rs:214:23:
attempt to subtract with overflow

failures:
    load::tests::shuffled_input_paths_load_to_same_canonical_world
    validate::tests::fixture_food_supply_negative_servings_rejected_001
    validate::tests::fixture_schema_v1_golden_bytes_load_001
    validate::tests::fixture_schema_version_unsupported_rejected_001
    validate::tests::forbidden_player_and_script_forms_are_rejected_from_raw_content

test result: FAILED. 31 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
