*** crates/tracewake-content/src/validate.rs:214:29: replace + with * in validate_raw_lines

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace + with * in validate_raw_lines
@@ -206,17 +206,17 @@
                 "non_utf8",
                 "fixture source must be UTF-8",
             ));
             return errors;
         }
     };
 
     for (index, line) in text.lines().enumerate() {
-        let line_no = index + 1;
+        let line_no = index * /* ~ changed by cargo-mutants ~ */ 1;
         let tag = line.split('|').next().unwrap_or_default();
         if is_forbidden_key(tag) {
             let phase = if is_player_key(tag) {
                 ValidationPhase::NoPlayer
             } else {
                 ValidationPhase::NoScript
             };
             errors.push(ContentValidationError::new(

---- validator_branch_matrix_locks_fail_closed_validate_rs_guards stdout ----

thread 'validator_branch_matrix_locks_fail_closed_validate_rs_guards' (32606) panicked at crates/tracewake-content/tests/forbidden_content.rs:296:9:
validate.rs branch lock missing fragment: letline_no=index+1;

failures:
    validator_branch_matrix_locks_fail_closed_validate_rs_guards

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
