*** crates/tracewake-content/src/validate.rs:2371:5: replace reject_location_ids_by_policy with ()

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace reject_location_ids_by_policy with ()
@@ -2363,36 +2363,17 @@
 }
 
 fn reject_location_ids_by_policy(
     location: &Location,
     path: String,
     policy: StringScanPolicy,
     errors: &mut Vec<ContentValidationError>,
 ) {
-    match location {
-        Location::AtPlace(place_id) => reject_text_by_policy(
-            place_id.as_str(),
-            format!("{path}.place_id"),
-            policy,
-            errors,
-        ),
-        Location::InContainer(container_id) => reject_text_by_policy(
-            container_id.as_str(),
-            format!("{path}.container_id"),
-            policy,
-            errors,
-        ),
-        Location::CarriedBy(actor_id) => reject_text_by_policy(
-            actor_id.as_str(),
-            format!("{path}.actor_id"),
-            policy,
-            errors,
-        ),
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn planner_intended_seed_text(
     belief: &crate::schema::InitialBeliefSchema,
 ) -> impl Iterator<Item = String> + '_ {
     [
         belief.belief_id.as_str().to_string(),
         belief.proposition.serialize_canonical(),

---- fixtures_load_location_embedded_marker_id_rejected_001 stdout ----

thread 'fixtures_load_location_embedded_marker_id_rejected_001' (25744) panicked at crates/tracewake-content/tests/fixtures_load.rs:1311:5:
assertion failed: failure.report.errors.iter().any(|error|
        {
            error.phase == ValidationPhase::NoScript &&
                    error.code == "authored_shortcut_effect" &&
                error.path == "food_supplies[0].location.place_id"
        })

failures:
    fixtures_load_location_embedded_marker_id_rejected_001

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
