*** crates/tracewake-content/src/validate.rs:2396:5: replace planner_intended_seed_text -> impl Iterator<Item = String>+'_ with ::std::iter::once("xyzzy".into())

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace planner_intended_seed_text -> impl Iterator<Item = String>+'_ with ::std::iter::once("xyzzy".into())
@@ -2388,26 +2388,17 @@
             errors,
         ),
     }
 }
 
 fn planner_intended_seed_text(
     belief: &crate::schema::InitialBeliefSchema,
 ) -> impl Iterator<Item = String> + '_ {
-    [
-        belief.belief_id.as_str().to_string(),
-        belief.proposition.serialize_canonical(),
-        match &belief.source {
-            SourceRef::Event(event_id) => event_id.as_str().to_string(),
-            SourceRef::Action(action_id) => action_id.as_str().to_string(),
-            SourceRef::Cause(cause) => stable_event_cause_id(cause),
-        },
-    ]
-    .into_iter()
+    ::std::iter::once("xyzzy".into()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn stable_event_cause_id(cause: &EventCause) -> String {
     match cause {
         EventCause::Event(id) => format!("event:{}", id.as_str()),
         EventCause::Proposal(id) => format!("proposal:{}", id.as_str()),
         EventCause::ValidationReport(id) => format!("validation_report:{}", id.as_str()),
         EventCause::Process(id) => format!("process:{}", id.as_str()),

---- forbidden_content_planner_intended_initial_facts_require_provenance stdout ----

thread 'forbidden_content_planner_intended_initial_facts_require_provenance' (32150) panicked at crates/tracewake-content/tests/forbidden_content.rs:397:5:
assertion failed: missing.errors.iter().any(|error|
        {
            error.phase == ValidationPhase::NoScript &&
                error.code == "missing_actor_known_provenance"
        })

failures:
    forbidden_content_planner_intended_initial_facts_require_provenance

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
