*** crates/tracewake-content/src/validate.rs:2409:5: replace stable_event_cause_id -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace stable_event_cause_id -> String with "xyzzy".into()
@@ -2401,22 +2401,17 @@
             SourceRef::Action(action_id) => action_id.as_str().to_string(),
             SourceRef::Cause(cause) => stable_event_cause_id(cause),
         },
     ]
     .into_iter()
 }
 
 fn stable_event_cause_id(cause: &EventCause) -> String {
-    match cause {
-        EventCause::Event(id) => format!("event:{}", id.as_str()),
-        EventCause::Proposal(id) => format!("proposal:{}", id.as_str()),
-        EventCause::ValidationReport(id) => format!("validation_report:{}", id.as_str()),
-        EventCause::Process(id) => format!("process:{}", id.as_str()),
-    }
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 fn contains_planner_seed_marker(value: String) -> bool {
     let markers = [
         "actor_known",
         "planner_visible",
         "known_food",
         "known_route",

---- validator_branch_matrix_locks_fail_closed_validate_rs_guards stdout ----

thread 'validator_branch_matrix_locks_fail_closed_validate_rs_guards' (3953) panicked at crates/tracewake-content/tests/forbidden_content.rs:296:9:
validate.rs branch lock missing fragment: EventCause::Event(id)=>format!("event:{}",id.as_str())

failures:
    validator_branch_matrix_locks_fail_closed_validate_rs_guards

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
