*** crates/tracewake-content/src/validate.rs:2418:5: replace contains_planner_seed_marker -> bool with true

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace contains_planner_seed_marker -> bool with true
@@ -2410,27 +2410,17 @@
         EventCause::Event(id) => format!("event:{}", id.as_str()),
         EventCause::Proposal(id) => format!("proposal:{}", id.as_str()),
         EventCause::ValidationReport(id) => format!("validation_report:{}", id.as_str()),
         EventCause::Process(id) => format!("process:{}", id.as_str()),
     }
 }
 
 fn contains_planner_seed_marker(value: String) -> bool {
-    let markers = [
-        "actor_known",
-        "planner_visible",
-        "known_food",
-        "known_route",
-        "known_workplace",
-        "food_source",
-        "route_edge",
-        "workplace_access",
-    ];
-    markers.iter().any(|marker| value.contains(marker))
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn reject_text_by_policy(
     value: &str,
     path: String,
     policy: StringScanPolicy,
     errors: &mut Vec<ContentValidationError>,
 ) {

---- fixture_fingerprint_reprices_secondary_file_bytes stdout ----

thread 'fixture_fingerprint_reprices_secondary_file_bytes' (6031) panicked at crates/tracewake-content/tests/fixtures_load.rs:629:6:

---- fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture stdout ----

thread 'fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture' (6030) panicked at crates/tracewake-content/tests/fixtures_load.rs:661:6:

---- all_fixtures_load_deterministically_and_validate stdout ----

thread 'all_fixtures_load_deterministically_and_validate' (6028) panicked at crates/tracewake-content/tests/fixtures_load.rs:591:54:

failures:
    all_fixtures_load_deterministically_and_validate
    fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture
    fixture_fingerprint_reprices_secondary_file_bytes
    phase2a_fixtures_are_registered_and_script_free
    seed_event_log_order_and_projection_provenance_are_causal_and_stable
    valid_epistemic_seed_validates_and_round_trips_canonically

test result: FAILED. 28 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
