*** crates/tracewake-content/src/validate.rs:2418:5: replace contains_planner_seed_marker -> bool with false

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace contains_planner_seed_marker -> bool with false
@@ -2410,27 +2410,17 @@
         EventCause::Event(id) => format!("event:{}", id.as_str()),
         EventCause::Proposal(id) => format!("proposal:{}", id.as_str()),
         EventCause::ValidationReport(id) => format!("validation_report:{}", id.as_str()),
         EventCause::Process(id) => format!("process:{}", id.as_str()),
     }
 }
 
 fn contains_planner_seed_marker(value: String) -> bool {
-    let markers = [
-        "actor_known",
-        "planner_visible",
-        "known_food",
-        "known_route",
-        "known_workplace",
-        "food_source",
-        "route_edge",
-        "workplace_access",
-    ];
-    markers.iter().any(|marker| value.contains(marker))
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn reject_text_by_policy(
     value: &str,
     path: String,
     policy: StringScanPolicy,
     errors: &mut Vec<ContentValidationError>,
 ) {

---- forbidden_content_planner_intended_initial_facts_require_provenance stdout ----

thread 'forbidden_content_planner_intended_initial_facts_require_provenance' (8182) panicked at crates/tracewake-content/tests/forbidden_content.rs:397:5:
assertion failed: missing.errors.iter().any(|error|
        {
            error.phase == ValidationPhase::NoScript &&
                error.code == "missing_actor_known_provenance"
        })

failures:
    forbidden_content_planner_intended_initial_facts_require_provenance

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
