*** crates/tracewake-content/src/validate.rs:2437:5: replace reject_text_by_policy with ()

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace reject_text_by_policy with ()
@@ -2429,22 +2429,17 @@
 }
 
 fn reject_text_by_policy(
     value: &str,
     path: String,
     policy: StringScanPolicy,
     errors: &mut Vec<ContentValidationError>,
 ) {
-    match policy {
-        StringScanPolicy::Union => {
-            reject_script_marker_text(value, path.clone(), errors);
-            reject_shortcut_text(value, path, errors);
-        }
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn reject_script_marker_text(value: &str, path: String, errors: &mut Vec<ContentValidationError>) {
     if contains_authored_outcome_marker(value) {
         errors.push(ContentValidationError::new(
             ValidationPhase::NoScript,
             path,
             "authored_outcome_chain",

---- validate::tests::display_label_script_marker_is_rejected stdout ----

thread 'validate::tests::display_label_script_marker_is_rejected' (10238) panicked at crates/tracewake-content/src/validate.rs:3265:62:

---- validate::tests::fixture_output_tag_script_marker_rejected_001 stdout ----

thread 'validate::tests::fixture_output_tag_script_marker_rejected_001' (10243) panicked at crates/tracewake-content/src/validate.rs:3277:62:

---- validate::tests::phase3a_routine_shortcut_effects_are_rejected stdout ----

thread 'validate::tests::phase3a_routine_shortcut_effects_are_rejected' (10252) panicked at crates/tracewake-content/src/validate.rs:3766:13:

failures:
    validate::tests::display_label_script_marker_is_rejected
    validate::tests::fixture_output_tag_script_marker_rejected_001
    validate::tests::phase3a_routine_shortcut_effects_are_rejected

test result: FAILED. 33 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
