*** crates/tracewake-content/src/validate.rs:243:44: replace && with || in validate_raw_lines

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace && with || in validate_raw_lines
@@ -235,17 +235,17 @@
             if contains_prose_born_fact_marker(line) {
                 errors.push(ContentValidationError::new(
                     ValidationPhase::NoScript,
                     format!("line[{line_no}].{tag}"),
                     "prose_born_fact",
                     "prose or notes must not imply culprit, outcome, or hidden truth facts",
                 ));
             }
-            if tag.starts_with("routine_") && contains_direct_state_or_script_marker(line) {
+            if tag.starts_with("routine_") || /* ~ changed by cargo-mutants ~ */ contains_direct_state_or_script_marker(line) {
                 errors.push(ContentValidationError::new(
                     ValidationPhase::NoScript,
                     format!("line[{line_no}].{tag}"),
                     "authored_shortcut_effect",
                     format!("unknown routine content section {tag} contains behavior shortcut"),
                 ));
             }
         }

---- validator_branch_matrix_locks_fail_closed_validate_rs_guards stdout ----

thread 'validator_branch_matrix_locks_fail_closed_validate_rs_guards' (2269) panicked at crates/tracewake-content/tests/forbidden_content.rs:296:9:
validate.rs branch lock missing fragment: tag.starts_with("routine_")&&contains_direct_state_or_script_marker(line)

failures:
    validator_branch_matrix_locks_fail_closed_validate_rs_guards

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
