*** crates/tracewake-content/src/validate.rs:2446:5: replace reject_script_marker_text with ()

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace reject_script_marker_text with ()
@@ -2438,24 +2438,17 @@
         StringScanPolicy::Union => {
             reject_script_marker_text(value, path.clone(), errors);
             reject_shortcut_text(value, path, errors);
         }
     }
 }
 
 fn reject_script_marker_text(value: &str, path: String, errors: &mut Vec<ContentValidationError>) {
-    if contains_authored_outcome_marker(value) {
-        errors.push(ContentValidationError::new(
-            ValidationPhase::NoScript,
-            path,
-            "authored_outcome_chain",
-            format!("authored outcome-chain marker {value} is forbidden"),
-        ));
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn contains_authored_outcome_marker(value: &str) -> bool {
     let markers = [
         "guaranteed_success",
         "always_succeeds",
         "success_without_action",
         "without_pipeline",

---- validate::tests::fixture_output_tag_script_marker_rejected_001 stdout ----

thread 'validate::tests::fixture_output_tag_script_marker_rejected_001' (12314) panicked at crates/tracewake-content/src/validate.rs:3275:62:

---- validate::tests::display_label_script_marker_is_rejected stdout ----

thread 'validate::tests::display_label_script_marker_is_rejected' (12309) panicked at crates/tracewake-content/src/validate.rs:3263:62:

failures:
    validate::tests::display_label_script_marker_is_rejected
    validate::tests::fixture_output_tag_script_marker_rejected_001

test result: FAILED. 34 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
