*** crates/tracewake-content/src/validate.rs:2457:5: replace contains_authored_outcome_marker -> bool with true

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace contains_authored_outcome_marker -> bool with true
@@ -2449,34 +2449,17 @@
             path,
             "authored_outcome_chain",
             format!("authored outcome-chain marker {value} is forbidden"),
         ));
     }
 }
 
 fn contains_authored_outcome_marker(value: &str) -> bool {
-    let markers = [
-        "guaranteed_success",
-        "always_succeeds",
-        "success_without_action",
-        "without_pipeline",
-        "synthetic_action_chain",
-        "acceptance_marker",
-        "debug_acceptance",
-        "expected_final_event",
-        "player_conditioned",
-        "protagonist_conditioned",
-        "player_only",
-        "protagonist_only",
-    ];
-    markers.iter().any(|marker| value.contains(marker))
-        || value
-            .split(|character: char| !character.is_ascii_alphanumeric() && character != '_')
-            .any(|token| is_script_key(token) || is_player_key(token))
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn validate_phase3a_no_shortcuts(
     fixture: &FixtureSchema,
     errors: &mut Vec<ContentValidationError>,
 ) {
     for (index, sleep_place) in fixture.sleep_places.iter().enumerate() {
         reject_shortcut_text(

---- load::tests::shuffled_input_paths_load_to_same_canonical_world stdout ----

thread 'load::tests::shuffled_input_paths_load_to_same_canonical_world' (14371) panicked at crates/tracewake-content/src/load.rs:509:10:

---- validate::tests::fixture_schema_v1_golden_bytes_load_001 stdout ----

thread 'validate::tests::fixture_schema_v1_golden_bytes_load_001' (14387) panicked at crates/tracewake-content/src/validate.rs:3070:81:

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (14399) panicked at crates/tracewake-content/src/validate.rs:3633:59:

failures:
    load::tests::shuffled_input_paths_load_to_same_canonical_world
    validate::tests::fixture_schema_v1_golden_bytes_load_001
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 31 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
