*** crates/tracewake-content/src/validate.rs:2457:5: replace contains_authored_outcome_marker -> bool with false

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace contains_authored_outcome_marker -> bool with false
@@ -2449,34 +2449,17 @@
             path,
             "authored_outcome_chain",
             format!("authored outcome-chain marker {value} is forbidden"),
         ));
     }
 }
 
 fn contains_authored_outcome_marker(value: &str) -> bool {
-    let markers = [
-        "guaranteed_success",
-        "always_succeeds",
-        "success_without_action",
-        "without_pipeline",
-        "synthetic_action_chain",
-        "acceptance_marker",
-        "debug_acceptance",
-        "expected_final_event",
-        "player_conditioned",
-        "protagonist_conditioned",
-        "player_only",
-        "protagonist_only",
-    ];
-    markers.iter().any(|marker| value.contains(marker))
-        || value
-            .split(|character: char| !character.is_ascii_alphanumeric() && character != '_')
-            .any(|token| is_script_key(token) || is_player_key(token))
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn validate_phase3a_no_shortcuts(
     fixture: &FixtureSchema,
     errors: &mut Vec<ContentValidationError>,
 ) {
     for (index, sleep_place) in fixture.sleep_places.iter().enumerate() {
         reject_shortcut_text(

---- validate::tests::display_label_script_marker_is_rejected stdout ----

thread 'validate::tests::display_label_script_marker_is_rejected' (16451) panicked at crates/tracewake-content/src/validate.rs:3253:62:

---- validate::tests::fixture_output_tag_script_marker_rejected_001 stdout ----

thread 'validate::tests::fixture_output_tag_script_marker_rejected_001' (16456) panicked at crates/tracewake-content/src/validate.rs:3265:62:

failures:
    validate::tests::display_label_script_marker_is_rejected
    validate::tests::fixture_output_tag_script_marker_rejected_001

test result: FAILED. 34 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
