*** crates/tracewake-content/src/validate.rs:2472:9: replace || with && in contains_authored_outcome_marker

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace || with && in contains_authored_outcome_marker
@@ -2464,17 +2464,17 @@
         "debug_acceptance",
         "expected_final_event",
         "player_conditioned",
         "protagonist_conditioned",
         "player_only",
         "protagonist_only",
     ];
     markers.iter().any(|marker| value.contains(marker))
-        || value
+        && /* ~ changed by cargo-mutants ~ */ value
             .split(|character: char| !character.is_ascii_alphanumeric() && character != '_')
             .any(|token| is_script_key(token) || is_player_key(token))
 }
 
 fn validate_phase3a_no_shortcuts(
     fixture: &FixtureSchema,
     errors: &mut Vec<ContentValidationError>,
 ) {

---- forbidden_content_acceptance_gaming_debug_labels_are_rejected stdout ----

thread 'forbidden_content_acceptance_gaming_debug_labels_are_rejected' (18586) panicked at crates/tracewake-content/tests/forbidden_content.rs:415:58:

---- forbidden_content_outcome_chain_routine_markers_are_rejected stdout ----

thread 'forbidden_content_outcome_chain_routine_markers_are_rejected' (18593) panicked at crates/tracewake-content/tests/forbidden_content.rs:383:58:

---- forbidden_content_player_conditioned_ordinary_life_markers_are_rejected stdout ----

thread 'forbidden_content_player_conditioned_ordinary_life_markers_are_rejected' (18598) panicked at crates/tracewake-content/tests/forbidden_content.rs:430:5:
assertion failed: report.errors.iter().any(|error|
        {
            error.phase == ValidationPhase::NoScript &&
                error.code == "authored_outcome_chain"
        })

failures:
    forbidden_content_acceptance_gaming_debug_labels_are_rejected
    forbidden_content_outcome_chain_routine_markers_are_rejected
    forbidden_content_player_conditioned_ordinary_life_markers_are_rejected
    forbidden_content_success_implying_routine_step_names_are_rejected
    validator_branch_matrix_locks_fail_closed_validate_rs_guards

test result: FAILED. 19 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
