*** crates/tracewake-content/src/validate.rs:2474:47: replace || with && in contains_authored_outcome_marker

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace || with && in contains_authored_outcome_marker
@@ -2466,17 +2466,17 @@
         "player_conditioned",
         "protagonist_conditioned",
         "player_only",
         "protagonist_only",
     ];
     markers.iter().any(|marker| value.contains(marker))
         || value
             .split(|character: char| !character.is_ascii_alphanumeric() && character != '_')
-            .any(|token| is_script_key(token) || is_player_key(token))
+            .any(|token| is_script_key(token) && /* ~ changed by cargo-mutants ~ */ is_player_key(token))
 }
 
 fn validate_phase3a_no_shortcuts(
     fixture: &FixtureSchema,
     errors: &mut Vec<ContentValidationError>,
 ) {
     for (index, sleep_place) in fixture.sleep_places.iter().enumerate() {
         reject_shortcut_text(

---- validator_branch_matrix_locks_fail_closed_validate_rs_guards stdout ----

thread 'validator_branch_matrix_locks_fail_closed_validate_rs_guards' (27130) panicked at crates/tracewake-content/tests/forbidden_content.rs:296:9:
validate.rs branch lock missing fragment: markers.iter().any(|marker|value.contains(marker))||value.split(|character:char|!character.is_ascii_alphanumeric()&&character!='_').any(|token|is_script_key(token)||is_player_key(token))

failures:
    validator_branch_matrix_locks_fail_closed_validate_rs_guards

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
