*** crates/tracewake-content/src/validate.rs:2543:5: replace reject_shortcut_text with ()

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace reject_shortcut_text with ()
@@ -2535,27 +2535,17 @@
                 format!("routine_templates[{template_index}].reservable_resource"),
                 errors,
             );
         }
     }
 }
 
 fn reject_shortcut_text(value: &str, path: String, errors: &mut Vec<ContentValidationError>) {
-    if value
-        .split(|character: char| !character.is_ascii_alphanumeric() && character != '_')
-        .any(is_phase3a_shortcut_marker)
-    {
-        errors.push(ContentValidationError::new(
-            ValidationPhase::NoScript,
-            path,
-            "authored_shortcut_effect",
-            format!("Phase 3A shortcut marker {value} is forbidden"),
-        ));
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn validate_epistemic_seeds(
     fixture: &FixtureSchema,
     registry: &ActionRegistry,
     errors: &mut Vec<ContentValidationError>,
 ) {
     for (index, belief) in fixture.initial_beliefs.iter().enumerate() {

---- validate::tests::phase3a_routine_shortcut_effects_are_rejected stdout ----

thread 'validate::tests::phase3a_routine_shortcut_effects_are_rejected' (31262) panicked at crates/tracewake-content/src/validate.rs:3761:13:

failures:
    validate::tests::phase3a_routine_shortcut_effects_are_rejected

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
