*** crates/tracewake-content/src/validate.rs:2544:82: replace != with == in reject_shortcut_text

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace != with == in reject_shortcut_text
@@ -2536,17 +2536,17 @@
                 errors,
             );
         }
     }
 }
 
 fn reject_shortcut_text(value: &str, path: String, errors: &mut Vec<ContentValidationError>) {
     if value
-        .split(|character: char| !character.is_ascii_alphanumeric() && character != '_')
+        .split(|character: char| !character.is_ascii_alphanumeric() && character == /* ~ changed by cargo-mutants ~ */ '_')
         .any(is_phase3a_shortcut_marker)
     {
         errors.push(ContentValidationError::new(
             ValidationPhase::NoScript,
             path,
             "authored_shortcut_effect",
             format!("Phase 3A shortcut marker {value} is forbidden"),
         ));

---- validate::tests::phase3a_routine_shortcut_effects_are_rejected stdout ----

thread 'validate::tests::phase3a_routine_shortcut_effects_are_rejected' (5007) panicked at crates/tracewake-content/src/validate.rs:3771:13:

failures:
    validate::tests::phase3a_routine_shortcut_effects_are_rejected

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
