*** crates/tracewake-content/src/validate.rs:2561:5: replace validate_epistemic_seeds with ()

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace validate_epistemic_seeds with ()
@@ -2553,115 +2553,17 @@
     }
 }
 
 fn validate_epistemic_seeds(
     fixture: &FixtureSchema,
     registry: &ActionRegistry,
     errors: &mut Vec<ContentValidationError>,
 ) {
-    for (index, belief) in fixture.initial_beliefs.iter().enumerate() {
-        if belief.schema_version.as_str() != EPISTEMIC_RECORD_SCHEMA_V1 {
-            errors.push(ContentValidationError::new(
-                ValidationPhase::EpistemicSeed,
-                format!("initial_beliefs[{index}].schema_version"),
-                "unsupported_epistemic_schema_version",
-                format!(
-                    "unsupported epistemic schema version {}",
-                    belief.schema_version.as_str()
-                ),
-            ));
-        }
-        if !(0..=1000).contains(&belief.confidence.parts_per_thousand()) {
-            errors.push(ContentValidationError::new(
-                ValidationPhase::EpistemicSeed,
-                format!("initial_beliefs[{index}].confidence"),
-                "bad_confidence",
-                "belief confidence must be 0..=1000",
-            ));
-        }
-        match &belief.privacy_scope {
-            PrivacyScope::ActorPrivate(actor_id) if actor_id == &belief.holder_actor_id => {}
-            PrivacyScope::ActorPrivate(actor_id) => errors.push(ContentValidationError::new(
-                ValidationPhase::EpistemicSeed,
-                format!("initial_beliefs[{index}].privacy_scope"),
-                "cross_actor_seed_scope",
-                format!(
-                    "belief holder {} must not receive actor-private scope for {}",
-                    belief.holder_actor_id.as_str(),
-                    actor_id.as_str()
-                ),
-            )),
-            PrivacyScope::PublicPlaceholder | PrivacyScope::InstitutionPlaceholder(_) => {
-                errors.push(ContentValidationError::new(
-                    ValidationPhase::EpistemicSeed,
-                    format!("initial_beliefs[{index}].privacy_scope"),
-                    "unsupported_seed_scope",
-                    "initial belief seeds must be actor-private in Phase 2A",
-                ));
-            }
-        }
-        if let Some(last_verified_tick) = belief.last_verified_tick {
-            if last_verified_tick < belief.acquired_tick {
-                errors.push(ContentValidationError::new(
-                    ValidationPhase::EpistemicSeed,
-                    format!("initial_beliefs[{index}].last_verified_tick"),
-                    "bad_tick_order",
-                    "last_verified_tick must not precede acquired_tick",
-                ));
-            }
-        }
-        match &belief.source {
-            SourceRef::Event(event_id)
-                if belief.source_kind == InitialBeliefSourceKind::AuthoredPrehistory =>
-            {
-                if is_forbidden_key(event_id.as_str())
-                    || contains_direct_state_or_script_marker(event_id.as_str())
-                {
-                    errors.push(ContentValidationError::new(
-                        ValidationPhase::NoScript,
-                        format!("initial_beliefs[{index}].source_id"),
-                        "shortcut_truth_field",
-                        format!("forbidden shortcut-truth source {}", event_id.as_str()),
-                    ));
-                }
-            }
-            SourceRef::Event(_) | SourceRef::Action(_) | SourceRef::Cause(_) => {
-                errors.push(ContentValidationError::new(
-                    ValidationPhase::EpistemicSeed,
-                    format!("initial_beliefs[{index}].source_kind"),
-                    "unsupported_source_kind",
-                    "initial belief seeds must use authored_prehistory event source references",
-                ))
-            }
-        }
-        if let SourceRef::Action(action_id) = &belief.source {
-            if registry.get(action_id).is_none() {
-                errors.push(ContentValidationError::new(
-                    ValidationPhase::EpistemicSeed,
-                    format!("initial_beliefs[{index}].source_id"),
-                    "unknown_action_source",
-                    format!(
-                        "belief source action {} is not registered",
-                        action_id.as_str()
-                    ),
-                ));
-            }
-        }
-        if matches!(&belief.source, SourceRef::Cause(_)) {
-            errors.push(ContentValidationError::new(
-                ValidationPhase::EpistemicSeed,
-                format!("initial_beliefs[{index}].source_kind"),
-                "unsupported_source_kind",
-                "initial belief seeds must use authored_prehistory event source references",
-            ));
-        }
-
-        let _belief = belief.to_belief();
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn validate_determinism(fixture: &FixtureSchema, errors: &mut Vec<ContentValidationError>) {
     for (index, place) in fixture.places.iter().enumerate() {
         if !is_sorted_unique(&place.adjacent_place_ids) {
             errors.push(ContentValidationError::new(
                 ValidationPhase::DeterminismHazard,
                 format!("places[{index}].adjacent_place_ids"),

---- forbidden_content_hidden_truth_source_cannot_seed_actor_known_planner_input stdout ----

thread 'forbidden_content_hidden_truth_source_cannot_seed_actor_known_planner_input' (7132) panicked at crates/tracewake-content/tests/forbidden_content.rs:482:5:
assertion failed: report.errors.iter().any(|error|
        {
            error.phase == ValidationPhase::NoScript &&
                    error.code == "shortcut_truth_field" &&
                error.path.contains("source_id")
        })

---- forbidden_content_epistemic_seed_reference_duplicate_and_version_failures_are_blocking stdout ----

thread 'forbidden_content_epistemic_seed_reference_duplicate_and_version_failures_are_blocking' (7131) panicked at crates/tracewake-content/tests/forbidden_content.rs:547:5:
assertion failed: version.errors.iter().any(|error|
        error.code == "unsupported_epistemic_schema_version")

---- validator_branch_matrix_locks_fail_closed_validate_rs_guards stdout ----

thread 'validator_branch_matrix_locks_fail_closed_validate_rs_guards' (7149) panicked at crates/tracewake-content/tests/forbidden_content.rs:296:9:
validate.rs branch lock missing fragment: PrivacyScope::ActorPrivate(actor_id)ifactor_id==&belief.holder_actor_id=>{}

failures:
    forbidden_content_epistemic_seed_reference_duplicate_and_version_failures_are_blocking
    forbidden_content_hidden_truth_source_cannot_seed_actor_known_planner_input
    validator_branch_matrix_locks_fail_closed_validate_rs_guards

test result: FAILED. 21 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
