*** crates/tracewake-content/src/validate.rs:2562:43: replace != with == in validate_epistemic_seeds

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace != with == in validate_epistemic_seeds
@@ -2554,17 +2554,17 @@
 }
 
 fn validate_epistemic_seeds(
     fixture: &FixtureSchema,
     registry: &ActionRegistry,
     errors: &mut Vec<ContentValidationError>,
 ) {
     for (index, belief) in fixture.initial_beliefs.iter().enumerate() {
-        if belief.schema_version.as_str() != EPISTEMIC_RECORD_SCHEMA_V1 {
+        if belief.schema_version.as_str() == /* ~ changed by cargo-mutants ~ */ EPISTEMIC_RECORD_SCHEMA_V1 {
             errors.push(ContentValidationError::new(
                 ValidationPhase::EpistemicSeed,
                 format!("initial_beliefs[{index}].schema_version"),
                 "unsupported_epistemic_schema_version",
                 format!(
                     "unsupported epistemic schema version {}",
                     belief.schema_version.as_str()
                 ),

---- fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture stdout ----

thread 'fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture' (9225) panicked at crates/tracewake-content/tests/fixtures_load.rs:661:6:

---- fixture_fingerprint_reprices_secondary_file_bytes stdout ----

thread 'fixture_fingerprint_reprices_secondary_file_bytes' (9226) panicked at crates/tracewake-content/tests/fixtures_load.rs:629:6:

---- valid_epistemic_seed_validates_and_round_trips_canonically stdout ----

thread 'valid_epistemic_seed_validates_and_round_trips_canonically' (9255) panicked at crates/tracewake-content/tests/fixtures_load.rs:1708:52:

failures:
    all_fixtures_load_deterministically_and_validate
    fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture
    fixture_fingerprint_reprices_secondary_file_bytes
    phase2a_fixtures_are_registered_and_script_free
    seed_event_log_order_and_projection_provenance_are_causal_and_stable
    valid_epistemic_seed_validates_and_round_trips_canonically

test result: FAILED. 28 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
