*** crates/tracewake-content/src/validate.rs:2573:12: delete ! in validate_epistemic_seeds

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ delete ! in validate_epistemic_seeds
@@ -2565,17 +2565,17 @@
                 format!("initial_beliefs[{index}].schema_version"),
                 "unsupported_epistemic_schema_version",
                 format!(
                     "unsupported epistemic schema version {}",
                     belief.schema_version.as_str()
                 ),
             ));
         }
-        if !(0..=1000).contains(&belief.confidence.parts_per_thousand()) {
+        if  /* ~ changed by cargo-mutants ~ */(0..=1000).contains(&belief.confidence.parts_per_thousand()) {
             errors.push(ContentValidationError::new(
                 ValidationPhase::EpistemicSeed,
                 format!("initial_beliefs[{index}].confidence"),
                 "bad_confidence",
                 "belief confidence must be 0..=1000",
             ));
         }
         match &belief.privacy_scope {

---- fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture stdout ----

thread 'fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture' (11331) panicked at crates/tracewake-content/tests/fixtures_load.rs:661:6:

---- fixture_fingerprint_reprices_secondary_file_bytes stdout ----

thread 'fixture_fingerprint_reprices_secondary_file_bytes' (11332) panicked at crates/tracewake-content/tests/fixtures_load.rs:629:6:

---- seed_event_log_order_and_projection_provenance_are_causal_and_stable stdout ----

thread 'seed_event_log_order_and_projection_provenance_are_causal_and_stable' (11356) panicked at crates/tracewake-content/tests/fixtures_load.rs:920:74:

failures:
    all_fixtures_load_deterministically_and_validate
    fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture
    fixture_fingerprint_reprices_secondary_file_bytes
    phase2a_fixtures_are_registered_and_script_free
    seed_event_log_order_and_projection_provenance_are_causal_and_stable
    valid_epistemic_seed_validates_and_round_trips_canonically

test result: FAILED. 28 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
