*** crates/tracewake-content/src/validate.rs:2582:53: replace match guard actor_id == &belief.holder_actor_id with true in validate_epistemic_seeds

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace match guard actor_id == &belief.holder_actor_id with true in validate_epistemic_seeds
@@ -2574,17 +2574,17 @@
             errors.push(ContentValidationError::new(
                 ValidationPhase::EpistemicSeed,
                 format!("initial_beliefs[{index}].confidence"),
                 "bad_confidence",
                 "belief confidence must be 0..=1000",
             ));
         }
         match &belief.privacy_scope {
-            PrivacyScope::ActorPrivate(actor_id) if actor_id == &belief.holder_actor_id => {}
+            PrivacyScope::ActorPrivate(actor_id) if true /* ~ changed by cargo-mutants ~ */ => {}
             PrivacyScope::ActorPrivate(actor_id) => errors.push(ContentValidationError::new(
                 ValidationPhase::EpistemicSeed,
                 format!("initial_beliefs[{index}].privacy_scope"),
                 "cross_actor_seed_scope",
                 format!(
                     "belief holder {} must not receive actor-private scope for {}",
                     belief.holder_actor_id.as_str(),
                     actor_id.as_str()

---- validator_branch_matrix_locks_fail_closed_validate_rs_guards stdout ----

thread 'validator_branch_matrix_locks_fail_closed_validate_rs_guards' (13492) panicked at crates/tracewake-content/tests/forbidden_content.rs:296:9:
validate.rs branch lock missing fragment: PrivacyScope::ActorPrivate(actor_id)ifactor_id==&belief.holder_actor_id=>{}

failures:
    validator_branch_matrix_locks_fail_closed_validate_rs_guards

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
