*** crates/tracewake-content/src/validate.rs:2582:62: replace == with != in validate_epistemic_seeds

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace == with != in validate_epistemic_seeds
@@ -2574,17 +2574,17 @@
             errors.push(ContentValidationError::new(
                 ValidationPhase::EpistemicSeed,
                 format!("initial_beliefs[{index}].confidence"),
                 "bad_confidence",
                 "belief confidence must be 0..=1000",
             ));
         }
         match &belief.privacy_scope {
-            PrivacyScope::ActorPrivate(actor_id) if actor_id == &belief.holder_actor_id => {}
+            PrivacyScope::ActorPrivate(actor_id) if actor_id != /* ~ changed by cargo-mutants ~ */ &belief.holder_actor_id => {}
             PrivacyScope::ActorPrivate(actor_id) => errors.push(ContentValidationError::new(
                 ValidationPhase::EpistemicSeed,
                 format!("initial_beliefs[{index}].privacy_scope"),
                 "cross_actor_seed_scope",
                 format!(
                     "belief holder {} must not receive actor-private scope for {}",
                     belief.holder_actor_id.as_str(),
                     actor_id.as_str()

---- fixture_fingerprint_reprices_secondary_file_bytes stdout ----

thread 'fixture_fingerprint_reprices_secondary_file_bytes' (17675) panicked at crates/tracewake-content/tests/fixtures_load.rs:629:6:

---- fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture stdout ----

thread 'fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture' (17674) panicked at crates/tracewake-content/tests/fixtures_load.rs:661:6:

---- seed_event_log_order_and_projection_provenance_are_causal_and_stable stdout ----

thread 'seed_event_log_order_and_projection_provenance_are_causal_and_stable' (17699) panicked at crates/tracewake-content/tests/fixtures_load.rs:920:74:

failures:
    all_fixtures_load_deterministically_and_validate
    fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture
    fixture_fingerprint_reprices_secondary_file_bytes
    phase2a_fixtures_are_registered_and_script_free
    seed_event_log_order_and_projection_provenance_are_causal_and_stable
    valid_epistemic_seed_validates_and_round_trips_canonically

test result: FAILED. 28 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
