*** crates/tracewake-content/src/validate.rs:2603:35: replace < with > in validate_epistemic_seeds

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace < with > in validate_epistemic_seeds
@@ -2595,17 +2595,17 @@
                     ValidationPhase::EpistemicSeed,
                     format!("initial_beliefs[{index}].privacy_scope"),
                     "unsupported_seed_scope",
                     "initial belief seeds must be actor-private in Phase 2A",
                 ));
             }
         }
         if let Some(last_verified_tick) = belief.last_verified_tick {
-            if last_verified_tick < belief.acquired_tick {
+            if last_verified_tick > /* ~ changed by cargo-mutants ~ */ belief.acquired_tick {
                 errors.push(ContentValidationError::new(
                     ValidationPhase::EpistemicSeed,
                     format!("initial_beliefs[{index}].last_verified_tick"),
                     "bad_tick_order",
                     "last_verified_tick must not precede acquired_tick",
                 ));
             }
         }

---- validator_branch_matrix_locks_fail_closed_validate_rs_guards stdout ----

thread 'validator_branch_matrix_locks_fail_closed_validate_rs_guards' (21966) panicked at crates/tracewake-content/tests/forbidden_content.rs:296:9:
validate.rs branch lock missing fragment: iflast_verified_tick<belief.acquired_tick{

failures:
    validator_branch_matrix_locks_fail_closed_validate_rs_guards

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
