*** crates/tracewake-content/src/validate.rs:2614:20: replace match guard belief.source_kind == InitialBeliefSourceKind::AuthoredPrehistory with true in validate_epistemic_seeds

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace match guard belief.source_kind == InitialBeliefSourceKind::AuthoredPrehistory with true in validate_epistemic_seeds
@@ -2606,17 +2606,17 @@
                     format!("initial_beliefs[{index}].last_verified_tick"),
                     "bad_tick_order",
                     "last_verified_tick must not precede acquired_tick",
                 ));
             }
         }
         match &belief.source {
             SourceRef::Event(event_id)
-                if belief.source_kind == InitialBeliefSourceKind::AuthoredPrehistory =>
+                if true /* ~ changed by cargo-mutants ~ */ =>
             {
                 if is_forbidden_key(event_id.as_str())
                     || contains_direct_state_or_script_marker(event_id.as_str())
                 {
                     errors.push(ContentValidationError::new(
                         ValidationPhase::NoScript,
                         format!("initial_beliefs[{index}].source_id"),
                         "shortcut_truth_field",

---- validator_branch_matrix_locks_fail_closed_validate_rs_guards stdout ----

thread 'validator_branch_matrix_locks_fail_closed_validate_rs_guards' (26228) panicked at crates/tracewake-content/tests/forbidden_content.rs:296:9:
validate.rs branch lock missing fragment: ifbelief.source_kind==InitialBeliefSourceKind::AuthoredPrehistory

failures:
    validator_branch_matrix_locks_fail_closed_validate_rs_guards

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
