*** crates/tracewake-content/src/validate.rs:2614:39: replace == with != in validate_epistemic_seeds

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace == with != in validate_epistemic_seeds
@@ -2606,17 +2606,17 @@
                     format!("initial_beliefs[{index}].last_verified_tick"),
                     "bad_tick_order",
                     "last_verified_tick must not precede acquired_tick",
                 ));
             }
         }
         match &belief.source {
             SourceRef::Event(event_id)
-                if belief.source_kind == InitialBeliefSourceKind::AuthoredPrehistory =>
+                if belief.source_kind != /* ~ changed by cargo-mutants ~ */ InitialBeliefSourceKind::AuthoredPrehistory =>
             {
                 if is_forbidden_key(event_id.as_str())
                     || contains_direct_state_or_script_marker(event_id.as_str())
                 {
                     errors.push(ContentValidationError::new(
                         ValidationPhase::NoScript,
                         format!("initial_beliefs[{index}].source_id"),
                         "shortcut_truth_field",

---- fixture_fingerprint_reprices_secondary_file_bytes stdout ----

thread 'fixture_fingerprint_reprices_secondary_file_bytes' (30411) panicked at crates/tracewake-content/tests/fixtures_load.rs:629:6:

---- fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture stdout ----

thread 'fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture' (30410) panicked at crates/tracewake-content/tests/fixtures_load.rs:661:6:

---- seed_event_log_order_and_projection_provenance_are_causal_and_stable stdout ----

thread 'seed_event_log_order_and_projection_provenance_are_causal_and_stable' (30435) panicked at crates/tracewake-content/tests/fixtures_load.rs:920:74:

failures:
    all_fixtures_load_deterministically_and_validate
    fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture
    fixture_fingerprint_reprices_secondary_file_bytes
    phase2a_fixtures_are_registered_and_script_free
    seed_event_log_order_and_projection_provenance_are_causal_and_stable
    valid_epistemic_seed_validates_and_round_trips_canonically

test result: FAILED. 28 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
