*** crates/tracewake-content/src/validate.rs:2617:21: replace || with && in validate_epistemic_seeds

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace || with && in validate_epistemic_seeds
@@ -2609,17 +2609,17 @@
                 ));
             }
         }
         match &belief.source {
             SourceRef::Event(event_id)
                 if belief.source_kind == InitialBeliefSourceKind::AuthoredPrehistory =>
             {
                 if is_forbidden_key(event_id.as_str())
-                    || contains_direct_state_or_script_marker(event_id.as_str())
+                    && /* ~ changed by cargo-mutants ~ */ contains_direct_state_or_script_marker(event_id.as_str())
                 {
                     errors.push(ContentValidationError::new(
                         ValidationPhase::NoScript,
                         format!("initial_beliefs[{index}].source_id"),
                         "shortcut_truth_field",
                         format!("forbidden shortcut-truth source {}", event_id.as_str()),
                     ));
                 }

---- forbidden_content_hidden_truth_source_cannot_seed_actor_known_planner_input stdout ----

thread 'forbidden_content_hidden_truth_source_cannot_seed_actor_known_planner_input' (32554) panicked at crates/tracewake-content/tests/forbidden_content.rs:482:5:
assertion failed: report.errors.iter().any(|error|
        {
            error.phase == ValidationPhase::NoScript &&
                    error.code == "shortcut_truth_field" &&
                error.path.contains("source_id")
        })

failures:
    forbidden_content_hidden_truth_source_cannot_seed_actor_known_planner_input

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
