*** crates/tracewake-content/src/validate.rs:2663:5: replace validate_determinism with ()

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace validate_determinism with ()
@@ -2655,48 +2655,17 @@
             ));
         }
 
         let _belief = belief.to_belief();
     }
 }
 
 fn validate_determinism(fixture: &FixtureSchema, errors: &mut Vec<ContentValidationError>) {
-    for (index, place) in fixture.places.iter().enumerate() {
-        if !is_sorted_unique(&place.adjacent_place_ids) {
-            errors.push(ContentValidationError::new(
-                ValidationPhase::DeterminismHazard,
-                format!("places[{index}].adjacent_place_ids"),
-                "non_canonical_ordering",
-                "adjacent place IDs must be canonical sorted without duplicates",
-            ));
-        }
-    }
-    for (index, container) in fixture.containers.iter().enumerate() {
-        if !is_sorted_unique(&container.contents) {
-            errors.push(ContentValidationError::new(
-                ValidationPhase::DeterminismHazard,
-                format!("containers[{index}].contents"),
-                "non_canonical_ordering",
-                "container contents must be canonical sorted without duplicates",
-            ));
-        }
-    }
-    if !fixture
-        .initial_beliefs
-        .windows(2)
-        .all(|window| window[0].belief_id < window[1].belief_id)
-    {
-        errors.push(ContentValidationError::new(
-            ValidationPhase::DeterminismHazard,
-            "initial_beliefs",
-            "non_canonical_ordering",
-            "initial belief seeds must be canonical sorted without duplicates",
-        ));
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn is_sorted_unique<T: Ord>(values: &[T]) -> bool {
     values.windows(2).all(|window| window[0] < window[1])
 }
 
 fn validate_fixture_contract(fixture: &FixtureSchema, errors: &mut Vec<ContentValidationError>) {
     if fixture.actors.is_empty() || fixture.places.is_empty() {

---- validate::tests::deterministic_ordering_hazards_sort_errors stdout ----

thread 'validate::tests::deterministic_ordering_hazards_sort_errors' (2149) panicked at crates/tracewake-content/src/validate.rs:3596:9:
assertion failed: report.errors.iter().any(|error| error.code == "non_canonical_ordering")

failures:
    validate::tests::deterministic_ordering_hazards_sort_errors

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
