*** crates/tracewake-content/src/validate.rs:2664:12: delete ! in validate_determinism

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ delete ! in validate_determinism
@@ -2656,17 +2656,17 @@
         }
 
         let _belief = belief.to_belief();
     }
 }
 
 fn validate_determinism(fixture: &FixtureSchema, errors: &mut Vec<ContentValidationError>) {
     for (index, place) in fixture.places.iter().enumerate() {
-        if !is_sorted_unique(&place.adjacent_place_ids) {
+        if  /* ~ changed by cargo-mutants ~ */is_sorted_unique(&place.adjacent_place_ids) {
             errors.push(ContentValidationError::new(
                 ValidationPhase::DeterminismHazard,
                 format!("places[{index}].adjacent_place_ids"),
                 "non_canonical_ordering",
                 "adjacent place IDs must be canonical sorted without duplicates",
             ));
         }
     }

---- load::tests::shuffled_input_paths_load_to_same_canonical_world stdout ----

thread 'load::tests::shuffled_input_paths_load_to_same_canonical_world' (4212) panicked at crates/tracewake-content/src/load.rs:509:10:

---- validate::tests::fixture_schema_v1_golden_bytes_load_001 stdout ----

thread 'validate::tests::fixture_schema_v1_golden_bytes_load_001' (4228) panicked at crates/tracewake-content/src/validate.rs:3087:81:

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (4239) panicked at crates/tracewake-content/src/validate.rs:3685:49:

failures:
    load::tests::shuffled_input_paths_load_to_same_canonical_world
    validate::tests::fixture_schema_v1_golden_bytes_load_001
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 31 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
