*** crates/tracewake-content/src/validate.rs:2674:12: delete ! in validate_determinism

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ delete ! in validate_determinism
@@ -2666,17 +2666,17 @@
                 ValidationPhase::DeterminismHazard,
                 format!("places[{index}].adjacent_place_ids"),
                 "non_canonical_ordering",
                 "adjacent place IDs must be canonical sorted without duplicates",
             ));
         }
     }
     for (index, container) in fixture.containers.iter().enumerate() {
-        if !is_sorted_unique(&container.contents) {
+        if  /* ~ changed by cargo-mutants ~ */is_sorted_unique(&container.contents) {
             errors.push(ContentValidationError::new(
                 ValidationPhase::DeterminismHazard,
                 format!("containers[{index}].contents"),
                 "non_canonical_ordering",
                 "container contents must be canonical sorted without duplicates",
             ));
         }
     }

---- load::tests::shuffled_input_paths_load_to_same_canonical_world stdout ----

thread 'load::tests::shuffled_input_paths_load_to_same_canonical_world' (6284) panicked at crates/tracewake-content/src/load.rs:509:10:

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (6311) panicked at crates/tracewake-content/src/validate.rs:3685:49:

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (6312) panicked at crates/tracewake-content/src/validate.rs:3650:59:

failures:
    load::tests::shuffled_input_paths_load_to_same_canonical_world
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 32 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
