*** crates/tracewake-content/src/validate.rs:2683:8: delete ! in validate_determinism

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ delete ! in validate_determinism
@@ -2675,17 +2675,17 @@
             errors.push(ContentValidationError::new(
                 ValidationPhase::DeterminismHazard,
                 format!("containers[{index}].contents"),
                 "non_canonical_ordering",
                 "container contents must be canonical sorted without duplicates",
             ));
         }
     }
-    if !fixture
+    if  /* ~ changed by cargo-mutants ~ */fixture
         .initial_beliefs
         .windows(2)
         .all(|window| window[0].belief_id < window[1].belief_id)
     {
         errors.push(ContentValidationError::new(
             ValidationPhase::DeterminismHazard,
             "initial_beliefs",
             "non_canonical_ordering",

---- load::tests::shuffled_input_paths_load_to_same_canonical_world stdout ----

thread 'load::tests::shuffled_input_paths_load_to_same_canonical_world' (8355) panicked at crates/tracewake-content/src/load.rs:509:10:

---- validate::tests::fixture_schema_v1_golden_bytes_load_001 stdout ----

thread 'validate::tests::fixture_schema_v1_golden_bytes_load_001' (8371) panicked at crates/tracewake-content/src/validate.rs:3087:81:

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (8382) panicked at crates/tracewake-content/src/validate.rs:3685:49:

failures:
    load::tests::shuffled_input_paths_load_to_same_canonical_world
    validate::tests::fixture_schema_v1_golden_bytes_load_001
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 31 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
