*** crates/tracewake-content/src/validate.rs:2686:43: replace < with == in validate_determinism

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace < with == in validate_determinism
@@ -2678,17 +2678,17 @@
                 "non_canonical_ordering",
                 "container contents must be canonical sorted without duplicates",
             ));
         }
     }
     if !fixture
         .initial_beliefs
         .windows(2)
-        .all(|window| window[0].belief_id < window[1].belief_id)
+        .all(|window| window[0].belief_id == /* ~ changed by cargo-mutants ~ */ window[1].belief_id)
     {
         errors.push(ContentValidationError::new(
             ValidationPhase::DeterminismHazard,
             "initial_beliefs",
             "non_canonical_ordering",
             "initial belief seeds must be canonical sorted without duplicates",
         ));
     }

---- valid_epistemic_seed_validates_and_round_trips_canonically stdout ----

thread 'valid_epistemic_seed_validates_and_round_trips_canonically' (10494) panicked at crates/tracewake-content/tests/fixtures_load.rs:1708:52:

---- phase2a_fixtures_are_registered_and_script_free stdout ----

thread 'phase2a_fixtures_are_registered_and_script_free' (10486) panicked at crates/tracewake-content/tests/fixtures_load.rs:1546:56:

---- all_fixtures_load_deterministically_and_validate stdout ----

thread 'all_fixtures_load_deterministically_and_validate' (10462) panicked at crates/tracewake-content/tests/fixtures_load.rs:591:54:

failures:
    all_fixtures_load_deterministically_and_validate
    phase2a_fixtures_are_registered_and_script_free
    valid_epistemic_seed_validates_and_round_trips_canonically

test result: FAILED. 31 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
