*** crates/tracewake-content/src/validate.rs:2686:43: replace < with <= in validate_determinism

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace < with <= in validate_determinism
@@ -2678,17 +2678,17 @@
                 "non_canonical_ordering",
                 "container contents must be canonical sorted without duplicates",
             ));
         }
     }
     if !fixture
         .initial_beliefs
         .windows(2)
-        .all(|window| window[0].belief_id < window[1].belief_id)
+        .all(|window| window[0].belief_id <= /* ~ changed by cargo-mutants ~ */ window[1].belief_id)
     {
         errors.push(ContentValidationError::new(
             ValidationPhase::DeterminismHazard,
             "initial_beliefs",
             "non_canonical_ordering",
             "initial belief seeds must be canonical sorted without duplicates",
         ));
     }

---- validator_branch_matrix_locks_fail_closed_validate_rs_guards stdout ----

thread 'validator_branch_matrix_locks_fail_closed_validate_rs_guards' (14731) panicked at crates/tracewake-content/tests/forbidden_content.rs:296:9:
validate.rs branch lock missing fragment: .windows(2).all(|window|window[0].belief_id<window[1].belief_id)

failures:
    validator_branch_matrix_locks_fail_closed_validate_rs_guards

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
