*** crates/tracewake-content/src/validate.rs:2698:46: replace < with > in is_sorted_unique

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace < with > in is_sorted_unique
@@ -2690,17 +2690,17 @@
             "initial_beliefs",
             "non_canonical_ordering",
             "initial belief seeds must be canonical sorted without duplicates",
         ));
     }
 }
 
 fn is_sorted_unique<T: Ord>(values: &[T]) -> bool {
-    values.windows(2).all(|window| window[0] < window[1])
+    values.windows(2).all(|window| window[0] > /* ~ changed by cargo-mutants ~ */ window[1])
 }
 
 fn validate_fixture_contract(fixture: &FixtureSchema, errors: &mut Vec<ContentValidationError>) {
     if fixture.actors.is_empty() || fixture.places.is_empty() {
         errors.push(ContentValidationError::new(
             ValidationPhase::FixtureContract,
             "fixture",
             "missing_golden_assertions",

---- all_fixtures_load_deterministically_and_validate stdout ----

thread 'all_fixtures_load_deterministically_and_validate' (23053) panicked at crates/tracewake-content/tests/fixtures_load.rs:591:54:

failures:
    all_fixtures_load_deterministically_and_validate

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
