*** crates/tracewake-content/src/validate.rs:2698:46: replace < with <= in is_sorted_unique

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace < with <= in is_sorted_unique
@@ -2690,17 +2690,17 @@
             "initial_beliefs",
             "non_canonical_ordering",
             "initial belief seeds must be canonical sorted without duplicates",
         ));
     }
 }
 
 fn is_sorted_unique<T: Ord>(values: &[T]) -> bool {
-    values.windows(2).all(|window| window[0] < window[1])
+    values.windows(2).all(|window| window[0] <= /* ~ changed by cargo-mutants ~ */ window[1])
 }
 
 fn validate_fixture_contract(fixture: &FixtureSchema, errors: &mut Vec<ContentValidationError>) {
     if fixture.actors.is_empty() || fixture.places.is_empty() {
         errors.push(ContentValidationError::new(
             ValidationPhase::FixtureContract,
             "fixture",
             "missing_golden_assertions",

---- validator_branch_matrix_locks_fail_closed_validate_rs_guards stdout ----

thread 'validator_branch_matrix_locks_fail_closed_validate_rs_guards' (25216) panicked at crates/tracewake-content/tests/forbidden_content.rs:296:9:
validate.rs branch lock missing fragment: values.windows(2).all(|window|window[0]<window[1])

failures:
    validator_branch_matrix_locks_fail_closed_validate_rs_guards

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
