*** crates/tracewake-content/src/validate.rs:2698:5: replace is_sorted_unique -> bool with true

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace is_sorted_unique -> bool with true
@@ -2690,17 +2690,17 @@
             "initial_beliefs",
             "non_canonical_ordering",
             "initial belief seeds must be canonical sorted without duplicates",
         ));
     }
 }
 
 fn is_sorted_unique<T: Ord>(values: &[T]) -> bool {
-    values.windows(2).all(|window| window[0] < window[1])
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn validate_fixture_contract(fixture: &FixtureSchema, errors: &mut Vec<ContentValidationError>) {
     if fixture.actors.is_empty() || fixture.places.is_empty() {
         errors.push(ContentValidationError::new(
             ValidationPhase::FixtureContract,
             "fixture",
             "missing_golden_assertions",

---- validate::tests::deterministic_ordering_hazards_sort_errors stdout ----

thread 'validate::tests::deterministic_ordering_hazards_sort_errors' (16777) panicked at crates/tracewake-content/src/validate.rs:3627:9:
assertion failed: report.errors.iter().any(|error| error.code == "non_canonical_ordering")

failures:
    validate::tests::deterministic_ordering_hazards_sort_errors

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
