*** crates/tracewake-content/src/validate.rs:2698:5: replace is_sorted_unique -> bool with false

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace is_sorted_unique -> bool with false
@@ -2690,17 +2690,17 @@
             "initial_beliefs",
             "non_canonical_ordering",
             "initial belief seeds must be canonical sorted without duplicates",
         ));
     }
 }
 
 fn is_sorted_unique<T: Ord>(values: &[T]) -> bool {
-    values.windows(2).all(|window| window[0] < window[1])
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn validate_fixture_contract(fixture: &FixtureSchema, errors: &mut Vec<ContentValidationError>) {
     if fixture.actors.is_empty() || fixture.places.is_empty() {
         errors.push(ContentValidationError::new(
             ValidationPhase::FixtureContract,
             "fixture",
             "missing_golden_assertions",

---- load::tests::shuffled_input_paths_load_to_same_canonical_world stdout ----

thread 'load::tests::shuffled_input_paths_load_to_same_canonical_world' (18840) panicked at crates/tracewake-content/src/load.rs:509:10:

---- validate::tests::fixture_schema_v1_golden_bytes_load_001 stdout ----

thread 'validate::tests::fixture_schema_v1_golden_bytes_load_001' (18856) panicked at crates/tracewake-content/src/validate.rs:3087:81:

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (18867) panicked at crates/tracewake-content/src/validate.rs:3685:49:

failures:
    load::tests::shuffled_input_paths_load_to_same_canonical_world
    validate::tests::fixture_schema_v1_golden_bytes_load_001
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 31 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
