*** crates/tracewake-content/src/validate.rs:269:5: replace validate_ids with ()

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace validate_ids with ()
@@ -261,187 +261,17 @@
                 ));
             }
         }
     }
     errors
 }
 
 fn validate_ids(fixture: &FixtureSchema, errors: &mut Vec<ContentValidationError>) {
-    let mut seen: BTreeMap<String, Vec<String>> = BTreeMap::new();
-    seen.entry(fixture.fixture_id.as_str().to_string())
-        .or_default()
-        .push("fixture.fixture_id".to_string());
-    seen.entry(fixture.schema_version.as_str().to_string())
-        .or_default()
-        .push("fixture.schema_version".to_string());
-
-    for (index, actor) in fixture.actors.iter().enumerate() {
-        push_id(
-            &mut seen,
-            actor.actor_id.as_str(),
-            format!("actors[{index}].actor_id"),
-        );
-        reject_reserved_or_display(
-            actor.actor_id.as_str(),
-            format!("actors[{index}].actor_id"),
-            errors,
-        );
-    }
-    for (index, place) in fixture.places.iter().enumerate() {
-        push_id(
-            &mut seen,
-            place.place_id.as_str(),
-            format!("places[{index}].place_id"),
-        );
-        reject_reserved_or_display(
-            place.place_id.as_str(),
-            format!("places[{index}].place_id"),
-            errors,
-        );
-    }
-    for (index, door) in fixture.doors.iter().enumerate() {
-        push_id(
-            &mut seen,
-            door.door_id.as_str(),
-            format!("doors[{index}].door_id"),
-        );
-        reject_reserved_or_display(
-            door.door_id.as_str(),
-            format!("doors[{index}].door_id"),
-            errors,
-        );
-    }
-    for (index, container) in fixture.containers.iter().enumerate() {
-        push_id(
-            &mut seen,
-            container.container_id.as_str(),
-            format!("containers[{index}].container_id"),
-        );
-        reject_reserved_or_display(
-            container.container_id.as_str(),
-            format!("containers[{index}].container_id"),
-            errors,
-        );
-    }
-    for (index, item) in fixture.items.iter().enumerate() {
-        push_id(
-            &mut seen,
-            item.item_id.as_str(),
-            format!("items[{index}].item_id"),
-        );
-        reject_reserved_or_display(
-            item.item_id.as_str(),
-            format!("items[{index}].item_id"),
-            errors,
-        );
-    }
-    for (index, belief) in fixture.initial_beliefs.iter().enumerate() {
-        push_id(
-            &mut seen,
-            belief.belief_id.as_str(),
-            format!("initial_beliefs[{index}].belief_id"),
-        );
-        reject_reserved_or_display(
-            belief.belief_id.as_str(),
-            format!("initial_beliefs[{index}].belief_id"),
-            errors,
-        );
-    }
-    for (index, food) in fixture.food_supplies.iter().enumerate() {
-        push_id(
-            &mut seen,
-            food.food_supply_id.as_str(),
-            format!("food_supplies[{index}].food_supply_id"),
-        );
-        reject_reserved_or_display(
-            food.food_supply_id.as_str(),
-            format!("food_supplies[{index}].food_supply_id"),
-            errors,
-        );
-    }
-    for (index, workplace) in fixture.workplaces.iter().enumerate() {
-        push_id(
-            &mut seen,
-            workplace.workplace_id.as_str(),
-            format!("workplaces[{index}].workplace_id"),
-        );
-        reject_reserved_or_display(
-            workplace.workplace_id.as_str(),
-            format!("workplaces[{index}].workplace_id"),
-            errors,
-        );
-    }
-    for (index, sleep_place) in fixture.sleep_places.iter().enumerate() {
-        push_id(
-            &mut seen,
-            sleep_place.sleep_place_id.as_str(),
-            format!("sleep_places[{index}].sleep_place_id"),
-        );
-        reject_reserved_or_display(
-            sleep_place.sleep_place_id.as_str(),
-            format!("sleep_places[{index}].sleep_place_id"),
-            errors,
-        );
-    }
-    for (index, template) in fixture.routine_templates.iter().enumerate() {
-        push_id(
-            &mut seen,
-            template.template_id.as_str(),
-            format!("routine_templates[{index}].template_id"),
-        );
-        reject_reserved_or_display(
-            template.template_id.as_str(),
-            format!("routine_templates[{index}].template_id"),
-            errors,
-        );
-    }
-
-    let mut initial_need_keys = BTreeSet::new();
-    for (index, need) in fixture.initial_needs.iter().enumerate() {
-        if !initial_need_keys.insert((need.actor_id.clone(), need.kind)) {
-            errors.push(ContentValidationError::new(
-                ValidationPhase::Id,
-                format!("initial_needs[{index}]"),
-                "duplicate_id",
-                format!(
-                    "duplicate initial need {} for {}",
-                    need.kind.stable_id(),
-                    need.actor_id.as_str()
-                ),
-            ));
-        }
-    }
-
-    let mut known_food_source_keys = BTreeSet::new();
-    for (index, edge) in fixture.known_food_sources.iter().enumerate() {
-        if !known_food_source_keys.insert((edge.actor_id.clone(), edge.food_supply_id.clone())) {
-            errors.push(ContentValidationError::new(
-                ValidationPhase::Id,
-                format!("known_food_sources[{index}]"),
-                "duplicate_id",
-                format!(
-                    "duplicate known food source edge {} -> {}",
-                    edge.actor_id.as_str(),
-                    edge.food_supply_id.as_str()
-                ),
-            ));
-        }
-    }
-
-    for (id, paths) in seen {
-        if paths.len() > 1 {
-            errors.push(ContentValidationError::new(
-                ValidationPhase::Id,
-                paths.join(","),
-                "duplicate_id",
-                format!("duplicate stable ID {id} at {}", paths.join(",")),
-            ));
-        }
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn push_id(seen: &mut BTreeMap<String, Vec<String>>, id: &str, path: String) {
     seen.entry(id.to_string()).or_default().push(path);
 }
 
 fn reject_reserved_or_display(id: &str, path: String, errors: &mut Vec<ContentValidationError>) {
     if matches!(

---- validate::tests::missing_duplicate_bad_reference_wrong_target_and_double_location_are_rejected stdout ----

thread 'validate::tests::missing_duplicate_bad_reference_wrong_target_and_double_location_are_rejected' (4328) panicked at crates/tracewake-content/src/validate.rs:3412:9:
assertion failed: codes.contains("duplicate_id")

failures:
    validate::tests::missing_duplicate_bad_reference_wrong_target_and_double_location_are_rejected

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
