*** crates/tracewake-content/src/validate.rs:2702:5: replace validate_fixture_contract with ()

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace validate_fixture_contract with ()
@@ -2694,24 +2694,17 @@
     }
 }
 
 fn is_sorted_unique<T: Ord>(values: &[T]) -> bool {
     values.windows(2).all(|window| window[0] < window[1])
 }
 
 fn validate_fixture_contract(fixture: &FixtureSchema, errors: &mut Vec<ContentValidationError>) {
-    if fixture.actors.is_empty() || fixture.places.is_empty() {
-        errors.push(ContentValidationError::new(
-            ValidationPhase::FixtureContract,
-            "fixture",
-            "missing_golden_assertions",
-            "Phase 1 fixtures must declare at least one actor and one place",
-        ));
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn validate_serialization_roundtrip(
     fixture: &FixtureSchema,
     errors: &mut Vec<ContentValidationError>,
 ) {
     let bytes = serialize_fixture(fixture);
     match deserialize_fixture(&bytes) {

---- validator_branch_matrix_locks_fail_closed_validate_rs_guards stdout ----

thread 'validator_branch_matrix_locks_fail_closed_validate_rs_guards' (27347) panicked at crates/tracewake-content/tests/forbidden_content.rs:296:9:
validate.rs branch lock missing fragment: iffixture.actors.is_empty()||fixture.places.is_empty(){

failures:
    validator_branch_matrix_locks_fail_closed_validate_rs_guards

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
