*** crates/tracewake-content/src/validate.rs:2716:5: replace validate_serialization_roundtrip with ()

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace validate_serialization_roundtrip with ()
@@ -2708,37 +2708,17 @@
         ));
     }
 }
 
 fn validate_serialization_roundtrip(
     fixture: &FixtureSchema,
     errors: &mut Vec<ContentValidationError>,
 ) {
-    let bytes = serialize_fixture(fixture);
-    match deserialize_fixture(&bytes) {
-        Ok(roundtrip)
-            if roundtrip == {
-                let mut expected = fixture.clone();
-                expected.canonicalize();
-                expected
-            } => {}
-        Ok(_) => errors.push(ContentValidationError::new(
-            ValidationPhase::Serialization,
-            "fixture",
-            "serialization_drift",
-            "fixture serialization changed canonical content",
-        )),
-        Err(error) => errors.push(ContentValidationError::new(
-            ValidationPhase::Serialization,
-            "fixture",
-            "serialization_error",
-            format!("fixture serialization failed: {error:?}"),
-        )),
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn missing(
     errors: &mut Vec<ContentValidationError>,
     phase: ValidationPhase,
     path: String,
     value: &str,
     expected: &str,

---- validator_branch_matrix_locks_fail_closed_validate_rs_guards stdout ----

thread 'validator_branch_matrix_locks_fail_closed_validate_rs_guards' (31650) panicked at crates/tracewake-content/tests/forbidden_content.rs:296:9:
validate.rs branch lock missing fragment: ifroundtrip=={letmutexpected=fixture.clone();expected.canonicalize();expected}

failures:
    validator_branch_matrix_locks_fail_closed_validate_rs_guards

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
