*** crates/tracewake-content/src/validate.rs:2719:16: replace match guard roundtrip == { let mut expected = fixture.clone(); expected.canonicalize(); expected } with true in validate_serialization_roundtrip

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace match guard roundtrip == { let mut expected = fixture.clone(); expected.canonicalize(); expected } with true in validate_serialization_roundtrip
@@ -2711,21 +2711,17 @@
 
 fn validate_serialization_roundtrip(
     fixture: &FixtureSchema,
     errors: &mut Vec<ContentValidationError>,
 ) {
     let bytes = serialize_fixture(fixture);
     match deserialize_fixture(&bytes) {
         Ok(roundtrip)
-            if roundtrip == {
-                let mut expected = fixture.clone();
-                expected.canonicalize();
-                expected
-            } => {}
+            if true /* ~ changed by cargo-mutants ~ */ => {}
         Ok(_) => errors.push(ContentValidationError::new(
             ValidationPhase::Serialization,
             "fixture",
             "serialization_drift",
             "fixture serialization changed canonical content",
         )),
         Err(error) => errors.push(ContentValidationError::new(
             ValidationPhase::Serialization,

---- validator_branch_matrix_locks_fail_closed_validate_rs_guards stdout ----

thread 'validator_branch_matrix_locks_fail_closed_validate_rs_guards' (1314) panicked at crates/tracewake-content/tests/forbidden_content.rs:296:9:
validate.rs branch lock missing fragment: ifroundtrip=={letmutexpected=fixture.clone();expected.canonicalize();expected}

failures:
    validator_branch_matrix_locks_fail_closed_validate_rs_guards

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
