*** crates/tracewake-content/src/validate.rs:2719:16: replace match guard roundtrip == { let mut expected = fixture.clone(); expected.canonicalize(); expected } with false in validate_serialization_roundtrip

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace match guard roundtrip == { let mut expected = fixture.clone(); expected.canonicalize(); expected } with false in validate_serialization_roundtrip
@@ -2711,21 +2711,17 @@
 
 fn validate_serialization_roundtrip(
     fixture: &FixtureSchema,
     errors: &mut Vec<ContentValidationError>,
 ) {
     let bytes = serialize_fixture(fixture);
     match deserialize_fixture(&bytes) {
         Ok(roundtrip)
-            if roundtrip == {
-                let mut expected = fixture.clone();
-                expected.canonicalize();
-                expected
-            } => {}
+            if false /* ~ changed by cargo-mutants ~ */ => {}
         Ok(_) => errors.push(ContentValidationError::new(
             ValidationPhase::Serialization,
             "fixture",
             "serialization_drift",
             "fixture serialization changed canonical content",
         )),
         Err(error) => errors.push(ContentValidationError::new(
             ValidationPhase::Serialization,

---- load::tests::shuffled_input_paths_load_to_same_canonical_world stdout ----

thread 'load::tests::shuffled_input_paths_load_to_same_canonical_world' (3353) panicked at crates/tracewake-content/src/load.rs:509:10:

---- validate::tests::fixture_schema_v1_golden_bytes_load_001 stdout ----

thread 'validate::tests::fixture_schema_v1_golden_bytes_load_001' (3369) panicked at crates/tracewake-content/src/validate.rs:3083:81:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Serialization, path: "fixture", code: "serialization_drift", message: "fixture serialization changed canonical content" }] } }

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (3380) panicked at crates/tracewake-content/src/validate.rs:3681:49:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Serialization, path: "fixture", code: "serialization_drift", message: "fixture serialization changed canonical content" }] } }

failures:
    load::tests::shuffled_input_paths_load_to_same_canonical_world
    validate::tests::fixture_schema_v1_golden_bytes_load_001
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 31 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
