*** crates/tracewake-content/src/validate.rs:2719:26: replace == with != in validate_serialization_roundtrip

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace == with != in validate_serialization_roundtrip
@@ -2711,17 +2711,17 @@
 
 fn validate_serialization_roundtrip(
     fixture: &FixtureSchema,
     errors: &mut Vec<ContentValidationError>,
 ) {
     let bytes = serialize_fixture(fixture);
     match deserialize_fixture(&bytes) {
         Ok(roundtrip)
-            if roundtrip == {
+            if roundtrip != /* ~ changed by cargo-mutants ~ */ {
                 let mut expected = fixture.clone();
                 expected.canonicalize();
                 expected
             } => {}
         Ok(_) => errors.push(ContentValidationError::new(
             ValidationPhase::Serialization,
             "fixture",
             "serialization_drift",

---- load::tests::shuffled_input_paths_load_to_same_canonical_world stdout ----

thread 'load::tests::shuffled_input_paths_load_to_same_canonical_world' (5424) panicked at crates/tracewake-content/src/load.rs:509:10:

---- validate::tests::fixture_schema_v1_golden_bytes_load_001 stdout ----

thread 'validate::tests::fixture_schema_v1_golden_bytes_load_001' (5440) panicked at crates/tracewake-content/src/validate.rs:3087:81:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Serialization, path: "fixture", code: "serialization_drift", message: "fixture serialization changed canonical content" }] } }

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (5452) panicked at crates/tracewake-content/src/validate.rs:3650:59:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Serialization, path: "fixture", code: "serialization_drift", message: "fixture serialization changed canonical content" }] } }

failures:
    load::tests::shuffled_input_paths_load_to_same_canonical_world
    validate::tests::fixture_schema_v1_golden_bytes_load_001
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 31 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
