*** crates/tracewake-content/src/validate.rs:2746:5: replace missing with ()

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace missing with ()
@@ -2738,22 +2738,17 @@
 
 fn missing(
     errors: &mut Vec<ContentValidationError>,
     phase: ValidationPhase,
     path: String,
     value: &str,
     expected: &str,
 ) {
-    errors.push(ContentValidationError::new(
-        phase,
-        path,
-        "bad_reference",
-        format!("missing {expected} reference {value}"),
-    ));
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn serialization_error(error: SerializationError) -> ContentValidationError {
     let (path, code, message) = match error {
         SerializationError::MissingField(field) => (
             format!("fixture.{field}"),
             "missing_field",
             format!("missing required field {field}"),

---- validate::tests::phase3a_routine_structure_failures_are_rejected stdout ----

thread 'validate::tests::phase3a_routine_structure_failures_are_rejected' (7520) panicked at crates/tracewake-content/src/validate.rs:3711:9:
assertion failed: codes.contains("bad_reference")

---- validate::tests::missing_duplicate_bad_reference_wrong_target_and_double_location_are_rejected stdout ----

thread 'validate::tests::missing_duplicate_bad_reference_wrong_target_and_double_location_are_rejected' (7517) panicked at crates/tracewake-content/src/validate.rs:3578:9:
assertion failed: codes.contains("bad_reference")

failures:
    validate::tests::missing_duplicate_bad_reference_wrong_target_and_double_location_are_rejected
    validate::tests::phase3a_routine_structure_failures_are_rejected

test result: FAILED. 34 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
