*** crates/tracewake-content/src/validate.rs:2801:26: replace || with && in is_forbidden_key

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace || with && in is_forbidden_key
@@ -2793,17 +2793,17 @@
             "bad_confidence",
             format!("{error:?}"),
         ),
     };
     ContentValidationError::new(ValidationPhase::ParseSchema, path, code, message)
 }
 
 fn is_forbidden_key(value: &str) -> bool {
-    is_player_key(value) || is_script_key(value)
+    is_player_key(value) && /* ~ changed by cargo-mutants ~ */ is_script_key(value)
 }
 
 fn is_player_key(value: &str) -> bool {
     matches!(
         value,
         "player"
             | "player_character"
             | "player_only"

---- validate::tests::forbidden_player_and_script_forms_are_rejected_from_raw_content stdout ----

thread 'validate::tests::forbidden_player_and_script_forms_are_rejected_from_raw_content' (13874) panicked at crates/tracewake-content/src/validate.rs:3592:9:
assertion failed: report.errors.iter().any(|error| error.phase == ValidationPhase::NoPlayer)

failures:
    validate::tests::forbidden_player_and_script_forms_are_rejected_from_raw_content

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
