*** crates/tracewake-content/src/validate.rs:2801:5: replace is_forbidden_key -> bool with true

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace is_forbidden_key -> bool with true
@@ -2793,17 +2793,17 @@
             "bad_confidence",
             format!("{error:?}"),
         ),
     };
     ContentValidationError::new(ValidationPhase::ParseSchema, path, code, message)
 }
 
 fn is_forbidden_key(value: &str) -> bool {
-    is_player_key(value) || is_script_key(value)
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn is_player_key(value: &str) -> bool {
     matches!(
         value,
         "player"
             | "player_character"
             | "player_only"

---- load::tests::shuffled_input_paths_load_to_same_canonical_world stdout ----

thread 'load::tests::shuffled_input_paths_load_to_same_canonical_world' (9712) panicked at crates/tracewake-content/src/load.rs:509:10:

---- validate::tests::fixture_schema_v1_golden_bytes_load_001 stdout ----

thread 'validate::tests::fixture_schema_v1_golden_bytes_load_001' (9728) panicked at crates/tracewake-content/src/validate.rs:3087:81:

failures:
    load::tests::shuffled_input_paths_load_to_same_canonical_world
    validate::tests::fixture_schema_v1_golden_bytes_load_001

test result: FAILED. 34 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
