*** crates/tracewake-content/src/validate.rs:2805:5: replace is_player_key -> bool with true

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace is_player_key -> bool with true
@@ -2797,26 +2797,17 @@
     ContentValidationError::new(ValidationPhase::ParseSchema, path, code, message)
 }
 
 fn is_forbidden_key(value: &str) -> bool {
     is_player_key(value) || is_script_key(value)
 }
 
 fn is_player_key(value: &str) -> bool {
-    matches!(
-        value,
-        "player"
-            | "player_character"
-            | "player_only"
-            | "protagonist"
-            | "quest"
-            | "objective"
-            | "reward"
-    )
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn is_script_key(value: &str) -> bool {
     matches!(
         value,
         "on_enter"
             | "on_open"
             | "on_tick"

---- load::tests::shuffled_input_paths_load_to_same_canonical_world stdout ----

thread 'load::tests::shuffled_input_paths_load_to_same_canonical_world' (15925) panicked at crates/tracewake-content/src/load.rs:509:10:

---- validate::tests::fixture_schema_v1_golden_bytes_load_001 stdout ----

thread 'validate::tests::fixture_schema_v1_golden_bytes_load_001' (15941) panicked at crates/tracewake-content/src/validate.rs:3078:81:

---- validate::tests::forbidden_player_and_script_forms_are_rejected_from_raw_content stdout ----

thread 'validate::tests::forbidden_player_and_script_forms_are_rejected_from_raw_content' (15945) panicked at crates/tracewake-content/src/validate.rs:3587:9:
assertion failed: report.errors.iter().any(|error| error.phase == ValidationPhase::NoScript)

failures:
    load::tests::shuffled_input_paths_load_to_same_canonical_world
    validate::tests::fixture_schema_v1_golden_bytes_load_001
    validate::tests::forbidden_player_and_script_forms_are_rejected_from_raw_content
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 30 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
