*** crates/tracewake-content/src/validate.rs:2805:5: replace is_player_key -> bool with false

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace is_player_key -> bool with false
@@ -2797,26 +2797,17 @@
     ContentValidationError::new(ValidationPhase::ParseSchema, path, code, message)
 }
 
 fn is_forbidden_key(value: &str) -> bool {
     is_player_key(value) || is_script_key(value)
 }
 
 fn is_player_key(value: &str) -> bool {
-    matches!(
-        value,
-        "player"
-            | "player_character"
-            | "player_only"
-            | "protagonist"
-            | "quest"
-            | "objective"
-            | "reward"
-    )
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn is_script_key(value: &str) -> bool {
     matches!(
         value,
         "on_enter"
             | "on_open"
             | "on_tick"

---- validate::tests::forbidden_player_and_script_forms_are_rejected_from_raw_content stdout ----

thread 'validate::tests::forbidden_player_and_script_forms_are_rejected_from_raw_content' (18016) panicked at crates/tracewake-content/src/validate.rs:3583:9:
assertion failed: report.errors.iter().any(|error| error.phase == ValidationPhase::NoPlayer)

failures:
    validate::tests::forbidden_player_and_script_forms_are_rejected_from_raw_content

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
