*** crates/tracewake-content/src/validate.rs:2818:5: replace is_script_key -> bool with true

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace is_script_key -> bool with true
@@ -2810,59 +2810,17 @@
             | "protagonist"
             | "quest"
             | "objective"
             | "reward"
     )
 }
 
 fn is_script_key(value: &str) -> bool {
-    matches!(
-        value,
-        "on_enter"
-            | "on_open"
-            | "on_tick"
-            | "force_event"
-            | "complete_objective"
-            | "appear_at"
-            | "force_location_at_tick"
-            | "scripted_absence"
-            | "teleport_actor"
-            | "move_item_to"
-            | "set_need"
-            | "set_hunger"
-            | "set_fatigue"
-            | "hunger_refill_without_food"
-            | "instant_sleep_refill"
-            | "work_always_succeeds"
-            | "hidden_true_item_location"
-            | "hidden_planner_input"
-            | "actor_known_hidden_input"
-            | "actor_knows_hidden_food"
-            | "story_beat"
-            | "final_event"
-            | "expected_final_event"
-            | "assert_final_event"
-            | "scripted_outcome"
-            | "golden_event_log"
-            | "director"
-            | "culprit"
-            | "true_culprit"
-            | "stolen_flag"
-            | "npc_knows_truth"
-            | "knows_mara_did_it"
-            | "truth_alias"
-            | "nested_culprit_hint"
-            | "renamed_stolen_state"
-            | "quest_state"
-            | "player_memory"
-            | "branch"
-            | "selector"
-            | "llm_prompt"
-    )
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 const PHASE3A_SHORTCUT_MARKERS: &[&str] = &[
     "appear_at",
     "force_location_at_tick",
     "scripted_absence",
     "teleport_actor",
     "move_item_to",

---- load::tests::shuffled_input_paths_load_to_same_canonical_world stdout ----

thread 'load::tests::shuffled_input_paths_load_to_same_canonical_world' (20067) panicked at crates/tracewake-content/src/load.rs:509:10:

---- validate::tests::fixture_schema_v1_golden_bytes_load_001 stdout ----

thread 'validate::tests::fixture_schema_v1_golden_bytes_load_001' (20083) panicked at crates/tracewake-content/src/validate.rs:3045:81:

---- validate::tests::phase3a_routine_structure_failures_are_rejected stdout ----

thread 'validate::tests::phase3a_routine_structure_failures_are_rejected' (20091) panicked at crates/tracewake-content/src/validate.rs:3673:9:
assertion failed: codes.contains("unknown_action")

failures:
    load::tests::shuffled_input_paths_load_to_same_canonical_world
    validate::tests::fixture_schema_v1_golden_bytes_load_001
    validate::tests::phase3a_routine_structure_failures_are_rejected
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 30 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
