*** crates/tracewake-content/src/validate.rs:2818:5: replace is_script_key -> bool with false

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace is_script_key -> bool with false
@@ -2810,59 +2810,17 @@
             | "protagonist"
             | "quest"
             | "objective"
             | "reward"
     )
 }
 
 fn is_script_key(value: &str) -> bool {
-    matches!(
-        value,
-        "on_enter"
-            | "on_open"
-            | "on_tick"
-            | "force_event"
-            | "complete_objective"
-            | "appear_at"
-            | "force_location_at_tick"
-            | "scripted_absence"
-            | "teleport_actor"
-            | "move_item_to"
-            | "set_need"
-            | "set_hunger"
-            | "set_fatigue"
-            | "hunger_refill_without_food"
-            | "instant_sleep_refill"
-            | "work_always_succeeds"
-            | "hidden_true_item_location"
-            | "hidden_planner_input"
-            | "actor_known_hidden_input"
-            | "actor_knows_hidden_food"
-            | "story_beat"
-            | "final_event"
-            | "expected_final_event"
-            | "assert_final_event"
-            | "scripted_outcome"
-            | "golden_event_log"
-            | "director"
-            | "culprit"
-            | "true_culprit"
-            | "stolen_flag"
-            | "npc_knows_truth"
-            | "knows_mara_did_it"
-            | "truth_alias"
-            | "nested_culprit_hint"
-            | "renamed_stolen_state"
-            | "quest_state"
-            | "player_memory"
-            | "branch"
-            | "selector"
-            | "llm_prompt"
-    )
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 const PHASE3A_SHORTCUT_MARKERS: &[&str] = &[
     "appear_at",
     "force_location_at_tick",
     "scripted_absence",
     "teleport_actor",
     "move_item_to",

---- validate::tests::forbidden_player_and_script_forms_are_rejected_from_raw_content stdout ----

thread 'validate::tests::forbidden_player_and_script_forms_are_rejected_from_raw_content' (22158) panicked at crates/tracewake-content/src/validate.rs:3554:9:
assertion failed: report.errors.iter().any(|error| error.phase == ValidationPhase::NoScript)

failures:
    validate::tests::forbidden_player_and_script_forms_are_rejected_from_raw_content

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
