*** crates/tracewake-content/src/validate.rs:2879:5: replace is_phase3a_shortcut_marker -> bool with true

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace is_phase3a_shortcut_marker -> bool with true
@@ -2871,19 +2871,17 @@
     "set_fatigue",
     "hunger_refill_without_food",
     "instant_sleep_refill",
     "work_always_succeeds",
     "hidden_true_item_location",
 ];
 
 fn is_phase3a_shortcut_marker(value: &str) -> bool {
-    PHASE3A_SHORTCUT_MARKERS
-        .iter()
-        .any(|marker| value.contains(marker))
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::fixtures;
     use crate::schema::{
         ActionAffordanceSchema, ActorSchema, ContainerSchema, DoorSchema, FixtureScope,

---- load::tests::shuffled_input_paths_load_to_same_canonical_world stdout ----

thread 'load::tests::shuffled_input_paths_load_to_same_canonical_world' (24209) panicked at crates/tracewake-content/src/load.rs:509:10:

---- validate::tests::fixture_schema_v1_golden_bytes_load_001 stdout ----

thread 'validate::tests::fixture_schema_v1_golden_bytes_load_001' (24225) panicked at crates/tracewake-content/src/validate.rs:3085:81:

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (24236) panicked at crates/tracewake-content/src/validate.rs:3683:49:

failures:
    load::tests::shuffled_input_paths_load_to_same_canonical_world
    validate::tests::fixture_schema_v1_golden_bytes_load_001
    validate::tests::phase3a_routine_structure_failures_are_rejected
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 30 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
