*** crates/tracewake-content/src/validate.rs:2879:5: replace is_phase3a_shortcut_marker -> bool with false

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace is_phase3a_shortcut_marker -> bool with false
@@ -2871,19 +2871,17 @@
     "set_fatigue",
     "hunger_refill_without_food",
     "instant_sleep_refill",
     "work_always_succeeds",
     "hidden_true_item_location",
 ];
 
 fn is_phase3a_shortcut_marker(value: &str) -> bool {
-    PHASE3A_SHORTCUT_MARKERS
-        .iter()
-        .any(|marker| value.contains(marker))
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::fixtures;
     use crate::schema::{
         ActionAffordanceSchema, ActorSchema, ContainerSchema, DoorSchema, FixtureScope,

---- validate::tests::phase3a_routine_shortcut_effects_are_rejected stdout ----

thread 'validate::tests::phase3a_routine_shortcut_effects_are_rejected' (26303) panicked at crates/tracewake-content/src/validate.rs:3769:13:

failures:
    validate::tests::phase3a_routine_shortcut_effects_are_rejected

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
