*** crates/tracewake-content/src/validate.rs:400:12: delete ! in validate_ids

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ delete ! in validate_ids
@@ -392,17 +392,17 @@
             template.template_id.as_str(),
             format!("routine_templates[{index}].template_id"),
             errors,
         );
     }
 
     let mut initial_need_keys = BTreeSet::new();
     for (index, need) in fixture.initial_needs.iter().enumerate() {
-        if !initial_need_keys.insert((need.actor_id.clone(), need.kind)) {
+        if  /* ~ changed by cargo-mutants ~ */initial_need_keys.insert((need.actor_id.clone(), need.kind)) {
             errors.push(ContentValidationError::new(
                 ValidationPhase::Id,
                 format!("initial_needs[{index}]"),
                 "duplicate_id",
                 format!(
                     "duplicate initial need {} for {}",
                     need.kind.stable_id(),
                     need.actor_id.as_str()

---- load::tests::shuffled_input_paths_load_to_same_canonical_world stdout ----

thread 'load::tests::shuffled_input_paths_load_to_same_canonical_world' (6379) panicked at crates/tracewake-content/src/load.rs:509:10:

---- validate::tests::fixture_schema_v1_golden_bytes_load_001 stdout ----

thread 'validate::tests::fixture_schema_v1_golden_bytes_load_001' (6395) panicked at crates/tracewake-content/src/validate.rs:3087:81:

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (6407) panicked at crates/tracewake-content/src/validate.rs:3650:59:

failures:
    load::tests::shuffled_input_paths_load_to_same_canonical_world
    validate::tests::fixture_schema_v1_golden_bytes_load_001
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 31 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
