*** crates/tracewake-content/src/validate.rs:443:5: replace push_id with ()

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace push_id with ()
@@ -435,17 +435,17 @@
                 "duplicate_id",
                 format!("duplicate stable ID {id} at {}", paths.join(",")),
             ));
         }
     }
 }
 
 fn push_id(seen: &mut BTreeMap<String, Vec<String>>, id: &str, path: String) {
-    seen.entry(id.to_string()).or_default().push(path);
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn reject_reserved_or_display(id: &str, path: String, errors: &mut Vec<ContentValidationError>) {
     if matches!(
         id,
         "player" | "protagonist" | "quest" | "objective" | "reward" | "culprit" | "director"
     ) {
         errors.push(ContentValidationError::new(

---- validate::tests::missing_duplicate_bad_reference_wrong_target_and_double_location_are_rejected stdout ----

thread 'validate::tests::missing_duplicate_bad_reference_wrong_target_and_double_location_are_rejected' (16790) panicked at crates/tracewake-content/src/validate.rs:3582:9:
assertion failed: codes.contains("duplicate_id")

failures:
    validate::tests::missing_duplicate_bad_reference_wrong_target_and_double_location_are_rejected

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
