*** crates/tracewake-content/src/validate.rs:447:5: replace reject_reserved_or_display with ()

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace reject_reserved_or_display with ()
@@ -439,34 +439,17 @@
     }
 }
 
 fn push_id(seen: &mut BTreeMap<String, Vec<String>>, id: &str, path: String) {
     seen.entry(id.to_string()).or_default().push(path);
 }
 
 fn reject_reserved_or_display(id: &str, path: String, errors: &mut Vec<ContentValidationError>) {
-    if matches!(
-        id,
-        "player" | "protagonist" | "quest" | "objective" | "reward" | "culprit" | "director"
-    ) {
-        errors.push(ContentValidationError::new(
-            ValidationPhase::NoPlayer,
-            path,
-            "reserved_player_or_story_id",
-            format!("reserved player/story ID {id} is forbidden"),
-        ));
-    } else if id.contains(' ') {
-        errors.push(ContentValidationError::new(
-            ValidationPhase::Id,
-            path,
-            "display_name_as_id",
-            "stable IDs must not be display names",
-        ));
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn validate_references(fixture: &FixtureSchema, errors: &mut Vec<ContentValidationError>) {
     let actors = fixture
         .actors
         .iter()
         .map(|actor| actor.actor_id.clone())
         .collect::<BTreeSet<_>>();

---- validator_branch_matrix_locks_fail_closed_validate_rs_guards stdout ----

thread 'validator_branch_matrix_locks_fail_closed_validate_rs_guards' (18933) panicked at crates/tracewake-content/tests/forbidden_content.rs:296:9:
validate.rs branch lock missing fragment: fnreject_reserved_or_display(id:&str,path:String,errors:&mutVec<ContentValidationError>){ifmatches!(id,"player"|"protagonist"|"quest"|"objective"|"reward"|"culprit"|"director")

failures:
    validator_branch_matrix_locks_fail_closed_validate_rs_guards

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
