*** crates/tracewake-content/src/validate.rs:514:31: replace != with == in validate_references

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace != with == in validate_references
@@ -506,17 +506,17 @@
         .map(|template| (template.template_id.clone(), template.family))
         .collect::<BTreeMap<_, _>>();
 
     let mut actor_suffixes = BTreeMap::new();
     for (index, actor) in fixture.actors.iter().enumerate() {
         let suffix = routine_assignment_actor_suffix(&actor.actor_id).to_string();
         if let Some(previous_actor) = actor_suffixes.insert(suffix.clone(), actor.actor_id.clone())
         {
-            if previous_actor != actor.actor_id {
+            if previous_actor == /* ~ changed by cargo-mutants ~ */ actor.actor_id {
                 errors.push(ContentValidationError::new(
                     ValidationPhase::State,
                     format!("actors[{index}].actor_id"),
                     "ambiguous_actor_assignment_suffix",
                     format!(
                         "actor IDs {} and {} collapse to routine assignment suffix {suffix}",
                         previous_actor.as_str(),
                         actor.actor_id.as_str()

---- fixture_validation_rejects_ambiguous_actor_assignment_suffix_collision stdout ----

thread 'fixture_validation_rejects_ambiguous_actor_assignment_suffix_collision' (23083) panicked at crates/tracewake-content/tests/fixtures_load.rs:497:5:
assertion failed: report.errors.iter().any(|error|
        error.code == "ambiguous_actor_assignment_suffix")

failures:
    fixture_validation_rejects_ambiguous_actor_assignment_suffix_collision

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
