*** crates/tracewake-content/src/validate.rs:530:12: delete ! in validate_references

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ delete ! in validate_references
@@ -522,17 +522,17 @@
                         actor.actor_id.as_str()
                     ),
                 ));
             }
         }
     }
 
     for (index, actor) in fixture.actors.iter().enumerate() {
-        if !places.contains(&actor.current_place_id) {
+        if  /* ~ changed by cargo-mutants ~ */places.contains(&actor.current_place_id) {
             missing(
                 errors,
                 ValidationPhase::Referential,
                 format!("actors[{index}].current_place_id"),
                 actor.current_place_id.as_str(),
                 "place",
             );
         }

---- load::tests::shuffled_input_paths_load_to_same_canonical_world stdout ----

thread 'load::tests::shuffled_input_paths_load_to_same_canonical_world' (25148) panicked at crates/tracewake-content/src/load.rs:509:10:

---- validate::tests::fixture_schema_v1_golden_bytes_load_001 stdout ----

thread 'validate::tests::fixture_schema_v1_golden_bytes_load_001' (25164) panicked at crates/tracewake-content/src/validate.rs:3087:81:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Referential, path: "actors[0].current_place_id", code: "bad_reference", message: "missing place reference shop_front" }] } }

---- validate::tests::missing_duplicate_bad_reference_wrong_target_and_double_location_are_rejected stdout ----

thread 'validate::tests::missing_duplicate_bad_reference_wrong_target_and_double_location_are_rejected' (25169) panicked at crates/tracewake-content/src/validate.rs:3583:9:
assertion failed: codes.contains("bad_reference")

failures:
    load::tests::shuffled_input_paths_load_to_same_canonical_world
    validate::tests::fixture_schema_v1_golden_bytes_load_001
    validate::tests::missing_duplicate_bad_reference_wrong_target_and_double_location_are_rejected
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 30 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
