*** crates/tracewake-content/src/validate.rs:542:16: delete ! in validate_references

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ delete ! in validate_references
@@ -534,17 +534,17 @@
                 format!("actors[{index}].current_place_id"),
                 actor.current_place_id.as_str(),
                 "place",
             );
         }
     }
     for (index, place) in fixture.places.iter().enumerate() {
         for adjacent in &place.adjacent_place_ids {
-            if !places.contains(adjacent) {
+            if  /* ~ changed by cargo-mutants ~ */places.contains(adjacent) {
                 missing(
                     errors,
                     ValidationPhase::Referential,
                     format!("places[{index}].adjacent_place_ids"),
                     adjacent.as_str(),
                     "place",
                 );
             }

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (27247) panicked at crates/tracewake-content/src/validate.rs:3650:59:

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (27246) panicked at crates/tracewake-content/src/validate.rs:3685:49:

---- validate::tests::valid_fixture_produces_initial_world stdout ----

thread 'validate::tests::valid_fixture_produces_initial_world' (27252) panicked at crates/tracewake-content/src/validate.rs:3076:63:

failures:
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 33 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
