*** crates/tracewake-content/src/validate.rs:554:12: delete ! in validate_references

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ delete ! in validate_references
@@ -546,17 +546,17 @@
                     format!("places[{index}].adjacent_place_ids"),
                     adjacent.as_str(),
                     "place",
                 );
             }
         }
     }
     for (index, container) in fixture.containers.iter().enumerate() {
-        if !places.contains(&container.place_id) {
+        if  /* ~ changed by cargo-mutants ~ */places.contains(&container.place_id) {
             missing(
                 errors,
                 ValidationPhase::Referential,
                 format!("containers[{index}].place_id"),
                 container.place_id.as_str(),
                 "place",
             );
         }

---- load::tests::shuffled_input_paths_load_to_same_canonical_world stdout ----

thread 'load::tests::shuffled_input_paths_load_to_same_canonical_world' (29290) panicked at crates/tracewake-content/src/load.rs:509:10:
called `Result::unwrap()` on an `Err` value: Validation(ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Referential, path: "containers[0].place_id", code: "bad_reference", message: "missing place reference shop_front" }] } })

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (29317) panicked at crates/tracewake-content/src/validate.rs:3685:49:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Referential, path: "containers[0].place_id", code: "bad_reference", message: "missing place reference shop_front" }] } }

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (29318) panicked at crates/tracewake-content/src/validate.rs:3650:59:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Referential, path: "containers[0].place_id", code: "bad_reference", message: "missing place reference shop_front" }] } }

failures:
    load::tests::shuffled_input_paths_load_to_same_canonical_world
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 32 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
