*** crates/tracewake-content/src/validate.rs:564:16: delete ! in validate_references

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ delete ! in validate_references
@@ -556,17 +556,17 @@
                 errors,
                 ValidationPhase::Referential,
                 format!("containers[{index}].place_id"),
                 container.place_id.as_str(),
                 "place",
             );
         }
         for item_id in &container.contents {
-            if !items.contains(item_id) {
+            if  /* ~ changed by cargo-mutants ~ */items.contains(item_id) {
                 missing(
                     errors,
                     ValidationPhase::Referential,
                     format!("containers[{index}].contents"),
                     item_id.as_str(),
                     "item",
                 );
             }

---- load::tests::shuffled_input_paths_load_to_same_canonical_world stdout ----

thread 'load::tests::shuffled_input_paths_load_to_same_canonical_world' (31361) panicked at crates/tracewake-content/src/load.rs:509:10:
called `Result::unwrap()` on an `Err` value: Validation(ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Referential, path: "containers[0].contents", code: "bad_reference", message: "missing item reference coin_stack_01" }] } })

---- validate::tests::valid_fixture_produces_initial_world stdout ----

thread 'validate::tests::valid_fixture_produces_initial_world' (31394) panicked at crates/tracewake-content/src/validate.rs:3076:63:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Referential, path: "containers[0].contents", code: "bad_reference", message: "missing item reference coin_stack_01" }] } }

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (31388) panicked at crates/tracewake-content/src/validate.rs:3685:49:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Referential, path: "containers[0].contents", code: "bad_reference", message: "missing item reference coin_stack_01" }] } }

failures:
    load::tests::shuffled_input_paths_load_to_same_canonical_world
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 32 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
