*** crates/tracewake-content/src/validate.rs:577:44: replace match guard !places.contains(place_id) with false in validate_references

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace match guard !places.contains(place_id) with false in validate_references
@@ -569,17 +569,17 @@
                     item_id.as_str(),
                     "item",
                 );
             }
         }
     }
     for (index, item) in fixture.items.iter().enumerate() {
         match &item.location {
-            Location::AtPlace(place_id) if !places.contains(place_id) => missing(
+            Location::AtPlace(place_id) if false /* ~ changed by cargo-mutants ~ */ => missing(
                 errors,
                 ValidationPhase::Referential,
                 format!("items[{index}].location"),
                 place_id.as_str(),
                 "place",
             ),
             Location::InContainer(container_id) if !containers.contains(container_id) => missing(
                 errors,

---- validator_branch_matrix_locks_fail_closed_validate_rs_guards stdout ----

thread 'validator_branch_matrix_locks_fail_closed_validate_rs_guards' (3163) panicked at crates/tracewake-content/tests/forbidden_content.rs:296:9:
validate.rs branch lock missing fragment: for(index,item)infixture.items.iter().enumerate(){match&item.location{Location::AtPlace(place_id)if!places.contains(place_id)=>missing(

failures:
    validator_branch_matrix_locks_fail_closed_validate_rs_guards

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
