*** crates/tracewake-content/src/validate.rs:577:44: delete ! in validate_references

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ delete ! in validate_references
@@ -569,17 +569,17 @@
                     item_id.as_str(),
                     "item",
                 );
             }
         }
     }
     for (index, item) in fixture.items.iter().enumerate() {
         match &item.location {
-            Location::AtPlace(place_id) if !places.contains(place_id) => missing(
+            Location::AtPlace(place_id) if  /* ~ changed by cargo-mutants ~ */places.contains(place_id) => missing(
                 errors,
                 ValidationPhase::Referential,
                 format!("items[{index}].location"),
                 place_id.as_str(),
                 "place",
             ),
             Location::InContainer(container_id) if !containers.contains(container_id) => missing(
                 errors,

---- all_fixtures_load_deterministically_and_validate stdout ----

thread 'all_fixtures_load_deterministically_and_validate' (13677) panicked at crates/tracewake-content/tests/fixtures_load.rs:591:54:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Referential, path: "items[0].location", code: "bad_reference", message: "missing place reference north_room" }] } }

failures:
    all_fixtures_load_deterministically_and_validate

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
