*** crates/tracewake-content/src/validate.rs:584:52: delete ! in validate_references

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ delete ! in validate_references
@@ -576,17 +576,17 @@
         match &item.location {
             Location::AtPlace(place_id) if !places.contains(place_id) => missing(
                 errors,
                 ValidationPhase::Referential,
                 format!("items[{index}].location"),
                 place_id.as_str(),
                 "place",
             ),
-            Location::InContainer(container_id) if !containers.contains(container_id) => missing(
+            Location::InContainer(container_id) if  /* ~ changed by cargo-mutants ~ */containers.contains(container_id) => missing(
                 errors,
                 ValidationPhase::Referential,
                 format!("items[{index}].location"),
                 container_id.as_str(),
                 "container",
             ),
             Location::CarriedBy(actor_id) if !actors.contains(actor_id) => missing(
                 errors,

---- load::tests::shuffled_input_paths_load_to_same_canonical_world stdout ----

thread 'load::tests::shuffled_input_paths_load_to_same_canonical_world' (15747) panicked at crates/tracewake-content/src/load.rs:509:10:

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (15774) panicked at crates/tracewake-content/src/validate.rs:3685:49:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Referential, path: "items[0].location", code: "bad_reference", message: "missing container reference strongbox_tomas" }] } }

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (15775) panicked at crates/tracewake-content/src/validate.rs:3650:59:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Referential, path: "items[0].location", code: "bad_reference", message: "missing container reference strongbox_tomas" }] } }

failures:
    load::tests::shuffled_input_paths_load_to_same_canonical_world
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 32 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
