*** crates/tracewake-content/src/validate.rs:591:46: delete ! in validate_references

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ delete ! in validate_references
@@ -583,17 +583,17 @@
             ),
             Location::InContainer(container_id) if !containers.contains(container_id) => missing(
                 errors,
                 ValidationPhase::Referential,
                 format!("items[{index}].location"),
                 container_id.as_str(),
                 "container",
             ),
-            Location::CarriedBy(actor_id) if !actors.contains(actor_id) => missing(
+            Location::CarriedBy(actor_id) if  /* ~ changed by cargo-mutants ~ */actors.contains(actor_id) => missing(
                 errors,
                 ValidationPhase::Referential,
                 format!("items[{index}].location"),
                 actor_id.as_str(),
                 "actor",
             ),
             _ => {}
         }

---- phase2a_fixtures_are_registered_and_script_free stdout ----

thread 'phase2a_fixtures_are_registered_and_script_free' (17878) panicked at crates/tracewake-content/tests/fixtures_load.rs:1546:56:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Referential, path: "items[0].location", code: "bad_reference", message: "missing actor reference actor_mara" }] } }

---- all_fixtures_load_deterministically_and_validate stdout ----

thread 'all_fixtures_load_deterministically_and_validate' (17854) panicked at crates/tracewake-content/tests/fixtures_load.rs:591:54:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Referential, path: "items[0].location", code: "bad_reference", message: "missing actor reference actor_mara" }] } }

failures:
    all_fixtures_load_deterministically_and_validate
    phase2a_fixtures_are_registered_and_script_free

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
