*** crates/tracewake-content/src/validate.rs:603:12: delete ! in validate_references

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ delete ! in validate_references
@@ -595,17 +595,17 @@
                 actor_id.as_str(),
                 "actor",
             ),
             _ => {}
         }
     }
 
     for (index, belief) in fixture.initial_beliefs.iter().enumerate() {
-        if !actors.contains(&belief.holder_actor_id) {
+        if  /* ~ changed by cargo-mutants ~ */actors.contains(&belief.holder_actor_id) {
             missing(
                 errors,
                 ValidationPhase::Referential,
                 format!("initial_beliefs[{index}].holder_actor_id"),
                 belief.holder_actor_id.as_str(),
                 "actor",
             );
         }

---- fixture_fingerprint_reprices_secondary_file_bytes stdout ----

thread 'fixture_fingerprint_reprices_secondary_file_bytes' (19963) panicked at crates/tracewake-content/tests/fixtures_load.rs:629:6:

---- fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture stdout ----

thread 'fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture' (19962) panicked at crates/tracewake-content/tests/fixtures_load.rs:661:6:

---- phase2a_fixtures_are_registered_and_script_free stdout ----

thread 'phase2a_fixtures_are_registered_and_script_free' (19984) panicked at crates/tracewake-content/tests/fixtures_load.rs:1546:56:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Referential, path: "initial_beliefs[0].holder_actor_id", code: "bad_reference", message: "missing actor reference actor_tomas" }] } }

failures:
    all_fixtures_load_deterministically_and_validate
    fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture
    fixture_fingerprint_reprices_secondary_file_bytes
    phase2a_fixtures_are_registered_and_script_free
    seed_event_log_order_and_projection_provenance_are_causal_and_stable
    valid_epistemic_seed_validates_and_round_trips_canonically

test result: FAILED. 28 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
