*** crates/tracewake-content/src/validate.rs:626:12: delete ! in validate_references

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ delete ! in validate_references
@@ -618,17 +618,17 @@
                 ValidationPhase::EpistemicSeed,
                 format!("initial_beliefs[{index}].proposition"),
                 "bad_reference",
                 format!("{error}"),
             ));
         }
     }
     for (index, need) in fixture.initial_needs.iter().enumerate() {
-        if !actors.contains(&need.actor_id) {
+        if  /* ~ changed by cargo-mutants ~ */actors.contains(&need.actor_id) {
             missing(
                 errors,
                 ValidationPhase::Referential,
                 format!("initial_needs[{index}].actor_id"),
                 need.actor_id.as_str(),
                 "actor",
             );
         }

---- load::tests::shuffled_input_paths_load_to_same_canonical_world stdout ----

thread 'load::tests::shuffled_input_paths_load_to_same_canonical_world' (22030) panicked at crates/tracewake-content/src/load.rs:509:10:

---- validate::tests::fixture_schema_v1_golden_bytes_load_001 stdout ----

thread 'validate::tests::fixture_schema_v1_golden_bytes_load_001' (22046) panicked at crates/tracewake-content/src/validate.rs:3087:81:

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (22057) panicked at crates/tracewake-content/src/validate.rs:3685:49:

failures:
    load::tests::shuffled_input_paths_load_to_same_canonical_world
    validate::tests::fixture_schema_v1_golden_bytes_load_001
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 31 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
