*** crates/tracewake-content/src/validate.rs:637:12: delete ! in validate_references

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ delete ! in validate_references
@@ -629,17 +629,17 @@
                 ValidationPhase::Referential,
                 format!("initial_needs[{index}].actor_id"),
                 need.actor_id.as_str(),
                 "actor",
             );
         }
     }
     for (index, home) in fixture.homes.iter().enumerate() {
-        if !actors.contains(&home.actor_id) {
+        if  /* ~ changed by cargo-mutants ~ */actors.contains(&home.actor_id) {
             missing(
                 errors,
                 ValidationPhase::Referential,
                 format!("homes[{index}].actor_id"),
                 home.actor_id.as_str(),
                 "actor",
             );
         }

---- fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering stdout ----

thread 'fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering' (24149) panicked at crates/tracewake-content/tests/fixtures_load.rs:1238:6:
called `Result::unwrap()` on an `Err` value: Validation(ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Referential, path: "homes[0].actor_id", code: "bad_reference", message: "missing actor reference actor_tomas" }] } })

---- stale_workplace_notice_superseded_by_newer_001 stdout ----

thread 'stale_workplace_notice_superseded_by_newer_001' (24167) panicked at crates/tracewake-content/tests/fixtures_load.rs:1096:6:
called `Result::unwrap()` on an `Err` value: Validation(ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Referential, path: "homes[0].actor_id", code: "bad_reference", message: "missing actor reference actor_tomas" }] } })

---- seed_event_log_order_and_projection_provenance_are_causal_and_stable stdout ----

thread 'seed_event_log_order_and_projection_provenance_are_causal_and_stable' (24164) panicked at crates/tracewake-content/tests/fixtures_load.rs:920:74:
called `Result::unwrap()` on an `Err` value: Validation(ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Referential, path: "homes[0].actor_id", code: "bad_reference", message: "missing actor reference actor_tomas" }] } })

failures:
    all_fixtures_load_deterministically_and_validate
    fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering
    phase3a_load_emits_authored_prehistory_seed_events
    seed_event_log_order_and_projection_provenance_are_causal_and_stable
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food
    stale_workplace_notice_superseded_by_newer_001

test result: FAILED. 28 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
