*** crates/tracewake-content/src/validate.rs:646:12: delete ! in validate_references

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ delete ! in validate_references
@@ -638,17 +638,17 @@
             missing(
                 errors,
                 ValidationPhase::Referential,
                 format!("homes[{index}].actor_id"),
                 home.actor_id.as_str(),
                 "actor",
             );
         }
-        if !places.contains(&home.place_id) {
+        if  /* ~ changed by cargo-mutants ~ */places.contains(&home.place_id) {
             missing(
                 errors,
                 ValidationPhase::Referential,
                 format!("homes[{index}].place_id"),
                 home.place_id.as_str(),
                 "place",
             );
         }

---- fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering stdout ----

thread 'fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering' (26255) panicked at crates/tracewake-content/tests/fixtures_load.rs:1238:6:
called `Result::unwrap()` on an `Err` value: Validation(ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Referential, path: "homes[0].place_id", code: "bad_reference", message: "missing place reference home_tomas" }] } })

---- seed_event_log_order_and_projection_provenance_are_causal_and_stable stdout ----

thread 'seed_event_log_order_and_projection_provenance_are_causal_and_stable' (26270) panicked at crates/tracewake-content/tests/fixtures_load.rs:920:74:
called `Result::unwrap()` on an `Err` value: Validation(ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Referential, path: "homes[0].place_id", code: "bad_reference", message: "missing place reference home_tomas" }] } })

---- stale_workplace_notice_superseded_by_newer_001 stdout ----

thread 'stale_workplace_notice_superseded_by_newer_001' (26273) panicked at crates/tracewake-content/tests/fixtures_load.rs:1096:6:
called `Result::unwrap()` on an `Err` value: Validation(ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Referential, path: "homes[0].place_id", code: "bad_reference", message: "missing place reference home_tomas" }] } })

failures:
    all_fixtures_load_deterministically_and_validate
    fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering
    phase3a_load_emits_authored_prehistory_seed_events
    seed_event_log_order_and_projection_provenance_are_causal_and_stable
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food
    stale_workplace_notice_superseded_by_newer_001

test result: FAILED. 28 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
