*** crates/tracewake-content/src/validate.rs:666:12: delete ! in validate_references

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ delete ! in validate_references
@@ -658,17 +658,17 @@
             missing(
                 errors,
                 ValidationPhase::Referential,
                 format!("sleep_places[{index}].actor_id"),
                 sleep_place.actor_id.as_str(),
                 "actor",
             );
         }
-        if !places.contains(&sleep_place.place_id) {
+        if  /* ~ changed by cargo-mutants ~ */places.contains(&sleep_place.place_id) {
             missing(
                 errors,
                 ValidationPhase::Referential,
                 format!("sleep_places[{index}].place_id"),
                 sleep_place.place_id.as_str(),
                 "place",
             );
         }

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (30412) panicked at crates/tracewake-content/src/validate.rs:3650:59:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Referential, path: "sleep_places[0].place_id", code: "bad_reference", message: "missing place reference shop_front" }] } }

failures:
    validate::tests::phase3a_valid_routine_content_is_accepted

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
