*** crates/tracewake-content/src/validate.rs:696:12: delete ! in validate_references

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ delete ! in validate_references
@@ -688,17 +688,17 @@
             missing(
                 errors,
                 ValidationPhase::Referential,
                 format!("known_food_sources[{index}].actor_id"),
                 edge.actor_id.as_str(),
                 "actor",
             );
         }
-        if !food_supplies.contains(&edge.food_supply_id) {
+        if  /* ~ changed by cargo-mutants ~ */food_supplies.contains(&edge.food_supply_id) {
             missing(
                 errors,
                 ValidationPhase::Referential,
                 format!("known_food_sources[{index}].food_supply_id"),
                 edge.food_supply_id.as_str(),
                 "food_supply",
             );
         }

---- phase3a_load_emits_authored_prehistory_seed_events stdout ----

thread 'phase3a_load_emits_authored_prehistory_seed_events' (2154) panicked at crates/tracewake-content/tests/fixtures_load.rs:761:6:

---- all_fixtures_load_deterministically_and_validate stdout ----

thread 'all_fixtures_load_deterministically_and_validate' (2129) panicked at crates/tracewake-content/tests/fixtures_load.rs:591:54:

failures:
    all_fixtures_load_deterministically_and_validate
    phase3a_load_emits_authored_prehistory_seed_events

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
