*** crates/tracewake-content/src/validate.rs:707:12: delete ! in validate_references

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ delete ! in validate_references
@@ -699,17 +699,17 @@
                 ValidationPhase::Referential,
                 format!("known_food_sources[{index}].food_supply_id"),
                 edge.food_supply_id.as_str(),
                 "food_supply",
             );
         }
     }
     for (index, workplace) in fixture.workplaces.iter().enumerate() {
-        if !places.contains(&workplace.place_id) {
+        if  /* ~ changed by cargo-mutants ~ */places.contains(&workplace.place_id) {
             missing(
                 errors,
                 ValidationPhase::Referential,
                 format!("workplaces[{index}].place_id"),
                 workplace.place_id.as_str(),
                 "place",
             );
         }

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (4226) panicked at crates/tracewake-content/src/validate.rs:3685:49:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Referential, path: "workplaces[0].place_id", code: "bad_reference", message: "missing place reference workshop" }] } }

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (4227) panicked at crates/tracewake-content/src/validate.rs:3650:59:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Referential, path: "workplaces[0].place_id", code: "bad_reference", message: "missing place reference workshop" }] } }

failures:
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted

test result: FAILED. 34 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
