*** crates/tracewake-content/src/validate.rs:717:16: delete ! in validate_references

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ delete ! in validate_references
@@ -709,17 +709,17 @@
                 errors,
                 ValidationPhase::Referential,
                 format!("workplaces[{index}].place_id"),
                 workplace.place_id.as_str(),
                 "place",
             );
         }
         for actor_id in &workplace.assigned_actor_ids {
-            if !actors.contains(actor_id) {
+            if  /* ~ changed by cargo-mutants ~ */actors.contains(actor_id) {
                 missing(
                     errors,
                     ValidationPhase::Referential,
                     format!("workplaces[{index}].assigned_actor_ids"),
                     actor_id.as_str(),
                     "actor",
                 );
             }

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (6299) panicked at crates/tracewake-content/src/validate.rs:3650:59:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Referential, path: "workplaces[0].assigned_actor_ids", code: "bad_reference", message: "missing actor reference actor_tomas" }] } }

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (6298) panicked at crates/tracewake-content/src/validate.rs:3685:49:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Referential, path: "workplaces[0].assigned_actor_ids", code: "bad_reference", message: "missing actor reference actor_tomas" }] } }

failures:
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted

test result: FAILED. 34 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
