*** crates/tracewake-content/src/validate.rs:742:12: delete ! in validate_references

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ delete ! in validate_references
@@ -734,17 +734,17 @@
                 format!("{error:?}"),
             ));
         }
     }
     let mut assignment_by_actor_start = BTreeMap::new();
     let mut assignment_by_actor_family = BTreeMap::new();
     let mut assignment_by_derived_suffix = BTreeMap::new();
     for (index, assignment) in fixture.routine_assignments.iter().enumerate() {
-        if !actors.contains(&assignment.actor_id) {
+        if  /* ~ changed by cargo-mutants ~ */actors.contains(&assignment.actor_id) {
             missing(
                 errors,
                 ValidationPhase::Referential,
                 format!("routine_assignments[{index}].actor_id"),
                 assignment.actor_id.as_str(),
                 "actor",
             );
         }

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (8369) panicked at crates/tracewake-content/src/validate.rs:3685:49:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Referential, path: "routine_assignments[0].actor_id", code: "bad_reference", message: "missing actor reference actor_tomas" }] } }

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (8370) panicked at crates/tracewake-content/src/validate.rs:3650:59:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Referential, path: "routine_assignments[0].actor_id", code: "bad_reference", message: "missing actor reference actor_tomas" }] } }

failures:
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted

test result: FAILED. 34 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
