*** crates/tracewake-content/src/validate.rs:751:12: delete ! in validate_references

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ delete ! in validate_references
@@ -743,17 +743,17 @@
             missing(
                 errors,
                 ValidationPhase::Referential,
                 format!("routine_assignments[{index}].actor_id"),
                 assignment.actor_id.as_str(),
                 "actor",
             );
         }
-        if !routine_templates.contains(&assignment.template_id) {
+        if  /* ~ changed by cargo-mutants ~ */routine_templates.contains(&assignment.template_id) {
             missing(
                 errors,
                 ValidationPhase::Referential,
                 format!("routine_assignments[{index}].template_id"),
                 assignment.template_id.as_str(),
                 "routine_template",
             );
         }

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (10440) panicked at crates/tracewake-content/src/validate.rs:3685:49:

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (10441) panicked at crates/tracewake-content/src/validate.rs:3650:59:

---- validate::tests::phase3a_routine_structure_failures_are_rejected stdout ----

thread 'validate::tests::phase3a_routine_structure_failures_are_rejected' (10437) panicked at crates/tracewake-content/src/validate.rs:3716:9:
assertion failed: codes.contains("bad_reference")

failures:
    validate::tests::phase3a_routine_structure_failures_are_rejected
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted

test result: FAILED. 33 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
