*** crates/tracewake-content/src/validate.rs:805:34: replace >= with < in validate_references

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace >= with < in validate_references
@@ -797,17 +797,17 @@
                     format!("routine_assignments[{index}]"),
                     "routine_assignment_id_collision",
                     format!(
                         "routine assignment at index {index} derives the same intention/execution ID suffix as index {previous_index}"
                     ),
                 ));
             }
         }
-        if assignment.start_tick >= assignment.end_tick {
+        if assignment.start_tick < /* ~ changed by cargo-mutants ~ */ assignment.end_tick {
             errors.push(ContentValidationError::new(
                 ValidationPhase::State,
                 format!("routine_assignments[{index}]"),
                 "bad_tick_order",
                 "routine assignment start_tick must precede end_tick",
             ));
         }
     }

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (12512) panicked at crates/tracewake-content/src/validate.rs:3650:59:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: State, path: "routine_assignments[0]", code: "bad_tick_order", message: "routine assignment start_tick must precede end_tick" }] } }

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (12511) panicked at crates/tracewake-content/src/validate.rs:3685:49:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: State, path: "routine_assignments[0]", code: "bad_tick_order", message: "routine assignment start_tick must precede end_tick" }] } }

failures:
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted

test result: FAILED. 34 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
