*** crates/tracewake-content/src/validate.rs:824:30: replace >= with < in validate_references

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace >= with < in validate_references
@@ -816,17 +816,17 @@
             missing(
                 errors,
                 ValidationPhase::Referential,
                 format!("day_windows[{index}].actor_id"),
                 window.actor_id.as_str(),
                 "actor",
             );
         }
-        if window.start_tick >= window.end_tick {
+        if window.start_tick < /* ~ changed by cargo-mutants ~ */ window.end_tick {
             errors.push(ContentValidationError::new(
                 ValidationPhase::State,
                 format!("day_windows[{index}]"),
                 "bad_tick_order",
                 "day window start_tick must precede end_tick",
             ));
         }
     }

---- fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering stdout ----

thread 'fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering' (16709) panicked at crates/tracewake-content/tests/fixtures_load.rs:1238:6:
called `Result::unwrap()` on an `Err` value: Validation(ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: State, path: "day_windows[0]", code: "bad_tick_order", message: "day window start_tick must precede end_tick" }] } })

---- stale_workplace_notice_superseded_by_newer_001 stdout ----

thread 'stale_workplace_notice_superseded_by_newer_001' (16727) panicked at crates/tracewake-content/tests/fixtures_load.rs:1096:6:
called `Result::unwrap()` on an `Err` value: Validation(ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: State, path: "day_windows[0]", code: "bad_tick_order", message: "day window start_tick must precede end_tick" }] } })

---- seed_event_log_order_and_projection_provenance_are_causal_and_stable stdout ----

thread 'seed_event_log_order_and_projection_provenance_are_causal_and_stable' (16724) panicked at crates/tracewake-content/tests/fixtures_load.rs:920:74:
called `Result::unwrap()` on an `Err` value: Validation(ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: State, path: "day_windows[0]", code: "bad_tick_order", message: "day window start_tick must precede end_tick" }] } })

failures:
    all_fixtures_load_deterministically_and_validate
    fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering
    phase3a_load_emits_authored_prehistory_seed_events
    seed_event_log_order_and_projection_provenance_are_causal_and_stable
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food
    stale_workplace_notice_superseded_by_newer_001

test result: FAILED. 28 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
