*** crates/tracewake-content/src/validate.rs:836:55: replace && with || in validate_references

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace && with || in validate_references
@@ -828,17 +828,17 @@
                 "bad_tick_order",
                 "day window start_tick must precede end_tick",
             ));
         }
     }
 
     for (index, affordance) in fixture.affordances.iter().enumerate() {
         if let Ok(food_supply_id) = FoodSupplyId::new(affordance.target_id.as_str()) {
-            if affordance.action_id.as_str() == "eat" && !food_supplies.contains(&food_supply_id) {
+            if affordance.action_id.as_str() == "eat" || /* ~ changed by cargo-mutants ~ */ !food_supplies.contains(&food_supply_id) {
                 missing(
                     errors,
                     ValidationPhase::Referential,
                     format!("affordances[{index}].target_id"),
                     affordance.target_id.as_str(),
                     "food_supply",
                 );
             }

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (18795) panicked at crates/tracewake-content/src/validate.rs:3650:59:

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (18794) panicked at crates/tracewake-content/src/validate.rs:3685:49:

---- validate::tests::valid_fixture_produces_initial_world stdout ----

thread 'validate::tests::valid_fixture_produces_initial_world' (18800) panicked at crates/tracewake-content/src/validate.rs:3076:63:

failures:
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 33 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
