*** crates/tracewake-content/src/validate.rs:836:58: delete ! in validate_references

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ delete ! in validate_references
@@ -828,17 +828,17 @@
                 "bad_tick_order",
                 "day window start_tick must precede end_tick",
             ));
         }
     }
 
     for (index, affordance) in fixture.affordances.iter().enumerate() {
         if let Ok(food_supply_id) = FoodSupplyId::new(affordance.target_id.as_str()) {
-            if affordance.action_id.as_str() == "eat" && !food_supplies.contains(&food_supply_id) {
+            if affordance.action_id.as_str() == "eat" &&  /* ~ changed by cargo-mutants ~ */food_supplies.contains(&food_supply_id) {
                 missing(
                     errors,
                     ValidationPhase::Referential,
                     format!("affordances[{index}].target_id"),
                     affordance.target_id.as_str(),
                     "food_supply",
                 );
             }

---- phase3a_load_emits_authored_prehistory_seed_events stdout ----

thread 'phase3a_load_emits_authored_prehistory_seed_events' (22970) panicked at crates/tracewake-content/tests/fixtures_load.rs:761:6:

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (22973) panicked at crates/tracewake-content/tests/fixtures_load.rs:1172:6:

---- all_fixtures_load_deterministically_and_validate stdout ----

thread 'all_fixtures_load_deterministically_and_validate' (22945) panicked at crates/tracewake-content/tests/fixtures_load.rs:591:54:

failures:
    all_fixtures_load_deterministically_and_validate
    phase3a_load_emits_authored_prehistory_seed_events
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 31 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
