*** crates/tracewake-content/src/validate.rs:847:62: replace && with || in validate_references

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace && with || in validate_references
@@ -839,17 +839,17 @@
                     ValidationPhase::Referential,
                     format!("affordances[{index}].target_id"),
                     affordance.target_id.as_str(),
                     "food_supply",
                 );
             }
         }
         if let Ok(workplace_id) = WorkplaceId::new(affordance.target_id.as_str()) {
-            if affordance.action_id.as_str() == "work_block" && !workplaces.contains(&workplace_id)
+            if affordance.action_id.as_str() == "work_block" || /* ~ changed by cargo-mutants ~ */ !workplaces.contains(&workplace_id)
             {
                 missing(
                     errors,
                     ValidationPhase::Referential,
                     format!("affordances[{index}].target_id"),
                     affordance.target_id.as_str(),
                     "workplace",
                 );

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (25043) panicked at crates/tracewake-content/src/validate.rs:3650:59:

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (25042) panicked at crates/tracewake-content/src/validate.rs:3685:49:

---- validate::tests::valid_fixture_produces_initial_world stdout ----

thread 'validate::tests::valid_fixture_produces_initial_world' (25048) panicked at crates/tracewake-content/src/validate.rs:3076:63:

failures:
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 33 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
