*** crates/tracewake-content/src/validate.rs:847:65: delete ! in validate_references

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ delete ! in validate_references
@@ -839,17 +839,17 @@
                     ValidationPhase::Referential,
                     format!("affordances[{index}].target_id"),
                     affordance.target_id.as_str(),
                     "food_supply",
                 );
             }
         }
         if let Ok(workplace_id) = WorkplaceId::new(affordance.target_id.as_str()) {
-            if affordance.action_id.as_str() == "work_block" && !workplaces.contains(&workplace_id)
+            if affordance.action_id.as_str() == "work_block" &&  /* ~ changed by cargo-mutants ~ */workplaces.contains(&workplace_id)
             {
                 missing(
                     errors,
                     ValidationPhase::Referential,
                     format!("affordances[{index}].target_id"),
                     affordance.target_id.as_str(),
                     "workplace",
                 );

---- phase3a_load_emits_authored_prehistory_seed_events stdout ----

thread 'phase3a_load_emits_authored_prehistory_seed_events' (29218) panicked at crates/tracewake-content/tests/fixtures_load.rs:761:6:

---- all_fixtures_load_deterministically_and_validate stdout ----

thread 'all_fixtures_load_deterministically_and_validate' (29193) panicked at crates/tracewake-content/tests/fixtures_load.rs:591:54:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Referential, path: "affordances[0].target_id", code: "bad_reference", message: "missing workplace reference workplace_tomas" }] } }

---- stale_workplace_notice_superseded_by_newer_001 stdout ----

thread 'stale_workplace_notice_superseded_by_newer_001' (29223) panicked at crates/tracewake-content/tests/fixtures_load.rs:1096:6:

failures:
    all_fixtures_load_deterministically_and_validate
    phase3a_load_emits_authored_prehistory_seed_events
    stale_workplace_notice_superseded_by_newer_001

test result: FAILED. 31 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
