*** crates/tracewake-content/src/validate.rs:869:5: replace validate_location_reference with ()

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace validate_location_reference with ()
@@ -861,40 +861,17 @@
 fn validate_location_reference(
     location: &Location,
     actors: &BTreeSet<tracewake_core::ids::ActorId>,
     places: &BTreeSet<PlaceId>,
     containers: &BTreeSet<tracewake_core::ids::ContainerId>,
     errors: &mut Vec<ContentValidationError>,
     path: String,
 ) {
-    match location {
-        Location::AtPlace(place_id) if !places.contains(place_id) => missing(
-            errors,
-            ValidationPhase::Referential,
-            path,
-            place_id.as_str(),
-            "place",
-        ),
-        Location::InContainer(container_id) if !containers.contains(container_id) => missing(
-            errors,
-            ValidationPhase::Referential,
-            path,
-            container_id.as_str(),
-            "container",
-        ),
-        Location::CarriedBy(actor_id) if !actors.contains(actor_id) => missing(
-            errors,
-            ValidationPhase::Referential,
-            path,
-            actor_id.as_str(),
-            "actor",
-        ),
-        _ => {}
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn validate_locations(fixture: &FixtureSchema, errors: &mut Vec<ContentValidationError>) {
     let item_locations = fixture
         .items
         .iter()
         .map(|item| (item.item_id.clone(), item.location.clone()))
         .collect::<BTreeMap<_, _>>();

---- validator_branch_matrix_locks_fail_closed_validate_rs_guards stdout ----

thread 'validator_branch_matrix_locks_fail_closed_validate_rs_guards' (31356) panicked at crates/tracewake-content/tests/forbidden_content.rs:296:9:

failures:
    validator_branch_matrix_locks_fail_closed_validate_rs_guards

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
