*** crates/tracewake-content/src/validate.rs:870:40: replace match guard !places.contains(place_id) with false in validate_location_reference

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace match guard !places.contains(place_id) with false in validate_location_reference
@@ -862,17 +862,17 @@
     location: &Location,
     actors: &BTreeSet<tracewake_core::ids::ActorId>,
     places: &BTreeSet<PlaceId>,
     containers: &BTreeSet<tracewake_core::ids::ContainerId>,
     errors: &mut Vec<ContentValidationError>,
     path: String,
 ) {
     match location {
-        Location::AtPlace(place_id) if !places.contains(place_id) => missing(
+        Location::AtPlace(place_id) if false /* ~ changed by cargo-mutants ~ */ => missing(
             errors,
             ValidationPhase::Referential,
             path,
             place_id.as_str(),
             "place",
         ),
         Location::InContainer(container_id) if !containers.contains(container_id) => missing(
             errors,

---- validator_branch_matrix_locks_fail_closed_validate_rs_guards stdout ----

thread 'validator_branch_matrix_locks_fail_closed_validate_rs_guards' (3090) panicked at crates/tracewake-content/tests/forbidden_content.rs:296:9:

failures:
    validator_branch_matrix_locks_fail_closed_validate_rs_guards

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
