*** crates/tracewake-content/src/validate.rs:870:40: delete ! in validate_location_reference

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ delete ! in validate_location_reference
@@ -862,17 +862,17 @@
     location: &Location,
     actors: &BTreeSet<tracewake_core::ids::ActorId>,
     places: &BTreeSet<PlaceId>,
     containers: &BTreeSet<tracewake_core::ids::ContainerId>,
     errors: &mut Vec<ContentValidationError>,
     path: String,
 ) {
     match location {
-        Location::AtPlace(place_id) if !places.contains(place_id) => missing(
+        Location::AtPlace(place_id) if  /* ~ changed by cargo-mutants ~ */places.contains(place_id) => missing(
             errors,
             ValidationPhase::Referential,
             path,
             place_id.as_str(),
             "place",
         ),
         Location::InContainer(container_id) if !containers.contains(container_id) => missing(
             errors,

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (13655) panicked at crates/tracewake-content/src/validate.rs:3685:49:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Referential, path: "food_supplies[0].location", code: "bad_reference", message: "missing place reference shop_front" }] } }

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (13656) panicked at crates/tracewake-content/src/validate.rs:3650:59:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Referential, path: "food_supplies[0].location", code: "bad_reference", message: "missing place reference shop_front" }] } }

failures:
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted

test result: FAILED. 34 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
