*** crates/tracewake-content/src/validate.rs:877:48: replace match guard !containers.contains(container_id) with false in validate_location_reference

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace match guard !containers.contains(container_id) with false in validate_location_reference
@@ -869,17 +869,17 @@
     match location {
         Location::AtPlace(place_id) if !places.contains(place_id) => missing(
             errors,
             ValidationPhase::Referential,
             path,
             place_id.as_str(),
             "place",
         ),
-        Location::InContainer(container_id) if !containers.contains(container_id) => missing(
+        Location::InContainer(container_id) if false /* ~ changed by cargo-mutants ~ */ => missing(
             errors,
             ValidationPhase::Referential,
             path,
             container_id.as_str(),
             "container",
         ),
         Location::CarriedBy(actor_id) if !actors.contains(actor_id) => missing(
             errors,

---- validator_branch_matrix_locks_fail_closed_validate_rs_guards stdout ----

thread 'validator_branch_matrix_locks_fail_closed_validate_rs_guards' (7328) panicked at crates/tracewake-content/tests/forbidden_content.rs:296:9:
validate.rs branch lock missing fragment: Location::InContainer(container_id)if!containers.contains(container_id)=>missing(errors,ValidationPhase::Referential,path,container_id.as_str()

failures:
    validator_branch_matrix_locks_fail_closed_validate_rs_guards

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
