*** crates/tracewake-content/src/validate.rs:896:5: replace validate_locations with ()

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace validate_locations with ()
@@ -888,84 +888,17 @@
             actor_id.as_str(),
             "actor",
         ),
         _ => {}
     }
 }
 
 fn validate_locations(fixture: &FixtureSchema, errors: &mut Vec<ContentValidationError>) {
-    let item_locations = fixture
-        .items
-        .iter()
-        .map(|item| (item.item_id.clone(), item.location.clone()))
-        .collect::<BTreeMap<_, _>>();
-    let mut listed_contents = BTreeSet::new();
-    for (container_index, container) in fixture.containers.iter().enumerate() {
-        let mut local_contents = BTreeSet::new();
-        for item_id in &container.contents {
-            if !local_contents.insert(item_id.clone()) {
-                errors.push(ContentValidationError::new(
-                    ValidationPhase::DeterminismHazard,
-                    format!("containers[{container_index}].contents"),
-                    "duplicate_contents",
-                    format!("container contents duplicate item {}", item_id.as_str()),
-                ));
-            }
-            if !listed_contents.insert(item_id.clone()) {
-                errors.push(ContentValidationError::new(
-                    ValidationPhase::Location,
-                    format!("containers[{container_index}].contents"),
-                    "item_double_location",
-                    format!(
-                        "item {} is listed by more than one container",
-                        item_id.as_str()
-                    ),
-                ));
-            }
-            if item_locations.get(item_id)
-                != Some(&Location::InContainer(container.container_id.clone()))
-            {
-                errors.push(ContentValidationError::new(
-                    ValidationPhase::Location,
-                    format!("containers[{container_index}].contents"),
-                    "container_item_mismatch",
-                    format!(
-                        "container {} lists item {} but item holder disagrees",
-                        container.container_id.as_str(),
-                        item_id.as_str()
-                    ),
-                ));
-            }
-        }
-    }
-
-    for (item_index, item) in fixture.items.iter().enumerate() {
-        if let Location::InContainer(container_id) = &item.location {
-            let Some(container) = fixture
-                .containers
-                .iter()
-                .find(|container| &container.container_id == container_id)
-            else {
-                continue;
-            };
-            if !container.contents.contains(&item.item_id) {
-                errors.push(ContentValidationError::new(
-                    ValidationPhase::Location,
-                    format!("items[{item_index}].location"),
-                    "container_item_mismatch",
-                    format!(
-                        "item {} is in container {} but container contents omit it",
-                        item.item_id.as_str(),
-                        container_id.as_str()
-                    ),
-                ));
-            }
-        }
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn validate_topology(fixture: &FixtureSchema, errors: &mut Vec<ContentValidationError>) {
     let places = fixture
         .places
         .iter()
         .map(|place| place.place_id.clone())
         .collect::<BTreeSet<_>>();

---- validate::tests::missing_duplicate_bad_reference_wrong_target_and_double_location_are_rejected stdout ----

thread 'validate::tests::missing_duplicate_bad_reference_wrong_target_and_double_location_are_rejected' (19957) panicked at crates/tracewake-content/src/validate.rs:3518:9:
assertion failed: codes.contains("item_double_location")

failures:
    validate::tests::missing_duplicate_bad_reference_wrong_target_and_double_location_are_rejected

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
