*** crates/tracewake-content/src/validate.rs:905:16: delete ! in validate_locations

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ delete ! in validate_locations
@@ -897,17 +897,17 @@
         .items
         .iter()
         .map(|item| (item.item_id.clone(), item.location.clone()))
         .collect::<BTreeMap<_, _>>();
     let mut listed_contents = BTreeSet::new();
     for (container_index, container) in fixture.containers.iter().enumerate() {
         let mut local_contents = BTreeSet::new();
         for item_id in &container.contents {
-            if !local_contents.insert(item_id.clone()) {
+            if  /* ~ changed by cargo-mutants ~ */local_contents.insert(item_id.clone()) {
                 errors.push(ContentValidationError::new(
                     ValidationPhase::DeterminismHazard,
                     format!("containers[{container_index}].contents"),
                     "duplicate_contents",
                     format!("container contents duplicate item {}", item_id.as_str()),
                 ));
             }
             if !listed_contents.insert(item_id.clone()) {

---- load::tests::shuffled_input_paths_load_to_same_canonical_world stdout ----

thread 'load::tests::shuffled_input_paths_load_to_same_canonical_world' (22007) panicked at crates/tracewake-content/src/load.rs:509:10:

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (22034) panicked at crates/tracewake-content/src/validate.rs:3685:49:

---- validate::tests::valid_fixture_produces_initial_world stdout ----

thread 'validate::tests::valid_fixture_produces_initial_world' (22040) panicked at crates/tracewake-content/src/validate.rs:3076:63:

failures:
    load::tests::shuffled_input_paths_load_to_same_canonical_world
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 32 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
