*** crates/tracewake-content/src/validate.rs:913:16: delete ! in validate_locations

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ delete ! in validate_locations
@@ -905,17 +905,17 @@
             if !local_contents.insert(item_id.clone()) {
                 errors.push(ContentValidationError::new(
                     ValidationPhase::DeterminismHazard,
                     format!("containers[{container_index}].contents"),
                     "duplicate_contents",
                     format!("container contents duplicate item {}", item_id.as_str()),
                 ));
             }
-            if !listed_contents.insert(item_id.clone()) {
+            if  /* ~ changed by cargo-mutants ~ */listed_contents.insert(item_id.clone()) {
                 errors.push(ContentValidationError::new(
                     ValidationPhase::Location,
                     format!("containers[{container_index}].contents"),
                     "item_double_location",
                     format!(
                         "item {} is listed by more than one container",
                         item_id.as_str()
                     ),

---- load::tests::shuffled_input_paths_load_to_same_canonical_world stdout ----

thread 'load::tests::shuffled_input_paths_load_to_same_canonical_world' (24078) panicked at crates/tracewake-content/src/load.rs:509:10:

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (24105) panicked at crates/tracewake-content/src/validate.rs:3685:49:

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (24106) panicked at crates/tracewake-content/src/validate.rs:3650:59:

failures:
    load::tests::shuffled_input_paths_load_to_same_canonical_world
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 32 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
