*** crates/tracewake-content/src/validate.rs:925:17: replace != with == in validate_locations

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ replace != with == in validate_locations
@@ -917,17 +917,17 @@
                     "item_double_location",
                     format!(
                         "item {} is listed by more than one container",
                         item_id.as_str()
                     ),
                 ));
             }
             if item_locations.get(item_id)
-                != Some(&Location::InContainer(container.container_id.clone()))
+                == /* ~ changed by cargo-mutants ~ */ Some(&Location::InContainer(container.container_id.clone()))
             {
                 errors.push(ContentValidationError::new(
                     ValidationPhase::Location,
                     format!("containers[{container_index}].contents"),
                     "container_item_mismatch",
                     format!(
                         "container {} lists item {} but item holder disagrees",
                         container.container_id.as_str(),

---- load::tests::shuffled_input_paths_load_to_same_canonical_world stdout ----

thread 'load::tests::shuffled_input_paths_load_to_same_canonical_world' (26149) panicked at crates/tracewake-content/src/load.rs:509:10:

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (26177) panicked at crates/tracewake-content/src/validate.rs:3650:59:

---- validate::tests::valid_fixture_produces_initial_world stdout ----

thread 'validate::tests::valid_fixture_produces_initial_world' (26182) panicked at crates/tracewake-content/src/validate.rs:3076:63:

failures:
    load::tests::shuffled_input_paths_load_to_same_canonical_world
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 32 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
