*** crates/tracewake-content/src/validate.rs:950:16: delete ! in validate_locations

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ delete ! in validate_locations
@@ -942,17 +942,17 @@
         if let Location::InContainer(container_id) = &item.location {
             let Some(container) = fixture
                 .containers
                 .iter()
                 .find(|container| &container.container_id == container_id)
             else {
                 continue;
             };
-            if !container.contents.contains(&item.item_id) {
+            if  /* ~ changed by cargo-mutants ~ */container.contents.contains(&item.item_id) {
                 errors.push(ContentValidationError::new(
                     ValidationPhase::Location,
                     format!("items[{item_index}].location"),
                     "container_item_mismatch",
                     format!(
                         "item {} is in container {} but container contents omit it",
                         item.item_id.as_str(),
                         container_id.as_str()

---- load::tests::shuffled_input_paths_load_to_same_canonical_world stdout ----

thread 'load::tests::shuffled_input_paths_load_to_same_canonical_world' (30326) panicked at crates/tracewake-content/src/load.rs:509:10:

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (30353) panicked at crates/tracewake-content/src/validate.rs:3685:49:

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (30354) panicked at crates/tracewake-content/src/validate.rs:3650:59:

failures:
    load::tests::shuffled_input_paths_load_to_same_canonical_world
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 32 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
