*** crates/tracewake-content/src/validate.rs:978:12: delete ! in validate_topology

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ delete ! in validate_topology
@@ -970,17 +970,17 @@
         .map(|place| place.place_id.clone())
         .collect::<BTreeSet<_>>();
     let adjacency = fixture
         .places
         .iter()
         .map(|place| (place.place_id.clone(), place.adjacent_place_ids.clone()))
         .collect::<BTreeMap<_, _>>();
     for (index, door) in fixture.doors.iter().enumerate() {
-        if !places.contains(&door.endpoint_a) {
+        if  /* ~ changed by cargo-mutants ~ */places.contains(&door.endpoint_a) {
             missing(
                 errors,
                 ValidationPhase::PhysicalTopology,
                 format!("doors[{index}].endpoint_a"),
                 door.endpoint_a.as_str(),
                 "place",
             );
         }

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (2087) panicked at crates/tracewake-content/src/validate.rs:3685:49:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: PhysicalTopology, path: "doors[0].endpoint_a", code: "bad_reference", message: "missing place reference shop_front" }] } }

---- validate::tests::valid_fixture_produces_initial_world stdout ----

thread 'validate::tests::valid_fixture_produces_initial_world' (2093) panicked at crates/tracewake-content/src/validate.rs:3076:63:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: PhysicalTopology, path: "doors[0].endpoint_a", code: "bad_reference", message: "missing place reference shop_front" }] } }

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (2088) panicked at crates/tracewake-content/src/validate.rs:3650:59:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: PhysicalTopology, path: "doors[0].endpoint_a", code: "bad_reference", message: "missing place reference shop_front" }] } }

failures:
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 33 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
