*** crates/tracewake-content/src/validate.rs:987:12: delete ! in validate_topology

*** mutation diff:
--- crates/tracewake-content/src/validate.rs
+++ delete ! in validate_topology
@@ -979,17 +979,17 @@
             missing(
                 errors,
                 ValidationPhase::PhysicalTopology,
                 format!("doors[{index}].endpoint_a"),
                 door.endpoint_a.as_str(),
                 "place",
             );
         }
-        if !places.contains(&door.endpoint_b) {
+        if  /* ~ changed by cargo-mutants ~ */places.contains(&door.endpoint_b) {
             missing(
                 errors,
                 ValidationPhase::PhysicalTopology,
                 format!("doors[{index}].endpoint_b"),
                 door.endpoint_b.as_str(),
                 "place",
             );
         }

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (4158) panicked at crates/tracewake-content/src/validate.rs:3685:49:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: PhysicalTopology, path: "doors[0].endpoint_b", code: "bad_reference", message: "missing place reference back_room" }] } }

---- validate::tests::valid_fixture_produces_initial_world stdout ----

thread 'validate::tests::valid_fixture_produces_initial_world' (4164) panicked at crates/tracewake-content/src/validate.rs:3076:63:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: PhysicalTopology, path: "doors[0].endpoint_b", code: "bad_reference", message: "missing place reference back_room" }] } }

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (4159) panicked at crates/tracewake-content/src/validate.rs:3650:59:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: PhysicalTopology, path: "doors[0].endpoint_b", code: "bad_reference", message: "missing place reference back_room" }] } }

failures:
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 33 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
