*** crates/tracewake-core/src/actions/defs/eat.rs:132:5: replace eat_need_events -> Vec<EventEnvelope> with vec![]

*** mutation diff:
--- crates/tracewake-core/src/actions/defs/eat.rs
+++ replace eat_need_events -> Vec<EventEnvelope> with vec![]
@@ -124,53 +124,17 @@
 fn eat_need_events(
     agent_state: &AgentState,
     proposal: &Proposal,
     ordering_key: &OrderingKey,
     content_manifest_id: &ContentManifestId,
     consumed_event: &EventEnvelope,
     delta: i32,
 ) -> Vec<EventEnvelope> {
-    let actor_id = proposal.actor_id.as_ref().expect("actor checked");
-    let current_hunger = agent_state
-        .needs_by_actor
-        .get(actor_id)
-        .and_then(|needs| needs.get(&NeedKind::Hunger))
-        .map(crate::agent::NeedState::value);
-    build_need_delta_and_threshold_events(
-        NeedDeltaEventSpec {
-            event_id: EventId::new(format!(
-                "event.eat_hunger_delta.{}",
-                proposal.proposal_id.as_str()
-            ))
-            .unwrap(),
-            threshold_event_id: EventId::new(format!(
-                "event.eat_hunger_threshold.{}",
-                proposal.proposal_id.as_str()
-            ))
-            .unwrap(),
-            tick: proposal.requested_tick,
-            ordering_key: ordering_key.clone(),
-            content_manifest_id: content_manifest_id.clone(),
-            causes: vec![EventCause::Event(consumed_event.event_id.clone())],
-            actor_id: actor_id.clone(),
-            proposal_id: Some(proposal.proposal_id.clone()),
-            process_id: None,
-            participants: vec![actor_id.to_string()],
-            need_kind: NeedKind::Hunger,
-            delta,
-            elapsed_ticks: 0,
-            cause_kind: "action_effect".to_string(),
-            cause_action_id: Some("eat".to_string()),
-            extra_payload: vec![PayloadField::new("schema_version", EVENT_SCHEMA_V1)],
-            delta_effects_summary: "hunger reduced by modeled food consumption".to_string(),
-            threshold_effects_summary: "hunger pressure band crossed after eating".to_string(),
-        },
-        current_hunger,
-    )
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn eat_failed_event(
     proposal: &Proposal,
     ordering_key: &OrderingKey,
     content_manifest_id: &ContentManifestId,
     food_supply_id: &str,
     blocker_kind: &str,

---- sleep_eat_work_fixture_logs_need_effects_and_replays stdout ----

thread 'sleep_eat_work_fixture_logs_need_effects_and_replays' (16616) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1272:5:
assertion failed: log.events().iter().filter(|event|
                event.event_type == EventKind::NeedDeltaApplied).count() >= 5

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (16590) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (16591) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2714:5:
assertion failed: has_event(&log, EventKind::ActorMoved)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    sleep_eat_work_fixture_logs_need_effects_and_replays

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.47s

*** result: Failure(101)
