*** crates/tracewake-core/src/actions/defs/eat.rs:224:5: replace access_failure -> Option<EatAccessFailure> with None

*** mutation diff:
--- crates/tracewake-core/src/actions/defs/eat.rs
+++ replace access_failure -> Option<EatAccessFailure> with None
@@ -216,53 +216,17 @@
 }
 
 fn access_failure(
     state: &PhysicalState,
     food: &FoodSupplyState,
     actor_id: &crate::ids::ActorId,
     actor_place_id: &crate::ids::PlaceId,
 ) -> Option<EatAccessFailure> {
-    match &food.location {
-        Location::AtPlace(place_id) if place_id == actor_place_id => None,
-        Location::AtPlace(_) => Some(EatAccessFailure {
-            actor_visible_reason: "food source not reachable",
-            absence_ancestry: "food source not at actor place",
-        }),
-        Location::CarriedBy(carrier_id) if carrier_id == actor_id => None,
-        Location::CarriedBy(carrier_id) => Some(EatAccessFailure {
-            actor_visible_reason: "food source not reachable",
-            absence_ancestry: if state.actors.contains_key(carrier_id) {
-                "food source carried by another actor"
-            } else {
-                "food source carrier absent"
-            },
-        }),
-        Location::InContainer(container_id) => {
-            let Some(container) = state.containers.get(container_id) else {
-                return Some(EatAccessFailure {
-                    actor_visible_reason: "food source not reachable",
-                    absence_ancestry: "food source container absent",
-                });
-            };
-            if container.location != Location::AtPlace(actor_place_id.clone()) {
-                return Some(EatAccessFailure {
-                    actor_visible_reason: "food source not reachable",
-                    absence_ancestry: "food source container not reachable",
-                });
-            }
-            if !container.is_open {
-                return Some(EatAccessFailure {
-                    actor_visible_reason: "food source not reachable",
-                    absence_ancestry: "food source container closed",
-                });
-            }
-            None
-        }
-    }
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn food_supply_target(proposal: &Proposal) -> Result<FoodSupplyId, ActionRejection> {
     let target = proposal.target_ids.first().ok_or_else(|| {
         reject(
             PipelineStage::TargetBinding,
             ReasonCode::TargetNotFound,
             "target_count",

---- no_hidden_truth_fixture_keeps_hidden_food_out_of_planner_inputs stdout ----

thread 'no_hidden_truth_fixture_keeps_hidden_food_out_of_planner_inputs' (20712) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2008:5:
assertion failed: has_event(&log, EventKind::EatFailed)

failures:
    no_hidden_truth_fixture_keeps_hidden_food_out_of_planner_inputs

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.58s

*** result: Failure(101)
