*** crates/tracewake-core/src/actions/defs/eat.rs:225:40: replace match guard place_id == actor_place_id with true in access_failure

*** mutation diff:
--- crates/tracewake-core/src/actions/defs/eat.rs
+++ replace match guard place_id == actor_place_id with true in access_failure
@@ -217,17 +217,17 @@
 
 fn access_failure(
     state: &PhysicalState,
     food: &FoodSupplyState,
     actor_id: &crate::ids::ActorId,
     actor_place_id: &crate::ids::PlaceId,
 ) -> Option<EatAccessFailure> {
     match &food.location {
-        Location::AtPlace(place_id) if place_id == actor_place_id => None,
+        Location::AtPlace(place_id) if true /* ~ changed by cargo-mutants ~ */ => None,
         Location::AtPlace(_) => Some(EatAccessFailure {
             actor_visible_reason: "food source not reachable",
             absence_ancestry: "food source not at actor place",
         }),
         Location::CarriedBy(carrier_id) if carrier_id == actor_id => None,
         Location::CarriedBy(carrier_id) => Some(EatAccessFailure {
             actor_visible_reason: "food source not reachable",
             absence_ancestry: if state.actors.contains_key(carrier_id) {

---- actions::defs::eat::tests::eat_food_at_other_place_fails_access_without_consumption stdout ----

thread 'actions::defs::eat::tests::eat_food_at_other_place_fails_access_without_consumption' (24874) panicked at crates/tracewake-core/src/actions/defs/eat.rs:516:9:
assertion `left == right` failed
  left: 2
 right: 1

failures:
    actions::defs::eat::tests::eat_food_at_other_place_fails_access_without_consumption

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
