*** crates/tracewake-core/src/actions/defs/eat.rs:225:49: replace == with != in access_failure

*** mutation diff:
--- crates/tracewake-core/src/actions/defs/eat.rs
+++ replace == with != in access_failure
@@ -217,17 +217,17 @@
 
 fn access_failure(
     state: &PhysicalState,
     food: &FoodSupplyState,
     actor_id: &crate::ids::ActorId,
     actor_place_id: &crate::ids::PlaceId,
 ) -> Option<EatAccessFailure> {
     match &food.location {
-        Location::AtPlace(place_id) if place_id == actor_place_id => None,
+        Location::AtPlace(place_id) if place_id != /* ~ changed by cargo-mutants ~ */ actor_place_id => None,
         Location::AtPlace(_) => Some(EatAccessFailure {
             actor_visible_reason: "food source not reachable",
             absence_ancestry: "food source not at actor place",
         }),
         Location::CarriedBy(carrier_id) if carrier_id == actor_id => None,
         Location::CarriedBy(carrier_id) => Some(EatAccessFailure {
             actor_visible_reason: "food source not reachable",
             absence_ancestry: if state.actors.contains_key(carrier_id) {

---- sleep_eat_work_fixture_logs_need_effects_and_replays stdout ----

thread 'sleep_eat_work_fixture_logs_need_effects_and_replays' (10159) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1270:5:
assertion failed: has_event(&log, EventKind::FoodConsumed)

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (10133) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (10134) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2714:5:
assertion failed: has_event(&log, EventKind::ActorMoved)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    sleep_eat_work_fixture_logs_need_effects_and_replays

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.47s

*** result: Failure(101)
