*** crates/tracewake-core/src/actions/defs/eat.rs:22:5: replace build_eat_events -> Result<Vec<EventEnvelope>, ActionRejection> with Ok(vec![])

*** mutation diff:
--- crates/tracewake-core/src/actions/defs/eat.rs
+++ replace build_eat_events -> Result<Vec<EventEnvelope>, ActionRejection> with Ok(vec![])
@@ -14,73 +14,17 @@
 
 pub fn build_eat_events(
     state: &PhysicalState,
     agent_state: &AgentState,
     proposal: &Proposal,
     ordering_key: &OrderingKey,
     content_manifest_id: &ContentManifestId,
 ) -> Result<Vec<EventEnvelope>, ActionRejection> {
-    let actor_id = proposal.actor_id.clone().ok_or_else(actor_missing)?;
-    let actor = state.actors.get(&actor_id).ok_or_else(actor_missing)?;
-    let food_supply_id = food_supply_target(proposal)?;
-
-    let Some(food) = state.food_supplies.get(&food_supply_id) else {
-        return Ok(vec![eat_failed_event(
-            proposal,
-            ordering_key,
-            content_manifest_id,
-            food_supply_id.as_str(),
-            "knowledge",
-            "food source absent",
-            "target food supply is not present in physical state",
-        )]);
-    };
-
-    if food.is_empty() {
-        return Ok(vec![eat_failed_event(
-            proposal,
-            ordering_key,
-            content_manifest_id,
-            food_supply_id.as_str(),
-            "resource",
-            "food source empty",
-            "target food supply had zero servings",
-        )]);
-    }
-
-    if let Some(failure) = access_failure(state, food, &actor.actor_id, &actor.current_place_id) {
-        return Ok(vec![eat_failed_event(
-            proposal,
-            ordering_key,
-            content_manifest_id,
-            food_supply_id.as_str(),
-            "access",
-            failure.actor_visible_reason,
-            failure.absence_ancestry,
-        )]);
-    }
-
-    let consumed = food_consumed_event(
-        proposal,
-        ordering_key,
-        content_manifest_id,
-        food,
-        food.servings - 1,
-    );
-    let mut events = vec![consumed];
-    events.extend(eat_need_events(
-        agent_state,
-        proposal,
-        ordering_key,
-        content_manifest_id,
-        &events[0],
-        -food.hunger_reduction_per_serving,
-    ));
-    Ok(events)
+    Ok(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 fn food_consumed_event(
     proposal: &Proposal,
     ordering_key: &OrderingKey,
     content_manifest_id: &ContentManifestId,
     food: &FoodSupplyState,
     servings_after: u32,

---- food_unavailable_fixture_records_typed_failure_without_refill stdout ----

thread 'food_unavailable_fixture_records_typed_failure_without_refill' (32633) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1457:5:
assertion failed: has_event(&log, EventKind::EatFailed)

---- no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash stdout ----

thread 'no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash' (32639) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2904:5:
assertion failed: !records.is_empty()

---- no_hidden_truth_fixture_keeps_hidden_food_out_of_planner_inputs stdout ----

thread 'no_hidden_truth_fixture_keeps_hidden_food_out_of_planner_inputs' (32636) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2008:5:
assertion failed: has_event(&log, EventKind::EatFailed)

failures:
    food_unavailable_fixture_records_typed_failure_without_refill
    no_hidden_truth_fixture_keeps_hidden_food_out_of_planner_inputs
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash
    sleep_eat_work_fixture_logs_need_effects_and_replays

test result: FAILED. 36 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.27s

*** result: Failure(101)
