*** crates/tracewake-core/src/actions/defs/eat.rs:230:44: replace match guard carrier_id == actor_id with true in access_failure

*** mutation diff:
--- crates/tracewake-core/src/actions/defs/eat.rs
+++ replace match guard carrier_id == actor_id with true in access_failure
@@ -222,17 +222,17 @@
     actor_place_id: &crate::ids::PlaceId,
 ) -> Option<EatAccessFailure> {
     match &food.location {
         Location::AtPlace(place_id) if place_id == actor_place_id => None,
         Location::AtPlace(_) => Some(EatAccessFailure {
             actor_visible_reason: "food source not reachable",
             absence_ancestry: "food source not at actor place",
         }),
-        Location::CarriedBy(carrier_id) if carrier_id == actor_id => None,
+        Location::CarriedBy(carrier_id) if true /* ~ changed by cargo-mutants ~ */ => None,
         Location::CarriedBy(carrier_id) => Some(EatAccessFailure {
             actor_visible_reason: "food source not reachable",
             absence_ancestry: if state.actors.contains_key(carrier_id) {
                 "food source carried by another actor"
             } else {
                 "food source carrier absent"
             },
         }),

---- actions::defs::eat::tests::eat_carrier_access_failure_keeps_unobservable_distinction_out_of_reason stdout ----

thread 'actions::defs::eat::tests::eat_carrier_access_failure_keeps_unobservable_distinction_out_of_reason' (1061) panicked at crates/tracewake-core/src/actions/defs/eat.rs:677:14:
eat failure carries actor-facing reason

---- actions::defs::eat::tests::eat_food_carried_by_other_actor_fails_access_with_debug_ancestry stdout ----

thread 'actions::defs::eat::tests::eat_food_carried_by_other_actor_fails_access_with_debug_ancestry' (1065) panicked at crates/tracewake-core/src/actions/defs/eat.rs:644:9:
assertion `left == right` failed
  left: 2
 right: 1

failures:
    actions::defs::eat::tests::eat_carrier_access_failure_keeps_unobservable_distinction_out_of_reason
    actions::defs::eat::tests::eat_food_carried_by_other_actor_fails_access_with_debug_ancestry

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
