*** crates/tracewake-core/src/actions/defs/eat.rs:230:44: replace match guard carrier_id == actor_id with false in access_failure

*** mutation diff:
--- crates/tracewake-core/src/actions/defs/eat.rs
+++ replace match guard carrier_id == actor_id with false in access_failure
@@ -222,17 +222,17 @@
     actor_place_id: &crate::ids::PlaceId,
 ) -> Option<EatAccessFailure> {
     match &food.location {
         Location::AtPlace(place_id) if place_id == actor_place_id => None,
         Location::AtPlace(_) => Some(EatAccessFailure {
             actor_visible_reason: "food source not reachable",
             absence_ancestry: "food source not at actor place",
         }),
-        Location::CarriedBy(carrier_id) if carrier_id == actor_id => None,
+        Location::CarriedBy(carrier_id) if false /* ~ changed by cargo-mutants ~ */ => None,
         Location::CarriedBy(carrier_id) => Some(EatAccessFailure {
             actor_visible_reason: "food source not reachable",
             absence_ancestry: if state.actors.contains_key(carrier_id) {
                 "food source carried by another actor"
             } else {
                 "food source carrier absent"
             },
         }),

---- actions::defs::eat::tests::eat_self_carried_food_consumes_and_records_actor_payload stdout ----

thread 'actions::defs::eat::tests::eat_self_carried_food_consumes_and_records_actor_payload' (5631) panicked at crates/tracewake-core/src/actions/defs/eat.rs:620:9:
assertion `left == right` failed
  left: EatFailed
 right: FoodConsumed

failures:
    actions::defs::eat::tests::eat_self_carried_food_consumes_and_records_actor_payload

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
