*** crates/tracewake-core/src/actions/defs/eat.rs:252:16: delete ! in access_failure

*** mutation diff:
--- crates/tracewake-core/src/actions/defs/eat.rs
+++ delete ! in access_failure
@@ -244,17 +244,17 @@
                 });
             };
             if container.location != Location::AtPlace(actor_place_id.clone()) {
                 return Some(EatAccessFailure {
                     actor_visible_reason: "food source not reachable",
                     absence_ancestry: "food source container not reachable",
                 });
             }
-            if !container.is_open {
+            if  /* ~ changed by cargo-mutants ~ */container.is_open {
                 return Some(EatAccessFailure {
                     actor_visible_reason: "food source not reachable",
                     absence_ancestry: "food source container closed",
                 });
             }
             None
         }
     }

---- no_hidden_truth_fixture_keeps_hidden_food_out_of_planner_inputs stdout ----

thread 'no_hidden_truth_fixture_keeps_hidden_food_out_of_planner_inputs' (23349) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2008:5:
assertion failed: has_event(&log, EventKind::EatFailed)

failures:
    no_hidden_truth_fixture_keeps_hidden_food_out_of_planner_inputs

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.58s

*** result: Failure(101)
