*** crates/tracewake-core/src/actions/defs/eat.rs:287:5: replace location_payload -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-core/src/actions/defs/eat.rs
+++ replace location_payload -> String with "xyzzy".into()
@@ -279,21 +279,17 @@
             target,
             "That food source is invalid.",
             "eat target was not a stable food supply ID",
         )
     })
 }
 
 fn location_payload(location: &Location) -> String {
-    match location {
-        Location::AtPlace(id) => format!("place:{}", id.as_str()),
-        Location::InContainer(id) => format!("container:{}", id.as_str()),
-        Location::CarriedBy(id) => format!("actor:{}", id.as_str()),
-    }
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 fn actor_missing() -> ActionRejection {
     ActionRejection::new(
         PipelineStage::ActorLookup,
         ReasonCode::ActorNotFound,
         Vec::new(),
         "That actor cannot eat.",

---- actions::defs::eat::tests::eat_in_open_local_container_consumes_and_records_container_payload stdout ----

thread 'actions::defs::eat::tests::eat_in_open_local_container_consumes_and_records_container_payload' (32074) panicked at crates/tracewake-core/src/actions/defs/eat.rs:568:9:
assertion `left == right` failed
  left: Some("xyzzy")
 right: Some("container:pantry")

---- actions::defs::eat::tests::eat_records_location_payload_for_place_food stdout ----

thread 'actions::defs::eat::tests::eat_records_location_payload_for_place_food' (32076) panicked at crates/tracewake-core/src/actions/defs/eat.rs:452:9:
assertion `left == right` failed
  left: Some("xyzzy")
 right: Some("place:kitchen")

---- actions::defs::eat::tests::eat_self_carried_food_consumes_and_records_actor_payload stdout ----

thread 'actions::defs::eat::tests::eat_self_carried_food_consumes_and_records_actor_payload' (32078) panicked at crates/tracewake-core/src/actions/defs/eat.rs:617:9:
assertion `left == right` failed
  left: Some("xyzzy")
 right: Some("actor:actor_tomas")

failures:
    actions::defs::eat::tests::eat_in_open_local_container_consumes_and_records_container_payload
    actions::defs::eat::tests::eat_records_location_payload_for_place_food
    actions::defs::eat::tests::eat_self_carried_food_consumes_and_records_actor_payload

test result: FAILED. 452 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
