*** crates/tracewake-core/src/actions/defs/eat.rs:67:23: replace - with + in build_eat_events

*** mutation diff:
--- crates/tracewake-core/src/actions/defs/eat.rs
+++ replace - with + in build_eat_events
@@ -59,17 +59,17 @@
         )]);
     }
 
     let consumed = food_consumed_event(
         proposal,
         ordering_key,
         content_manifest_id,
         food,
-        food.servings - 1,
+        food.servings + /* ~ changed by cargo-mutants ~ */ 1,
     );
     let mut events = vec![consumed];
     events.extend(eat_need_events(
         agent_state,
         proposal,
         ordering_key,
         content_manifest_id,
         &events[0],

---- sleep_eat_work_fixture_logs_need_effects_and_replays stdout ----

thread 'sleep_eat_work_fixture_logs_need_effects_and_replays' (4306) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1270:5:
assertion failed: has_event(&log, EventKind::FoodConsumed)

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (4280) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2172:5:
assertion `left == right` failed
  left: {ActorId(StableId("actor_anna")), ActorId(StableId("actor_elena")), ActorId(StableId("actor_mara"))}
 right: {ActorId(StableId("actor_anna")), ActorId(StableId("actor_elena")), ActorId(StableId("actor_mara")), ActorId(StableId("actor_tomas"))}

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (4281) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2714:5:
assertion failed: has_event(&log, EventKind::ActorMoved)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    sleep_eat_work_fixture_logs_need_effects_and_replays

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.47s

*** result: Failure(101)
