*** crates/tracewake-core/src/actions/defs/eat.rs:76:9: delete - in build_eat_events

*** mutation diff:
--- crates/tracewake-core/src/actions/defs/eat.rs
+++ delete - in build_eat_events
@@ -68,17 +68,17 @@
     );
     let mut events = vec![consumed];
     events.extend(eat_need_events(
         agent_state,
         proposal,
         ordering_key,
         content_manifest_id,
         &events[0],
-        -food.hunger_reduction_per_serving,
+         /* ~ changed by cargo-mutants ~ */food.hunger_reduction_per_serving,
     ));
     Ok(events)
 }
 
 fn food_consumed_event(
     proposal: &Proposal,
     ordering_key: &OrderingKey,
     content_manifest_id: &ContentManifestId,

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (12479) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (12480) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2714:5:
assertion failed: has_event(&log, EventKind::ActorMoved)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection

test result: FAILED. 40 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.48s

*** result: Failure(101)
