*** crates/tracewake-core/src/actions/defs/sleep.rs:124:53: replace || with && in require_sleep_affordance

*** mutation diff:
--- crates/tracewake-core/src/actions/defs/sleep.rs
+++ replace || with && in require_sleep_affordance
@@ -116,17 +116,17 @@
         })?;
     let Some(sleep_affordance) = state.sleep_affordances.get(&sleep_affordance_id) else {
         return Err(no_sleep_affordance_rejection(
             "unknown_sleep_affordance_id",
             actor_place_id,
             sleep_affordance_id.as_str(),
         ));
     };
-    if sleep_affordance.place_id != *actor_place_id || !sleep_affordance.access_open {
+    if sleep_affordance.place_id != *actor_place_id && /* ~ changed by cargo-mutants ~ */ !sleep_affordance.access_open {
         return Err(no_sleep_affordance_rejection(
             "sleep_affordance_not_open_at_actor_place",
             actor_place_id,
             sleep_affordance_id.as_str(),
         ));
     }
     if let Some(sleep_place_id) = proposal.parameters.get("sleep_place_id") {
         if sleep_place_id != sleep_affordance.place_id.as_str() {

---- actions::defs::sleep::tests::sleep_rejects_forged_or_stale_affordance stdout ----

thread 'actions::defs::sleep::tests::sleep_rejects_forged_or_stale_affordance' (4232) panicked at crates/tracewake-core/src/actions/defs/sleep.rs:832:9:
assertion `left == right` failed
  left: ActorNotAtRequiredPlace
 right: NoSleepAffordance

failures:
    actions::defs::sleep::tests::sleep_rejects_forged_or_stale_affordance

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
