*** crates/tracewake-core/src/actions/defs/sleep.rs:124:56: delete ! in require_sleep_affordance

*** mutation diff:
--- crates/tracewake-core/src/actions/defs/sleep.rs
+++ delete ! in require_sleep_affordance
@@ -116,17 +116,17 @@
         })?;
     let Some(sleep_affordance) = state.sleep_affordances.get(&sleep_affordance_id) else {
         return Err(no_sleep_affordance_rejection(
             "unknown_sleep_affordance_id",
             actor_place_id,
             sleep_affordance_id.as_str(),
         ));
     };
-    if sleep_affordance.place_id != *actor_place_id || !sleep_affordance.access_open {
+    if sleep_affordance.place_id != *actor_place_id ||  /* ~ changed by cargo-mutants ~ */sleep_affordance.access_open {
         return Err(no_sleep_affordance_rejection(
             "sleep_affordance_not_open_at_actor_place",
             actor_place_id,
             sleep_affordance_id.as_str(),
         ));
     }
     if let Some(sleep_place_id) = proposal.parameters.get("sleep_place_id") {
         if sleep_place_id != sleep_affordance.place_id.as_str() {

---- episode_tamper_output_tag_poisons_replay stdout ----

thread 'episode_tamper_output_tag_poisons_replay' (12810) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:993:10:
sleep starts

---- episode_tamper_proration_poisons_replay stdout ----

thread 'episode_tamper_proration_poisons_replay' (12811) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2851:5:
assertion failed: has_event(&log, EventKind::SleepInterrupted)

---- serialized_event_log_replays_to_identical_state stdout ----

thread 'serialized_event_log_replays_to_identical_state' (12841) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:993:10:
sleep starts

failures:
    episode_tamper_output_tag_poisons_replay
    episode_tamper_proration_poisons_replay
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    serialized_event_log_replays_to_identical_state
    sleep_eat_work_fixture_logs_need_effects_and_replays
    sleep_spanning_window_boundary_charges_each_tick_once
    work_block_failed_then_sleep_succeeds_fixture_closes_reservation

test result: FAILED. 34 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.51s

*** result: Failure(101)
