*** crates/tracewake-core/src/actions/defs/sleep.rs:176:5: replace build_sleep_completion_events -> Result<Vec<EventEnvelope>, ApplyError> with Ok(vec![])

*** mutation diff:
--- crates/tracewake-core/src/actions/defs/sleep.rs
+++ replace build_sleep_completion_events -> Result<Vec<EventEnvelope>, ApplyError> with Ok(vec![])
@@ -168,37 +168,17 @@
     state: &PhysicalState,
     agent_state: &AgentState,
     log: &EventLog,
     sleep_started_event: &EventEnvelope,
     ordering_key: &OrderingKey,
     content_manifest_id: &ContentManifestId,
     completion_tick: SimTick,
 ) -> Result<Vec<EventEnvelope>, ApplyError> {
-    if let Some(reason) = sleep_interruption_reason(state, agent_state, sleep_started_event) {
-        return build_sleep_interruption_events(
-            agent_state,
-            sleep_started_event,
-            log,
-            ordering_key,
-            content_manifest_id,
-            completion_tick,
-            reason,
-        );
-    }
-    build_sleep_end_events(
-        agent_state,
-        sleep_started_event,
-        log,
-        ordering_key,
-        content_manifest_id,
-        completion_tick,
-        EventKind::SleepCompleted,
-        "sleep completed",
-    )
+    Ok(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 fn sleep_interruption_reason(
     state: &PhysicalState,
     agent_state: &AgentState,
     sleep_started_event: &EventEnvelope,
 ) -> Option<&'static str> {
     let Some(actor_id) = sleep_started_event.actor_id.as_ref() else {

---- episode_tamper_output_tag_poisons_replay stdout ----

thread 'episode_tamper_output_tag_poisons_replay' (21020) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1055:10:
work starts

---- episode_tamper_proration_poisons_replay stdout ----

thread 'episode_tamper_proration_poisons_replay' (21021) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2851:5:
assertion failed: has_event(&log, EventKind::SleepInterrupted)

---- serialized_event_log_replays_to_identical_state stdout ----

thread 'serialized_event_log_replays_to_identical_state' (21051) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1055:10:
work starts

failures:
    episode_tamper_output_tag_poisons_replay
    episode_tamper_proration_poisons_replay
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    serialized_event_log_replays_to_identical_state
    sleep_eat_work_fixture_logs_need_effects_and_replays
    sleep_spanning_window_boundary_charges_each_tick_once

test result: FAILED. 36 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.56s

*** result: Failure(101)
