*** crates/tracewake-core/src/actions/defs/sleep.rs:204:5: replace sleep_interruption_reason -> Option<&'static str> with Some("xyzzy")

*** mutation diff:
--- crates/tracewake-core/src/actions/defs/sleep.rs
+++ replace sleep_interruption_reason -> Option<&'static str> with Some("xyzzy")
@@ -196,40 +196,17 @@
     )
 }
 
 fn sleep_interruption_reason(
     state: &PhysicalState,
     agent_state: &AgentState,
     sleep_started_event: &EventEnvelope,
 ) -> Option<&'static str> {
-    let Some(actor_id) = sleep_started_event.actor_id.as_ref() else {
-        return Some("actor_missing");
-    };
-    let Some(actor) = state.actors.get(actor_id) else {
-        return Some("actor_missing");
-    };
-    let Some(sleep_affordance_id) = payload_value(sleep_started_event, "sleep_affordance_id")
-        .and_then(|value| SleepAffordanceId::new(value).ok())
-    else {
-        return Some("sleep_affordance_missing");
-    };
-    let Some(sleep_affordance) = state.sleep_affordances.get(&sleep_affordance_id) else {
-        return Some("sleep_affordance_missing");
-    };
-    if actor.current_place_id != sleep_affordance.place_id {
-        return Some("actor_displaced");
-    }
-    if !sleep_affordance.access_open {
-        return Some("sleep_affordance_closed");
-    }
-    if has_severe_interrupting_need(agent_state, actor_id) {
-        return Some("severe_need_pressure");
-    }
-    None
+    Some("xyzzy") /* ~ changed by cargo-mutants ~ */
 }
 
 fn has_severe_interrupting_need(agent_state: &AgentState, actor_id: &crate::ids::ActorId) -> bool {
     agent_state
         .needs_by_actor
         .get(actor_id)
         .is_some_and(|needs| {
             [NeedKind::Hunger, NeedKind::Safety].iter().any(|kind| {

---- sleep_eat_work_fixture_logs_need_effects_and_replays stdout ----

thread 'sleep_eat_work_fixture_logs_need_effects_and_replays' (895) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1269:5:
assertion failed: has_event(&log, EventKind::SleepCompleted)

---- sleep_spanning_window_boundary_charges_each_tick_once stdout ----

thread 'sleep_spanning_window_boundary_charges_each_tick_once' (896) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2529:5:
assertion failed: has_event(&log, EventKind::SleepCompleted)

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (869) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2177:5:
assertion failed: has_no_human_event(&log, EventKind::SleepCompleted)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    sleep_eat_work_fixture_logs_need_effects_and_replays
    sleep_spanning_window_boundary_charges_each_tick_once

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.58s

*** result: Failure(101)
