*** crates/tracewake-core/src/actions/defs/sleep.rs:221:8: delete ! in sleep_interruption_reason

*** mutation diff:
--- crates/tracewake-core/src/actions/defs/sleep.rs
+++ delete ! in sleep_interruption_reason
@@ -213,17 +213,17 @@
         return Some("sleep_affordance_missing");
     };
     let Some(sleep_affordance) = state.sleep_affordances.get(&sleep_affordance_id) else {
         return Some("sleep_affordance_missing");
     };
     if actor.current_place_id != sleep_affordance.place_id {
         return Some("actor_displaced");
     }
-    if !sleep_affordance.access_open {
+    if  /* ~ changed by cargo-mutants ~ */sleep_affordance.access_open {
         return Some("sleep_affordance_closed");
     }
     if has_severe_interrupting_need(agent_state, actor_id) {
         return Some("severe_need_pressure");
     }
     None
 }

---- sleep_eat_work_fixture_logs_need_effects_and_replays stdout ----

thread 'sleep_eat_work_fixture_logs_need_effects_and_replays' (9094) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1269:5:
assertion failed: has_event(&log, EventKind::SleepCompleted)

---- sleep_spanning_window_boundary_charges_each_tick_once stdout ----

thread 'sleep_spanning_window_boundary_charges_each_tick_once' (9095) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2529:5:
assertion failed: has_event(&log, EventKind::SleepCompleted)

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (9068) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2177:5:
assertion failed: has_no_human_event(&log, EventKind::SleepCompleted)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    sleep_eat_work_fixture_logs_need_effects_and_replays
    sleep_spanning_window_boundary_charges_each_tick_once

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.58s

*** result: Failure(101)
