*** crates/tracewake-core/src/actions/defs/sleep.rs:231:5: replace has_severe_interrupting_need -> bool with true

*** mutation diff:
--- crates/tracewake-core/src/actions/defs/sleep.rs
+++ replace has_severe_interrupting_need -> bool with true
@@ -223,26 +223,17 @@
     }
     if has_severe_interrupting_need(agent_state, actor_id) {
         return Some("severe_need_pressure");
     }
     None
 }
 
 fn has_severe_interrupting_need(agent_state: &AgentState, actor_id: &crate::ids::ActorId) -> bool {
-    agent_state
-        .needs_by_actor
-        .get(actor_id)
-        .is_some_and(|needs| {
-            [NeedKind::Hunger, NeedKind::Safety].iter().any(|kind| {
-                needs
-                    .get(kind)
-                    .is_some_and(|need| need.band() == NeedBand::Severe)
-            })
-        })
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn payload_value<'a>(event: &'a EventEnvelope, key: &str) -> Option<&'a str> {
     event
         .payload
         .iter()
         .find(|field| field.key == key)
         .map(|field| field.value.as_str())

---- sleep_eat_work_fixture_logs_need_effects_and_replays stdout ----

thread 'sleep_eat_work_fixture_logs_need_effects_and_replays' (13193) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1269:5:
assertion failed: has_event(&log, EventKind::SleepCompleted)

---- sleep_spanning_window_boundary_charges_each_tick_once stdout ----

thread 'sleep_spanning_window_boundary_charges_each_tick_once' (13194) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2529:5:
assertion failed: has_event(&log, EventKind::SleepCompleted)

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (13167) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2177:5:
assertion failed: has_no_human_event(&log, EventKind::SleepCompleted)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    sleep_eat_work_fixture_logs_need_effects_and_replays
    sleep_spanning_window_boundary_charges_each_tick_once

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.57s

*** result: Failure(101)
