*** crates/tracewake-core/src/actions/defs/sleep.rs:231:5: replace has_severe_interrupting_need -> bool with false

*** mutation diff:
--- crates/tracewake-core/src/actions/defs/sleep.rs
+++ replace has_severe_interrupting_need -> bool with false
@@ -223,26 +223,17 @@
     }
     if has_severe_interrupting_need(agent_state, actor_id) {
         return Some("severe_need_pressure");
     }
     None
 }
 
 fn has_severe_interrupting_need(agent_state: &AgentState, actor_id: &crate::ids::ActorId) -> bool {
-    agent_state
-        .needs_by_actor
-        .get(actor_id)
-        .is_some_and(|needs| {
-            [NeedKind::Hunger, NeedKind::Safety].iter().any(|kind| {
-                needs
-                    .get(kind)
-                    .is_some_and(|need| need.band() == NeedBand::Severe)
-            })
-        })
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn payload_value<'a>(event: &'a EventEnvelope, key: &str) -> Option<&'a str> {
     event
         .payload
         .iter()
         .find(|field| field.key == key)
         .map(|field| field.value.as_str())

---- episode_tamper_proration_poisons_replay stdout ----

thread 'episode_tamper_proration_poisons_replay' (17259) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2851:5:
assertion failed: has_event(&log, EventKind::SleepInterrupted)

failures:
    episode_tamper_proration_poisons_replay

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.59s

*** result: Failure(101)
