*** crates/tracewake-core/src/actions/defs/sleep.rs:244:5: replace payload_value -> Option<&'a str> with Some("xyzzy")

*** mutation diff:
--- crates/tracewake-core/src/actions/defs/sleep.rs
+++ replace payload_value -> Option<&'a str> with Some("xyzzy")
@@ -236,21 +236,17 @@
                 needs
                     .get(kind)
                     .is_some_and(|need| need.band() == NeedBand::Severe)
             })
         })
 }
 
 fn payload_value<'a>(event: &'a EventEnvelope, key: &str) -> Option<&'a str> {
-    event
-        .payload
-        .iter()
-        .find(|field| field.key == key)
-        .map(|field| field.value.as_str())
+    Some("xyzzy") /* ~ changed by cargo-mutants ~ */
 }
 
 fn payload_i32(event: &EventEnvelope, key: &'static str) -> Result<i32, ApplyError> {
     let value = payload_value(event, key).ok_or(ApplyError::MissingPayload(key))?;
     value.parse().map_err(|_| ApplyError::BadPayload {
         key,
         value: value.to_string(),
     })

---- episode_tamper_output_tag_poisons_replay stdout ----

thread 'episode_tamper_output_tag_poisons_replay' (1186) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1004:6:
called `Result::unwrap()` on an `Err` value: BadPayload { key: "fatigue_recovery_per_tick", value: "xyzzy" }

---- serialized_event_log_replays_to_identical_state stdout ----

thread 'serialized_event_log_replays_to_identical_state' (1217) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1004:6:
called `Result::unwrap()` on an `Err` value: BadPayload { key: "fatigue_recovery_per_tick", value: "xyzzy" }

---- sleep_eat_work_fixture_logs_need_effects_and_replays stdout ----

thread 'sleep_eat_work_fixture_logs_need_effects_and_replays' (1220) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1204:6:
called `Result::unwrap()` on an `Err` value: BadPayload { key: "fatigue_recovery_per_tick", value: "xyzzy" }

failures:
    episode_tamper_output_tag_poisons_replay
    episode_tamper_proration_poisons_replay
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    serialized_event_log_replays_to_identical_state
    sleep_eat_work_fixture_logs_need_effects_and_replays
    sleep_spanning_window_boundary_charges_each_tick_once

test result: FAILED. 36 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.58s

*** result: Failure(101)
