*** crates/tracewake-core/src/actions/defs/sleep.rs:252:5: replace payload_i32 -> Result<i32, ApplyError> with Ok(1)

*** mutation diff:
--- crates/tracewake-core/src/actions/defs/sleep.rs
+++ replace payload_i32 -> Result<i32, ApplyError> with Ok(1)
@@ -244,21 +244,17 @@
     event
         .payload
         .iter()
         .find(|field| field.key == key)
         .map(|field| field.value.as_str())
 }
 
 fn payload_i32(event: &EventEnvelope, key: &'static str) -> Result<i32, ApplyError> {
-    let value = payload_value(event, key).ok_or(ApplyError::MissingPayload(key))?;
-    value.parse().map_err(|_| ApplyError::BadPayload {
-        key,
-        value: value.to_string(),
-    })
+    Ok(1) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn build_sleep_interruption_events(
     agent_state: &AgentState,
     sleep_started_event: &EventEnvelope,
     log: &EventLog,
     ordering_key: &OrderingKey,
     content_manifest_id: &ContentManifestId,

---- actions::defs::sleep::tests::sleep_completion_interrupts_on_severe_need_with_prorated_recovery stdout ----

thread 'actions::defs::sleep::tests::sleep_completion_interrupts_on_severe_need_with_prorated_recovery' (14021) panicked at crates/tracewake-core/src/actions/defs/sleep.rs:704:9:
assertion failed: events.iter().any(|event|
        {
            event.event_type == EventKind::NeedDeltaApplied &&
                    event.payload.iter().any(|field|
                            field.key == "need_kind" && field.value == "fatigue") &&
                event.payload.iter().any(|field|
                        field.key == "delta" && field.value == "-40")
        })

---- actions::defs::sleep::tests::malformed_sleep_start_payload_returns_typed_error stdout ----

thread 'actions::defs::sleep::tests::malformed_sleep_start_payload_returns_typed_error' (14020) panicked at crates/tracewake-core/src/actions/defs/sleep.rs:665:10:

---- actions::defs::sleep::tests::sleep_completion_recovers_fatigue_by_elapsed_duration stdout ----

thread 'actions::defs::sleep::tests::sleep_completion_recovers_fatigue_by_elapsed_duration' (14022) panicked at crates/tracewake-core/src/actions/defs/sleep.rs:615:9:
assertion failed: fatigue.payload.iter().any(|field|
        field.key == "delta" && field.value == "-60")

failures:
    actions::defs::sleep::tests::malformed_sleep_start_payload_returns_typed_error
    actions::defs::sleep::tests::sleep_completion_interrupts_on_severe_need_with_prorated_recovery
    actions::defs::sleep::tests::sleep_completion_recovers_fatigue_by_elapsed_duration
    actions::defs::sleep::tests::sleep_interruption_records_partial_recovery
    scheduler::no_human::tests::scheduler_completion_reports_malformed_start_without_panic

test result: FAILED. 450 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
