*** crates/tracewake-core/src/actions/defs/sleep.rs:268:5: replace build_sleep_interruption_events -> Result<Vec<EventEnvelope>, ApplyError> with Ok(vec![])

*** mutation diff:
--- crates/tracewake-core/src/actions/defs/sleep.rs
+++ replace build_sleep_interruption_events -> Result<Vec<EventEnvelope>, ApplyError> with Ok(vec![])
@@ -260,26 +260,17 @@
     agent_state: &AgentState,
     sleep_started_event: &EventEnvelope,
     log: &EventLog,
     ordering_key: &OrderingKey,
     content_manifest_id: &ContentManifestId,
     interruption_tick: SimTick,
     reason: &str,
 ) -> Result<Vec<EventEnvelope>, ApplyError> {
-    build_sleep_end_events(
-        agent_state,
-        sleep_started_event,
-        log,
-        ordering_key,
-        content_manifest_id,
-        interruption_tick,
-        EventKind::SleepInterrupted,
-        reason,
-    )
+    Ok(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 #[allow(clippy::too_many_arguments)]
 fn build_sleep_end_events(
     agent_state: &AgentState,
     sleep_started_event: &EventEnvelope,
     log: &EventLog,
     ordering_key: &OrderingKey,

---- episode_tamper_proration_poisons_replay stdout ----

thread 'episode_tamper_proration_poisons_replay' (23063) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2851:5:
assertion failed: has_event(&log, EventKind::SleepInterrupted)

failures:
    episode_tamper_proration_poisons_replay

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.58s

*** result: Failure(101)
