*** crates/tracewake-core/src/actions/defs/sleep.rs:306:25: delete - in build_sleep_end_events

*** mutation diff:
--- crates/tracewake-core/src/actions/defs/sleep.rs
+++ delete - in build_sleep_end_events
@@ -298,17 +298,17 @@
     let sleep_ticks = classify_actor_tick_regimes_with_start(
         log,
         &actor_id,
         sleep_started_event.sim_tick,
         end_tick,
         Some(sleep_started_event),
     )
     .asleep_ticks;
-    let fatigue_delta = -(sleep_ticks as i32).saturating_mul(payload_i32(
+    let fatigue_delta =  /* ~ changed by cargo-mutants ~ */(sleep_ticks as i32).saturating_mul(payload_i32(
         sleep_started_event,
         "fatigue_recovery_per_tick",
     )?);
     let hunger_delta = (sleep_ticks as i32)
         .saturating_mul(payload_i32(sleep_started_event, "hunger_rise_per_tick")?);
     let mut lifecycle = EventEnvelope::new_caused_v1(
         EventId::new(format!(
             "event.{}.{}",

---- actions::defs::sleep::tests::sleep_completion_recovers_fatigue_by_elapsed_duration stdout ----

thread 'actions::defs::sleep::tests::sleep_completion_recovers_fatigue_by_elapsed_duration' (31362) panicked at crates/tracewake-core/src/actions/defs/sleep.rs:619:9:
assertion failed: fatigue.payload.iter().any(|field|
        field.key == "delta" && field.value == "-60")

---- actions::defs::sleep::tests::sleep_completion_interrupts_on_severe_need_with_prorated_recovery stdout ----

thread 'actions::defs::sleep::tests::sleep_completion_interrupts_on_severe_need_with_prorated_recovery' (31361) panicked at crates/tracewake-core/src/actions/defs/sleep.rs:708:9:
assertion failed: events.iter().any(|event|
        {
            event.event_type == EventKind::NeedDeltaApplied &&
                    event.payload.iter().any(|field|
                            field.key == "need_kind" && field.value == "fatigue") &&
                event.payload.iter().any(|field|
                        field.key == "delta" && field.value == "-40")
        })

---- actions::defs::sleep::tests::sleep_interruption_records_partial_recovery stdout ----

thread 'actions::defs::sleep::tests::sleep_interruption_records_partial_recovery' (31363) panicked at crates/tracewake-core/src/actions/defs/sleep.rs:752:9:
assertion failed: events.iter().any(|event|
        {
            event.event_type == EventKind::NeedDeltaApplied &&
                    event.payload.iter().any(|field|
                            field.key == "need_kind" && field.value == "fatigue") &&
                event.payload.iter().any(|field|
                        field.key == "delta" && field.value == "-20")
        })

failures:
    actions::defs::sleep::tests::sleep_completion_interrupts_on_severe_need_with_prorated_recovery
    actions::defs::sleep::tests::sleep_completion_recovers_fatigue_by_elapsed_duration
    actions::defs::sleep::tests::sleep_interruption_records_partial_recovery

test result: FAILED. 452 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
