*** crates/tracewake-core/src/actions/defs/sleep.rs:385:5: replace sleep_need_events -> Result<Vec<EventEnvelope>, ApplyError> with Ok(vec![])

*** mutation diff:
--- crates/tracewake-core/src/actions/defs/sleep.rs
+++ replace sleep_need_events -> Result<Vec<EventEnvelope>, ApplyError> with Ok(vec![])
@@ -377,64 +377,17 @@
     sleep_started_event: &EventEnvelope,
     ordering_key: &OrderingKey,
     content_manifest_id: &ContentManifestId,
     tick: SimTick,
     need_kind: NeedKind,
     delta: i32,
     elapsed_ticks: u64,
 ) -> Result<Vec<EventEnvelope>, ApplyError> {
-    let actor_id = sleep_started_event
-        .actor_id
-        .clone()
-        .ok_or_else(|| ApplyError::BadPayload {
-            key: "actor_id",
-            value: "missing".to_string(),
-        })?;
-    let current = agent_state
-        .needs_by_actor
-        .get(&actor_id)
-        .and_then(|needs| needs.get(&need_kind))
-        .map(crate::agent::NeedState::value);
-    Ok(build_need_delta_and_threshold_events(
-        NeedDeltaEventSpec {
-            event_id: EventId::new(format!(
-                "event.sleep_need_delta.{}.{}",
-                need_kind.stable_id(),
-                sleep_started_event.event_id.as_str()
-            ))
-            .unwrap(),
-            threshold_event_id: EventId::new(format!(
-                "event.sleep_need_threshold.{}.{}",
-                need_kind.stable_id(),
-                sleep_started_event.event_id.as_str()
-            ))
-            .unwrap(),
-            tick,
-            ordering_key: ordering_key.clone(),
-            content_manifest_id: content_manifest_id.clone(),
-            causes: vec![EventCause::Event(sleep_started_event.event_id.clone())],
-            actor_id: actor_id.clone(),
-            proposal_id: sleep_started_event.proposal_id.clone(),
-            process_id: None,
-            participants: vec![actor_id.to_string()],
-            need_kind,
-            delta,
-            elapsed_ticks,
-            cause_kind: "action_effect".to_string(),
-            cause_action_id: Some("sleep".to_string()),
-            extra_payload: Vec::new(),
-            delta_effects_summary: format!("{} delta from elapsed sleep", need_kind.stable_id()),
-            threshold_effects_summary: format!(
-                "{} crossed threshold during sleep",
-                need_kind.stable_id()
-            ),
-        },
-        current,
-    ))
+    Ok(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_duration_ticks(proposal: &Proposal) -> Result<Option<u64>, ActionRejection> {
     let duration_ticks = proposal
         .parameters
         .get("duration_ticks")
         .map(|value| value.parse::<u64>())
         .transpose()

---- sleep_eat_work_fixture_logs_need_effects_and_replays stdout ----

thread 'sleep_eat_work_fixture_logs_need_effects_and_replays' (3409) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1272:5:
assertion failed: log.events().iter().filter(|event|
                event.event_type == EventKind::NeedDeltaApplied).count() >= 5

failures:
    sleep_eat_work_fixture_logs_need_effects_and_replays

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.58s

*** result: Failure(101)
