*** crates/tracewake-core/src/actions/defs/sleep.rs:436:5: replace parse_duration_ticks -> Result<Option<u64>, ActionRejection> with Ok(Some(0))

*** mutation diff:
--- crates/tracewake-core/src/actions/defs/sleep.rs
+++ replace parse_duration_ticks -> Result<Option<u64>, ActionRejection> with Ok(Some(0))
@@ -428,47 +428,17 @@
                 need_kind.stable_id()
             ),
         },
         current,
     ))
 }
 
 fn parse_duration_ticks(proposal: &Proposal) -> Result<Option<u64>, ActionRejection> {
-    let duration_ticks = proposal
-        .parameters
-        .get("duration_ticks")
-        .map(|value| value.parse::<u64>())
-        .transpose()
-        .map_err(|_| {
-            ActionRejection::new(
-                PipelineStage::CostDurationCheck,
-                ReasonCode::InvalidParameter,
-                vec![CheckedFact::new(
-                    "duration_ticks",
-                    proposal
-                        .parameters
-                        .get("duration_ticks")
-                        .cloned()
-                        .unwrap_or_default(),
-                )],
-                "That sleep duration is invalid.",
-                "sleep duration_ticks parameter was not an unsigned integer",
-            )
-        })?;
-    if duration_ticks == Some(0) {
-        return Err(ActionRejection::new(
-            PipelineStage::CostDurationCheck,
-            ReasonCode::InvalidParameter,
-            vec![CheckedFact::new("duration_ticks", "0")],
-            "That sleep duration is invalid.",
-            "sleep duration must be greater than zero",
-        ));
-    }
-    Ok(duration_ticks)
+    Ok(Some(0)) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use std::collections::BTreeMap;
 
     use super::*;
     use crate::actions::proposal::ProposalOrigin;

---- sleep_spanning_window_boundary_charges_each_tick_once stdout ----

thread 'sleep_spanning_window_boundary_charges_each_tick_once' (12081) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:738:17:
action_effect duration charge interval is positive

---- no_human_need_ledger_has_no_duplicate_regime_charges stdout ----

thread 'no_human_need_ledger_has_no_duplicate_regime_charges' (12058) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:738:17:
action_effect duration charge interval is positive

failures:
    no_human_need_ledger_has_no_duplicate_regime_charges
    sleep_spanning_window_boundary_charges_each_tick_once

test result: FAILED. 40 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.59s

*** result: Failure(101)
