*** crates/tracewake-core/src/actions/defs/sleep.rs:436:5: replace parse_duration_ticks -> Result<Option<u64>, ActionRejection> with Ok(Some(1))

*** mutation diff:
--- crates/tracewake-core/src/actions/defs/sleep.rs
+++ replace parse_duration_ticks -> Result<Option<u64>, ActionRejection> with Ok(Some(1))
@@ -428,47 +428,17 @@
                 need_kind.stable_id()
             ),
         },
         current,
     ))
 }
 
 fn parse_duration_ticks(proposal: &Proposal) -> Result<Option<u64>, ActionRejection> {
-    let duration_ticks = proposal
-        .parameters
-        .get("duration_ticks")
-        .map(|value| value.parse::<u64>())
-        .transpose()
-        .map_err(|_| {
-            ActionRejection::new(
-                PipelineStage::CostDurationCheck,
-                ReasonCode::InvalidParameter,
-                vec![CheckedFact::new(
-                    "duration_ticks",
-                    proposal
-                        .parameters
-                        .get("duration_ticks")
-                        .cloned()
-                        .unwrap_or_default(),
-                )],
-                "That sleep duration is invalid.",
-                "sleep duration_ticks parameter was not an unsigned integer",
-            )
-        })?;
-    if duration_ticks == Some(0) {
-        return Err(ActionRejection::new(
-            PipelineStage::CostDurationCheck,
-            ReasonCode::InvalidParameter,
-            vec![CheckedFact::new("duration_ticks", "0")],
-            "That sleep duration is invalid.",
-            "sleep duration must be greater than zero",
-        ));
-    }
-    Ok(duration_ticks)
+    Ok(Some(1)) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use std::collections::BTreeMap;
 
     use super::*;
     use crate::actions::proposal::ProposalOrigin;

---- actions::defs::sleep::tests::sleep_start_is_duration_based_and_does_not_recover_fatigue stdout ----

thread 'actions::defs::sleep::tests::sleep_start_is_duration_based_and_does_not_recover_fatigue' (16228) panicked at crates/tracewake-core/src/actions/defs/sleep.rs:534:9:
assertion failed: event.payload.iter().any(|field|
        { field.key == "expected_completion_tick" && field.value == "13" })

---- scheduler::no_human::tests::advance_catches_up_intervening_ticks_before_later_proposal stdout ----

thread 'scheduler::no_human::tests::advance_catches_up_intervening_ticks_before_later_proposal' (16580) panicked at crates/tracewake-core/src/scheduler.rs:3231:13:
assertion `left == right` failed
  left: SimTick(1)
 right: SimTick(2)

failures:
    actions::defs::sleep::tests::sleep_start_is_duration_based_and_does_not_recover_fatigue
    scheduler::no_human::tests::advance_catches_up_intervening_ticks_before_later_proposal

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
