*** crates/tracewake-core/src/actions/defs/work.rs:100:34: replace > with == in build_work_start_events

*** mutation diff:
--- crates/tracewake-core/src/actions/defs/work.rs
+++ replace > with == in build_work_start_events
@@ -92,17 +92,17 @@
             proposal,
             ordering_key,
             content_manifest_id,
             workplace,
             "need",
             "hunger state missing for work",
         )]);
     };
-    if i32::from(current_hunger) > workplace.max_hunger_to_start {
+    if i32::from(current_hunger) == /* ~ changed by cargo-mutants ~ */ workplace.max_hunger_to_start {
         return Ok(vec![work_failed_event(
             proposal,
             ordering_key,
             content_manifest_id,
             workplace,
             "need",
             "hunger too high for work",
         )]);

---- actions::defs::work::tests::work_missing_or_malformed_need_parameters_do_not_default_to_safe_pass stdout ----

thread 'actions::defs::work::tests::work_missing_or_malformed_need_parameters_do_not_default_to_safe_pass' (30726) panicked at crates/tracewake-core/src/actions/defs/work.rs:1050:9:
assertion `left == right` failed
  left: WorkBlockStarted
 right: WorkBlockFailed

---- actions::defs::work::tests::work_start_allows_needs_at_authored_thresholds stdout ----

thread 'actions::defs::work::tests::work_start_allows_needs_at_authored_thresholds' (30728) panicked at crates/tracewake-core/src/actions/defs/work.rs:758:9:
assertion `left == right` failed
  left: WorkBlockFailed
 right: WorkBlockStarted

failures:
    actions::defs::work::tests::work_missing_or_malformed_need_parameters_do_not_default_to_safe_pass
    actions::defs::work::tests::work_start_allows_needs_at_authored_thresholds

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
