*** crates/tracewake-core/src/actions/defs/work.rs:100:34: replace > with < in build_work_start_events

*** mutation diff:
--- crates/tracewake-core/src/actions/defs/work.rs
+++ replace > with < in build_work_start_events
@@ -92,17 +92,17 @@
             proposal,
             ordering_key,
             content_manifest_id,
             workplace,
             "need",
             "hunger state missing for work",
         )]);
     };
-    if i32::from(current_hunger) > workplace.max_hunger_to_start {
+    if i32::from(current_hunger) < /* ~ changed by cargo-mutants ~ */ workplace.max_hunger_to_start {
         return Ok(vec![work_failed_event(
             proposal,
             ordering_key,
             content_manifest_id,
             workplace,
             "need",
             "hunger too high for work",
         )]);

---- episode_tamper_output_tag_poisons_replay stdout ----

thread 'episode_tamper_output_tag_poisons_replay' (2710) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1055:10:
work starts

---- ordinary_workday_fixture_moves_before_work_completion stdout ----

thread 'ordinary_workday_fixture_moves_before_work_completion' (2725) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1142:10:
work starts after movement ancestry

---- serialized_event_log_replays_to_identical_state stdout ----

thread 'serialized_event_log_replays_to_identical_state' (2741) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1055:10:
work starts

failures:
    episode_tamper_output_tag_poisons_replay
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    ordinary_workday_fixture_moves_before_work_completion
    serialized_event_log_replays_to_identical_state
    sleep_eat_work_fixture_logs_need_effects_and_replays
    work_block_failed_then_sleep_succeeds_fixture_closes_reservation

test result: FAILED. 36 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.59s

*** result: Failure(101)
