*** crates/tracewake-core/src/actions/defs/work.rs:128:5: replace build_work_completion_events -> Result<Vec<EventEnvelope>, ApplyError> with Ok(vec![])

*** mutation diff:
--- crates/tracewake-core/src/actions/defs/work.rs
+++ replace build_work_completion_events -> Result<Vec<EventEnvelope>, ApplyError> with Ok(vec![])
@@ -120,101 +120,17 @@
     state: &PhysicalState,
     agent_state: &AgentState,
     log: &EventLog,
     work_started_event: &EventEnvelope,
     ordering_key: &OrderingKey,
     content_manifest_id: &ContentManifestId,
     completion_tick: SimTick,
 ) -> Result<Vec<EventEnvelope>, ApplyError> {
-    let actor_id = work_started_event
-        .actor_id
-        .clone()
-        .ok_or_else(|| ApplyError::BadPayload {
-            key: "actor_id",
-            value: "missing".to_string(),
-        })?;
-    let working_ticks = classify_actor_tick_regimes_with_start(
-        log,
-        &actor_id,
-        work_started_event.sim_tick,
-        completion_tick,
-        Some(work_started_event),
-    )
-    .working_ticks;
-    let fatigue_delta =
-        payload_i32(work_started_event, "fatigue_delta_per_tick")? * working_ticks as i32;
-    let hunger_delta =
-        payload_i32(work_started_event, "hunger_delta_per_tick")? * working_ticks as i32;
-    if let Some((blocker_kind, reason)) =
-        work_completion_failure(state, agent_state, work_started_event)?
-    {
-        let mut events = vec![work_failed_from_start_event(
-            work_started_event,
-            ordering_key,
-            content_manifest_id,
-            completion_tick,
-            working_ticks,
-            fatigue_delta,
-            hunger_delta,
-            blocker_kind,
-            reason,
-        )?];
-        events.extend(work_need_events(
-            agent_state,
-            work_started_event,
-            ordering_key,
-            content_manifest_id,
-            completion_tick,
-            NeedKind::Fatigue,
-            fatigue_delta,
-            working_ticks,
-        )?);
-        events.extend(work_need_events(
-            agent_state,
-            work_started_event,
-            ordering_key,
-            content_manifest_id,
-            completion_tick,
-            NeedKind::Hunger,
-            hunger_delta,
-            working_ticks,
-        )?);
-        return Ok(events);
-    }
-    let mut events = vec![work_completed_event(
-        work_started_event,
-        ordering_key,
-        content_manifest_id,
-        completion_tick,
-        working_ticks,
-        fatigue_delta,
-        hunger_delta,
-    )?];
-    events.extend(work_need_events(
-        agent_state,
-        work_started_event,
-        ordering_key,
-        content_manifest_id,
-        completion_tick,
-        NeedKind::Fatigue,
-        fatigue_delta,
-        working_ticks,
-    )?);
-    events.extend(work_need_events(
-        agent_state,
-        work_started_event,
-        ordering_key,
-        content_manifest_id,
-        completion_tick,
-        NeedKind::Hunger,
-        hunger_delta,
-        working_ticks,
-    )?);
-    Ok(events)
+    Ok(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 fn work_completion_failure(
     state: &PhysicalState,
     agent_state: &AgentState,
     work_started_event: &EventEnvelope,
 ) -> Result<Option<(&'static str, &'static str)>, ApplyError> {
     let Some(actor_id) = work_started_event.actor_id.as_ref() else {

---- ordinary_workday_fixture_moves_before_work_completion stdout ----

thread 'ordinary_workday_fixture_moves_before_work_completion' (11384) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1158:5:
assertion failed: has_event(&log, EventKind::WorkBlockCompleted)

---- sleep_eat_work_fixture_logs_need_effects_and_replays stdout ----

thread 'sleep_eat_work_fixture_logs_need_effects_and_replays' (11403) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1271:5:
assertion failed: has_event(&log, EventKind::WorkBlockCompleted)

---- work_block_failed_then_sleep_succeeds_fixture_closes_reservation stdout ----

thread 'work_block_failed_then_sleep_succeeds_fixture_closes_reservation' (11407) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1343:5:
assertion failed: has_event(&log, EventKind::WorkBlockFailed)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    ordinary_workday_fixture_moves_before_work_completion
    sleep_eat_work_fixture_logs_need_effects_and_replays
    work_block_failed_then_sleep_succeeds_fixture_closes_reservation

test result: FAILED. 38 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.59s

*** result: Failure(101)
