*** crates/tracewake-core/src/actions/defs/work.rs:146:67: replace * with / in build_work_completion_events

*** mutation diff:
--- crates/tracewake-core/src/actions/defs/work.rs
+++ replace * with / in build_work_completion_events
@@ -138,17 +138,17 @@
         work_started_event.sim_tick,
         completion_tick,
         Some(work_started_event),
     )
     .working_ticks;
     let fatigue_delta =
         payload_i32(work_started_event, "fatigue_delta_per_tick")? * working_ticks as i32;
     let hunger_delta =
-        payload_i32(work_started_event, "hunger_delta_per_tick")? * working_ticks as i32;
+        payload_i32(work_started_event, "hunger_delta_per_tick")? / /* ~ changed by cargo-mutants ~ */ working_ticks as i32;
     if let Some((blocker_kind, reason)) =
         work_completion_failure(state, agent_state, work_started_event)?
     {
         let mut events = vec![work_failed_from_start_event(
             work_started_event,
             ordering_key,
             content_manifest_id,
             completion_tick,

---- actions::defs::work::tests::work_completion_emits_output_marker_and_need_costs stdout ----

thread 'actions::defs::work::tests::work_completion_emits_output_marker_and_need_costs' (29259) panicked at crates/tracewake-core/src/actions/defs/work.rs:819:9:
assertion failed: events.iter().any(|event|
        {
            event.event_type == EventKind::NeedDeltaApplied &&
                    event.payload.iter().any(|field|
                            field.key == "need_kind" && field.value == "hunger") &&
                event.payload.iter().any(|field|
                        field.key == "delta" && field.value == "16")
        })

failures:
    actions::defs::work::tests::work_completion_emits_output_marker_and_need_costs

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
