*** crates/tracewake-core/src/actions/defs/work.rs:220:5: replace work_completion_failure -> Result<Option<(&'static str, &'static str)>, ApplyError> with Ok(None)

*** mutation diff:
--- crates/tracewake-core/src/actions/defs/work.rs
+++ replace work_completion_failure -> Result<Option<(&'static str, &'static str)>, ApplyError> with Ok(None)
@@ -212,40 +212,17 @@
     Ok(events)
 }
 
 fn work_completion_failure(
     state: &PhysicalState,
     agent_state: &AgentState,
     work_started_event: &EventEnvelope,
 ) -> Result<Option<(&'static str, &'static str)>, ApplyError> {
-    let Some(actor_id) = work_started_event.actor_id.as_ref() else {
-        return Ok(Some(("continuity", "actor_missing")));
-    };
-    let Some(actor) = state.actors.get(actor_id) else {
-        return Ok(Some(("continuity", "actor_missing")));
-    };
-    let place_id = payload_value(work_started_event, "place_id")?;
-    if actor.current_place_id.as_str() != place_id {
-        return Ok(Some(("continuity", "actor_displaced")));
-    }
-    let workplace_id = payload_value(work_started_event, "workplace_id")?;
-    let Some(workplace) = WorkplaceId::new(workplace_id)
-        .ok()
-        .and_then(|id| state.workplaces.get(&id))
-    else {
-        return Ok(Some(("continuity", "workplace_missing")));
-    };
-    if workplace.place_id.as_str() != place_id || !workplace.access_open {
-        return Ok(Some(("continuity", "workplace_unusable")));
-    }
-    if has_severe_interrupting_need(agent_state, actor_id) {
-        return Ok(Some(("need", "severe_need_pressure")));
-    }
-    Ok(None)
+    Ok(None) /* ~ changed by cargo-mutants ~ */
 }
 
 fn has_severe_interrupting_need(agent_state: &AgentState, actor_id: &crate::ids::ActorId) -> bool {
     agent_state
         .needs_by_actor
         .get(actor_id)
         .is_some_and(|needs| {
             [NeedKind::Hunger, NeedKind::Safety].iter().any(|kind| {

---- work_block_failed_then_sleep_succeeds_fixture_closes_reservation stdout ----

thread 'work_block_failed_then_sleep_succeeds_fixture_closes_reservation' (1286) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1343:5:
assertion failed: has_event(&log, EventKind::WorkBlockFailed)

failures:
    work_block_failed_then_sleep_succeeds_fixture_closes_reservation

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.57s

*** result: Failure(101)
