*** crates/tracewake-core/src/actions/defs/work.rs:220:5: replace work_completion_failure -> Result<Option<(&'static str, &'static str)>, ApplyError> with Ok(Some(("xyzzy", "xyzzy")))

*** mutation diff:
--- crates/tracewake-core/src/actions/defs/work.rs
+++ replace work_completion_failure -> Result<Option<(&'static str, &'static str)>, ApplyError> with Ok(Some(("xyzzy", "xyzzy")))
@@ -212,40 +212,17 @@
     Ok(events)
 }
 
 fn work_completion_failure(
     state: &PhysicalState,
     agent_state: &AgentState,
     work_started_event: &EventEnvelope,
 ) -> Result<Option<(&'static str, &'static str)>, ApplyError> {
-    let Some(actor_id) = work_started_event.actor_id.as_ref() else {
-        return Ok(Some(("continuity", "actor_missing")));
-    };
-    let Some(actor) = state.actors.get(actor_id) else {
-        return Ok(Some(("continuity", "actor_missing")));
-    };
-    let place_id = payload_value(work_started_event, "place_id")?;
-    if actor.current_place_id.as_str() != place_id {
-        return Ok(Some(("continuity", "actor_displaced")));
-    }
-    let workplace_id = payload_value(work_started_event, "workplace_id")?;
-    let Some(workplace) = WorkplaceId::new(workplace_id)
-        .ok()
-        .and_then(|id| state.workplaces.get(&id))
-    else {
-        return Ok(Some(("continuity", "workplace_missing")));
-    };
-    if workplace.place_id.as_str() != place_id || !workplace.access_open {
-        return Ok(Some(("continuity", "workplace_unusable")));
-    }
-    if has_severe_interrupting_need(agent_state, actor_id) {
-        return Ok(Some(("need", "severe_need_pressure")));
-    }
-    Ok(None)
+    Ok(Some(("xyzzy", "xyzzy"))) /* ~ changed by cargo-mutants ~ */
 }
 
 fn has_severe_interrupting_need(agent_state: &AgentState, actor_id: &crate::ids::ActorId) -> bool {
     agent_state
         .needs_by_actor
         .get(actor_id)
         .is_some_and(|needs| {
             [NeedKind::Hunger, NeedKind::Safety].iter().any(|kind| {

---- ordinary_workday_fixture_moves_before_work_completion stdout ----

thread 'ordinary_workday_fixture_moves_before_work_completion' (17660) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1158:5:
assertion failed: has_event(&log, EventKind::WorkBlockCompleted)

---- sleep_eat_work_fixture_logs_need_effects_and_replays stdout ----

thread 'sleep_eat_work_fixture_logs_need_effects_and_replays' (17679) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1271:5:
assertion failed: has_event(&log, EventKind::WorkBlockCompleted)

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (17653) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    ordinary_workday_fixture_moves_before_work_completion
    sleep_eat_work_fixture_logs_need_effects_and_replays

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.58s

*** result: Failure(101)
