*** crates/tracewake-core/src/actions/defs/work.rs:227:40: replace != with == in work_completion_failure

*** mutation diff:
--- crates/tracewake-core/src/actions/defs/work.rs
+++ replace != with == in work_completion_failure
@@ -219,17 +219,17 @@
 ) -> Result<Option<(&'static str, &'static str)>, ApplyError> {
     let Some(actor_id) = work_started_event.actor_id.as_ref() else {
         return Ok(Some(("continuity", "actor_missing")));
     };
     let Some(actor) = state.actors.get(actor_id) else {
         return Ok(Some(("continuity", "actor_missing")));
     };
     let place_id = payload_value(work_started_event, "place_id")?;
-    if actor.current_place_id.as_str() != place_id {
+    if actor.current_place_id.as_str() == /* ~ changed by cargo-mutants ~ */ place_id {
         return Ok(Some(("continuity", "actor_displaced")));
     }
     let workplace_id = payload_value(work_started_event, "workplace_id")?;
     let Some(workplace) = WorkplaceId::new(workplace_id)
         .ok()
         .and_then(|id| state.workplaces.get(&id))
     else {
         return Ok(Some(("continuity", "workplace_missing")));

---- ordinary_workday_fixture_moves_before_work_completion stdout ----

thread 'ordinary_workday_fixture_moves_before_work_completion' (21759) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1158:5:
assertion failed: has_event(&log, EventKind::WorkBlockCompleted)

---- sleep_eat_work_fixture_logs_need_effects_and_replays stdout ----

thread 'sleep_eat_work_fixture_logs_need_effects_and_replays' (21778) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1271:5:
assertion failed: has_event(&log, EventKind::WorkBlockCompleted)

---- work_block_failed_then_sleep_succeeds_fixture_closes_reservation stdout ----

thread 'work_block_failed_then_sleep_succeeds_fixture_closes_reservation' (21782) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1343:5:
assertion failed: has_event(&log, EventKind::WorkBlockFailed)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    ordinary_workday_fixture_moves_before_work_completion
    sleep_eat_work_fixture_logs_need_effects_and_replays
    work_block_failed_then_sleep_succeeds_fixture_closes_reservation

test result: FAILED. 38 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.59s

*** result: Failure(101)
