*** crates/tracewake-core/src/actions/defs/work.rs:237:48: replace || with && in work_completion_failure

*** mutation diff:
--- crates/tracewake-core/src/actions/defs/work.rs
+++ replace || with && in work_completion_failure
@@ -229,17 +229,17 @@
     }
     let workplace_id = payload_value(work_started_event, "workplace_id")?;
     let Some(workplace) = WorkplaceId::new(workplace_id)
         .ok()
         .and_then(|id| state.workplaces.get(&id))
     else {
         return Ok(Some(("continuity", "workplace_missing")));
     };
-    if workplace.place_id.as_str() != place_id || !workplace.access_open {
+    if workplace.place_id.as_str() != place_id && /* ~ changed by cargo-mutants ~ */ !workplace.access_open {
         return Ok(Some(("continuity", "workplace_unusable")));
     }
     if has_severe_interrupting_need(agent_state, actor_id) {
         return Ok(Some(("need", "severe_need_pressure")));
     }
     Ok(None)
 }

---- actions::defs::work::tests::work_completion_fails_when_workplace_closes_even_if_actor_remains_present stdout ----

thread 'actions::defs::work::tests::work_completion_fails_when_workplace_closes_even_if_actor_remains_present' (25947) panicked at crates/tracewake-core/src/actions/defs/work.rs:952:9:
assertion `left == right` failed
  left: WorkBlockCompleted
 right: WorkBlockFailed

failures:
    actions::defs::work::tests::work_completion_fails_when_workplace_closes_even_if_actor_remains_present

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
