*** crates/tracewake-core/src/actions/defs/work.rs:237:51: delete ! in work_completion_failure

*** mutation diff:
--- crates/tracewake-core/src/actions/defs/work.rs
+++ delete ! in work_completion_failure
@@ -229,17 +229,17 @@
     }
     let workplace_id = payload_value(work_started_event, "workplace_id")?;
     let Some(workplace) = WorkplaceId::new(workplace_id)
         .ok()
         .and_then(|id| state.workplaces.get(&id))
     else {
         return Ok(Some(("continuity", "workplace_missing")));
     };
-    if workplace.place_id.as_str() != place_id || !workplace.access_open {
+    if workplace.place_id.as_str() != place_id ||  /* ~ changed by cargo-mutants ~ */workplace.access_open {
         return Ok(Some(("continuity", "workplace_unusable")));
     }
     if has_severe_interrupting_need(agent_state, actor_id) {
         return Ok(Some(("need", "severe_need_pressure")));
     }
     Ok(None)
 }

---- ordinary_workday_fixture_moves_before_work_completion stdout ----

thread 'ordinary_workday_fixture_moves_before_work_completion' (2048) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1158:5:
assertion failed: has_event(&log, EventKind::WorkBlockCompleted)

---- sleep_eat_work_fixture_logs_need_effects_and_replays stdout ----

thread 'sleep_eat_work_fixture_logs_need_effects_and_replays' (2067) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1271:5:
assertion failed: has_event(&log, EventKind::WorkBlockCompleted)

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (2041) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    ordinary_workday_fixture_moves_before_work_completion
    sleep_eat_work_fixture_logs_need_effects_and_replays

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.58s

*** result: Failure(101)
