*** crates/tracewake-core/src/actions/defs/work.rs:254:53: replace == with != in has_severe_interrupting_need

*** mutation diff:
--- crates/tracewake-core/src/actions/defs/work.rs
+++ replace == with != in has_severe_interrupting_need
@@ -246,17 +246,17 @@
 fn has_severe_interrupting_need(agent_state: &AgentState, actor_id: &crate::ids::ActorId) -> bool {
     agent_state
         .needs_by_actor
         .get(actor_id)
         .is_some_and(|needs| {
             [NeedKind::Hunger, NeedKind::Safety].iter().any(|kind| {
                 needs
                     .get(kind)
-                    .is_some_and(|need| need.band() == NeedBand::Severe)
+                    .is_some_and(|need| need.band() != /* ~ changed by cargo-mutants ~ */ NeedBand::Severe)
             })
         })
 }
 
 fn work_started_event(
     proposal: &Proposal,
     ordering_key: &OrderingKey,
     content_manifest_id: &ContentManifestId,

---- ordinary_workday_fixture_moves_before_work_completion stdout ----

thread 'ordinary_workday_fixture_moves_before_work_completion' (14952) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1158:5:
assertion failed: has_event(&log, EventKind::WorkBlockCompleted)

---- sleep_eat_work_fixture_logs_need_effects_and_replays stdout ----

thread 'sleep_eat_work_fixture_logs_need_effects_and_replays' (14971) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1271:5:
assertion failed: has_event(&log, EventKind::WorkBlockCompleted)

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (14945) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    ordinary_workday_fixture_moves_before_work_completion
    sleep_eat_work_fixture_logs_need_effects_and_replays

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.59s

*** result: Failure(101)
