*** crates/tracewake-core/src/actions/defs/work.rs:25:5: replace build_work_start_events -> Result<Vec<EventEnvelope>, ActionRejection> with Ok(vec![])

*** mutation diff:
--- crates/tracewake-core/src/actions/defs/work.rs
+++ replace build_work_start_events -> Result<Vec<EventEnvelope>, ActionRejection> with Ok(vec![])
@@ -17,108 +17,17 @@
 
 pub fn build_work_start_events(
     state: &PhysicalState,
     agent_state: &AgentState,
     proposal: &Proposal,
     ordering_key: &OrderingKey,
     content_manifest_id: &ContentManifestId,
 ) -> Result<Vec<EventEnvelope>, ActionRejection> {
-    let actor_id = proposal.actor_id.clone().ok_or_else(actor_missing)?;
-    let actor = state.actors.get(&actor_id).ok_or_else(actor_missing)?;
-    let workplace_id = workplace_target(proposal)?;
-    let workplace = state.workplaces.get(&workplace_id).ok_or_else(|| {
-        reject(
-            PipelineStage::TargetBinding,
-            ReasonCode::TargetNotFound,
-            "workplace_id",
-            workplace_id.as_str(),
-            "That workplace is not present.",
-            "work target was missing from physical state",
-        )
-    })?;
-
-    if actor.current_place_id != workplace.place_id {
-        return Ok(vec![work_failed_event(
-            proposal,
-            ordering_key,
-            content_manifest_id,
-            workplace,
-            "access",
-            "actor not at workplace",
-        )]);
-    }
-    if !workplace.access_open {
-        return Ok(vec![work_failed_event(
-            proposal,
-            ordering_key,
-            content_manifest_id,
-            workplace,
-            "access",
-            "workplace access closed",
-        )]);
-    }
-    if !workplace.assigned_actor_ids.is_empty() && !workplace.assigned_actor_ids.contains(&actor_id)
-    {
-        return Ok(vec![work_failed_event(
-            proposal,
-            ordering_key,
-            content_manifest_id,
-            workplace,
-            "physical",
-            "actor not assigned to workplace",
-        )]);
-    }
-    let Some(current_fatigue) = need_value(agent_state, &actor_id, NeedKind::Fatigue) else {
-        return Ok(vec![work_failed_event(
-            proposal,
-            ordering_key,
-            content_manifest_id,
-            workplace,
-            "need",
-            "fatigue state missing for work",
-        )]);
-    };
-    if i32::from(current_fatigue) > workplace.max_fatigue_to_start {
-        return Ok(vec![work_failed_event(
-            proposal,
-            ordering_key,
-            content_manifest_id,
-            workplace,
-            "need",
-            "fatigue too high for work",
-        )]);
-    }
-    let Some(current_hunger) = need_value(agent_state, &actor_id, NeedKind::Hunger) else {
-        return Ok(vec![work_failed_event(
-            proposal,
-            ordering_key,
-            content_manifest_id,
-            workplace,
-            "need",
-            "hunger state missing for work",
-        )]);
-    };
-    if i32::from(current_hunger) > workplace.max_hunger_to_start {
-        return Ok(vec![work_failed_event(
-            proposal,
-            ordering_key,
-            content_manifest_id,
-            workplace,
-            "need",
-            "hunger too high for work",
-        )]);
-    }
-
-    Ok(vec![work_started_event(
-        proposal,
-        ordering_key,
-        content_manifest_id,
-        workplace,
-    )])
+    Ok(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn build_work_completion_events(
     state: &PhysicalState,
     agent_state: &AgentState,
     log: &EventLog,
     work_started_event: &EventEnvelope,
     ordering_key: &OrderingKey,

---- episode_tamper_output_tag_poisons_replay stdout ----

thread 'episode_tamper_output_tag_poisons_replay' (24803) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1055:10:
work starts

---- ordinary_workday_fixture_moves_before_work_completion stdout ----

thread 'ordinary_workday_fixture_moves_before_work_completion' (24818) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1142:10:
work starts after movement ancestry

---- routine_blocked_fixture_records_access_failure_without_silent_loop stdout ----

thread 'routine_blocked_fixture_records_access_failure_without_silent_loop' (24831) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1497:5:
assertion failed: has_event(&log, EventKind::WorkBlockFailed)

failures:
    episode_tamper_output_tag_poisons_replay
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    ordinary_workday_fixture_moves_before_work_completion
    routine_blocked_fixture_records_access_failure_without_silent_loop
    routine_no_teleport_fixture_fails_remote_work_without_movement_ancestry
    serialized_event_log_replays_to_identical_state
    sleep_eat_work_fixture_logs_need_effects_and_replays
    work_block_failed_then_sleep_succeeds_fixture_closes_reservation

test result: FAILED. 34 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.53s

*** result: Failure(101)
