*** crates/tracewake-core/src/actions/defs/work.rs:39:31: replace != with == in build_work_start_events

*** mutation diff:
--- crates/tracewake-core/src/actions/defs/work.rs
+++ replace != with == in build_work_start_events
@@ -31,17 +31,17 @@
             ReasonCode::TargetNotFound,
             "workplace_id",
             workplace_id.as_str(),
             "That workplace is not present.",
             "work target was missing from physical state",
         )
     })?;
 
-    if actor.current_place_id != workplace.place_id {
+    if actor.current_place_id == /* ~ changed by cargo-mutants ~ */ workplace.place_id {
         return Ok(vec![work_failed_event(
             proposal,
             ordering_key,
             content_manifest_id,
             workplace,
             "access",
             "actor not at workplace",
         )]);

---- episode_tamper_output_tag_poisons_replay stdout ----

thread 'episode_tamper_output_tag_poisons_replay' (28914) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1055:10:
work starts

---- ordinary_workday_fixture_moves_before_work_completion stdout ----

thread 'ordinary_workday_fixture_moves_before_work_completion' (28929) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1142:10:
work starts after movement ancestry

---- routine_no_teleport_fixture_fails_remote_work_without_movement_ancestry stdout ----

thread 'routine_no_teleport_fixture_fails_remote_work_without_movement_ancestry' (28943) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1667:5:
assertion failed: has_event(&log, EventKind::WorkBlockFailed)

failures:
    episode_tamper_output_tag_poisons_replay
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    ordinary_workday_fixture_moves_before_work_completion
    routine_blocked_fixture_records_access_failure_without_silent_loop
    routine_no_teleport_fixture_fails_remote_work_without_movement_ancestry
    serialized_event_log_replays_to_identical_state
    sleep_eat_work_fixture_logs_need_effects_and_replays
    work_block_failed_then_sleep_succeeds_fixture_closes_reservation

test result: FAILED. 34 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.58s

*** result: Failure(101)
