*** crates/tracewake-core/src/actions/defs/work.rs:49:8: delete ! in build_work_start_events

*** mutation diff:
--- crates/tracewake-core/src/actions/defs/work.rs
+++ delete ! in build_work_start_events
@@ -41,17 +41,17 @@
             proposal,
             ordering_key,
             content_manifest_id,
             workplace,
             "access",
             "actor not at workplace",
         )]);
     }
-    if !workplace.access_open {
+    if  /* ~ changed by cargo-mutants ~ */workplace.access_open {
         return Ok(vec![work_failed_event(
             proposal,
             ordering_key,
             content_manifest_id,
             workplace,
             "access",
             "workplace access closed",
         )]);

---- episode_tamper_output_tag_poisons_replay stdout ----

thread 'episode_tamper_output_tag_poisons_replay' (545) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1055:10:
work starts

---- ordinary_workday_fixture_moves_before_work_completion stdout ----

thread 'ordinary_workday_fixture_moves_before_work_completion' (560) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1142:10:
work starts after movement ancestry

---- routine_blocked_fixture_records_access_failure_without_silent_loop stdout ----

thread 'routine_blocked_fixture_records_access_failure_without_silent_loop' (573) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1497:5:
assertion failed: has_event(&log, EventKind::WorkBlockFailed)

failures:
    episode_tamper_output_tag_poisons_replay
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    ordinary_workday_fixture_moves_before_work_completion
    routine_blocked_fixture_records_access_failure_without_silent_loop
    serialized_event_log_replays_to_identical_state
    sleep_eat_work_fixture_logs_need_effects_and_replays
    work_block_failed_then_sleep_succeeds_fixture_closes_reservation

test result: FAILED. 35 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.57s

*** result: Failure(101)
