*** crates/tracewake-core/src/actions/defs/work.rs:548:5: replace need_value -> Option<u16> with None

*** mutation diff:
--- crates/tracewake-core/src/actions/defs/work.rs
+++ replace need_value -> Option<u16> with None
@@ -540,21 +540,17 @@
     })
 }
 
 fn need_value(
     agent_state: &AgentState,
     actor_id: &crate::ids::ActorId,
     need_kind: NeedKind,
 ) -> Option<u16> {
-    agent_state
-        .needs_by_actor
-        .get(actor_id)
-        .and_then(|needs| needs.get(&need_kind))
-        .map(crate::agent::NeedState::value)
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn payload_value<'a>(event: &'a EventEnvelope, key: &'static str) -> Result<&'a str, ApplyError> {
     event
         .payload
         .iter()
         .find(|field| field.key == key)
         .map(|field| field.value.as_str())

---- episode_tamper_output_tag_poisons_replay stdout ----

thread 'episode_tamper_output_tag_poisons_replay' (23207) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1055:10:
work starts

---- ordinary_workday_fixture_moves_before_work_completion stdout ----

thread 'ordinary_workday_fixture_moves_before_work_completion' (23222) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1142:10:
work starts after movement ancestry

---- serialized_event_log_replays_to_identical_state stdout ----

thread 'serialized_event_log_replays_to_identical_state' (23238) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1055:10:
work starts

failures:
    episode_tamper_output_tag_poisons_replay
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    ordinary_workday_fixture_moves_before_work_completion
    serialized_event_log_replays_to_identical_state
    sleep_eat_work_fixture_logs_need_effects_and_replays
    work_block_failed_then_sleep_succeeds_fixture_closes_reservation

test result: FAILED. 36 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.58s

*** result: Failure(101)
