*** crates/tracewake-core/src/actions/defs/work.rs:548:5: replace need_value -> Option<u16> with Some(0)

*** mutation diff:
--- crates/tracewake-core/src/actions/defs/work.rs
+++ replace need_value -> Option<u16> with Some(0)
@@ -540,21 +540,17 @@
     })
 }
 
 fn need_value(
     agent_state: &AgentState,
     actor_id: &crate::ids::ActorId,
     need_kind: NeedKind,
 ) -> Option<u16> {
-    agent_state
-        .needs_by_actor
-        .get(actor_id)
-        .and_then(|needs| needs.get(&need_kind))
-        .map(crate::agent::NeedState::value)
+    Some(0) /* ~ changed by cargo-mutants ~ */
 }
 
 fn payload_value<'a>(event: &'a EventEnvelope, key: &'static str) -> Result<&'a str, ApplyError> {
     event
         .payload
         .iter()
         .find(|field| field.key == key)
         .map(|field| field.value.as_str())

---- actions::defs::work::tests::work_forged_need_parameters_do_not_override_authoritative_state stdout ----

thread 'actions::defs::work::tests::work_forged_need_parameters_do_not_override_authoritative_state' (27412) panicked at crates/tracewake-core/src/actions/defs/work.rs:1009:9:
assertion `left == right` failed
  left: WorkBlockStarted
 right: WorkBlockFailed

---- actions::defs::work::tests::work_fails_from_authoritative_need_state_without_completion stdout ----

thread 'actions::defs::work::tests::work_fails_from_authoritative_need_state_without_completion' (27411) panicked at crates/tracewake-core/src/actions/defs/work.rs:969:9:
assertion `left == right` failed
  left: WorkBlockStarted
 right: WorkBlockFailed

---- actions::defs::work::tests::work_missing_or_malformed_need_parameters_do_not_default_to_safe_pass stdout ----

thread 'actions::defs::work::tests::work_missing_or_malformed_need_parameters_do_not_default_to_safe_pass' (27413) panicked at crates/tracewake-core/src/actions/defs/work.rs:1046:9:
assertion `left == right` failed
  left: WorkBlockStarted
 right: WorkBlockFailed

failures:
    actions::defs::work::tests::work_fails_from_authoritative_need_state_without_completion
    actions::defs::work::tests::work_forged_need_parameters_do_not_override_authoritative_state
    actions::defs::work::tests::work_missing_or_malformed_need_parameters_do_not_default_to_safe_pass
    actions::defs::work::tests::work_stale_proposal_fails_against_current_authoritative_state

test result: FAILED. 451 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
