*** crates/tracewake-core/src/actions/defs/work.rs:556:5: replace payload_value -> Result<&'a str, ApplyError> with Ok("xyzzy")

*** mutation diff:
--- crates/tracewake-core/src/actions/defs/work.rs
+++ replace payload_value -> Result<&'a str, ApplyError> with Ok("xyzzy")
@@ -548,22 +548,17 @@
     agent_state
         .needs_by_actor
         .get(actor_id)
         .and_then(|needs| needs.get(&need_kind))
         .map(crate::agent::NeedState::value)
 }
 
 fn payload_value<'a>(event: &'a EventEnvelope, key: &'static str) -> Result<&'a str, ApplyError> {
-    event
-        .payload
-        .iter()
-        .find(|field| field.key == key)
-        .map(|field| field.value.as_str())
-        .ok_or(ApplyError::MissingPayload(key))
+    Ok("xyzzy") /* ~ changed by cargo-mutants ~ */
 }
 
 fn payload_i32(event: &EventEnvelope, key: &'static str) -> Result<i32, ApplyError> {
     let value = event
         .payload
         .iter()
         .find(|field| field.key == key)
         .map(|field| field.value.as_str())

---- ordinary_workday_fixture_moves_before_work_completion stdout ----

thread 'ordinary_workday_fixture_moves_before_work_completion' (8071) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1158:5:
assertion failed: has_event(&log, EventKind::WorkBlockCompleted)

---- sleep_eat_work_fixture_logs_need_effects_and_replays stdout ----

thread 'sleep_eat_work_fixture_logs_need_effects_and_replays' (8090) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1271:5:
assertion failed: has_event(&log, EventKind::WorkBlockCompleted)

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (8064) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    ordinary_workday_fixture_moves_before_work_completion
    sleep_eat_work_fixture_logs_need_effects_and_replays

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.57s

*** result: Failure(101)
