*** crates/tracewake-core/src/actions/defs/work.rs:565:5: replace payload_i32 -> Result<i32, ApplyError> with Ok(0)

*** mutation diff:
--- crates/tracewake-core/src/actions/defs/work.rs
+++ replace payload_i32 -> Result<i32, ApplyError> with Ok(0)
@@ -557,26 +557,17 @@
         .payload
         .iter()
         .find(|field| field.key == key)
         .map(|field| field.value.as_str())
         .ok_or(ApplyError::MissingPayload(key))
 }
 
 fn payload_i32(event: &EventEnvelope, key: &'static str) -> Result<i32, ApplyError> {
-    let value = event
-        .payload
-        .iter()
-        .find(|field| field.key == key)
-        .map(|field| field.value.as_str())
-        .ok_or(ApplyError::MissingPayload(key))?;
-    value.parse().map_err(|_| ApplyError::BadPayload {
-        key,
-        value: value.to_string(),
-    })
+    Ok(0) /* ~ changed by cargo-mutants ~ */
 }
 
 fn actor_missing() -> ActionRejection {
     ActionRejection::new(
         PipelineStage::ActorLookup,
         ReasonCode::ActorNotFound,
         Vec::new(),
         "That actor cannot work.",

---- actions::defs::work::tests::malformed_work_start_payload_returns_typed_error stdout ----

thread 'actions::defs::work::tests::malformed_work_start_payload_returns_typed_error' (16352) panicked at crates/tracewake-core/src/actions/defs/work.rs:855:10:

---- actions::defs::work::tests::work_completion_emits_output_marker_and_need_costs stdout ----

thread 'actions::defs::work::tests::work_completion_emits_output_marker_and_need_costs' (16356) panicked at crates/tracewake-core/src/actions/defs/work.rs:784:9:
assertion failed: events.iter().any(|event|
        {
            event.event_type == EventKind::NeedDeltaApplied &&
                    event.payload.iter().any(|field|
                            field.key == "need_kind" && field.value == "fatigue") &&
                event.payload.iter().any(|field|
                        field.key == "delta" && field.value == "32")
        })

---- actions::defs::work::tests::work_completion_fails_when_actor_displaced_with_prorated_costs stdout ----

thread 'actions::defs::work::tests::work_completion_fails_when_actor_displaced_with_prorated_costs' (16357) panicked at crates/tracewake-core/src/actions/defs/work.rs:902:9:
assertion failed: events.iter().any(|event|
        {
            event.event_type == EventKind::NeedDeltaApplied &&
                    event.payload.iter().any(|field|
                            field.key == "need_kind" && field.value == "fatigue") &&
                event.payload.iter().any(|field|
                        field.key == "delta" && field.value == "16")
        })

failures:
    actions::defs::work::tests::malformed_work_start_payload_returns_typed_error
    actions::defs::work::tests::work_completion_emits_output_marker_and_need_costs
    actions::defs::work::tests::work_completion_fails_when_actor_displaced_with_prorated_costs

test result: FAILED. 452 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
