*** crates/tracewake-core/src/actions/defs/work.rs:568:33: replace == with != in payload_i32

*** mutation diff:
--- crates/tracewake-core/src/actions/defs/work.rs
+++ replace == with != in payload_i32
@@ -560,17 +560,17 @@
         .map(|field| field.value.as_str())
         .ok_or(ApplyError::MissingPayload(key))
 }
 
 fn payload_i32(event: &EventEnvelope, key: &'static str) -> Result<i32, ApplyError> {
     let value = event
         .payload
         .iter()
-        .find(|field| field.key == key)
+        .find(|field| field.key != /* ~ changed by cargo-mutants ~ */ key)
         .map(|field| field.value.as_str())
         .ok_or(ApplyError::MissingPayload(key))?;
     value.parse().map_err(|_| ApplyError::BadPayload {
         key,
         value: value.to_string(),
     })
 }

---- episode_tamper_output_tag_poisons_replay stdout ----

thread 'episode_tamper_output_tag_poisons_replay' (29931) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1066:6:
called `Result::unwrap()` on an `Err` value: BadPayload { key: "fatigue_delta_per_tick", value: "event_schema_v1" }

---- ordinary_workday_fixture_moves_before_work_completion stdout ----

thread 'ordinary_workday_fixture_moves_before_work_completion' (29946) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1153:6:
called `Result::unwrap()` on an `Err` value: BadPayload { key: "fatigue_delta_per_tick", value: "event_schema_v1" }

---- serialized_event_log_replays_to_identical_state stdout ----

thread 'serialized_event_log_replays_to_identical_state' (29962) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1066:6:
called `Result::unwrap()` on an `Err` value: BadPayload { key: "fatigue_delta_per_tick", value: "event_schema_v1" }

failures:
    episode_tamper_output_tag_poisons_replay
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    ordinary_workday_fixture_moves_before_work_completion
    serialized_event_log_replays_to_identical_state
    sleep_eat_work_fixture_logs_need_effects_and_replays
    work_block_failed_then_sleep_succeeds_fixture_closes_reservation

test result: FAILED. 36 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.59s

*** result: Failure(101)
