*** crates/tracewake-core/src/actions/defs/work.rs:59:52: delete ! in build_work_start_events

*** mutation diff:
--- crates/tracewake-core/src/actions/defs/work.rs
+++ delete ! in build_work_start_events
@@ -51,17 +51,17 @@
             proposal,
             ordering_key,
             content_manifest_id,
             workplace,
             "access",
             "workplace access closed",
         )]);
     }
-    if !workplace.assigned_actor_ids.is_empty() && !workplace.assigned_actor_ids.contains(&actor_id)
+    if !workplace.assigned_actor_ids.is_empty() &&  /* ~ changed by cargo-mutants ~ */workplace.assigned_actor_ids.contains(&actor_id)
     {
         return Ok(vec![work_failed_event(
             proposal,
             ordering_key,
             content_manifest_id,
             workplace,
             "physical",
             "actor not assigned to workplace",

---- episode_tamper_output_tag_poisons_replay stdout ----

thread 'episode_tamper_output_tag_poisons_replay' (13303) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1055:10:
work starts

---- ordinary_workday_fixture_moves_before_work_completion stdout ----

thread 'ordinary_workday_fixture_moves_before_work_completion' (13318) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1142:10:
work starts after movement ancestry

---- serialized_event_log_replays_to_identical_state stdout ----

thread 'serialized_event_log_replays_to_identical_state' (13334) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1055:10:
work starts

failures:
    episode_tamper_output_tag_poisons_replay
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    ordinary_workday_fixture_moves_before_work_completion
    serialized_event_log_replays_to_identical_state
    sleep_eat_work_fixture_logs_need_effects_and_replays
    work_block_failed_then_sleep_succeeds_fixture_closes_reservation

test result: FAILED. 36 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.57s

*** result: Failure(101)
