*** crates/tracewake-core/src/actions/defs/work.rs:59:8: delete ! in build_work_start_events

*** mutation diff:
--- crates/tracewake-core/src/actions/defs/work.rs
+++ delete ! in build_work_start_events
@@ -51,17 +51,17 @@
             proposal,
             ordering_key,
             content_manifest_id,
             workplace,
             "access",
             "workplace access closed",
         )]);
     }
-    if !workplace.assigned_actor_ids.is_empty() && !workplace.assigned_actor_ids.contains(&actor_id)
+    if  /* ~ changed by cargo-mutants ~ */workplace.assigned_actor_ids.is_empty() && !workplace.assigned_actor_ids.contains(&actor_id)
     {
         return Ok(vec![work_failed_event(
             proposal,
             ordering_key,
             content_manifest_id,
             workplace,
             "physical",
             "actor not assigned to workplace",

---- actions::defs::work::tests::malformed_work_start_payload_returns_typed_error stdout ----

thread 'actions::defs::work::tests::malformed_work_start_payload_returns_typed_error' (8842) panicked at crates/tracewake-core/src/actions/defs/work.rs:866:9:
assertion `left == right` failed
  left: MissingPayload("fatigue_delta_per_tick")
 right: BadPayload { key: "fatigue_delta_per_tick", value: "not_i32" }

---- actions::defs::work::tests::overlapping_body_exclusive_action_is_reservation_conflict stdout ----

thread 'actions::defs::work::tests::overlapping_body_exclusive_action_is_reservation_conflict' (8843) panicked at crates/tracewake-core/src/actions/defs/work.rs:1194:9:
assertion `left == right` failed
  left: Accepted
 right: Rejected

---- actions::defs::work::tests::work_block_failed_closes_body_exclusive_reservation stdout ----

thread 'actions::defs::work::tests::work_block_failed_closes_body_exclusive_reservation' (8845) panicked at crates/tracewake-core/src/actions/defs/work.rs:1232:14:
work starts

failures:
    actions::defs::work::tests::malformed_work_start_payload_returns_typed_error
    actions::defs::work::tests::overlapping_body_exclusive_action_is_reservation_conflict
    actions::defs::work::tests::scheduler_origin_work_uses_shared_pipeline
    actions::defs::work::tests::work_block_failed_closes_body_exclusive_reservation
    actions::defs::work::tests::work_completion_emits_output_marker_and_need_costs
    actions::defs::work::tests::work_completion_fails_when_actor_displaced_with_prorated_costs
    actions::defs::work::tests::work_completion_fails_when_workplace_closes_even_if_actor_remains_present
    actions::defs::work::tests::work_fails_from_authoritative_need_state_without_completion
    actions::defs::work::tests::work_forged_need_parameters_do_not_override_authoritative_state
    actions::defs::work::tests::work_missing_or_malformed_need_parameters_do_not_default

test result: FAILED. 442 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
