*** crates/tracewake-core/src/actions/defs/work.rs:80:35: replace > with == in build_work_start_events

*** mutation diff:
--- crates/tracewake-core/src/actions/defs/work.rs
+++ replace > with == in build_work_start_events
@@ -72,17 +72,17 @@
             proposal,
             ordering_key,
             content_manifest_id,
             workplace,
             "need",
             "fatigue state missing for work",
         )]);
     };
-    if i32::from(current_fatigue) > workplace.max_fatigue_to_start {
+    if i32::from(current_fatigue) == /* ~ changed by cargo-mutants ~ */ workplace.max_fatigue_to_start {
         return Ok(vec![work_failed_event(
             proposal,
             ordering_key,
             content_manifest_id,
             workplace,
             "need",
             "fatigue too high for work",
         )]);

---- actions::defs::work::tests::work_fails_from_authoritative_need_state_without_completion stdout ----

thread 'actions::defs::work::tests::work_fails_from_authoritative_need_state_without_completion' (17507) panicked at crates/tracewake-core/src/actions/defs/work.rs:973:9:
assertion `left == right` failed
  left: WorkBlockStarted
 right: WorkBlockFailed

---- actions::defs::work::tests::work_start_allows_needs_at_authored_thresholds stdout ----

thread 'actions::defs::work::tests::work_start_allows_needs_at_authored_thresholds' (17511) panicked at crates/tracewake-core/src/actions/defs/work.rs:758:9:
assertion `left == right` failed
  left: WorkBlockFailed
 right: WorkBlockStarted

---- actions::defs::work::tests::work_forged_need_parameters_do_not_override_authoritative_state stdout ----

thread 'actions::defs::work::tests::work_forged_need_parameters_do_not_override_authoritative_state' (17508) panicked at crates/tracewake-core/src/actions/defs/work.rs:1013:9:
assertion `left == right` failed
  left: WorkBlockStarted
 right: WorkBlockFailed

failures:
    actions::defs::work::tests::work_fails_from_authoritative_need_state_without_completion
    actions::defs::work::tests::work_forged_need_parameters_do_not_override_authoritative_state
    actions::defs::work::tests::work_stale_proposal_fails_against_current_authoritative_state
    actions::defs::work::tests::work_start_allows_needs_at_authored_thresholds

test result: FAILED. 451 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
