*** crates/tracewake-core/src/actions/pipeline.rs:1012:5: replace actor_visible_facts -> Vec<CheckedFact> with vec![]

*** mutation diff:
--- crates/tracewake-core/src/actions/pipeline.rs
+++ replace actor_visible_facts -> Vec<CheckedFact> with vec![]
@@ -1004,21 +1004,17 @@
         reason_codes,
         checked_facts,
         actor_visible_summary,
         debug_summary,
     )))
 }
 
 fn actor_visible_facts(checked_facts: &[CheckedFact]) -> Vec<CheckedFact> {
-    checked_facts
-        .iter()
-        .filter(|fact| is_actor_visible_fact(fact))
-        .cloned()
-        .collect()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn debug_only_facts(checked_facts: &[CheckedFact]) -> Vec<CheckedFact> {
     checked_facts
         .iter()
         .filter(|fact| !is_actor_visible_fact(fact))
         .cloned()
         .collect()

---- actions::pipeline::tests::human_source_context_stale_frontier_rejects_before_action_validation stdout ----

thread 'actions::pipeline::tests::human_source_context_stale_frontier_rejects_before_action_validation' (23529) panicked at crates/tracewake-core/src/actions/pipeline.rs:1594:9:
assertion failed: has_fact(&report.actor_visible_facts, "action_id")

---- debug_reports::tests::rejection_report_preserves_failed_stage_and_mutates_nothing stdout ----

thread 'debug_reports::tests::rejection_report_preserves_failed_stage_and_mutates_nothing' (23684) panicked at crates/tracewake-core/src/debug_reports.rs:991:9:
assertion failed: !report.actor_visible_facts.is_empty()

failures:
    actions::pipeline::tests::human_source_context_stale_frontier_rejects_before_action_validation
    debug_reports::tests::rejection_report_preserves_failed_stage_and_mutates_nothing

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
