*** crates/tracewake-core/src/actions/pipeline.rs:1020:5: replace debug_only_facts -> Vec<CheckedFact> with vec![]

*** mutation diff:
--- crates/tracewake-core/src/actions/pipeline.rs
+++ replace debug_only_facts -> Vec<CheckedFact> with vec![]
@@ -1012,21 +1012,17 @@
     checked_facts
         .iter()
         .filter(|fact| is_actor_visible_fact(fact))
         .cloned()
         .collect()
 }
 
 fn debug_only_facts(checked_facts: &[CheckedFact]) -> Vec<CheckedFact> {
-    checked_facts
-        .iter()
-        .filter(|fact| !is_actor_visible_fact(fact))
-        .cloned()
-        .collect()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn is_actor_visible_fact(fact: &CheckedFact) -> bool {
     matches!(
         fact.key(),
         crate::actions::report::CheckedFactKey::ActionId
             | crate::actions::report::CheckedFactKey::ActorId
             | crate::actions::report::CheckedFactKey::Reason

---- actions::pipeline::tests::human_source_context_forged_action_token_rejects stdout ----

thread 'actions::pipeline::tests::human_source_context_forged_action_token_rejects' (28095) panicked at crates/tracewake-core/src/actions/pipeline.rs:1683:9:
assertion failed: has_fact(&report.debug_only_facts, "source_kind")

---- actions::pipeline::tests::human_source_context_stale_frontier_rejects_before_action_validation stdout ----

thread 'actions::pipeline::tests::human_source_context_stale_frontier_rejects_before_action_validation' (28100) panicked at crates/tracewake-core/src/actions/pipeline.rs:1595:9:
assertion failed: has_fact(&report.debug_only_facts, "source_kind")

failures:
    actions::pipeline::tests::human_source_context_forged_action_token_rejects
    actions::pipeline::tests::human_source_context_stale_frontier_rejects_before_action_validation

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
