*** crates/tracewake-core/src/actions/pipeline.rs:1022:24: delete ! in debug_only_facts

*** mutation diff:
--- crates/tracewake-core/src/actions/pipeline.rs
+++ delete ! in debug_only_facts
@@ -1014,17 +1014,17 @@
         .filter(|fact| is_actor_visible_fact(fact))
         .cloned()
         .collect()
 }
 
 fn debug_only_facts(checked_facts: &[CheckedFact]) -> Vec<CheckedFact> {
     checked_facts
         .iter()
-        .filter(|fact| !is_actor_visible_fact(fact))
+        .filter(|fact|  /* ~ changed by cargo-mutants ~ */is_actor_visible_fact(fact))
         .cloned()
         .collect()
 }
 
 fn is_actor_visible_fact(fact: &CheckedFact) -> bool {
     matches!(
         fact.key(),
         crate::actions::report::CheckedFactKey::ActionId

---- actions::pipeline::tests::human_source_context_stale_frontier_rejects_before_action_validation stdout ----

thread 'actions::pipeline::tests::human_source_context_stale_frontier_rejects_before_action_validation' (32671) panicked at crates/tracewake-core/src/actions/pipeline.rs:1599:9:
assertion failed: has_fact(&report.debug_only_facts, "source_kind")

---- actions::pipeline::tests::human_source_context_forged_action_token_rejects stdout ----

thread 'actions::pipeline::tests::human_source_context_forged_action_token_rejects' (32666) panicked at crates/tracewake-core/src/actions/pipeline.rs:1687:9:
assertion failed: has_fact(&report.debug_only_facts, "source_kind")

---- debug_reports::tests::rejection_report_preserves_failed_stage_and_mutates_nothing stdout ----

thread 'debug_reports::tests::rejection_report_preserves_failed_stage_and_mutates_nothing' (358) panicked at crates/tracewake-core/src/debug_reports.rs:992:9:
assertion failed: report.debug_only_facts.is_empty()

failures:
    actions::pipeline::tests::human_source_context_forged_action_token_rejects
    actions::pipeline::tests::human_source_context_stale_frontier_rejects_before_action_validation
    debug_reports::tests::rejection_report_preserves_failed_stage_and_mutates_nothing

test result: FAILED. 452 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
