*** crates/tracewake-core/src/actions/pipeline.rs:1028:5: replace is_actor_visible_fact -> bool with true

*** mutation diff:
--- crates/tracewake-core/src/actions/pipeline.rs
+++ replace is_actor_visible_fact -> bool with true
@@ -1020,23 +1020,17 @@
     checked_facts
         .iter()
         .filter(|fact| !is_actor_visible_fact(fact))
         .cloned()
         .collect()
 }
 
 fn is_actor_visible_fact(fact: &CheckedFact) -> bool {
-    matches!(
-        fact.key(),
-        crate::actions::report::CheckedFactKey::ActionId
-            | crate::actions::report::CheckedFactKey::ActorId
-            | crate::actions::report::CheckedFactKey::Reason
-            | crate::actions::report::CheckedFactKey::TickCount
-    )
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn reject_committed(
     context: &mut PipelineContext<'_>,
     proposal: &Proposal,
     failed_stage: PipelineStage,
     reason_codes: Vec<ReasonCode>,
     checked_facts: Vec<CheckedFact>,

---- actions::pipeline::tests::human_source_context_forged_action_token_rejects stdout ----

thread 'actions::pipeline::tests::human_source_context_forged_action_token_rejects' (4757) panicked at crates/tracewake-core/src/actions/pipeline.rs:1681:9:
assertion failed: has_fact(&report.debug_only_facts, "source_kind")

---- actions::pipeline::tests::human_source_context_stale_frontier_rejects_before_action_validation stdout ----

thread 'actions::pipeline::tests::human_source_context_stale_frontier_rejects_before_action_validation' (4762) panicked at crates/tracewake-core/src/actions/pipeline.rs:1593:9:
assertion failed: has_fact(&report.debug_only_facts, "source_kind")

failures:
    actions::pipeline::tests::human_source_context_forged_action_token_rejects
    actions::pipeline::tests::human_source_context_stale_frontier_rejects_before_action_validation

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
