*** crates/tracewake-core/src/actions/pipeline.rs:1028:5: replace is_actor_visible_fact -> bool with false

*** mutation diff:
--- crates/tracewake-core/src/actions/pipeline.rs
+++ replace is_actor_visible_fact -> bool with false
@@ -1020,23 +1020,17 @@
     checked_facts
         .iter()
         .filter(|fact| !is_actor_visible_fact(fact))
         .cloned()
         .collect()
 }
 
 fn is_actor_visible_fact(fact: &CheckedFact) -> bool {
-    matches!(
-        fact.key(),
-        crate::actions::report::CheckedFactKey::ActionId
-            | crate::actions::report::CheckedFactKey::ActorId
-            | crate::actions::report::CheckedFactKey::Reason
-            | crate::actions::report::CheckedFactKey::TickCount
-    )
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn reject_committed(
     context: &mut PipelineContext<'_>,
     proposal: &Proposal,
     failed_stage: PipelineStage,
     reason_codes: Vec<ReasonCode>,
     checked_facts: Vec<CheckedFact>,

---- actions::pipeline::tests::human_source_context_stale_frontier_rejects_before_action_validation stdout ----

thread 'actions::pipeline::tests::human_source_context_stale_frontier_rejects_before_action_validation' (9322) panicked at crates/tracewake-core/src/actions/pipeline.rs:1592:9:
assertion failed: has_fact(&report.actor_visible_facts, "action_id")

---- debug_reports::tests::rejection_report_preserves_failed_stage_and_mutates_nothing stdout ----

thread 'debug_reports::tests::rejection_report_preserves_failed_stage_and_mutates_nothing' (9477) panicked at crates/tracewake-core/src/debug_reports.rs:991:9:
assertion failed: !report.actor_visible_facts.is_empty()

failures:
    actions::pipeline::tests::human_source_context_stale_frontier_rejects_before_action_validation
    debug_reports::tests::rejection_report_preserves_failed_stage_and_mutates_nothing

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
