*** crates/tracewake-core/src/actions/pipeline.rs:1138:5: replace build_absence_detection_events -> Vec<EventEnvelope> with vec![]

*** mutation diff:
--- crates/tracewake-core/src/actions/pipeline.rs
+++ replace build_absence_detection_events -> Vec<EventEnvelope> with vec![]
@@ -1130,158 +1130,17 @@
 fn build_absence_detection_events(
     projection: &EpistemicProjection,
     state: &PhysicalState,
     check_event: &EventEnvelope,
     observation_event: &EventEnvelope,
     ordering_key: &OrderingKey,
     content_manifest_id: &ContentManifestId,
 ) -> Vec<EventEnvelope> {
-    let Some(actor_id) = check_event.actor_id.as_ref() else {
-        return Vec::new();
-    };
-    let Some(container_id) =
-        payload_value(check_event, "container_id").and_then(|value| ContainerId::new(value).ok())
-    else {
-        return Vec::new();
-    };
-    let Some(observation_id) = payload_value(observation_event, "observation_id")
-        .and_then(|value| crate::ids::ObservationId::new(value).ok())
-    else {
-        return Vec::new();
-    };
-    let observed_item_ids = state
-        .containers
-        .get(&container_id)
-        .map(|container| container.contents.clone())
-        .unwrap_or_default();
-    let knowledge_context =
-        KnowledgeContext::embodied(actor_id.clone(), observation_event.sim_tick);
-    let expectation_beliefs = projection.beliefs_for_context(&knowledge_context);
-    let detections = detect_expected_absences(
-        actor_id,
-        &container_id,
-        &observed_item_ids,
-        &expectation_beliefs,
-        &observation_id,
-        &observation_event.event_id,
-        observation_event.sim_tick,
-        Confidence::new(1000).unwrap(),
-    );
-    let mut events = Vec::new();
-    for detection in detections {
-        let mut contradiction_event = EventEnvelope::new_v1(
-            EventId::new(format!(
-                "event.expectation_contradicted.{}",
-                detection.contradiction.contradiction_id().as_str()
-            ))
-            .unwrap(),
-            EventKind::ExpectationContradicted,
-            0,
-            0,
-            observation_event.sim_tick,
-            ordering_key.clone(),
-            content_manifest_id.clone(),
-        );
-        contradiction_event.actor_id = Some(actor_id.clone());
-        contradiction_event.proposal_id = check_event.proposal_id.clone();
-        contradiction_event.causes = vec![crate::events::EventCause::Event(
-            observation_event.event_id.clone(),
-        )];
-        contradiction_event.payload = vec![
-            PayloadField::new("schema_version", EVENT_SCHEMA_V1),
-            PayloadField::new(
-                "contradiction_id",
-                detection.contradiction.contradiction_id().as_str(),
-            ),
-            PayloadField::new("holder_actor_id", actor_id.as_str()),
-            PayloadField::new(
-                "prior_expectation_belief_id",
-                detection
-                    .contradiction
-                    .prior_expectation_belief_id()
-                    .as_str(),
-            ),
-            PayloadField::new(
-                "contradicting_observation_id",
-                detection
-                    .contradiction
-                    .contradicting_observation_id()
-                    .as_str(),
-            ),
-            PayloadField::new(
-                "expected_proposition",
-                detection
-                    .contradiction
-                    .expected_proposition()
-                    .serialize_canonical(),
-            ),
-            PayloadField::new(
-                "observed_proposition",
-                detection
-                    .contradiction
-                    .observed_proposition()
-                    .serialize_canonical(),
-            ),
-            PayloadField::new(
-                "detected_tick",
-                observation_event.sim_tick.value().to_string(),
-            ),
-        ];
-        contradiction_event.effects_summary = "expectation contradicted by check".to_string();
-
-        let mut belief_event = EventEnvelope::new_v1(
-            EventId::new(format!(
-                "event.belief_updated.{}",
-                detection.missing_belief.belief_id().as_str()
-            ))
-            .unwrap(),
-            EventKind::BeliefUpdated,
-            0,
-            0,
-            observation_event.sim_tick,
-            ordering_key.clone(),
-            content_manifest_id.clone(),
-        );
-        belief_event.actor_id = Some(actor_id.clone());
-        belief_event.proposal_id = check_event.proposal_id.clone();
-        belief_event.causes = vec![
-            crate::events::EventCause::Event(observation_event.event_id.clone()),
-            crate::events::EventCause::Event(contradiction_event.event_id.clone()),
-        ];
-        belief_event.payload = vec![
-            PayloadField::new("schema_version", EVENT_SCHEMA_V1),
-            PayloadField::new("belief_id", detection.missing_belief.belief_id().as_str()),
-            PayloadField::new("holder_actor_id", actor_id.as_str()),
-            PayloadField::new(
-                "proposition",
-                detection.missing_belief.proposition().serialize_canonical(),
-            ),
-            PayloadField::new("stance", detection.missing_belief.stance().stable_id()),
-            PayloadField::new(
-                "confidence",
-                detection
-                    .missing_belief
-                    .confidence()
-                    .parts_per_thousand()
-                    .to_string(),
-            ),
-            PayloadField::new("source_event_id", observation_event.event_id.as_str()),
-            PayloadField::new(
-                "acquired_tick",
-                observation_event.sim_tick.value().to_string(),
-            ),
-            PayloadField::new("channel", "absence_marker"),
-        ];
-        belief_event.effects_summary = "missing expected item belief updated".to_string();
-
-        events.push(contradiction_event);
-        events.push(belief_event);
-    }
-    events
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn payload_value<'a>(event: &'a EventEnvelope, key: &str) -> Option<&'a str> {
     event
         .payload
         .iter()
         .find(|field| field.key == key)
         .map(|field| field.value.as_str())

---- expected_absence_check_creates_contradiction_and_missing_belief stdout ----

thread 'expected_absence_check_creates_contradiction_and_missing_belief' (14470) panicked at crates/tracewake-core/tests/golden_scenarios.rs:602:5:
assertion `left == right` failed
  left: [ContainerChecked, ObservationRecorded]
 right: [ContainerChecked, ObservationRecorded, ExpectationContradicted, BeliefUpdated]

---- no_human_epistemic_check_records_evidence_without_controller stdout ----

thread 'no_human_epistemic_check_records_evidence_without_controller' (14473) panicked at crates/tracewake-core/tests/golden_scenarios.rs:662:5:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    expected_absence_check_creates_contradiction_and_missing_belief
    no_human_epistemic_check_records_evidence_without_controller

test result: FAILED. 14 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
