*** crates/tracewake-core/src/actions/pipeline.rs:1283:5: replace payload_value -> Option<&'a str> with None

*** mutation diff:
--- crates/tracewake-core/src/actions/pipeline.rs
+++ replace payload_value -> Option<&'a str> with None
@@ -1275,21 +1275,17 @@
 
         events.push(contradiction_event);
         events.push(belief_event);
     }
     events
 }
 
 fn payload_value<'a>(event: &'a EventEnvelope, key: &str) -> Option<&'a str> {
-    event
-        .payload
-        .iter()
-        .find(|field| field.key == key)
-        .map(|field| field.value.as_str())
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::actions::{
         ActionDefinition, ActionScope, ProposalOrigin, ProposalSource, ProposalSourceContext,
     };

---- actions::pipeline::tests::agent_source_context_rejects_failed_hidden_truth_audit stdout ----

thread 'actions::pipeline::tests::agent_source_context_rejects_failed_hidden_truth_audit' (18665) panicked at crates/tracewake-core/src/actions/pipeline.rs:2055:9:
assertion failed: result.appended_events.iter().any(|event|
        {
            event.event_type == EventKind::ActionRejected &&
                payload_value(event, "reason_code") ==
                    Some("hidden_truth_input")
        })

failures:
    actions::pipeline::tests::agent_source_context_rejects_failed_hidden_truth_audit

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
