*** crates/tracewake-core/src/actions/pipeline.rs:239:30: replace == with != in run_pipeline

*** mutation diff:
--- crates/tracewake-core/src/actions/pipeline.rs
+++ replace == with != in run_pipeline
@@ -231,17 +231,17 @@
                 proposal,
                 PipelineStage::EventApplication,
                 vec![ReasonCode::WorldStateMismatch],
                 checked_facts,
                 "The world state did not match that action.",
                 "event application rejected an event that passed dry-run",
             );
         }
-        if definition.effect == ActionEffect::CheckContainer {
+        if definition.effect != /* ~ changed by cargo-mutants ~ */ ActionEffect::CheckContainer {
             let observation_event = build_observation_recorded_event(
                 &appended,
                 &context.ordering_key,
                 &context.content_manifest_id,
             );
             let appended_observation = match context.log.append(observation_event) {
                 Ok(appended) => appended,
                 Err(_) => {

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (12104) panicked at crates/tracewake-core/src/actions/defs/checkcontainer.rs:97:10:
check event carries place_id

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
