*** crates/tracewake-core/src/actions/pipeline.rs:402:5: replace body_exclusive_reservation_conflict -> Option<EventId> with None

*** mutation diff:
--- crates/tracewake-core/src/actions/pipeline.rs
+++ replace body_exclusive_reservation_conflict -> Option<EventId> with None
@@ -394,32 +394,17 @@
         appended_events,
     }
 }
 
 fn body_exclusive_reservation_conflict(
     context: &PipelineContext<'_>,
     candidate_events: &[EventEnvelope],
 ) -> Option<EventId> {
-    let actor_id = candidate_events.iter().find_map(|event| {
-        is_body_exclusive_start(event)
-            .then(|| event.actor_id.clone())
-            .flatten()
-    })?;
-    if !candidate_events.iter().any(is_body_exclusive_start) {
-        return None;
-    }
-
-    let open_starts = crate::need_accounting::open_body_exclusive_starts(
-        context.log,
-        &actor_id,
-        context.ordering_key.sim_tick,
-    )
-    .expect("duplicate duration terminals are rejected before reservation checks");
-    open_starts.into_iter().next()
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn is_body_exclusive_start(event: &EventEnvelope) -> bool {
     matches!(
         event.event_type,
         EventKind::SleepStarted | EventKind::WorkBlockStarted
     ) && event
         .payload

---- actions::defs::work::tests::overlapping_body_exclusive_action_is_reservation_conflict stdout ----

thread 'actions::defs::work::tests::overlapping_body_exclusive_action_is_reservation_conflict' (16268) panicked at crates/tracewake-core/src/actions/defs/work.rs:1194:9:
assertion `left == right` failed
  left: Accepted
 right: Rejected

failures:
    actions::defs::work::tests::overlapping_body_exclusive_action_is_reservation_conflict

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
