*** crates/tracewake-core/src/actions/pipeline.rs:407:8: delete ! in body_exclusive_reservation_conflict

*** mutation diff:
--- crates/tracewake-core/src/actions/pipeline.rs
+++ delete ! in body_exclusive_reservation_conflict
@@ -399,17 +399,17 @@
     context: &PipelineContext<'_>,
     candidate_events: &[EventEnvelope],
 ) -> Option<EventId> {
     let actor_id = candidate_events.iter().find_map(|event| {
         is_body_exclusive_start(event)
             .then(|| event.actor_id.clone())
             .flatten()
     })?;
-    if !candidate_events.iter().any(is_body_exclusive_start) {
+    if  /* ~ changed by cargo-mutants ~ */candidate_events.iter().any(is_body_exclusive_start) {
         return None;
     }
 
     let open_starts = crate::need_accounting::open_body_exclusive_starts(
         context.log,
         &actor_id,
         context.ordering_key.sim_tick,
     )

---- actions::defs::work::tests::overlapping_body_exclusive_action_is_reservation_conflict stdout ----

thread 'actions::defs::work::tests::overlapping_body_exclusive_action_is_reservation_conflict' (20839) panicked at crates/tracewake-core/src/actions/defs/work.rs:1194:9:
assertion `left == right` failed
  left: Accepted
 right: Rejected

failures:
    actions::defs::work::tests::overlapping_body_exclusive_action_is_reservation_conflict

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
