*** crates/tracewake-core/src/actions/pipeline.rs:421:5: replace is_body_exclusive_start -> bool with true

*** mutation diff:
--- crates/tracewake-core/src/actions/pipeline.rs
+++ replace is_body_exclusive_start -> bool with true
@@ -413,23 +413,17 @@
         &actor_id,
         context.ordering_key.sim_tick,
     )
     .expect("duplicate duration terminals are rejected before reservation checks");
     open_starts.into_iter().next()
 }
 
 fn is_body_exclusive_start(event: &EventEnvelope) -> bool {
-    matches!(
-        event.event_type,
-        EventKind::SleepStarted | EventKind::WorkBlockStarted
-    ) && event
-        .payload
-        .iter()
-        .any(|field| field.key == "body_exclusive" && field.value == "true")
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn decide_proposal(context: PipelineReadContext<'_>, proposal: &Proposal) -> PipelineDecision {
     let mut checked_facts = vec![CheckedFact::new("action_id", proposal.action_id.as_str())];
 
     if let Some(result) = controller_binding_check(context, proposal, checked_facts.clone()) {
         return result;
     }

---- work_block_failed_then_sleep_succeeds_fixture_closes_reservation stdout ----

thread 'work_block_failed_then_sleep_succeeds_fixture_closes_reservation' (25337) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1343:5:
assertion failed: has_event(&log, EventKind::WorkBlockFailed)

failures:
    work_block_failed_then_sleep_succeeds_fixture_closes_reservation

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.60s

*** result: Failure(101)
