*** crates/tracewake-core/src/actions/pipeline.rs:421:5: replace is_body_exclusive_start -> bool with false

*** mutation diff:
--- crates/tracewake-core/src/actions/pipeline.rs
+++ replace is_body_exclusive_start -> bool with false
@@ -413,23 +413,17 @@
         &actor_id,
         context.ordering_key.sim_tick,
     )
     .expect("duplicate duration terminals are rejected before reservation checks");
     open_starts.into_iter().next()
 }
 
 fn is_body_exclusive_start(event: &EventEnvelope) -> bool {
-    matches!(
-        event.event_type,
-        EventKind::SleepStarted | EventKind::WorkBlockStarted
-    ) && event
-        .payload
-        .iter()
-        .any(|field| field.key == "body_exclusive" && field.value == "true")
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn decide_proposal(context: PipelineReadContext<'_>, proposal: &Proposal) -> PipelineDecision {
     let mut checked_facts = vec![CheckedFact::new("action_id", proposal.action_id.as_str())];
 
     if let Some(result) = controller_binding_check(context, proposal, checked_facts.clone()) {
         return result;
     }

---- actions::defs::work::tests::overlapping_body_exclusive_action_is_reservation_conflict stdout ----

thread 'actions::defs::work::tests::overlapping_body_exclusive_action_is_reservation_conflict' (29497) panicked at crates/tracewake-core/src/actions/defs/work.rs:1194:9:
assertion `left == right` failed
  left: Accepted
 right: Rejected

---- actions::pipeline::tests::body_exclusive_start_requires_kind_and_payload_flag stdout ----

thread 'actions::pipeline::tests::body_exclusive_start_requires_kind_and_payload_flag' (29511) panicked at crates/tracewake-core/src/actions/pipeline.rs:1963:9:
assertion failed: is_body_exclusive_start(&work)

failures:
    actions::defs::work::tests::overlapping_body_exclusive_action_is_reservation_conflict
    actions::pipeline::tests::body_exclusive_start_requires_kind_and_payload_flag

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
