*** crates/tracewake-core/src/actions/pipeline.rs:424:7: replace && with || in is_body_exclusive_start

*** mutation diff:
--- crates/tracewake-core/src/actions/pipeline.rs
+++ replace && with || in is_body_exclusive_start
@@ -416,17 +416,17 @@
     .expect("duplicate duration terminals are rejected before reservation checks");
     open_starts.into_iter().next()
 }
 
 fn is_body_exclusive_start(event: &EventEnvelope) -> bool {
     matches!(
         event.event_type,
         EventKind::SleepStarted | EventKind::WorkBlockStarted
-    ) && event
+    ) || /* ~ changed by cargo-mutants ~ */ event
         .payload
         .iter()
         .any(|field| field.key == "body_exclusive" && field.value == "true")
 }
 
 fn decide_proposal(context: PipelineReadContext<'_>, proposal: &Proposal) -> PipelineDecision {
     let mut checked_facts = vec![CheckedFact::new("action_id", proposal.action_id.as_str())];

---- actions::pipeline::tests::body_exclusive_start_requires_kind_and_payload_flag stdout ----

thread 'actions::pipeline::tests::body_exclusive_start_requires_kind_and_payload_flag' (1602) panicked at crates/tracewake-core/src/actions/pipeline.rs:1980:9:
assertion failed: !is_body_exclusive_start(&missing_flag)

failures:
    actions::pipeline::tests::body_exclusive_start_requires_kind_and_payload_flag

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
