*** crates/tracewake-core/src/actions/pipeline.rs:427:52: replace && with || in is_body_exclusive_start

*** mutation diff:
--- crates/tracewake-core/src/actions/pipeline.rs
+++ replace && with || in is_body_exclusive_start
@@ -419,17 +419,17 @@
 
 fn is_body_exclusive_start(event: &EventEnvelope) -> bool {
     matches!(
         event.event_type,
         EventKind::SleepStarted | EventKind::WorkBlockStarted
     ) && event
         .payload
         .iter()
-        .any(|field| field.key == "body_exclusive" && field.value == "true")
+        .any(|field| field.key == "body_exclusive" || /* ~ changed by cargo-mutants ~ */ field.value == "true")
 }
 
 fn decide_proposal(context: PipelineReadContext<'_>, proposal: &Proposal) -> PipelineDecision {
     let mut checked_facts = vec![CheckedFact::new("action_id", proposal.action_id.as_str())];
 
     if let Some(result) = controller_binding_check(context, proposal, checked_facts.clone()) {
         return result;
     }

---- actions::pipeline::tests::body_exclusive_start_requires_kind_and_payload_flag stdout ----

thread 'actions::pipeline::tests::body_exclusive_start_requires_kind_and_payload_flag' (6162) panicked at crates/tracewake-core/src/actions/pipeline.rs:1994:9:
assertion failed: !is_body_exclusive_start(&false_flag)

failures:
    actions::pipeline::tests::body_exclusive_start_requires_kind_and_payload_flag

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
