*** crates/tracewake-core/src/actions/pipeline.rs:460:28: replace match guard actor.enabled with true in decide_proposal

*** mutation diff:
--- crates/tracewake-core/src/actions/pipeline.rs
+++ replace match guard actor.enabled with true in decide_proposal
@@ -452,17 +452,17 @@
                 "action definition was not present in the ordinary registry",
             )
         }
     };
 
     if let Some(actor_id) = &proposal.actor_id {
         checked_facts.push(CheckedFact::new("actor_id", actor_id.as_str()));
         match context.state.actors.get(actor_id) {
-            Some(actor) if actor.enabled => {}
+            Some(actor) if true /* ~ changed by cargo-mutants ~ */ => {}
             _ => {
                 return reject(
                     context,
                     proposal,
                     PipelineStage::ActorLookup,
                     vec![ReasonCode::ActorNotFound],
                     checked_facts,
                     "That actor cannot act.",

---- actions::pipeline::tests::disabled_actor_rejects_before_query_acceptance stdout ----

thread 'actions::pipeline::tests::disabled_actor_rejects_before_query_acceptance' (19852) panicked at crates/tracewake-core/src/actions/pipeline.rs:1909:9:
assertion `left == right` failed
  left: Accepted
 right: Rejected

failures:
    actions::pipeline::tests::disabled_actor_rejects_before_query_acceptance

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
