*** crates/tracewake-core/src/actions/pipeline.rs:460:28: replace match guard actor.enabled with false in decide_proposal

*** mutation diff:
--- crates/tracewake-core/src/actions/pipeline.rs
+++ replace match guard actor.enabled with false in decide_proposal
@@ -452,17 +452,17 @@
                 "action definition was not present in the ordinary registry",
             )
         }
     };
 
     if let Some(actor_id) = &proposal.actor_id {
         checked_facts.push(CheckedFact::new("actor_id", actor_id.as_str()));
         match context.state.actors.get(actor_id) {
-            Some(actor) if actor.enabled => {}
+            Some(actor) if false /* ~ changed by cargo-mutants ~ */ => {}
             _ => {
                 return reject(
                     context,
                     proposal,
                     PipelineStage::ActorLookup,
                     vec![ReasonCode::ActorNotFound],
                     checked_facts,
                     "That actor cannot act.",

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (24263) panicked at crates/tracewake-content/tests/fixtures_load.rs:1217:5:
assertion failed: report.ordinary_pipeline_events > 0

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
