*** crates/tracewake-core/src/actions/pipeline.rs:475:8: delete ! in decide_proposal

*** mutation diff:
--- crates/tracewake-core/src/actions/pipeline.rs
+++ delete ! in decide_proposal
@@ -467,17 +467,17 @@
                     checked_facts,
                     "That actor cannot act.",
                     "actor was missing or disabled",
                 )
             }
         }
     }
 
-    if !context.registry.scope_is_active(definition.scope) {
+    if  /* ~ changed by cargo-mutants ~ */context.registry.scope_is_active(definition.scope) {
         return reject(
             context,
             proposal,
             PipelineStage::PhaseBoundaryValidation,
             vec![ReasonCode::PhaseUnsupportedAction],
             checked_facts,
             "That action is not part of this phase.",
             "registry action exists but is outside the active action scope set",

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (28294) panicked at crates/tracewake-content/tests/fixtures_load.rs:1217:5:
assertion failed: report.ordinary_pipeline_events > 0

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
