*** crates/tracewake-core/src/actions/pipeline.rs:491:47: replace == with != in decide_proposal

*** mutation diff:
--- crates/tracewake-core/src/actions/pipeline.rs
+++ replace == with != in decide_proposal
@@ -483,17 +483,17 @@
             "registry action exists but is outside the active action scope set",
         );
     }
 
     checked_facts.push(CheckedFact::new(
         "knowledge_perception_slot",
         if matches!(definition.effect, ActionEffect::CheckContainer) {
             "active"
-        } else if proposal.action_id.as_str() == "truthful_accuse_probe" {
+        } else if proposal.action_id.as_str() != /* ~ changed by cargo-mutants ~ */ "truthful_accuse_probe" {
             "query_validation"
         } else {
             "inert"
         },
     ));
     checked_facts.push(CheckedFact::new("pipeline_slots_9_11", "inert"));
 
     let would_mutate = !matches!(definition.effect, ActionEffect::QueryOnly);

---- actions::pipeline::tests::query_only_look_keeps_knowledge_slot_inert stdout ----

thread 'actions::pipeline::tests::query_only_look_keeps_knowledge_slot_inert' (32485) panicked at crates/tracewake-core/src/actions/pipeline.rs:1798:9:
assertion `left == right` failed
  left: Some("query_validation")
 right: Some("inert")

failures:
    actions::pipeline::tests::query_only_look_keeps_knowledge_slot_inert

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
