*** crates/tracewake-core/src/actions/pipeline.rs:499:24: delete ! in decide_proposal

*** mutation diff:
--- crates/tracewake-core/src/actions/pipeline.rs
+++ delete ! in decide_proposal
@@ -491,17 +491,17 @@
         } else if proposal.action_id.as_str() == "truthful_accuse_probe" {
             "query_validation"
         } else {
             "inert"
         },
     ));
     checked_facts.push(CheckedFact::new("pipeline_slots_9_11", "inert"));
 
-    let would_mutate = !matches!(definition.effect, ActionEffect::QueryOnly);
+    let would_mutate =  /* ~ changed by cargo-mutants ~ */matches!(definition.effect, ActionEffect::QueryOnly);
     if definition.effect == ActionEffect::QueryOnly
         && proposal.action_id.as_str() == "truthful_accuse_probe"
     {
         if let Err(rejection) =
             validate_truthful_accuse_probe(context.state, context.epistemic_projection, proposal)
         {
             return reject_action(context, proposal, rejection);
         }

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (4416) panicked at crates/tracewake-content/tests/fixtures_load.rs:1217:5:
assertion failed: report.ordinary_pipeline_events > 0

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
