*** crates/tracewake-core/src/actions/pipeline.rs:500:26: replace == with != in decide_proposal

*** mutation diff:
--- crates/tracewake-core/src/actions/pipeline.rs
+++ replace == with != in decide_proposal
@@ -492,17 +492,17 @@
             "query_validation"
         } else {
             "inert"
         },
     ));
     checked_facts.push(CheckedFact::new("pipeline_slots_9_11", "inert"));
 
     let would_mutate = !matches!(definition.effect, ActionEffect::QueryOnly);
-    if definition.effect == ActionEffect::QueryOnly
+    if definition.effect != /* ~ changed by cargo-mutants ~ */ ActionEffect::QueryOnly
         && proposal.action_id.as_str() == "truthful_accuse_probe"
     {
         if let Err(rejection) =
             validate_truthful_accuse_probe(context.state, context.epistemic_projection, proposal)
         {
             return reject_action(context, proposal, rejection);
         }
     }

---- missing_property_belief_does_not_support_truthful_accusation stdout ----

thread 'missing_property_belief_does_not_support_truthful_accusation' (13693) panicked at crates/tracewake-core/tests/golden_scenarios.rs:699:5:
assertion `left == right` failed
  left: Accepted
 right: Rejected

failures:
    missing_property_belief_does_not_support_truthful_accusation

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
