*** crates/tracewake-core/src/actions/pipeline.rs:501:40: replace == with != in decide_proposal

*** mutation diff:
--- crates/tracewake-core/src/actions/pipeline.rs
+++ replace == with != in decide_proposal
@@ -493,17 +493,17 @@
         } else {
             "inert"
         },
     ));
     checked_facts.push(CheckedFact::new("pipeline_slots_9_11", "inert"));
 
     let would_mutate = !matches!(definition.effect, ActionEffect::QueryOnly);
     if definition.effect == ActionEffect::QueryOnly
-        && proposal.action_id.as_str() == "truthful_accuse_probe"
+        && proposal.action_id.as_str() != /* ~ changed by cargo-mutants ~ */ "truthful_accuse_probe"
     {
         if let Err(rejection) =
             validate_truthful_accuse_probe(context.state, context.epistemic_projection, proposal)
         {
             return reject_action(context, proposal, rejection);
         }
     }
     if would_mutate {

---- actions::defs::inspect::tests::accepted_inspect_appends_no_world_event stdout ----

thread 'actions::defs::inspect::tests::accepted_inspect_appends_no_world_event' (17830) panicked at crates/tracewake-core/src/actions/defs/inspect.rs:123:9:
assertion failed: result.appended_events.is_empty()

---- actions::pipeline::tests::human_source_context_fresh_view_passes_source_validation stdout ----

thread 'actions::pipeline::tests::human_source_context_fresh_view_passes_source_validation' (17881) panicked at crates/tracewake-core/src/actions/pipeline.rs:1571:9:
assertion `left == right` failed
  left: Rejected
 right: Accepted

---- actions::pipeline::tests::human_source_context_matches_exact_and_dotted_semantic_actions stdout ----

thread 'actions::pipeline::tests::human_source_context_matches_exact_and_dotted_semantic_actions' (17882) panicked at crates/tracewake-core/src/actions/pipeline.rs:1713:9:
assertion `left == right` failed
  left: Rejected
 right: Accepted

failures:
    actions::defs::inspect::tests::accepted_inspect_appends_no_world_event
    actions::pipeline::tests::human_source_context_fresh_view_passes_source_validation
    actions::pipeline::tests::human_source_context_matches_exact_and_dotted_semantic_actions
    actions::pipeline::tests::query_only_look_keeps_knowledge_slot_inert

test result: FAILED. 451 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
