*** crates/tracewake-core/src/actions/pipeline.rs:727:24: replace != with == in controller_binding_check

*** mutation diff:
--- crates/tracewake-core/src/actions/pipeline.rs
+++ replace != with == in controller_binding_check
@@ -719,17 +719,17 @@
     }
 }
 
 fn controller_binding_check(
     context: PipelineReadContext<'_>,
     proposal: &Proposal,
     checked_facts: Vec<CheckedFact>,
 ) -> Option<PipelineDecision> {
-    if proposal.origin != ProposalOrigin::Human {
+    if proposal.origin == /* ~ changed by cargo-mutants ~ */ ProposalOrigin::Human {
         return None;
     }
 
     let Some(actor_id) = proposal.actor_id.as_ref() else {
         return Some(reject(
             context,
             proposal,
             PipelineStage::ControllerBindingCheck,

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (26871) panicked at crates/tracewake-content/tests/fixtures_load.rs:1217:5:
assertion failed: report.ordinary_pipeline_events > 0

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
