*** crates/tracewake-core/src/actions/pipeline.rs:727:5: replace controller_binding_check -> Option<PipelineDecision> with None

*** mutation diff:
--- crates/tracewake-core/src/actions/pipeline.rs
+++ replace controller_binding_check -> Option<PipelineDecision> with None
@@ -719,79 +719,17 @@
     }
 }
 
 fn controller_binding_check(
     context: PipelineReadContext<'_>,
     proposal: &Proposal,
     checked_facts: Vec<CheckedFact>,
 ) -> Option<PipelineDecision> {
-    if proposal.origin != ProposalOrigin::Human {
-        return None;
-    }
-
-    let Some(actor_id) = proposal.actor_id.as_ref() else {
-        return Some(reject(
-            context,
-            proposal,
-            PipelineStage::ControllerBindingCheck,
-            vec![ReasonCode::ControllerUnbound],
-            checked_facts,
-            "No controller is bound to that actor.",
-            "human-origin proposal did not name an actor for authorization",
-        ));
-    };
-
-    let Some(controller_id_value) = proposal.parameters.get("controller_id") else {
-        return Some(reject(
-            context,
-            proposal,
-            PipelineStage::ControllerBindingCheck,
-            vec![ReasonCode::ControllerUnbound],
-            checked_facts,
-            "No controller is bound to that actor.",
-            "human-origin proposal did not include controller_id metadata",
-        ));
-    };
-    let Ok(controller_id) = crate::ids::ControllerId::new(controller_id_value.clone()) else {
-        return Some(reject(
-            context,
-            proposal,
-            PipelineStage::ControllerBindingCheck,
-            vec![ReasonCode::ControllerUnbound],
-            checked_facts,
-            "No controller is bound to that actor.",
-            "human-origin controller_id was not a stable ID",
-        ));
-    };
-
-    match context
-        .controller_bindings
-        .map(|bindings| bindings.authorize(&controller_id, actor_id))
-    {
-        Some(Ok(())) => None,
-        Some(Err(ControllerError::ControllerActorMismatch { .. })) => Some(reject(
-            context,
-            proposal,
-            PipelineStage::ControllerBindingCheck,
-            vec![ReasonCode::ControllerActorMismatch],
-            checked_facts,
-            "That controller is bound to another actor.",
-            "human-origin controller binding did not match proposal actor",
-        )),
-        Some(Err(ControllerError::ControllerUnbound(_))) | None => Some(reject(
-            context,
-            proposal,
-            PipelineStage::ControllerBindingCheck,
-            vec![ReasonCode::ControllerUnbound],
-            checked_facts,
-            "No controller is bound to that actor.",
-            "human-origin controller was not bound",
-        )),
-    }
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn source_context_check(
     context: PipelineReadContext<'_>,
     proposal: &Proposal,
     mut checked_facts: Vec<CheckedFact>,
 ) -> Option<PipelineDecision> {
     if proposal.origin == ProposalOrigin::Agent {

---- actions::pipeline::tests::human_controller_binding_is_required_before_other_validation stdout ----

thread 'actions::pipeline::tests::human_controller_binding_is_required_before_other_validation' (22449) panicked at crates/tracewake-core/src/actions/pipeline.rs:1812:9:
assertion `left == right` failed
  left: Accepted
 right: Rejected

failures:
    actions::pipeline::tests::human_controller_binding_is_required_before_other_validation

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
