*** crates/tracewake-core/src/actions/pipeline.rs:797:24: replace == with != in source_context_check

*** mutation diff:
--- crates/tracewake-core/src/actions/pipeline.rs
+++ replace == with != in source_context_check
@@ -789,17 +789,17 @@
     }
 }
 
 fn source_context_check(
     context: PipelineReadContext<'_>,
     proposal: &Proposal,
     mut checked_facts: Vec<CheckedFact>,
 ) -> Option<PipelineDecision> {
-    if proposal.origin == ProposalOrigin::Agent {
+    if proposal.origin != /* ~ changed by cargo-mutants ~ */ ProposalOrigin::Agent {
         if proposal
             .parameters
             .get("hidden_truth_audit_actor_known_only")
             .is_none_or(|value| value != "true")
         {
             return Some(reject(
                 context,
                 proposal,

---- episode_tamper_output_tag_poisons_replay stdout ----

thread 'episode_tamper_output_tag_poisons_replay' (3040) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:993:10:
sleep starts

---- continue_routine_tamper_kind_flip_poisons_replay stdout ----

thread 'continue_routine_tamper_kind_flip_poisons_replay' (3038) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:956:5:
assertion failed: has_event(&log, EventKind::ContinueRoutineProposed)

---- continue_routine_tamper_reason_rewrite_poisons_replay stdout ----

thread 'continue_routine_tamper_reason_rewrite_poisons_replay' (3039) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:956:5:
assertion failed: has_event(&log, EventKind::ContinueRoutineProposed)

failures:
    continue_routine_tamper_kind_flip_poisons_replay
    continue_routine_tamper_reason_rewrite_poisons_replay
    episode_tamper_output_tag_poisons_replay
    food_unavailable_fixture_records_typed_failure_without_refill
    no_hidden_truth_fixture_keeps_hidden_food_out_of_planner_inputs
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    ordinary_workday_fixture_moves_before_work_completion
    possession_fixture_preserves_intention_needs_and_can_continue
    routine_blocked_fixture_records_access_failure_without_silent_loop
    routine_no_teleport_fixture_fails_remote_work_without_movement_ancestry
    serialized_event_log_replays_to_identical_state
    sleep_eat_work_fixture_logs_need_effects_and_replays

test result: FAILED. 28 passed; 14 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.60s

*** result: Failure(101)
