*** crates/tracewake-core/src/actions/pipeline.rs:797:5: replace source_context_check -> Option<PipelineDecision> with None

*** mutation diff:
--- crates/tracewake-core/src/actions/pipeline.rs
+++ replace source_context_check -> Option<PipelineDecision> with None
@@ -789,180 +789,17 @@
     }
 }
 
 fn source_context_check(
     context: PipelineReadContext<'_>,
     proposal: &Proposal,
     mut checked_facts: Vec<CheckedFact>,
 ) -> Option<PipelineDecision> {
-    if proposal.origin == ProposalOrigin::Agent {
-        if proposal
-            .parameters
-            .get("hidden_truth_audit_actor_known_only")
-            .is_none_or(|value| value != "true")
-        {
-            return Some(reject(
-                context,
-                proposal,
-                PipelineStage::SourceContextValidation,
-                vec![ReasonCode::HiddenTruthInput],
-                checked_facts,
-                "That action was blocked by the actor-known audit.",
-                "agent-origin proposal lacked a clean hidden-truth audit stamp",
-            ));
-        }
-        return None;
-    }
-
-    if proposal.origin != ProposalOrigin::Human {
-        return None;
-    }
-
-    let Some(actor_id) = proposal.actor_id.as_ref() else {
-        return Some(reject(
-            context,
-            proposal,
-            PipelineStage::SourceContextValidation,
-            vec![ReasonCode::ProposalSourceMissing],
-            checked_facts,
-            "That action does not have a current view source.",
-            "human-origin proposal did not name an actor for source validation",
-        ));
-    };
-
-    let Some(proposal_source) = proposal.source.as_ref() else {
-        return Some(reject(
-            context,
-            proposal,
-            PipelineStage::SourceContextValidation,
-            vec![ReasonCode::ProposalSourceMissing],
-            checked_facts,
-            "That action does not have a current view source.",
-            "human-origin proposal did not include a TUI semantic-action source packet",
-        ));
-    };
-
-    let Some(source) = proposal_source.tui_context() else {
-        return Some(reject(
-            context,
-            proposal,
-            PipelineStage::SourceContextValidation,
-            vec![ReasonCode::ProposalSourceMissing],
-            checked_facts,
-            "That action does not have a current view source.",
-            "human-origin proposal did not include a TUI semantic-action source packet",
-        ));
-    };
-
-    checked_facts.push(CheckedFact::new("source_kind", proposal_source.stable_id()));
-    checked_facts.push(CheckedFact::new(
-        "semantic_action_id",
-        source.semantic_action_id.as_str(),
-    ));
-    checked_facts.push(CheckedFact::new(
-        "holder_known_context_id",
-        source.holder_known_context_id.as_str(),
-    ));
-    checked_facts.push(CheckedFact::new(
-        "holder_known_context_hash",
-        source.holder_known_context_hash.as_str(),
-    ));
-    checked_facts.push(CheckedFact::new(
-        "holder_known_context_frontier",
-        source.holder_known_context_frontier.to_string(),
-    ));
-
-    if source.actor_id != *actor_id {
-        return Some(reject(
-            context,
-            proposal,
-            PipelineStage::SourceContextValidation,
-            vec![ReasonCode::ProposalSourceActorMismatch],
-            checked_facts,
-            "That action belongs to another actor's view.",
-            "proposal source actor did not match proposal actor",
-        ));
-    }
-    if source.context_tick != proposal.requested_tick
-        || source.context_tick != context.ordering_key.sim_tick
-    {
-        return Some(reject(
-            context,
-            proposal,
-            PipelineStage::SourceContextValidation,
-            vec![ReasonCode::ProposalSourceStale],
-            checked_facts,
-            "That action is from a stale view.",
-            "proposal source tick did not match requested/current ordering tick",
-        ));
-    }
-    if source.holder_known_context_frontier != context.current_event_frontier {
-        return Some(reject(
-            context,
-            proposal,
-            PipelineStage::SourceContextValidation,
-            vec![ReasonCode::ProposalSourceStale],
-            checked_facts,
-            "That action is from a stale view.",
-            "proposal source frontier did not match current event frontier",
-        ));
-    }
-    if source.source_view_model_id
-        != proposal
-            .source_view_model_id
-            .clone()
-            .unwrap_or_else(|| source.source_view_model_id.clone())
-    {
-        return Some(reject(
-            context,
-            proposal,
-            PipelineStage::SourceContextValidation,
-            vec![ReasonCode::ProposalSourceContextMismatch],
-            checked_facts,
-            "That action does not match its view source.",
-            "proposal source view model did not match legacy source view field",
-        ));
-    }
-
-    let expected_context = current_place_knowledge_context(
-        context.state,
-        context.epistemic_projection,
-        actor_id,
-        source.context_tick,
-        context.content_manifest_id,
-        context.current_event_frontier,
-    );
-    if source.holder_known_context_id != *expected_context.holder_known_context_id()
-        || source.holder_known_context_hash != *expected_context.holder_known_context_hash()
-    {
-        return Some(reject(
-            context,
-            proposal,
-            PipelineStage::SourceContextValidation,
-            vec![ReasonCode::ProposalSourceContextMismatch],
-            checked_facts,
-            "That action does not match the actor's current knowledge context.",
-            "proposal source context id/hash did not match reconstructed sealed context",
-        ));
-    }
-
-    if !semantic_action_matches_action(&source.semantic_action_id, &proposal.action_id) {
-        return Some(reject(
-            context,
-            proposal,
-            PipelineStage::SourceContextValidation,
-            vec![ReasonCode::ProposalSourceForged],
-            checked_facts,
-            "That action token does not match the requested action.",
-            "semantic action id did not match proposal action id",
-        ));
-    }
-
-    None
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn semantic_action_matches_action(
     semantic_action_id: &crate::ids::SemanticActionId,
     action_id: &crate::ids::ActionId,
 ) -> bool {
     let semantic = semantic_action_id.as_str();
     let action = action_id.as_str();

---- actions::pipeline::tests::agent_source_context_rejects_absent_hidden_truth_audit_stamp stdout ----

thread 'actions::pipeline::tests::agent_source_context_rejects_absent_hidden_truth_audit_stamp' (31048) panicked at crates/tracewake-core/src/actions/pipeline.rs:1923:9:
assertion `left == right` failed
  left: Accepted
 right: Rejected

---- actions::pipeline::tests::agent_source_context_rejects_failed_hidden_truth_audit stdout ----

thread 'actions::pipeline::tests::agent_source_context_rejects_failed_hidden_truth_audit' (31049) panicked at crates/tracewake-core/src/actions/pipeline.rs:1887:9:
assertion `left == right` failed
  left: Accepted
 right: Rejected

---- actions::pipeline::tests::human_source_context_cross_actor_rejects stdout ----

thread 'actions::pipeline::tests::human_source_context_cross_actor_rejects' (31053) panicked at crates/tracewake-core/src/actions/pipeline.rs:1488:9:
assertion `left == right` failed
  left: Accepted
 right: Rejected

failures:
    actions::pipeline::tests::agent_source_context_rejects_absent_hidden_truth_audit_stamp
    actions::pipeline::tests::agent_source_context_rejects_failed_hidden_truth_audit
    actions::pipeline::tests::human_source_context_cross_actor_rejects
    actions::pipeline::tests::human_source_context_forged_action_token_rejects
    actions::pipeline::tests::human_source_context_matches_exact_and_dotted_semantic_actions
    actions::pipeline::tests::human_source_context_missing_rejects_before_action_lookup
    actions::pipeline::tests::human_source_context_rejects_each_stale_tick_side
    actions::pipeline::tests::human_source_context_stale_frontier_rejects_before_action_validation

test result: FAILED. 447 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
