*** crates/tracewake-core/src/actions/pipeline.rs:801:39: replace != with == in source_context_check

*** mutation diff:
--- crates/tracewake-core/src/actions/pipeline.rs
+++ replace != with == in source_context_check
@@ -793,17 +793,17 @@
     context: PipelineReadContext<'_>,
     proposal: &Proposal,
     mut checked_facts: Vec<CheckedFact>,
 ) -> Option<PipelineDecision> {
     if proposal.origin == ProposalOrigin::Agent {
         if proposal
             .parameters
             .get("hidden_truth_audit_actor_known_only")
-            .is_none_or(|value| value != "true")
+            .is_none_or(|value| value == /* ~ changed by cargo-mutants ~ */ "true")
         {
             return Some(reject(
                 context,
                 proposal,
                 PipelineStage::SourceContextValidation,
                 vec![ReasonCode::HiddenTruthInput],
                 checked_facts,
                 "That action was blocked by the actor-known audit.",

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (7106) panicked at crates/tracewake-content/tests/fixtures_load.rs:1217:5:
assertion failed: report.ordinary_pipeline_events > 0

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
