*** crates/tracewake-core/src/actions/pipeline.rs:816:24: replace != with == in source_context_check

*** mutation diff:
--- crates/tracewake-core/src/actions/pipeline.rs
+++ replace != with == in source_context_check
@@ -808,17 +808,17 @@
                 checked_facts,
                 "That action was blocked by the actor-known audit.",
                 "agent-origin proposal lacked a clean hidden-truth audit stamp",
             ));
         }
         return None;
     }
 
-    if proposal.origin != ProposalOrigin::Human {
+    if proposal.origin == /* ~ changed by cargo-mutants ~ */ ProposalOrigin::Human {
         return None;
     }
 
     let Some(actor_id) = proposal.actor_id.as_ref() else {
         return Some(reject(
             context,
             proposal,
             PipelineStage::SourceContextValidation,

---- food_unavailable_fixture_records_typed_failure_without_refill stdout ----

thread 'food_unavailable_fixture_records_typed_failure_without_refill' (11175) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1457:5:
assertion failed: has_event(&log, EventKind::EatFailed)

---- continue_routine_tamper_reason_rewrite_poisons_replay stdout ----

thread 'continue_routine_tamper_reason_rewrite_poisons_replay' (11170) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:956:5:
assertion failed: has_event(&log, EventKind::ContinueRoutineProposed)

---- continue_routine_tamper_kind_flip_poisons_replay stdout ----

thread 'continue_routine_tamper_kind_flip_poisons_replay' (11169) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:956:5:
assertion failed: has_event(&log, EventKind::ContinueRoutineProposed)

failures:
    continue_routine_tamper_kind_flip_poisons_replay
    continue_routine_tamper_reason_rewrite_poisons_replay
    episode_tamper_output_tag_poisons_replay
    food_unavailable_fixture_records_typed_failure_without_refill
    no_hidden_truth_fixture_keeps_hidden_food_out_of_planner_inputs
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    ordinary_workday_fixture_moves_before_work_completion
    possession_fixture_preserves_intention_needs_and_can_continue
    routine_blocked_fixture_records_access_failure_without_silent_loop
    routine_no_teleport_fixture_fails_remote_work_without_movement_ancestry
    serialized_event_log_replays_to_identical_state
    sleep_eat_work_fixture_logs_need_effects_and_replays

test result: FAILED. 28 passed; 14 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.60s

*** result: Failure(101)
