*** crates/tracewake-core/src/actions/pipeline.rs:886:9: replace || with && in source_context_check

*** mutation diff:
--- crates/tracewake-core/src/actions/pipeline.rs
+++ replace || with && in source_context_check
@@ -878,17 +878,17 @@
             PipelineStage::SourceContextValidation,
             vec![ReasonCode::ProposalSourceActorMismatch],
             checked_facts,
             "That action belongs to another actor's view.",
             "proposal source actor did not match proposal actor",
         ));
     }
     if source.context_tick != proposal.requested_tick
-        || source.context_tick != context.ordering_key.sim_tick
+        && /* ~ changed by cargo-mutants ~ */ source.context_tick != context.ordering_key.sim_tick
     {
         return Some(reject(
             context,
             proposal,
             PipelineStage::SourceContextValidation,
             vec![ReasonCode::ProposalSourceStale],
             checked_facts,
             "That action is from a stale view.",

---- actions::pipeline::tests::human_source_context_rejects_each_stale_tick_side stdout ----

thread 'actions::pipeline::tests::human_source_context_rejects_each_stale_tick_side' (19950) panicked at crates/tracewake-core/src/actions/pipeline.rs:1854:9:
assertion `left == right` failed
  left: [ProposalSourceContextMismatch]
 right: [ProposalSourceStale]

failures:
    actions::pipeline::tests::human_source_context_rejects_each_stale_tick_side

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
