*** crates/tracewake-core/src/actions/pipeline.rs:910:9: replace != with == in source_context_check

*** mutation diff:
--- crates/tracewake-core/src/actions/pipeline.rs
+++ replace != with == in source_context_check
@@ -902,17 +902,17 @@
             PipelineStage::SourceContextValidation,
             vec![ReasonCode::ProposalSourceStale],
             checked_facts,
             "That action is from a stale view.",
             "proposal source frontier did not match current event frontier",
         ));
     }
     if source.source_view_model_id
-        != proposal
+        == /* ~ changed by cargo-mutants ~ */ proposal
             .source_view_model_id
             .clone()
             .unwrap_or_else(|| source.source_view_model_id.clone())
     {
         return Some(reject(
             context,
             proposal,
             PipelineStage::SourceContextValidation,

---- actions::defs::continue_routine::tests::human_and_scheduler_continue_share_pipeline_result stdout ----

thread 'actions::defs::continue_routine::tests::human_and_scheduler_continue_share_pipeline_result' (5651) panicked at crates/tracewake-core/src/actions/defs/continue_routine.rs:539:9:
assertion `left == right` failed
  left: Rejected
 right: Accepted

---- actions::pipeline::tests::human_source_context_matches_exact_and_dotted_semantic_actions stdout ----

thread 'actions::pipeline::tests::human_source_context_matches_exact_and_dotted_semantic_actions' (5716) panicked at crates/tracewake-core/src/actions/pipeline.rs:1713:9:
assertion `left == right` failed
  left: Rejected
 right: Accepted

---- actions::pipeline::tests::human_source_context_fresh_view_passes_source_validation stdout ----

thread 'actions::pipeline::tests::human_source_context_fresh_view_passes_source_validation' (5715) panicked at crates/tracewake-core/src/actions/pipeline.rs:1571:9:
assertion `left == right` failed
  left: Rejected
 right: Accepted

failures:
    actions::defs::continue_routine::tests::human_and_scheduler_continue_share_pipeline_result
    actions::pipeline::tests::human_source_context_forged_action_token_rejects
    actions::pipeline::tests::human_source_context_fresh_view_passes_source_validation
    actions::pipeline::tests::human_source_context_matches_exact_and_dotted_semantic_actions
    actions::pipeline::tests::same_proposal_validates_same_for_human_and_scheduler_origin
    controller::tests::human_after_authorization_matches_scheduler_validation

test result: FAILED. 449 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
