*** crates/tracewake-core/src/actions/pipeline.rs:934:39: replace != with == in source_context_check

*** mutation diff:
--- crates/tracewake-core/src/actions/pipeline.rs
+++ replace != with == in source_context_check
@@ -926,17 +926,17 @@
     let expected_context = current_place_knowledge_context(
         context.state,
         context.epistemic_projection,
         actor_id,
         source.context_tick,
         context.content_manifest_id,
         context.current_event_frontier,
     );
-    if source.holder_known_context_id != *expected_context.holder_known_context_id()
+    if source.holder_known_context_id == /* ~ changed by cargo-mutants ~ */ *expected_context.holder_known_context_id()
         || source.holder_known_context_hash != *expected_context.holder_known_context_hash()
     {
         return Some(reject(
             context,
             proposal,
             PipelineStage::SourceContextValidation,
             vec![ReasonCode::ProposalSourceContextMismatch],
             checked_facts,

---- actions::defs::continue_routine::tests::human_and_scheduler_continue_share_pipeline_result stdout ----

thread 'actions::defs::continue_routine::tests::human_and_scheduler_continue_share_pipeline_result' (14871) panicked at crates/tracewake-core/src/actions/defs/continue_routine.rs:539:9:
assertion `left == right` failed
  left: Rejected
 right: Accepted

---- actions::pipeline::tests::human_source_context_forged_action_token_rejects stdout ----

thread 'actions::pipeline::tests::human_source_context_forged_action_token_rejects' (14934) panicked at crates/tracewake-core/src/actions/pipeline.rs:1685:9:
assertion `left == right` failed
  left: [ProposalSourceContextMismatch]
 right: [ProposalSourceForged]

---- actions::pipeline::tests::human_source_context_fresh_view_passes_source_validation stdout ----

thread 'actions::pipeline::tests::human_source_context_fresh_view_passes_source_validation' (14935) panicked at crates/tracewake-core/src/actions/pipeline.rs:1571:9:
assertion `left == right` failed
  left: Rejected
 right: Accepted

failures:
    actions::defs::continue_routine::tests::human_and_scheduler_continue_share_pipeline_result
    actions::pipeline::tests::human_source_context_forged_action_token_rejects
    actions::pipeline::tests::human_source_context_fresh_view_passes_source_validation
    actions::pipeline::tests::human_source_context_matches_exact_and_dotted_semantic_actions
    actions::pipeline::tests::same_proposal_validates_same_for_human_and_scheduler_origin
    controller::tests::human_after_authorization_matches_scheduler_validation

test result: FAILED. 449 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
