*** crates/tracewake-core/src/actions/pipeline.rs:935:9: replace || with && in source_context_check

*** mutation diff:
--- crates/tracewake-core/src/actions/pipeline.rs
+++ replace || with && in source_context_check
@@ -927,17 +927,17 @@
         context.state,
         context.epistemic_projection,
         actor_id,
         source.context_tick,
         context.content_manifest_id,
         context.current_event_frontier,
     );
     if source.holder_known_context_id != *expected_context.holder_known_context_id()
-        || source.holder_known_context_hash != *expected_context.holder_known_context_hash()
+        && /* ~ changed by cargo-mutants ~ */ source.holder_known_context_hash != *expected_context.holder_known_context_hash()
     {
         return Some(reject(
             context,
             proposal,
             PipelineStage::SourceContextValidation,
             vec![ReasonCode::ProposalSourceContextMismatch],
             checked_facts,
             "That action does not match the actor's current knowledge context.",

---- forged_or_stale_source_context_rejected_by_reason_code stdout ----

thread 'forged_or_stale_source_context_rejected_by_reason_code' (10694) panicked at crates/tracewake-core/tests/anti_regression_guards.rs:5976:5:
assertion `left == right` failed
  left: []
 right: [ProposalSourceContextMismatch]

failures:
    forged_or_stale_source_context_rejected_by_reason_code

test result: FAILED. 79 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.40s

*** result: Failure(101)
