*** crates/tracewake-core/src/actions/pipeline.rs:967:5: replace semantic_action_matches_action -> bool with true

*** mutation diff:
--- crates/tracewake-core/src/actions/pipeline.rs
+++ replace semantic_action_matches_action -> bool with true
@@ -959,23 +959,17 @@
 
     None
 }
 
 fn semantic_action_matches_action(
     semantic_action_id: &crate::ids::SemanticActionId,
     action_id: &crate::ids::ActionId,
 ) -> bool {
-    let semantic = semantic_action_id.as_str();
-    let action = action_id.as_str();
-    if semantic == action || semantic.starts_with(&format!("{action}.")) {
-        return true;
-    }
-    let dotted_action = action.replace('_', ".");
-    semantic == dotted_action || semantic.starts_with(&format!("{dotted_action}."))
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn reject_action(
     context: PipelineReadContext<'_>,
     proposal: &Proposal,
     rejection: ActionRejection,
 ) -> PipelineDecision {
     reject(

---- actions::pipeline::tests::human_source_context_forged_action_token_rejects stdout ----

thread 'actions::pipeline::tests::human_source_context_forged_action_token_rejects' (28612) panicked at crates/tracewake-core/src/actions/pipeline.rs:1674:9:
assertion `left == right` failed
  left: Accepted
 right: Rejected

---- actions::pipeline::tests::semantic_action_match_accepts_exact_and_prefix_forms stdout ----

thread 'actions::pipeline::tests::semantic_action_match_accepts_exact_and_prefix_forms' (28625) panicked at crates/tracewake-core/src/actions/pipeline.rs:1764:9:
assertion failed: !semantic_action_matches_action(&SemanticActionId::new("look.hidden").unwrap(),
        &action_id("inspect_place"))

---- actions::pipeline::tests::human_source_context_matches_exact_and_dotted_semantic_actions stdout ----

thread 'actions::pipeline::tests::human_source_context_matches_exact_and_dotted_semantic_actions' (28614) panicked at crates/tracewake-core/src/actions/pipeline.rs:1739:9:
assertion `left == right` failed
  left: Accepted
 right: Rejected

failures:
    actions::pipeline::tests::human_source_context_forged_action_token_rejects
    actions::pipeline::tests::human_source_context_matches_exact_and_dotted_semantic_actions
    actions::pipeline::tests::semantic_action_match_accepts_exact_and_prefix_forms

test result: FAILED. 452 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
