*** crates/tracewake-core/src/actions/pipeline.rs:967:5: replace semantic_action_matches_action -> bool with false

*** mutation diff:
--- crates/tracewake-core/src/actions/pipeline.rs
+++ replace semantic_action_matches_action -> bool with false
@@ -959,23 +959,17 @@
 
     None
 }
 
 fn semantic_action_matches_action(
     semantic_action_id: &crate::ids::SemanticActionId,
     action_id: &crate::ids::ActionId,
 ) -> bool {
-    let semantic = semantic_action_id.as_str();
-    let action = action_id.as_str();
-    if semantic == action || semantic.starts_with(&format!("{action}.")) {
-        return true;
-    }
-    let dotted_action = action.replace('_', ".");
-    semantic == dotted_action || semantic.starts_with(&format!("{dotted_action}."))
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn reject_action(
     context: PipelineReadContext<'_>,
     proposal: &Proposal,
     rejection: ActionRejection,
 ) -> PipelineDecision {
     reject(

---- actions::defs::continue_routine::tests::human_and_scheduler_continue_share_pipeline_result stdout ----

thread 'actions::defs::continue_routine::tests::human_and_scheduler_continue_share_pipeline_result' (641) panicked at crates/tracewake-core/src/actions/defs/continue_routine.rs:539:9:
assertion `left == right` failed
  left: Rejected
 right: Accepted

---- actions::pipeline::tests::human_source_context_fresh_view_passes_source_validation stdout ----

thread 'actions::pipeline::tests::human_source_context_fresh_view_passes_source_validation' (705) panicked at crates/tracewake-core/src/actions/pipeline.rs:1565:9:
assertion `left == right` failed
  left: Rejected
 right: Accepted

---- actions::pipeline::tests::human_source_context_matches_exact_and_dotted_semantic_actions stdout ----

thread 'actions::pipeline::tests::human_source_context_matches_exact_and_dotted_semantic_actions' (706) panicked at crates/tracewake-core/src/actions/pipeline.rs:1707:9:
assertion `left == right` failed
  left: Rejected
 right: Accepted

failures:
    actions::defs::continue_routine::tests::human_and_scheduler_continue_share_pipeline_result
    actions::pipeline::tests::human_source_context_fresh_view_passes_source_validation
    actions::pipeline::tests::human_source_context_matches_exact_and_dotted_semantic_actions
    actions::pipeline::tests::same_proposal_validates_same_for_human_and_scheduler_origin
    actions::pipeline::tests::semantic_action_match_accepts_exact_and_prefix_forms
    controller::tests::human_after_authorization_matches_scheduler_validation

test result: FAILED. 449 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
