*** crates/tracewake-core/src/actions/pipeline.rs:969:27: replace || with && in semantic_action_matches_action

*** mutation diff:
--- crates/tracewake-core/src/actions/pipeline.rs
+++ replace || with && in semantic_action_matches_action
@@ -961,17 +961,17 @@
 }
 
 fn semantic_action_matches_action(
     semantic_action_id: &crate::ids::SemanticActionId,
     action_id: &crate::ids::ActionId,
 ) -> bool {
     let semantic = semantic_action_id.as_str();
     let action = action_id.as_str();
-    if semantic == action || semantic.starts_with(&format!("{action}.")) {
+    if semantic == action && /* ~ changed by cargo-mutants ~ */ semantic.starts_with(&format!("{action}.")) {
         return true;
     }
     let dotted_action = action.replace('_', ".");
     semantic == dotted_action || semantic.starts_with(&format!("{dotted_action}."))
 }
 
 fn reject_action(
     context: PipelineReadContext<'_>,

---- actions::pipeline::tests::semantic_action_match_accepts_exact_and_prefix_forms stdout ----

thread 'actions::pipeline::tests::semantic_action_match_accepts_exact_and_prefix_forms' (5276) panicked at crates/tracewake-core/src/actions/pipeline.rs:1762:9:
assertion failed: semantic_action_matches_action(&SemanticActionId::new("inspect_place.shop_front").unwrap(),
    &action_id("inspect_place"))

failures:
    actions::pipeline::tests::semantic_action_match_accepts_exact_and_prefix_forms

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
