*** crates/tracewake-core/src/actions/pipeline.rs:973:14: replace == with != in semantic_action_matches_action

*** mutation diff:
--- crates/tracewake-core/src/actions/pipeline.rs
+++ replace == with != in semantic_action_matches_action
@@ -965,17 +965,17 @@
     action_id: &crate::ids::ActionId,
 ) -> bool {
     let semantic = semantic_action_id.as_str();
     let action = action_id.as_str();
     if semantic == action || semantic.starts_with(&format!("{action}.")) {
         return true;
     }
     let dotted_action = action.replace('_', ".");
-    semantic == dotted_action || semantic.starts_with(&format!("{dotted_action}."))
+    semantic != /* ~ changed by cargo-mutants ~ */ dotted_action || semantic.starts_with(&format!("{dotted_action}."))
 }
 
 fn reject_action(
     context: PipelineReadContext<'_>,
     proposal: &Proposal,
     rejection: ActionRejection,
 ) -> PipelineDecision {
     reject(

---- actions::pipeline::tests::human_source_context_forged_action_token_rejects stdout ----

thread 'actions::pipeline::tests::human_source_context_forged_action_token_rejects' (18941) panicked at crates/tracewake-core/src/actions/pipeline.rs:1680:9:
assertion `left == right` failed
  left: Accepted
 right: Rejected

---- actions::pipeline::tests::human_source_context_matches_exact_and_dotted_semantic_actions stdout ----

thread 'actions::pipeline::tests::human_source_context_matches_exact_and_dotted_semantic_actions' (18943) panicked at crates/tracewake-core/src/actions/pipeline.rs:1745:9:
assertion `left == right` failed
  left: Accepted
 right: Rejected

---- actions::pipeline::tests::semantic_action_match_accepts_exact_and_prefix_forms stdout ----

thread 'actions::pipeline::tests::semantic_action_match_accepts_exact_and_prefix_forms' (18954) panicked at crates/tracewake-core/src/actions/pipeline.rs:1770:9:
assertion failed: !semantic_action_matches_action(&SemanticActionId::new("look.hidden").unwrap(),
        &action_id("inspect_place"))

failures:
    actions::pipeline::tests::human_source_context_forged_action_token_rejects
    actions::pipeline::tests::human_source_context_matches_exact_and_dotted_semantic_actions
    actions::pipeline::tests::semantic_action_match_accepts_exact_and_prefix_forms

test result: FAILED. 452 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
