*** crates/tracewake-core/src/actions/pipeline.rs:973:31: replace || with && in semantic_action_matches_action

*** mutation diff:
--- crates/tracewake-core/src/actions/pipeline.rs
+++ replace || with && in semantic_action_matches_action
@@ -965,17 +965,17 @@
     action_id: &crate::ids::ActionId,
 ) -> bool {
     let semantic = semantic_action_id.as_str();
     let action = action_id.as_str();
     if semantic == action || semantic.starts_with(&format!("{action}.")) {
         return true;
     }
     let dotted_action = action.replace('_', ".");
-    semantic == dotted_action || semantic.starts_with(&format!("{dotted_action}."))
+    semantic == dotted_action && /* ~ changed by cargo-mutants ~ */ semantic.starts_with(&format!("{dotted_action}."))
 }
 
 fn reject_action(
     context: PipelineReadContext<'_>,
     proposal: &Proposal,
     rejection: ActionRejection,
 ) -> PipelineDecision {
     reject(

---- actions::defs::continue_routine::tests::human_and_scheduler_continue_share_pipeline_result stdout ----

thread 'actions::defs::continue_routine::tests::human_and_scheduler_continue_share_pipeline_result' (14319) panicked at crates/tracewake-core/src/actions/defs/continue_routine.rs:539:9:
assertion `left == right` failed
  left: Rejected
 right: Accepted

---- actions::pipeline::tests::human_source_context_matches_exact_and_dotted_semantic_actions stdout ----

thread 'actions::pipeline::tests::human_source_context_matches_exact_and_dotted_semantic_actions' (14384) panicked at crates/tracewake-core/src/actions/pipeline.rs:1736:9:
assertion `left == right` failed
  left: Rejected
 right: Accepted

---- actions::pipeline::tests::semantic_action_match_accepts_exact_and_prefix_forms stdout ----

thread 'actions::pipeline::tests::semantic_action_match_accepts_exact_and_prefix_forms' (14395) panicked at crates/tracewake-core/src/actions/pipeline.rs:1766:9:
assertion failed: semantic_action_matches_action(&SemanticActionId::new("inspect.place.shop_front").unwrap(),
    &action_id("inspect_place"))

failures:
    actions::defs::continue_routine::tests::human_and_scheduler_continue_share_pipeline_result
    actions::pipeline::tests::human_source_context_matches_exact_and_dotted_semantic_actions
    actions::pipeline::tests::semantic_action_match_accepts_exact_and_prefix_forms

test result: FAILED. 452 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
