*** crates/tracewake-core/src/actions/proposal.rs:64:9: replace ProposalSource::stable_id -> &'static str with "xyzzy"

*** mutation diff:
--- crates/tracewake-core/src/actions/proposal.rs
+++ replace ProposalSource::stable_id -> &'static str with "xyzzy"
@@ -56,23 +56,17 @@
     Scheduler,
     Agent,
     Test,
     Debug,
 }
 
 impl ProposalSource {
     pub const fn stable_id(&self) -> &'static str {
-        match self {
-            Self::TuiSemanticAction(_) => "tui_semantic_action",
-            Self::Scheduler => "scheduler",
-            Self::Agent => "agent",
-            Self::Test => "test",
-            Self::Debug => "debug",
-        }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     pub const fn tui_context(&self) -> Option<&ProposalSourceContext> {
         match self {
             Self::TuiSemanticAction(context) => Some(context),
             Self::Scheduler | Self::Agent | Self::Test | Self::Debug => None,
         }
     }

---- actions::pipeline::tests::human_source_context_stale_frontier_rejects_before_action_validation stdout ----

thread 'actions::pipeline::tests::human_source_context_stale_frontier_rejects_before_action_validation' (9003) panicked at crates/tracewake-core/src/actions/pipeline.rs:1600:9:
assertion `left == right` failed
  left: Some("xyzzy")
 right: Some("tui_semantic_action")

failures:
    actions::pipeline::tests::human_source_context_stale_frontier_rejects_before_action_validation

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
