*** crates/tracewake-core/src/actions/proposal.rs:74:9: replace ProposalSource::tui_context -> Option<&ProposalSourceContext> with None

*** mutation diff:
--- crates/tracewake-core/src/actions/proposal.rs
+++ replace ProposalSource::tui_context -> Option<&ProposalSourceContext> with None
@@ -66,20 +66,17 @@
             Self::Scheduler => "scheduler",
             Self::Agent => "agent",
             Self::Test => "test",
             Self::Debug => "debug",
         }
     }
 
     pub const fn tui_context(&self) -> Option<&ProposalSourceContext> {
-        match self {
-            Self::TuiSemanticAction(context) => Some(context),
-            Self::Scheduler | Self::Agent | Self::Test | Self::Debug => None,
-        }
+        None /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq)]
 pub struct ProposalSourceContext {
     pub source_view_model_id: ViewModelId,
     pub holder_known_context_id: HolderKnownContextId,
     pub holder_known_context_hash: HolderKnownContextHash,

---- actions::defs::continue_routine::tests::human_and_scheduler_continue_share_pipeline_result stdout ----

thread 'actions::defs::continue_routine::tests::human_and_scheduler_continue_share_pipeline_result' (13494) panicked at crates/tracewake-core/src/actions/defs/continue_routine.rs:539:9:
assertion `left == right` failed
  left: Rejected
 right: Accepted

---- actions::pipeline::tests::human_source_context_cross_actor_rejects stdout ----

thread 'actions::pipeline::tests::human_source_context_cross_actor_rejects' (13556) panicked at crates/tracewake-core/src/actions/pipeline.rs:1656:9:
assertion `left == right` failed
  left: [ProposalSourceMissing]
 right: [ProposalSourceActorMismatch]

---- actions::pipeline::tests::human_source_context_forged_action_token_rejects stdout ----

thread 'actions::pipeline::tests::human_source_context_forged_action_token_rejects' (13557) panicked at crates/tracewake-core/src/actions/pipeline.rs:1685:9:
assertion `left == right` failed
  left: [ProposalSourceMissing]
 right: [ProposalSourceForged]

failures:
    actions::defs::continue_routine::tests::human_and_scheduler_continue_share_pipeline_result
    actions::pipeline::tests::human_source_context_cross_actor_rejects
    actions::pipeline::tests::human_source_context_forged_action_token_rejects
    actions::pipeline::tests::human_source_context_fresh_view_passes_source_validation
    actions::pipeline::tests::human_source_context_matches_exact_and_dotted_semantic_actions
    actions::pipeline::tests::human_source_context_rejects_each_stale_tick_side
    actions::pipeline::tests::human_source_context_stale_frontier_rejects_before_action_validation
    actions::pipeline::tests::same_proposal_validates_same_for_human_and_scheduler_origin
    controller::tests::human_after_authorization_matches_scheduler_validation

test result: FAILED. 446 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
