*** crates/tracewake-core/src/actions/report.rs:121:13: delete match arm "action_id" in CheckedFactKey::from_stable_key

*** mutation diff:
--- crates/tracewake-core/src/actions/report.rs
+++ delete match arm "action_id" in CheckedFactKey::from_stable_key
@@ -113,17 +113,17 @@
     ToPlaceId,
     Unsupported(String),
 }
 
 impl CheckedFactKey {
     pub fn from_stable_key(key: impl Into<String>) -> Self {
         let key = key.into();
         match key.as_str() {
-            "action_id" => Self::ActionId,
+             /* ~ changed by cargo-mutants ~ */
             "actor_id" => Self::ActorId,
             "body_exclusive" => Self::BodyExclusive,
             "container_id" => Self::ContainerId,
             "door_id" => Self::DoorId,
             "duration_ticks" => Self::DurationTicks,
             "from_place_id" => Self::FromPlaceId,
             "item_id" => Self::ItemId,
             "need_kind" => Self::NeedKind,

---- actions::pipeline::tests::human_source_context_stale_frontier_rejects_before_action_validation stdout ----

thread 'actions::pipeline::tests::human_source_context_stale_frontier_rejects_before_action_validation' (27263) panicked at crates/tracewake-core/src/actions/pipeline.rs:1598:9:
assertion failed: has_fact(&report.actor_visible_facts, "action_id")

---- actions::report::tests::checked_fact_key_matrix_survives_validation_report_consumption stdout ----

thread 'actions::report::tests::checked_fact_key_matrix_survives_validation_report_consumption' (27276) panicked at crates/tracewake-core/src/actions/report.rs:383:17:
assertion `left == right` failed: action_id
  left: Unsupported("action_id")
 right: ActionId

---- debug_reports::tests::rejection_report_preserves_failed_stage_and_mutates_nothing stdout ----

thread 'debug_reports::tests::rejection_report_preserves_failed_stage_and_mutates_nothing' (27418) panicked at crates/tracewake-core/src/debug_reports.rs:991:9:
assertion failed: !report.actor_visible_facts.is_empty()

failures:
    actions::pipeline::tests::human_source_context_stale_frontier_rejects_before_action_validation
    actions::report::tests::checked_fact_key_matrix_survives_validation_report_consumption
    debug_reports::tests::rejection_report_preserves_failed_stage_and_mutates_nothing

test result: FAILED. 452 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
