*** crates/tracewake-core/src/actions/report.rs:122:13: delete match arm "actor_id" in CheckedFactKey::from_stable_key

*** mutation diff:
--- crates/tracewake-core/src/actions/report.rs
+++ delete match arm "actor_id" in CheckedFactKey::from_stable_key
@@ -114,17 +114,17 @@
     Unsupported(String),
 }
 
 impl CheckedFactKey {
     pub fn from_stable_key(key: impl Into<String>) -> Self {
         let key = key.into();
         match key.as_str() {
             "action_id" => Self::ActionId,
-            "actor_id" => Self::ActorId,
+             /* ~ changed by cargo-mutants ~ */
             "body_exclusive" => Self::BodyExclusive,
             "container_id" => Self::ContainerId,
             "door_id" => Self::DoorId,
             "duration_ticks" => Self::DurationTicks,
             "from_place_id" => Self::FromPlaceId,
             "item_id" => Self::ItemId,
             "need_kind" => Self::NeedKind,
             "pipeline_slots_9_11" => Self::PipelineSlot,

---- actions::report::tests::checked_fact_key_matrix_survives_validation_report_consumption stdout ----

thread 'actions::report::tests::checked_fact_key_matrix_survives_validation_report_consumption' (31835) panicked at crates/tracewake-core/src/actions/report.rs:383:17:
assertion `left == right` failed: actor_id
  left: Unsupported("actor_id")
 right: ActorId

---- actions::report::tests::checked_fact_preserves_typed_key_and_render_pair stdout ----

thread 'actions::report::tests::checked_fact_preserves_typed_key_and_render_pair' (31836) panicked at crates/tracewake-core/src/actions/report.rs:269:9:
assertion `left == right` failed
  left: Unsupported("actor_id")
 right: ActorId

failures:
    actions::report::tests::checked_fact_key_matrix_survives_validation_report_consumption
    actions::report::tests::checked_fact_preserves_typed_key_and_render_pair

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
