*** crates/tracewake-core/src/actions/report.rs:123:13: delete match arm "body_exclusive" in CheckedFactKey::from_stable_key

*** mutation diff:
--- crates/tracewake-core/src/actions/report.rs
+++ delete match arm "body_exclusive" in CheckedFactKey::from_stable_key
@@ -115,17 +115,17 @@
 }
 
 impl CheckedFactKey {
     pub fn from_stable_key(key: impl Into<String>) -> Self {
         let key = key.into();
         match key.as_str() {
             "action_id" => Self::ActionId,
             "actor_id" => Self::ActorId,
-            "body_exclusive" => Self::BodyExclusive,
+             /* ~ changed by cargo-mutants ~ */
             "container_id" => Self::ContainerId,
             "door_id" => Self::DoorId,
             "duration_ticks" => Self::DurationTicks,
             "from_place_id" => Self::FromPlaceId,
             "item_id" => Self::ItemId,
             "need_kind" => Self::NeedKind,
             "pipeline_slots_9_11" => Self::PipelineSlot,
             "place_id" => Self::PlaceId,

---- actions::report::tests::checked_fact_key_matrix_survives_validation_report_consumption stdout ----

thread 'actions::report::tests::checked_fact_key_matrix_survives_validation_report_consumption' (3926) panicked at crates/tracewake-core/src/actions/report.rs:383:17:
assertion `left == right` failed: body_exclusive
  left: Unsupported("body_exclusive")
 right: BodyExclusive

failures:
    actions::report::tests::checked_fact_key_matrix_survives_validation_report_consumption

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
