*** crates/tracewake-core/src/actions/report.rs:127:13: delete match arm "from_place_id" in CheckedFactKey::from_stable_key

*** mutation diff:
--- crates/tracewake-core/src/actions/report.rs
+++ delete match arm "from_place_id" in CheckedFactKey::from_stable_key
@@ -119,17 +119,17 @@
         let key = key.into();
         match key.as_str() {
             "action_id" => Self::ActionId,
             "actor_id" => Self::ActorId,
             "body_exclusive" => Self::BodyExclusive,
             "container_id" => Self::ContainerId,
             "door_id" => Self::DoorId,
             "duration_ticks" => Self::DurationTicks,
-            "from_place_id" => Self::FromPlaceId,
+             /* ~ changed by cargo-mutants ~ */
             "item_id" => Self::ItemId,
             "need_kind" => Self::NeedKind,
             "pipeline_slots_9_11" => Self::PipelineSlot,
             "place_id" => Self::PlaceId,
             "reason" => Self::Reason,
             "sleep_affordance_id" => Self::SleepAffordanceId,
             "target_id" => Self::TargetId,
             "ticks" => Self::TickCount,

---- actions::report::tests::checked_fact_key_matrix_survives_validation_report_consumption stdout ----

thread 'actions::report::tests::checked_fact_key_matrix_survives_validation_report_consumption' (22163) panicked at crates/tracewake-core/src/actions/report.rs:383:17:
assertion `left == right` failed: from_place_id
  left: Unsupported("from_place_id")
 right: FromPlaceId

failures:
    actions::report::tests::checked_fact_key_matrix_survives_validation_report_consumption

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
