*** crates/tracewake-core/src/actions/report.rs:128:13: delete match arm "item_id" in CheckedFactKey::from_stable_key

*** mutation diff:
--- crates/tracewake-core/src/actions/report.rs
+++ delete match arm "item_id" in CheckedFactKey::from_stable_key
@@ -120,17 +120,17 @@
         match key.as_str() {
             "action_id" => Self::ActionId,
             "actor_id" => Self::ActorId,
             "body_exclusive" => Self::BodyExclusive,
             "container_id" => Self::ContainerId,
             "door_id" => Self::DoorId,
             "duration_ticks" => Self::DurationTicks,
             "from_place_id" => Self::FromPlaceId,
-            "item_id" => Self::ItemId,
+             /* ~ changed by cargo-mutants ~ */
             "need_kind" => Self::NeedKind,
             "pipeline_slots_9_11" => Self::PipelineSlot,
             "place_id" => Self::PlaceId,
             "reason" => Self::Reason,
             "sleep_affordance_id" => Self::SleepAffordanceId,
             "target_id" => Self::TargetId,
             "ticks" => Self::TickCount,
             "to_place_id" => Self::ToPlaceId,

---- actions::report::tests::checked_fact_key_matrix_survives_validation_report_consumption stdout ----

thread 'actions::report::tests::checked_fact_key_matrix_survives_validation_report_consumption' (26722) panicked at crates/tracewake-core/src/actions/report.rs:383:17:
assertion `left == right` failed: item_id
  left: Unsupported("item_id")
 right: ItemId

failures:
    actions::report::tests::checked_fact_key_matrix_survives_validation_report_consumption

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
