*** crates/tracewake-core/src/actions/report.rs:135:13: delete match arm "ticks" in CheckedFactKey::from_stable_key

*** mutation diff:
--- crates/tracewake-core/src/actions/report.rs
+++ delete match arm "ticks" in CheckedFactKey::from_stable_key
@@ -127,17 +127,17 @@
             "from_place_id" => Self::FromPlaceId,
             "item_id" => Self::ItemId,
             "need_kind" => Self::NeedKind,
             "pipeline_slots_9_11" => Self::PipelineSlot,
             "place_id" => Self::PlaceId,
             "reason" => Self::Reason,
             "sleep_affordance_id" => Self::SleepAffordanceId,
             "target_id" => Self::TargetId,
-            "ticks" => Self::TickCount,
+             /* ~ changed by cargo-mutants ~ */
             "to_place_id" => Self::ToPlaceId,
             _ => Self::Unsupported(key),
         }
     }
 
     pub fn stable_key(&self) -> &str {
         match self {
             Self::ActionId => "action_id",

---- actions::report::tests::checked_fact_key_matrix_survives_validation_report_consumption stdout ----

thread 'actions::report::tests::checked_fact_key_matrix_survives_validation_report_consumption' (26168) panicked at crates/tracewake-core/src/actions/report.rs:383:17:
assertion `left == right` failed: ticks
  left: Unsupported("ticks")
 right: TickCount

failures:
    actions::report::tests::checked_fact_key_matrix_survives_validation_report_consumption

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
