*** crates/tracewake-core/src/actions/report.rs:142:9: replace CheckedFactKey::stable_key -> &str with ""

*** mutation diff:
--- crates/tracewake-core/src/actions/report.rs
+++ replace CheckedFactKey::stable_key -> &str with ""
@@ -134,35 +134,17 @@
             "target_id" => Self::TargetId,
             "ticks" => Self::TickCount,
             "to_place_id" => Self::ToPlaceId,
             _ => Self::Unsupported(key),
         }
     }
 
     pub fn stable_key(&self) -> &str {
-        match self {
-            Self::ActionId => "action_id",
-            Self::ActorId => "actor_id",
-            Self::BodyExclusive => "body_exclusive",
-            Self::ContainerId => "container_id",
-            Self::DoorId => "door_id",
-            Self::DurationTicks => "duration_ticks",
-            Self::FromPlaceId => "from_place_id",
-            Self::ItemId => "item_id",
-            Self::NeedKind => "need_kind",
-            Self::PipelineSlot => "pipeline_slots_9_11",
-            Self::PlaceId => "place_id",
-            Self::Reason => "reason",
-            Self::SleepAffordanceId => "sleep_affordance_id",
-            Self::TargetId => "target_id",
-            Self::TickCount => "ticks",
-            Self::ToPlaceId => "to_place_id",
-            Self::Unsupported(key) => key.as_str(),
-        }
+        "" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Copy, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
 pub enum CheckedFactSource {
     Validation,
 }

---- actions::pipeline::tests::human_source_context_forged_action_token_rejects stdout ----

thread 'actions::pipeline::tests::human_source_context_forged_action_token_rejects' (2800) panicked at crates/tracewake-core/src/actions/pipeline.rs:1687:9:
assertion failed: has_fact(&report.debug_only_facts, "source_kind")

---- actions::pipeline::tests::human_source_context_stale_frontier_rejects_before_action_validation stdout ----

thread 'actions::pipeline::tests::human_source_context_stale_frontier_rejects_before_action_validation' (2805) panicked at crates/tracewake-core/src/actions/pipeline.rs:1598:9:
assertion failed: has_fact(&report.actor_visible_facts, "action_id")

---- actions::pipeline::tests::query_only_look_keeps_knowledge_slot_inert stdout ----

thread 'actions::pipeline::tests::query_only_look_keeps_knowledge_slot_inert' (2809) panicked at crates/tracewake-core/src/actions/pipeline.rs:1798:9:
assertion `left == right` failed
  left: None
 right: Some("inert")

failures:
    actions::pipeline::tests::human_source_context_forged_action_token_rejects
    actions::pipeline::tests::human_source_context_stale_frontier_rejects_before_action_validation
    actions::pipeline::tests::query_only_look_keeps_knowledge_slot_inert
    actions::report::tests::checked_fact_key_matrix_survives_validation_report_consumption
    actions::report::tests::checked_fact_preserves_typed_key_and_render_pair

test result: FAILED. 450 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
