*** crates/tracewake-core/src/actions/report.rs:171:9: replace CheckedFactSource::stable_id -> &'static str with "xyzzy"

*** mutation diff:
--- crates/tracewake-core/src/actions/report.rs
+++ replace CheckedFactSource::stable_id -> &'static str with "xyzzy"
@@ -163,19 +163,17 @@
 
 #[derive(Clone, Copy, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
 pub enum CheckedFactSource {
     Validation,
 }
 
 impl CheckedFactSource {
     pub const fn stable_id(self) -> &'static str {
-        match self {
-            Self::Validation => "validation",
-        }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
 pub struct CheckedFact {
     key: CheckedFactKey,
     value: String,
     source: CheckedFactSource,

---- actions::report::tests::checked_fact_preserves_typed_key_and_render_pair stdout ----

thread 'actions::report::tests::checked_fact_preserves_typed_key_and_render_pair' (16497) panicked at crates/tracewake-core/src/actions/report.rs:270:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "validation"

failures:
    actions::report::tests::checked_fact_preserves_typed_key_and_render_pair

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
