*** crates/tracewake-core/src/actions/report.rs:198:9: replace CheckedFact::stable_key -> &str with ""

*** mutation diff:
--- crates/tracewake-core/src/actions/report.rs
+++ replace CheckedFact::stable_key -> &str with ""
@@ -190,17 +190,17 @@
         }
     }
 
     pub const fn key(&self) -> &CheckedFactKey {
         &self.key
     }
 
     pub fn stable_key(&self) -> &str {
-        self.key.stable_key()
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn value(&self) -> &str {
         &self.value
     }
 
     pub const fn source(&self) -> CheckedFactSource {
         self.source

---- actions::pipeline::tests::human_source_context_stale_frontier_rejects_before_action_validation stdout ----

thread 'actions::pipeline::tests::human_source_context_stale_frontier_rejects_before_action_validation' (21054) panicked at crates/tracewake-core/src/actions/pipeline.rs:1598:9:
assertion failed: has_fact(&report.actor_visible_facts, "action_id")

---- actions::pipeline::tests::human_source_context_forged_action_token_rejects stdout ----

thread 'actions::pipeline::tests::human_source_context_forged_action_token_rejects' (21049) panicked at crates/tracewake-core/src/actions/pipeline.rs:1687:9:
assertion failed: has_fact(&report.debug_only_facts, "source_kind")

---- actions::pipeline::tests::query_only_look_keeps_knowledge_slot_inert stdout ----

thread 'actions::pipeline::tests::query_only_look_keeps_knowledge_slot_inert' (21058) panicked at crates/tracewake-core/src/actions/pipeline.rs:1798:9:
assertion `left == right` failed
  left: None
 right: Some("inert")

failures:
    actions::pipeline::tests::human_source_context_forged_action_token_rejects
    actions::pipeline::tests::human_source_context_stale_frontier_rejects_before_action_validation
    actions::pipeline::tests::query_only_look_keeps_knowledge_slot_inert
    actions::report::tests::checked_fact_key_matrix_survives_validation_report_consumption
    actions::report::tests::checked_fact_preserves_typed_key_and_render_pair

test result: FAILED. 450 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
