*** crates/tracewake-core/src/actions/report.rs:210:9: replace CheckedFact::render_pair -> String with String::new()

*** mutation diff:
--- crates/tracewake-core/src/actions/report.rs
+++ replace CheckedFact::render_pair -> String with String::new()
@@ -202,17 +202,17 @@
         &self.value
     }
 
     pub const fn source(&self) -> CheckedFactSource {
         self.source
     }
 
     pub fn render_pair(&self) -> String {
-        format!("{}={}", self.stable_key(), self.value)
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq)]
 pub struct ValidationReport {
     pub validation_report_id: ValidationReportId,
     pub proposal_id: ProposalId,
     pub actor_id: Option<ActorId>,

---- actions::report::tests::checked_fact_preserves_typed_key_and_render_pair stdout ----

thread 'actions::report::tests::checked_fact_preserves_typed_key_and_render_pair' (6849) panicked at crates/tracewake-core/src/actions/report.rs:273:9:
assertion `left == right` failed
  left: ""
 right: "actor_id=actor_tomas"

---- actions::report::tests::checked_fact_key_matrix_survives_validation_report_consumption stdout ----

thread 'actions::report::tests::checked_fact_key_matrix_survives_validation_report_consumption' (6848) panicked at crates/tracewake-core/src/actions/report.rs:385:17:
assertion `left == right` failed
  left: ""
 right: "action_id=value_for_action_id"

failures:
    actions::report::tests::checked_fact_key_matrix_survives_validation_report_consumption
    actions::report::tests::checked_fact_preserves_typed_key_and_render_pair

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
