*** crates/tracewake-core/src/actions/report.rs:53:9: replace ReasonCode::stable_id -> &'static str with "xyzzy"

*** mutation diff:
--- crates/tracewake-core/src/actions/report.rs
+++ replace ReasonCode::stable_id -> &'static str with "xyzzy"
@@ -45,56 +45,17 @@
     RoutineStepBlocked,
     ReservationConflict,
     NoSleepAffordance,
     HiddenTruthInput,
 }
 
 impl ReasonCode {
     pub const fn stable_id(self) -> &'static str {
-        match self {
-            ReasonCode::UnknownActionId => "unknown_action_id",
-            ReasonCode::PhaseUnsupportedAction => "phase_unsupported_action",
-            ReasonCode::ControllerUnbound => "controller_unbound",
-            ReasonCode::ControllerActorMismatch => "controller_actor_mismatch",
-            ReasonCode::ActorNotFound => "actor_not_found",
-            ReasonCode::TargetNotFound => "target_not_found",
-            ReasonCode::UnsupportedTargetKind => "unsupported_target_kind",
-            ReasonCode::ActorNotAtRequiredPlace => "actor_not_at_required_place",
-            ReasonCode::NotAdjacent => "not_adjacent",
-            ReasonCode::DoorClosedBlocksMovement => "door_closed_blocks_movement",
-            ReasonCode::DoorLocked => "door_locked",
-            ReasonCode::ContainerClosed => "container_closed",
-            ReasonCode::ContainerLocked => "container_locked",
-            ReasonCode::TargetNotVisible => "target_not_visible",
-            ReasonCode::TargetNotReachable => "target_not_reachable",
-            ReasonCode::ItemNotPortable => "item_not_portable",
-            ReasonCode::ItemNotAtSource => "item_not_at_source",
-            ReasonCode::ItemNotCarried => "item_not_carried",
-            ReasonCode::CarryCapacityExceeded => "carry_capacity_exceeded",
-            ReasonCode::DestinationNotOpen => "destination_not_open",
-            ReasonCode::AlreadyOpen => "already_open",
-            ReasonCode::AlreadyClosed => "already_closed",
-            ReasonCode::InvalidParameter => "invalid_parameter",
-            ReasonCode::WorldStateMismatch => "world_state_mismatch",
-            ReasonCode::TargetReserved => "target_reserved",
-            ReasonCode::KnowledgePreconditionNotMet => "knowledge_precondition_not_met",
-            ReasonCode::ProposalSourceMissing => "proposal_source_missing",
-            ReasonCode::ProposalSourceActorMismatch => "proposal_source_actor_mismatch",
-            ReasonCode::ProposalSourceContextMismatch => "proposal_source_context_mismatch",
-            ReasonCode::ProposalSourceStale => "proposal_source_stale",
-            ReasonCode::ProposalSourceForged => "proposal_source_forged",
-            ReasonCode::MissingWaitReason => "missing_wait_reason",
-            ReasonCode::NoCurrentIntention => "no_current_intention",
-            ReasonCode::IntentionTerminal => "intention_terminal",
-            ReasonCode::RoutineStepBlocked => "routine_step_blocked",
-            ReasonCode::ReservationConflict => "reservation_conflict",
-            ReasonCode::NoSleepAffordance => "no_sleep_affordance",
-            ReasonCode::HiddenTruthInput => "hidden_truth_input",
-        }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
 pub enum CheckedFactKey {
     ActionId,
     ActorId,
     BodyExclusive,

---- actions::pipeline::tests::agent_source_context_rejects_failed_hidden_truth_audit stdout ----

thread 'actions::pipeline::tests::agent_source_context_rejects_failed_hidden_truth_audit' (22682) panicked at crates/tracewake-core/src/actions/pipeline.rs:2059:9:
assertion failed: result.appended_events.iter().any(|event|
        {
            event.event_type == EventKind::ActionRejected &&
                payload_value(event, "reason_code") ==
                    Some("hidden_truth_input")
        })

---- actions::report::tests::reason_code_stable_ids_match_spec stdout ----

thread 'actions::report::tests::reason_code_stable_ids_match_spec' (22707) panicked at crates/tracewake-core/src/actions/report.rs:202:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "unknown_action_id"

---- view_models::tests::availability_and_why_not_snapshots_preserve_typed_debug_values stdout ----

thread 'view_models::tests::availability_and_why_not_snapshots_preserve_typed_debug_values' (23060) panicked at crates/tracewake-core/src/view_models.rs:1013:9:
assertion `left == right` failed

failures:
    actions::pipeline::tests::agent_source_context_rejects_failed_hidden_truth_audit
    actions::report::tests::reason_code_stable_ids_match_spec
    view_models::tests::availability_and_why_not_snapshots_preserve_typed_debug_values
    view_models::tests::why_not_view_distinguishes_actor_known_from_ground_truth_failures

test result: FAILED. 451 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
