*** crates/tracewake-core/src/agent/actor_known.rs:188:9: replace ActorKnownFact::stable_id -> &str with ""

*** mutation diff:
--- crates/tracewake-core/src/agent/actor_known.rs
+++ replace ActorKnownFact::stable_id -> &str with ""
@@ -180,17 +180,17 @@
             tick,
             actor_id,
             provenance,
             source_event_ids,
         }
     }
 
     pub fn stable_id(&self) -> &str {
-        &self.stable_id
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn semantic_kind(&self) -> &str {
         &self.semantic_kind
     }
 
     pub fn value(&self) -> &str {
         &self.value

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (19924) panicked at crates/tracewake-content/tests/fixtures_load.rs:1217:5:
assertion failed: report.ordinary_pipeline_events > 0

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
