*** crates/tracewake-core/src/agent/actor_known.rs:192:9: replace ActorKnownFact::semantic_kind -> &str with ""

*** mutation diff:
--- crates/tracewake-core/src/agent/actor_known.rs
+++ replace ActorKnownFact::semantic_kind -> &str with ""
@@ -184,17 +184,17 @@
         }
     }
 
     pub fn stable_id(&self) -> &str {
         &self.stable_id
     }
 
     pub fn semantic_kind(&self) -> &str {
-        &self.semantic_kind
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn value(&self) -> &str {
         &self.value
     }
 
     pub fn tick(&self) -> Option<SimTick> {
         self.tick

---- aged_food_record_surfaces_as_remembered_belief stdout ----

thread 'aged_food_record_surfaces_as_remembered_belief' (28017) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2658:5:
assertion `left == right` failed
  left: ""
 right: "remembered_belief"

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (28028) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (28029) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2714:5:
assertion failed: has_event(&log, EventKind::ActorMoved)

failures:
    aged_food_record_surfaces_as_remembered_belief
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.53s

*** result: Failure(101)
