*** crates/tracewake-core/src/agent/actor_known.rs:196:9: replace ActorKnownFact::value -> &str with ""

*** mutation diff:
--- crates/tracewake-core/src/agent/actor_known.rs
+++ replace ActorKnownFact::value -> &str with ""
@@ -188,17 +188,17 @@
         &self.stable_id
     }
 
     pub fn semantic_kind(&self) -> &str {
         &self.semantic_kind
     }
 
     pub fn value(&self) -> &str {
-        &self.value
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn tick(&self) -> Option<SimTick> {
         self.tick
     }
 
     pub fn actor_id(&self) -> &ActorId {
         &self.actor_id

---- aged_food_record_surfaces_as_remembered_belief stdout ----

thread 'aged_food_record_surfaces_as_remembered_belief' (3747) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2648:5:
assertion failed: surface.context().known_food_sources().contains("food_stew_home_tomas")

---- partial_food_source_knowledge_seeds_only_authored_actor_edge stdout ----

thread 'partial_food_source_knowledge_seeds_only_authored_actor_edge' (3766) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2073:5:
assertion failed: mara_known.known_food_sources().contains("food_shared_pantry")

---- episode_tamper_proration_poisons_replay stdout ----

thread 'episode_tamper_proration_poisons_replay' (3751) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2851:5:
assertion failed: has_event(&log, EventKind::SleepInterrupted)

failures:
    aged_food_record_surfaces_as_remembered_belief
    episode_tamper_proration_poisons_replay
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    partial_food_source_knowledge_seeds_only_authored_actor_edge
    planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit
    severe_safety_with_known_exit_produces_move_and_replays
    sleep_spanning_window_boundary_charges_each_tick_once

test result: FAILED. 34 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.50s

*** result: Failure(101)
