*** crates/tracewake-core/src/agent/actor_known.rs:200:9: replace ActorKnownFact::tick -> Option<SimTick> with None

*** mutation diff:
--- crates/tracewake-core/src/agent/actor_known.rs
+++ replace ActorKnownFact::tick -> Option<SimTick> with None
@@ -192,17 +192,17 @@
         &self.semantic_kind
     }
 
     pub fn value(&self) -> &str {
         &self.value
     }
 
     pub fn tick(&self) -> Option<SimTick> {
-        self.tick
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn actor_id(&self) -> &ActorId {
         &self.actor_id
     }
 
     pub fn is_actor_known(&self) -> bool {
         self.provenance.actor_known()

---- aged_food_record_surfaces_as_remembered_belief stdout ----

thread 'aged_food_record_surfaces_as_remembered_belief' (11946) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2659:5:
assertion `left == right` failed
  left: None
 right: Some(SimTick(4))

failures:
    aged_food_record_surfaces_as_remembered_belief

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.64s

*** result: Failure(101)
