*** crates/tracewake-core/src/agent/actor_known.rs:200:9: replace ActorKnownFact::tick -> Option<SimTick> with Some(Default::default())

*** mutation diff:
--- crates/tracewake-core/src/agent/actor_known.rs
+++ replace ActorKnownFact::tick -> Option<SimTick> with Some(Default::default())
@@ -192,17 +192,17 @@
         &self.semantic_kind
     }
 
     pub fn value(&self) -> &str {
         &self.value
     }
 
     pub fn tick(&self) -> Option<SimTick> {
-        self.tick
+        Some(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn actor_id(&self) -> &ActorId {
         &self.actor_id
     }
 
     pub fn is_actor_known(&self) -> bool {
         self.provenance.actor_known()

---- aged_food_record_surfaces_as_remembered_belief stdout ----

thread 'aged_food_record_surfaces_as_remembered_belief' (16045) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2659:5:
assertion `left == right` failed
  left: Some(SimTick(0))
 right: Some(SimTick(4))

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (16056) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (16057) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2714:5:
assertion failed: has_event(&log, EventKind::ActorMoved)

failures:
    aged_food_record_surfaces_as_remembered_belief
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
