*** crates/tracewake-core/src/agent/actor_known.rs:208:9: replace ActorKnownFact::is_actor_known -> bool with true

*** mutation diff:
--- crates/tracewake-core/src/agent/actor_known.rs
+++ replace ActorKnownFact::is_actor_known -> bool with true
@@ -200,17 +200,17 @@
         self.tick
     }
 
     pub fn actor_id(&self) -> &ActorId {
         &self.actor_id
     }
 
     pub fn is_actor_known(&self) -> bool {
-        self.provenance.actor_known()
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn proof_note(&self) -> String {
         format!("{}={}", self.stable_id, self.provenance.note())
     }
 
     pub fn provenance(&self) -> &ActorKnownProvenance {
         &self.provenance

---- planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit stdout ----

thread 'planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit' (20180) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1633:5:
assertion failed: !no_source_plan.trace.hidden_truth_audit_result.actor_known_only

failures:
    planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.61s

*** result: Failure(101)
