*** crates/tracewake-core/src/agent/actor_known.rs:208:9: replace ActorKnownFact::is_actor_known -> bool with false

*** mutation diff:
--- crates/tracewake-core/src/agent/actor_known.rs
+++ replace ActorKnownFact::is_actor_known -> bool with false
@@ -200,17 +200,17 @@
         self.tick
     }
 
     pub fn actor_id(&self) -> &ActorId {
         &self.actor_id
     }
 
     pub fn is_actor_known(&self) -> bool {
-        self.provenance.actor_known()
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn proof_note(&self) -> String {
         format!("{}={}", self.stable_id, self.provenance.note())
     }
 
     pub fn provenance(&self) -> &ActorKnownProvenance {
         &self.provenance

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (24224) panicked at crates/tracewake-content/tests/fixtures_load.rs:1217:5:
assertion failed: report.ordinary_pipeline_events > 0

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
