*** crates/tracewake-core/src/agent/actor_known.rs:212:9: replace ActorKnownFact::proof_note -> String with String::new()

*** mutation diff:
--- crates/tracewake-core/src/agent/actor_known.rs
+++ replace ActorKnownFact::proof_note -> String with String::new()
@@ -204,17 +204,17 @@
         &self.actor_id
     }
 
     pub fn is_actor_known(&self) -> bool {
         self.provenance.actor_known()
     }
 
     pub fn proof_note(&self) -> String {
-        format!("{}={}", self.stable_id, self.provenance.note())
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn provenance(&self) -> &ActorKnownProvenance {
         &self.provenance
     }
 
     pub fn source_event_ids(&self) -> &[EventId] {
         self.source_event_ids.as_slice()

---- aged_food_record_surfaces_as_remembered_belief stdout ----

thread 'aged_food_record_surfaces_as_remembered_belief' (28286) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2660:5:
assertion failed: food_fact.proof_note().contains("remembered_belief:evented_perception:visible_food_supply")

---- no_hidden_truth_fixture_keeps_hidden_food_out_of_planner_inputs stdout ----

thread 'no_hidden_truth_fixture_keeps_hidden_food_out_of_planner_inputs' (28296) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1928:5:
assertion failed: actor_known_state.proof_sources().iter().any(|source|
        source ==
            "agent_needs_present=remembered_belief:agent_state:needs_present")

---- planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit stdout ----

thread 'planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit' (28310) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1639:5:
assertion failed: no_source_plan.trace.hidden_truth_audit_result.notes.contains("unproven:planner_trace_001 negative assertion")

failures:
    aged_food_record_surfaces_as_remembered_belief
    no_hidden_truth_fixture_keeps_hidden_food_out_of_planner_inputs
    planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.47s

*** result: Failure(101)
