*** crates/tracewake-core/src/agent/actor_known.rs:220:9: replace ActorKnownFact::source_event_ids -> &[EventId] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/tracewake-core/src/agent/actor_known.rs
+++ replace ActorKnownFact::source_event_ids -> &[EventId] with Vec::leak(Vec::new())
@@ -212,17 +212,17 @@
         format!("{}={}", self.stable_id, self.provenance.note())
     }
 
     pub fn provenance(&self) -> &ActorKnownProvenance {
         &self.provenance
     }
 
     pub fn source_event_ids(&self) -> &[EventId] {
-        self.source_event_ids.as_slice()
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq)]
 pub enum ActorKnownProvenance {
     ObservedNow { source: String },
     RememberedBelief { source: String },
     RoutineAssignment { source: String },

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (3997) panicked at crates/tracewake-content/tests/fixtures_load.rs:1217:5:
assertion failed: report.ordinary_pipeline_events > 0

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
