*** crates/tracewake-core/src/agent/actor_known.rs:237:9: replace ActorKnownProvenance::actor_known -> bool with true

*** mutation diff:
--- crates/tracewake-core/src/agent/actor_known.rs
+++ replace ActorKnownProvenance::actor_known -> bool with true
@@ -229,23 +229,17 @@
     FixturePossibility { source: String },
     PipelineValidationTruth(RestrictedProvenance),
     DebugOmniscience(RestrictedProvenance),
     UnprovenPhysicalTruth { note: String },
 }
 
 impl ActorKnownProvenance {
     fn actor_known(&self) -> bool {
-        matches!(
-            self,
-            Self::ObservedNow { .. }
-                | Self::RememberedBelief { .. }
-                | Self::RoutineAssignment { .. }
-                | Self::FixturePossibility { .. }
-        )
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     fn note(&self) -> String {
         match self {
             Self::ObservedNow { source } => format!("observed_now:{source}"),
             Self::RememberedBelief { source } => format!("remembered_belief:{source}"),
             Self::RoutineAssignment { source } => format!("routine_assignment:{source}"),
             Self::FixturePossibility { source } => format!("fixture_possibility:{source}"),

---- planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit stdout ----

thread 'planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit' (8096) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1633:5:
assertion failed: !no_source_plan.trace.hidden_truth_audit_result.actor_known_only

failures:
    planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.60s

*** result: Failure(101)
