*** crates/tracewake-core/src/agent/actor_known.rs:237:9: replace ActorKnownProvenance::actor_known -> bool with false

*** mutation diff:
--- crates/tracewake-core/src/agent/actor_known.rs
+++ replace ActorKnownProvenance::actor_known -> bool with false
@@ -229,23 +229,17 @@
     FixturePossibility { source: String },
     PipelineValidationTruth(RestrictedProvenance),
     DebugOmniscience(RestrictedProvenance),
     UnprovenPhysicalTruth { note: String },
 }
 
 impl ActorKnownProvenance {
     fn actor_known(&self) -> bool {
-        matches!(
-            self,
-            Self::ObservedNow { .. }
-                | Self::RememberedBelief { .. }
-                | Self::RoutineAssignment { .. }
-                | Self::FixturePossibility { .. }
-        )
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     fn note(&self) -> String {
         match self {
             Self::ObservedNow { source } => format!("observed_now:{source}"),
             Self::RememberedBelief { source } => format!("remembered_belief:{source}"),
             Self::RoutineAssignment { source } => format!("routine_assignment:{source}"),
             Self::FixturePossibility { source } => format!("fixture_possibility:{source}"),

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (12140) panicked at crates/tracewake-content/tests/fixtures_load.rs:1217:5:
assertion failed: report.ordinary_pipeline_events > 0

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
