*** crates/tracewake-core/src/agent/actor_known.rs:247:9: replace ActorKnownProvenance::note -> String with String::new()

*** mutation diff:
--- crates/tracewake-core/src/agent/actor_known.rs
+++ replace ActorKnownProvenance::note -> String with String::new()
@@ -239,27 +239,17 @@
             Self::ObservedNow { .. }
                 | Self::RememberedBelief { .. }
                 | Self::RoutineAssignment { .. }
                 | Self::FixturePossibility { .. }
         )
     }
 
     fn note(&self) -> String {
-        match self {
-            Self::ObservedNow { source } => format!("observed_now:{source}"),
-            Self::RememberedBelief { source } => format!("remembered_belief:{source}"),
-            Self::RoutineAssignment { source } => format!("routine_assignment:{source}"),
-            Self::FixturePossibility { source } => format!("fixture_possibility:{source}"),
-            Self::PipelineValidationTruth(source) => {
-                format!("pipeline_validation_truth:{}", source.note)
-            }
-            Self::DebugOmniscience(source) => format!("debug_omniscience:{}", source.note),
-            Self::UnprovenPhysicalTruth { note } => format!("unproven:{note}"),
-        }
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq)]
 pub struct RestrictedProvenance {
     note: String,
 }

---- aged_food_record_surfaces_as_remembered_belief stdout ----

thread 'aged_food_record_surfaces_as_remembered_belief' (16202) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2660:5:
assertion failed: food_fact.proof_note().contains("remembered_belief:evented_perception:visible_food_supply")

---- no_hidden_truth_fixture_keeps_hidden_food_out_of_planner_inputs stdout ----

thread 'no_hidden_truth_fixture_keeps_hidden_food_out_of_planner_inputs' (16212) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1928:5:
assertion failed: actor_known_state.proof_sources().iter().any(|source|
        source ==
            "agent_needs_present=remembered_belief:agent_state:needs_present")

---- planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit stdout ----

thread 'planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit' (16226) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1639:5:
assertion failed: no_source_plan.trace.hidden_truth_audit_result.notes.contains("unproven:planner_trace_001 negative assertion")

failures:
    aged_food_record_surfaces_as_remembered_belief
    no_hidden_truth_fixture_keeps_hidden_food_out_of_planner_inputs
    planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.51s

*** result: Failure(101)
