*** crates/tracewake-core/src/agent/actor_known.rs:30:9: replace SourceEventIds::as_slice -> &[EventId] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/tracewake-core/src/agent/actor_known.rs
+++ replace SourceEventIds::as_slice -> &[EventId] with Vec::leak(Vec::new())
@@ -22,17 +22,17 @@
         if ids.is_empty() {
             Err(SourceEventIdsError::Empty)
         } else {
             Ok(Self { ids })
         }
     }
 
     pub fn as_slice(&self) -> &[EventId] {
-        &self.ids
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Copy, Debug, PartialEq, Eq)]
 pub enum SourceEventIdsError {
     Empty,
 }

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (15821) panicked at crates/tracewake-content/tests/fixtures_load.rs:1217:5:
assertion failed: report.ordinary_pipeline_events > 0

---- stale_workplace_notice_superseded_by_newer_001 stdout ----

thread 'stale_workplace_notice_superseded_by_newer_001' (15823) panicked at crates/tracewake-content/tests/fixtures_load.rs:1161:5:
assertion `left == right` failed
  left: []
 right: [EventId(StableId("event_role_notice_newer_open_workplace_tomas"))]

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food
    stale_workplace_notice_superseded_by_newer_001

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
