*** crates/tracewake-core/src/agent/actor_known.rs:346:9: replace ActorKnownPlanningContext::known_edges -> &BTreeMap<PlaceId, BTreeSet<PlaceId>> with Box::leak(Box::new(BTreeMap::new()))

*** mutation diff:
--- crates/tracewake-core/src/agent/actor_known.rs
+++ replace ActorKnownPlanningContext::known_edges -> &BTreeMap<PlaceId, BTreeSet<PlaceId>> with Box::leak(Box::new(BTreeMap::new()))
@@ -338,17 +338,17 @@
         &self.actor_id
     }
 
     pub fn current_place_id(&self) -> &PlaceId {
         &self.current_place_id
     }
 
     pub fn known_edges(&self) -> &BTreeMap<PlaceId, BTreeSet<PlaceId>> {
-        &self.known_edges
+        Box::leak(Box::new(BTreeMap::new())) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn known_closed_doors(&self) -> &BTreeMap<(PlaceId, PlaceId), String> {
         &self.known_closed_doors
     }
 
     pub fn known_containers_by_place(&self) -> &BTreeMap<PlaceId, BTreeSet<ContainerId>> {
         &self.known_containers_by_place

---- severe_safety_with_known_exit_produces_move_and_replays stdout ----

thread 'severe_safety_with_known_exit_produces_move_and_replays' (24471) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1715:10:
severe safety should commit a move

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (24447) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (24448) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2714:5:
assertion failed: has_event(&log, EventKind::ActorMoved)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    severe_safety_with_known_exit_produces_move_and_replays

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.39s

*** result: Failure(101)
