*** crates/tracewake-core/src/agent/actor_known.rs:350:9: replace ActorKnownPlanningContext::known_closed_doors -> &BTreeMap<(PlaceId, PlaceId), String> with Box::leak(Box::new(BTreeMap::new()))

*** mutation diff:
--- crates/tracewake-core/src/agent/actor_known.rs
+++ replace ActorKnownPlanningContext::known_closed_doors -> &BTreeMap<(PlaceId, PlaceId), String> with Box::leak(Box::new(BTreeMap::new()))
@@ -342,17 +342,17 @@
         &self.current_place_id
     }
 
     pub fn known_edges(&self) -> &BTreeMap<PlaceId, BTreeSet<PlaceId>> {
         &self.known_edges
     }
 
     pub fn known_closed_doors(&self) -> &BTreeMap<(PlaceId, PlaceId), String> {
-        &self.known_closed_doors
+        Box::leak(Box::new(BTreeMap::new())) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn known_containers_by_place(&self) -> &BTreeMap<PlaceId, BTreeSet<ContainerId>> {
         &self.known_containers_by_place
     }
 
     pub fn known_food_sources(&self) -> &BTreeSet<String> {
         &self.known_food_sources

---- agent::planner::tests::planner_sequences_open_then_move_to_known_place stdout ----

thread 'agent::planner::tests::planner_sequences_open_then_move_to_known_place' (28784) panicked at crates/tracewake-core/src/agent/planner.rs:511:9:
assertion `left == right` failed
  left: ["move", "move"]
 right: ["open", "move", "move"]

failures:
    agent::planner::tests::planner_sequences_open_then_move_to_known_place

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
