*** crates/tracewake-core/src/agent/actor_known.rs:354:9: replace ActorKnownPlanningContext::known_containers_by_place -> &BTreeMap<PlaceId, BTreeSet<ContainerId>> with Box::leak(Box::new(BTreeMap::new()))

*** mutation diff:
--- crates/tracewake-core/src/agent/actor_known.rs
+++ replace ActorKnownPlanningContext::known_containers_by_place -> &BTreeMap<PlaceId, BTreeSet<ContainerId>> with Box::leak(Box::new(BTreeMap::new()))
@@ -346,17 +346,17 @@
         &self.known_edges
     }
 
     pub fn known_closed_doors(&self) -> &BTreeMap<(PlaceId, PlaceId), String> {
         &self.known_closed_doors
     }
 
     pub fn known_containers_by_place(&self) -> &BTreeMap<PlaceId, BTreeSet<ContainerId>> {
-        &self.known_containers_by_place
+        Box::leak(Box::new(BTreeMap::new())) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn known_food_sources(&self) -> &BTreeSet<String> {
         &self.known_food_sources
     }
 
     pub fn known_sleep_places(&self) -> &BTreeSet<PlaceId> {
         &self.known_sleep_places

---- agent::actor_known::tests::structured_actor_known_fields_are_derived_from_facts stdout ----

thread 'agent::actor_known::tests::structured_actor_known_fields_are_derived_from_facts' (817) panicked at crates/tracewake-core/src/agent/actor_known.rs:669:9:
assertion failed: context.known_containers_by_place().get(&place_id("home")).is_some_and(|containers|
        containers.contains(&ContainerId::new("pantry").unwrap()))

failures:
    agent::actor_known::tests::structured_actor_known_fields_are_derived_from_facts

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
