*** crates/tracewake-core/src/agent/actor_known.rs:358:9: replace ActorKnownPlanningContext::known_food_sources -> &BTreeSet<String> with Box::leak(Box::new(BTreeSet::new()))

*** mutation diff:
--- crates/tracewake-core/src/agent/actor_known.rs
+++ replace ActorKnownPlanningContext::known_food_sources -> &BTreeSet<String> with Box::leak(Box::new(BTreeSet::new()))
@@ -350,17 +350,17 @@
         &self.known_closed_doors
     }
 
     pub fn known_containers_by_place(&self) -> &BTreeMap<PlaceId, BTreeSet<ContainerId>> {
         &self.known_containers_by_place
     }
 
     pub fn known_food_sources(&self) -> &BTreeSet<String> {
-        &self.known_food_sources
+        Box::leak(Box::new(BTreeSet::new())) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn known_sleep_places(&self) -> &BTreeSet<PlaceId> {
         &self.known_sleep_places
     }
 
     pub fn known_workplaces(&self) -> &BTreeMap<WorkplaceId, PlaceId> {
         &self.known_workplaces

---- aged_food_record_surfaces_as_remembered_belief stdout ----

thread 'aged_food_record_surfaces_as_remembered_belief' (5257) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2648:5:
assertion failed: surface.context().known_food_sources().contains("food_stew_home_tomas")

---- partial_food_source_knowledge_seeds_only_authored_actor_edge stdout ----

thread 'partial_food_source_knowledge_seeds_only_authored_actor_edge' (5276) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2073:5:
assertion failed: mara_known.known_food_sources().contains("food_shared_pantry")

---- planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit stdout ----

thread 'planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit' (5281) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1603:6:
called `Result::unwrap()` on an `Err` value: NoApplicableMethod { family: EatMeal, reason: "no actor-known method inputs for eat_meal" }

failures:
    aged_food_record_surfaces_as_remembered_belief
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    partial_food_source_knowledge_seeds_only_authored_actor_edge
    planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit

test result: FAILED. 37 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.49s

*** result: Failure(101)
