*** crates/tracewake-core/src/agent/actor_known.rs:358:9: replace ActorKnownPlanningContext::known_food_sources -> &BTreeSet<String> with Box::leak(Box::new(BTreeSet::from_iter([String::new()])))

*** mutation diff:
--- crates/tracewake-core/src/agent/actor_known.rs
+++ replace ActorKnownPlanningContext::known_food_sources -> &BTreeSet<String> with Box::leak(Box::new(BTreeSet::from_iter([String::new()])))
@@ -350,17 +350,17 @@
         &self.known_closed_doors
     }
 
     pub fn known_containers_by_place(&self) -> &BTreeMap<PlaceId, BTreeSet<ContainerId>> {
         &self.known_containers_by_place
     }
 
     pub fn known_food_sources(&self) -> &BTreeSet<String> {
-        &self.known_food_sources
+        Box::leak(Box::new(BTreeSet::from_iter([String::new()]))) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn known_sleep_places(&self) -> &BTreeSet<PlaceId> {
         &self.known_sleep_places
     }
 
     pub fn known_workplaces(&self) -> &BTreeMap<WorkplaceId, PlaceId> {
         &self.known_workplaces

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (9326) panicked at crates/tracewake-content/tests/fixtures_load.rs:1217:5:
assertion failed: report.ordinary_pipeline_events > 0

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
