*** crates/tracewake-core/src/agent/actor_known.rs:362:9: replace ActorKnownPlanningContext::known_sleep_places -> &BTreeSet<PlaceId> with Box::leak(Box::new(BTreeSet::new()))

*** mutation diff:
--- crates/tracewake-core/src/agent/actor_known.rs
+++ replace ActorKnownPlanningContext::known_sleep_places -> &BTreeSet<PlaceId> with Box::leak(Box::new(BTreeSet::new()))
@@ -354,17 +354,17 @@
         &self.known_containers_by_place
     }
 
     pub fn known_food_sources(&self) -> &BTreeSet<String> {
         &self.known_food_sources
     }
 
     pub fn known_sleep_places(&self) -> &BTreeSet<PlaceId> {
-        &self.known_sleep_places
+        Box::leak(Box::new(BTreeSet::new())) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn known_workplaces(&self) -> &BTreeMap<WorkplaceId, PlaceId> {
         &self.known_workplaces
     }
 
     pub fn actor_known_facts(&self) -> &[ActorKnownFact] {
         &self.facts

---- episode_tamper_proration_poisons_replay stdout ----

thread 'episode_tamper_proration_poisons_replay' (17423) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2851:5:
assertion failed: has_event(&log, EventKind::SleepInterrupted)

---- sleep_spanning_window_boundary_charges_each_tick_once stdout ----

thread 'sleep_spanning_window_boundary_charges_each_tick_once' (17457) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2528:5:
assertion failed: has_event(&log, EventKind::SleepStarted)

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (17430) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2177:5:
assertion failed: has_no_human_event(&log, EventKind::SleepCompleted)

failures:
    episode_tamper_proration_poisons_replay
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    sleep_spanning_window_boundary_charges_each_tick_once

test result: FAILED. 38 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.48s

*** result: Failure(101)
