*** crates/tracewake-core/src/agent/actor_known.rs:366:9: replace ActorKnownPlanningContext::known_workplaces -> &BTreeMap<WorkplaceId, PlaceId> with Box::leak(Box::new(BTreeMap::new()))

*** mutation diff:
--- crates/tracewake-core/src/agent/actor_known.rs
+++ replace ActorKnownPlanningContext::known_workplaces -> &BTreeMap<WorkplaceId, PlaceId> with Box::leak(Box::new(BTreeMap::new()))
@@ -358,17 +358,17 @@
         &self.known_food_sources
     }
 
     pub fn known_sleep_places(&self) -> &BTreeSet<PlaceId> {
         &self.known_sleep_places
     }
 
     pub fn known_workplaces(&self) -> &BTreeMap<WorkplaceId, PlaceId> {
-        &self.known_workplaces
+        Box::leak(Box::new(BTreeMap::new())) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn actor_known_facts(&self) -> &[ActorKnownFact] {
         &self.facts
     }
 
     pub fn proof_sources(&self) -> Vec<String> {
         self.facts.iter().map(ActorKnownFact::proof_note).collect()

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (21541) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (21542) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2714:5:
assertion failed: has_event(&log, EventKind::ActorMoved)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection

test result: FAILED. 40 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.49s

*** result: Failure(101)
