*** crates/tracewake-core/src/agent/actor_known.rs:370:9: replace ActorKnownPlanningContext::actor_known_facts -> &[ActorKnownFact] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/tracewake-core/src/agent/actor_known.rs
+++ replace ActorKnownPlanningContext::actor_known_facts -> &[ActorKnownFact] with Vec::leak(Vec::new())
@@ -362,17 +362,17 @@
         &self.known_sleep_places
     }
 
     pub fn known_workplaces(&self) -> &BTreeMap<WorkplaceId, PlaceId> {
         &self.known_workplaces
     }
 
     pub fn actor_known_facts(&self) -> &[ActorKnownFact] {
-        &self.facts
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn proof_sources(&self) -> Vec<String> {
         self.facts.iter().map(ActorKnownFact::proof_note).collect()
     }
 
     fn sort_facts(&mut self) {
         self.facts.sort_by(|left, right| {

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (25610) panicked at crates/tracewake-content/tests/fixtures_load.rs:1217:5:
assertion failed: report.ordinary_pipeline_events > 0

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
