*** crates/tracewake-core/src/agent/actor_known.rs:374:9: replace ActorKnownPlanningContext::proof_sources -> Vec<String> with vec!["xyzzy".into()]

*** mutation diff:
--- crates/tracewake-core/src/agent/actor_known.rs
+++ replace ActorKnownPlanningContext::proof_sources -> Vec<String> with vec!["xyzzy".into()]
@@ -366,17 +366,17 @@
         &self.known_workplaces
     }
 
     pub fn actor_known_facts(&self) -> &[ActorKnownFact] {
         &self.facts
     }
 
     pub fn proof_sources(&self) -> Vec<String> {
-        self.facts.iter().map(ActorKnownFact::proof_note).collect()
+        vec!["xyzzy".into()] /* ~ changed by cargo-mutants ~ */
     }
 
     fn sort_facts(&mut self) {
         self.facts.sort_by(|left, right| {
             left.stable_id()
                 .cmp(right.stable_id())
                 .then_with(|| left.proof_note().cmp(&right.proof_note()))
         });

---- no_hidden_truth_fixture_keeps_hidden_food_out_of_planner_inputs stdout ----

thread 'no_hidden_truth_fixture_keeps_hidden_food_out_of_planner_inputs' (5424) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1928:5:
assertion failed: actor_known_state.proof_sources().iter().any(|source|
        source ==
            "agent_needs_present=remembered_belief:agent_state:needs_present")

failures:
    no_hidden_truth_fixture_keeps_hidden_food_out_of_planner_inputs

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.63s

*** result: Failure(101)
