*** crates/tracewake-core/src/agent/actor_known.rs:378:9: replace ActorKnownPlanningContext::sort_facts with ()

*** mutation diff:
--- crates/tracewake-core/src/agent/actor_known.rs
+++ replace ActorKnownPlanningContext::sort_facts with ()
@@ -370,21 +370,17 @@
         &self.facts
     }
 
     pub fn proof_sources(&self) -> Vec<String> {
         self.facts.iter().map(ActorKnownFact::proof_note).collect()
     }
 
     fn sort_facts(&mut self) {
-        self.facts.sort_by(|left, right| {
-            left.stable_id()
-                .cmp(right.stable_id())
-                .then_with(|| left.proof_note().cmp(&right.proof_note()))
-        });
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn audit_with(&self, request_facts: &[ActorKnownFact]) -> HiddenTruthAudit {
         let mut proof_notes = self.proof_sources();
         proof_notes.extend(request_facts.iter().map(ActorKnownFact::proof_note));
         let structured_gaps = self.structured_fact_gaps();
         proof_notes.extend(
             structured_gaps

---- agent::actor_known::tests::actor_known_facts_are_sorted_by_stable_id_then_proof_note stdout ----

thread 'agent::actor_known::tests::actor_known_facts_are_sorted_by_stable_id_then_proof_note' (9655) panicked at crates/tracewake-core/src/agent/actor_known.rs:724:9:
assertion `left == right` failed
  left: ["known_route_surface=observed_now:source:z", "actor_knows_food_source=remembered_belief:source:b", "actor_knows_food_source=observed_now:source:a"]
 right: ["actor_knows_food_source=observed_now:source:a", "actor_knows_food_source=remembered_belief:source:b", "known_route_surface=observed_now:source:z"]

failures:
    agent::actor_known::tests::actor_known_facts_are_sorted_by_stable_id_then_proof_note

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
