*** crates/tracewake-core/src/agent/actor_known.rs:409:9: replace ActorKnownPlanningContext::structured_fact_gaps -> Vec<String> with vec![]

*** mutation diff:
--- crates/tracewake-core/src/agent/actor_known.rs
+++ replace ActorKnownPlanningContext::structured_fact_gaps -> Vec<String> with vec![]
@@ -401,58 +401,17 @@
             && structured_gaps.is_empty();
         HiddenTruthAudit {
             actor_known_only,
             notes: format!("planner proof_sources={}", proof_notes.join(",")),
         }
     }
 
     fn structured_fact_gaps(&self) -> Vec<String> {
-        let mut gaps = Vec::new();
-        for food_source in &self.known_food_sources {
-            if !self.has_fact("actor_knows_food_source", food_source) {
-                gaps.push(format!("known_food_sources:{food_source}"));
-            }
-        }
-        for sleep_place in &self.known_sleep_places {
-            if !self.has_fact("actor_knows_sleep_place", sleep_place.as_str()) {
-                gaps.push(format!("known_sleep_places:{}", sleep_place.as_str()));
-            }
-        }
-        for (workplace_id, place_id) in &self.known_workplaces {
-            let value = format!("{}@{}", workplace_id.as_str(), place_id.as_str());
-            if !self.has_fact("actor_knows_workplace", &value) {
-                gaps.push(format!("known_workplaces:{value}"));
-            }
-        }
-        for (from, tos) in &self.known_edges {
-            for to in tos {
-                let value = format!("{}->{}", from.as_str(), to.as_str());
-                if !self.has_fact("known_route_surface", &value) {
-                    gaps.push(format!("known_edges:{value}"));
-                }
-            }
-        }
-        for ((from, to), door_id) in &self.known_closed_doors {
-            let edge_value = format!("{}->{}", from.as_str(), to.as_str());
-            let door_value = format!("{edge_value}@{door_id}");
-            if !self.has_fact("known_closed_door_surface", &door_value) {
-                gaps.push(format!("known_closed_doors:{door_value}"));
-            }
-        }
-        for (place_id, containers) in &self.known_containers_by_place {
-            for container_id in containers {
-                let value = format!("{}@{}", container_id.as_str(), place_id.as_str());
-                if !self.has_fact("known_container_surface", &value) {
-                    gaps.push(format!("known_containers_by_place:{value}"));
-                }
-            }
-        }
-        gaps.sort();
-        gaps
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 
     fn has_fact(&self, stable_id: &str, value: &str) -> bool {
         self.facts.iter().any(|fact| {
             fact.stable_id() == stable_id && fact.value() == value && fact.is_actor_known()
         })
     }
 }

---- agent::actor_known::tests::structured_fact_gaps_require_exact_actor_known_stable_id_and_value stdout ----

thread 'agent::actor_known::tests::structured_fact_gaps_require_exact_actor_known_stable_id_and_value' (18329) panicked at crates/tracewake-core/src/agent/actor_known.rs:719:9:
assertion `left == right` failed
  left: []
 right: ["known_food_sources:food_hidden"]

failures:
    agent::actor_known::tests::structured_fact_gaps_require_exact_actor_known_stable_id_and_value

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
