*** crates/tracewake-core/src/agent/actor_known.rs:409:9: replace ActorKnownPlanningContext::structured_fact_gaps -> Vec<String> with vec![String::new()]

*** mutation diff:
--- crates/tracewake-core/src/agent/actor_known.rs
+++ replace ActorKnownPlanningContext::structured_fact_gaps -> Vec<String> with vec![String::new()]
@@ -401,58 +401,17 @@
             && structured_gaps.is_empty();
         HiddenTruthAudit {
             actor_known_only,
             notes: format!("planner proof_sources={}", proof_notes.join(",")),
         }
     }
 
     fn structured_fact_gaps(&self) -> Vec<String> {
-        let mut gaps = Vec::new();
-        for food_source in &self.known_food_sources {
-            if !self.has_fact("actor_knows_food_source", food_source) {
-                gaps.push(format!("known_food_sources:{food_source}"));
-            }
-        }
-        for sleep_place in &self.known_sleep_places {
-            if !self.has_fact("actor_knows_sleep_place", sleep_place.as_str()) {
-                gaps.push(format!("known_sleep_places:{}", sleep_place.as_str()));
-            }
-        }
-        for (workplace_id, place_id) in &self.known_workplaces {
-            let value = format!("{}@{}", workplace_id.as_str(), place_id.as_str());
-            if !self.has_fact("actor_knows_workplace", &value) {
-                gaps.push(format!("known_workplaces:{value}"));
-            }
-        }
-        for (from, tos) in &self.known_edges {
-            for to in tos {
-                let value = format!("{}->{}", from.as_str(), to.as_str());
-                if !self.has_fact("known_route_surface", &value) {
-                    gaps.push(format!("known_edges:{value}"));
-                }
-            }
-        }
-        for ((from, to), door_id) in &self.known_closed_doors {
-            let edge_value = format!("{}->{}", from.as_str(), to.as_str());
-            let door_value = format!("{edge_value}@{door_id}");
-            if !self.has_fact("known_closed_door_surface", &door_value) {
-                gaps.push(format!("known_closed_doors:{door_value}"));
-            }
-        }
-        for (place_id, containers) in &self.known_containers_by_place {
-            for container_id in containers {
-                let value = format!("{}@{}", container_id.as_str(), place_id.as_str());
-                if !self.has_fact("known_container_surface", &value) {
-                    gaps.push(format!("known_containers_by_place:{value}"));
-                }
-            }
-        }
-        gaps.sort();
-        gaps
+        vec![String::new()] /* ~ changed by cargo-mutants ~ */
     }
 
     fn has_fact(&self, stable_id: &str, value: &str) -> bool {
         self.facts.iter().any(|fact| {
             fact.stable_id() == stable_id && fact.value() == value && fact.is_actor_known()
         })
     }
 }

---- no_hidden_truth_fixture_keeps_hidden_food_out_of_planner_inputs stdout ----

thread 'no_hidden_truth_fixture_keeps_hidden_food_out_of_planner_inputs' (22753) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1945:5:
assertion failed: plan_failure.trace.hidden_truth_audit_result.actor_known_only

---- partial_food_source_knowledge_seeds_only_authored_actor_edge stdout ----

thread 'partial_food_source_knowledge_seeds_only_authored_actor_edge' (22762) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2111:5:
assertion failed: tomas_plan_failure.trace.hidden_truth_audit_result.actor_known_only

---- planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit stdout ----

thread 'planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit' (22767) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1610:5:
assertion failed: method.trace.hidden_truth_audit_result.actor_known_only

failures:
    no_hidden_truth_fixture_keeps_hidden_food_out_of_planner_inputs
    partial_food_source_knowledge_seeds_only_authored_actor_edge
    planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.62s

*** result: Failure(101)
