*** crates/tracewake-core/src/agent/actor_known.rs:411:16: delete ! in ActorKnownPlanningContext::structured_fact_gaps

*** mutation diff:
--- crates/tracewake-core/src/agent/actor_known.rs
+++ delete ! in ActorKnownPlanningContext::structured_fact_gaps
@@ -403,17 +403,17 @@
             actor_known_only,
             notes: format!("planner proof_sources={}", proof_notes.join(",")),
         }
     }
 
     fn structured_fact_gaps(&self) -> Vec<String> {
         let mut gaps = Vec::new();
         for food_source in &self.known_food_sources {
-            if !self.has_fact("actor_knows_food_source", food_source) {
+            if  /* ~ changed by cargo-mutants ~ */self.has_fact("actor_knows_food_source", food_source) {
                 gaps.push(format!("known_food_sources:{food_source}"));
             }
         }
         for sleep_place in &self.known_sleep_places {
             if !self.has_fact("actor_knows_sleep_place", sleep_place.as_str()) {
                 gaps.push(format!("known_sleep_places:{}", sleep_place.as_str()));
             }
         }

---- planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit stdout ----

thread 'planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit' (30965) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1610:5:
assertion failed: method.trace.hidden_truth_audit_result.actor_known_only

failures:
    planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.61s

*** result: Failure(101)
