*** crates/tracewake-core/src/agent/actor_known.rs:416:16: delete ! in ActorKnownPlanningContext::structured_fact_gaps

*** mutation diff:
--- crates/tracewake-core/src/agent/actor_known.rs
+++ delete ! in ActorKnownPlanningContext::structured_fact_gaps
@@ -408,17 +408,17 @@
     fn structured_fact_gaps(&self) -> Vec<String> {
         let mut gaps = Vec::new();
         for food_source in &self.known_food_sources {
             if !self.has_fact("actor_knows_food_source", food_source) {
                 gaps.push(format!("known_food_sources:{food_source}"));
             }
         }
         for sleep_place in &self.known_sleep_places {
-            if !self.has_fact("actor_knows_sleep_place", sleep_place.as_str()) {
+            if  /* ~ changed by cargo-mutants ~ */self.has_fact("actor_knows_sleep_place", sleep_place.as_str()) {
                 gaps.push(format!("known_sleep_places:{}", sleep_place.as_str()));
             }
         }
         for (workplace_id, place_id) in &self.known_workplaces {
             let value = format!("{}@{}", workplace_id.as_str(), place_id.as_str());
             if !self.has_fact("actor_knows_workplace", &value) {
                 gaps.push(format!("known_workplaces:{value}"));
             }

---- agent::actor_known::tests::structured_actor_known_fields_are_derived_from_facts stdout ----

thread 'agent::actor_known::tests::structured_actor_known_fields_are_derived_from_facts' (2715) panicked at crates/tracewake-core/src/agent/actor_known.rs:681:9:
assertion failed: context.audit_with(&[]).actor_known_only

---- agent::actor_known::tests::structured_fact_gaps_require_exact_actor_known_stable_id_and_value stdout ----

thread 'agent::actor_known::tests::structured_fact_gaps_require_exact_actor_known_stable_id_and_value' (2717) panicked at crates/tracewake-core/src/agent/actor_known.rs:760:9:
assertion `left == right` failed
  left: ["known_food_sources:food_hidden", "known_sleep_places:food_hidden"]
 right: ["known_food_sources:food_hidden"]

---- agent::htn::tests::each_required_family_selects_applicable_method stdout ----

thread 'agent::htn::tests::each_required_family_selects_applicable_method' (2739) panicked at crates/tracewake-core/src/agent/htn.rs:457:13:
assertion failed: selection.trace.hidden_truth_audit_result.actor_known_only

failures:
    agent::actor_known::tests::structured_actor_known_fields_are_derived_from_facts
    agent::actor_known::tests::structured_fact_gaps_require_exact_actor_known_stable_id_and_value
    agent::htn::tests::each_required_family_selects_applicable_method
    agent::planner::tests::believed_but_wrong_food_source_fails_without_truth_lookup
    agent::planner::tests::hidden_truth_audit_is_derived_from_fact_provenance
    agent::planner::tests::planner_sequences_open_then_move_to_known_place

test result: FAILED. 449 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
