*** crates/tracewake-core/src/agent/actor_known.rs:422:16: delete ! in ActorKnownPlanningContext::structured_fact_gaps

*** mutation diff:
--- crates/tracewake-core/src/agent/actor_known.rs
+++ delete ! in ActorKnownPlanningContext::structured_fact_gaps
@@ -414,17 +414,17 @@
         }
         for sleep_place in &self.known_sleep_places {
             if !self.has_fact("actor_knows_sleep_place", sleep_place.as_str()) {
                 gaps.push(format!("known_sleep_places:{}", sleep_place.as_str()));
             }
         }
         for (workplace_id, place_id) in &self.known_workplaces {
             let value = format!("{}@{}", workplace_id.as_str(), place_id.as_str());
-            if !self.has_fact("actor_knows_workplace", &value) {
+            if  /* ~ changed by cargo-mutants ~ */self.has_fact("actor_knows_workplace", &value) {
                 gaps.push(format!("known_workplaces:{value}"));
             }
         }
         for (from, tos) in &self.known_edges {
             for to in tos {
                 let value = format!("{}->{}", from.as_str(), to.as_str());
                 if !self.has_fact("known_route_surface", &value) {
                     gaps.push(format!("known_edges:{value}"));

---- agent::actor_known::tests::structured_actor_known_fields_are_derived_from_facts stdout ----

thread 'agent::actor_known::tests::structured_actor_known_fields_are_derived_from_facts' (7275) panicked at crates/tracewake-core/src/agent/actor_known.rs:681:9:
assertion failed: context.audit_with(&[]).actor_known_only

failures:
    agent::actor_known::tests::structured_actor_known_fields_are_derived_from_facts

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
