*** crates/tracewake-core/src/agent/actor_known.rs:429:20: delete ! in ActorKnownPlanningContext::structured_fact_gaps

*** mutation diff:
--- crates/tracewake-core/src/agent/actor_known.rs
+++ delete ! in ActorKnownPlanningContext::structured_fact_gaps
@@ -421,17 +421,17 @@
             let value = format!("{}@{}", workplace_id.as_str(), place_id.as_str());
             if !self.has_fact("actor_knows_workplace", &value) {
                 gaps.push(format!("known_workplaces:{value}"));
             }
         }
         for (from, tos) in &self.known_edges {
             for to in tos {
                 let value = format!("{}->{}", from.as_str(), to.as_str());
-                if !self.has_fact("known_route_surface", &value) {
+                if  /* ~ changed by cargo-mutants ~ */self.has_fact("known_route_surface", &value) {
                     gaps.push(format!("known_edges:{value}"));
                 }
             }
         }
         for ((from, to), door_id) in &self.known_closed_doors {
             let edge_value = format!("{}->{}", from.as_str(), to.as_str());
             let door_value = format!("{edge_value}@{door_id}");
             if !self.has_fact("known_closed_door_surface", &door_value) {

---- agent::actor_known::tests::structured_actor_known_fields_are_derived_from_facts stdout ----

thread 'agent::actor_known::tests::structured_actor_known_fields_are_derived_from_facts' (11834) panicked at crates/tracewake-core/src/agent/actor_known.rs:681:9:
assertion failed: context.audit_with(&[]).actor_known_only

---- agent::htn::tests::each_required_family_selects_applicable_method stdout ----

thread 'agent::htn::tests::each_required_family_selects_applicable_method' (11858) panicked at crates/tracewake-core/src/agent/htn.rs:457:13:
assertion failed: selection.trace.hidden_truth_audit_result.actor_known_only

---- agent::planner::tests::believed_but_wrong_food_source_fails_without_truth_lookup stdout ----

thread 'agent::planner::tests::believed_but_wrong_food_source_fails_without_truth_lookup' (11912) panicked at crates/tracewake-core/src/agent/planner.rs:543:9:
assertion failed: failure.trace.hidden_truth_audit_result.actor_known_only

failures:
    agent::actor_known::tests::structured_actor_known_fields_are_derived_from_facts
    agent::htn::tests::each_required_family_selects_applicable_method
    agent::planner::tests::believed_but_wrong_food_source_fails_without_truth_lookup
    agent::planner::tests::hidden_truth_audit_is_derived_from_fact_provenance
    agent::planner::tests::planner_sequences_open_then_move_to_known_place

test result: FAILED. 450 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
