*** crates/tracewake-core/src/agent/actor_known.rs:437:16: delete ! in ActorKnownPlanningContext::structured_fact_gaps

*** mutation diff:
--- crates/tracewake-core/src/agent/actor_known.rs
+++ delete ! in ActorKnownPlanningContext::structured_fact_gaps
@@ -429,17 +429,17 @@
                 if !self.has_fact("known_route_surface", &value) {
                     gaps.push(format!("known_edges:{value}"));
                 }
             }
         }
         for ((from, to), door_id) in &self.known_closed_doors {
             let edge_value = format!("{}->{}", from.as_str(), to.as_str());
             let door_value = format!("{edge_value}@{door_id}");
-            if !self.has_fact("known_closed_door_surface", &door_value) {
+            if  /* ~ changed by cargo-mutants ~ */self.has_fact("known_closed_door_surface", &door_value) {
                 gaps.push(format!("known_closed_doors:{door_value}"));
             }
         }
         for (place_id, containers) in &self.known_containers_by_place {
             for container_id in containers {
                 let value = format!("{}@{}", container_id.as_str(), place_id.as_str());
                 if !self.has_fact("known_container_surface", &value) {
                     gaps.push(format!("known_containers_by_place:{value}"));

---- agent::planner::tests::hidden_truth_audit_is_derived_from_fact_provenance stdout ----

thread 'agent::planner::tests::hidden_truth_audit_is_derived_from_fact_provenance' (16473) panicked at crates/tracewake-core/src/agent/planner.rs:591:9:
assertion failed: known.trace.hidden_truth_audit_result.actor_known_only

---- agent::planner::tests::believed_but_wrong_food_source_fails_without_truth_lookup stdout ----

thread 'agent::planner::tests::believed_but_wrong_food_source_fails_without_truth_lookup' (16471) panicked at crates/tracewake-core/src/agent/planner.rs:543:9:
assertion failed: failure.trace.hidden_truth_audit_result.actor_known_only

---- agent::planner::tests::planner_sequences_open_then_move_to_known_place stdout ----

thread 'agent::planner::tests::planner_sequences_open_then_move_to_known_place' (16475) panicked at crates/tracewake-core/src/agent/planner.rs:512:9:
assertion failed: plan.trace.hidden_truth_audit_result.actor_known_only

failures:
    agent::planner::tests::believed_but_wrong_food_source_fails_without_truth_lookup
    agent::planner::tests::hidden_truth_audit_is_derived_from_fact_provenance
    agent::planner::tests::planner_sequences_open_then_move_to_known_place

test result: FAILED. 452 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
