*** crates/tracewake-core/src/agent/actor_known.rs:454:9: replace ActorKnownPlanningContext::has_fact -> bool with true

*** mutation diff:
--- crates/tracewake-core/src/agent/actor_known.rs
+++ replace ActorKnownPlanningContext::has_fact -> bool with true
@@ -446,19 +446,17 @@
                 }
             }
         }
         gaps.sort();
         gaps
     }
 
     fn has_fact(&self, stable_id: &str, value: &str) -> bool {
-        self.facts.iter().any(|fact| {
-            fact.stable_id() == stable_id && fact.value() == value && fact.is_actor_known()
-        })
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Debug, Default, PartialEq, Eq)]
 struct DerivedActorKnownFields {
     known_edges: BTreeMap<PlaceId, BTreeSet<PlaceId>>,
     known_closed_doors: BTreeMap<(PlaceId, PlaceId), String>,
     known_containers_by_place: BTreeMap<PlaceId, BTreeSet<ContainerId>>,

---- agent::actor_known::tests::structured_fact_gaps_require_exact_actor_known_stable_id_and_value stdout ----

thread 'agent::actor_known::tests::structured_fact_gaps_require_exact_actor_known_stable_id_and_value' (25513) panicked at crates/tracewake-core/src/agent/actor_known.rs:758:9:
assertion `left == right` failed
  left: []
 right: ["known_food_sources:food_hidden"]

failures:
    agent::actor_known::tests::structured_fact_gaps_require_exact_actor_known_stable_id_and_value

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
