*** crates/tracewake-core/src/agent/actor_known.rs:455:30: replace == with != in ActorKnownPlanningContext::has_fact

*** mutation diff:
--- crates/tracewake-core/src/agent/actor_known.rs
+++ replace == with != in ActorKnownPlanningContext::has_fact
@@ -447,17 +447,17 @@
             }
         }
         gaps.sort();
         gaps
     }
 
     fn has_fact(&self, stable_id: &str, value: &str) -> bool {
         self.facts.iter().any(|fact| {
-            fact.stable_id() == stable_id && fact.value() == value && fact.is_actor_known()
+            fact.stable_id() != /* ~ changed by cargo-mutants ~ */ stable_id && fact.value() == value && fact.is_actor_known()
         })
     }
 }
 
 #[derive(Clone, Debug, Default, PartialEq, Eq)]
 struct DerivedActorKnownFields {
     known_edges: BTreeMap<PlaceId, BTreeSet<PlaceId>>,
     known_closed_doors: BTreeMap<(PlaceId, PlaceId), String>,

---- agent::actor_known::tests::structured_actor_known_fields_are_derived_from_facts stdout ----

thread 'agent::actor_known::tests::structured_actor_known_fields_are_derived_from_facts' (10820) panicked at crates/tracewake-core/src/agent/actor_known.rs:681:9:
assertion failed: context.audit_with(&[]).actor_known_only

---- agent::actor_known::tests::structured_fact_gaps_require_exact_actor_known_stable_id_and_value stdout ----

thread 'agent::actor_known::tests::structured_fact_gaps_require_exact_actor_known_stable_id_and_value' (10822) panicked at crates/tracewake-core/src/agent/actor_known.rs:760:9:
assertion `left == right` failed
  left: ["known_food_sources:food_other", "known_sleep_places:food_hidden"]
 right: ["known_food_sources:food_hidden"]

---- agent::htn::tests::each_required_family_selects_applicable_method stdout ----

thread 'agent::htn::tests::each_required_family_selects_applicable_method' (10844) panicked at crates/tracewake-core/src/agent/htn.rs:457:13:
assertion failed: selection.trace.hidden_truth_audit_result.actor_known_only

failures:
    agent::actor_known::tests::structured_actor_known_fields_are_derived_from_facts
    agent::actor_known::tests::structured_fact_gaps_require_exact_actor_known_stable_id_and_value
    agent::htn::tests::each_required_family_selects_applicable_method
    agent::planner::tests::believed_but_wrong_food_source_fails_without_truth_lookup
    agent::planner::tests::hidden_truth_audit_is_derived_from_fact_provenance
    agent::planner::tests::planner_sequences_open_then_move_to_known_place

test result: FAILED. 449 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
