*** crates/tracewake-core/src/agent/actor_known.rs:455:59: replace == with != in ActorKnownPlanningContext::has_fact

*** mutation diff:
--- crates/tracewake-core/src/agent/actor_known.rs
+++ replace == with != in ActorKnownPlanningContext::has_fact
@@ -447,17 +447,17 @@
             }
         }
         gaps.sort();
         gaps
     }
 
     fn has_fact(&self, stable_id: &str, value: &str) -> bool {
         self.facts.iter().any(|fact| {
-            fact.stable_id() == stable_id && fact.value() == value && fact.is_actor_known()
+            fact.stable_id() == stable_id && fact.value() != /* ~ changed by cargo-mutants ~ */ value && fact.is_actor_known()
         })
     }
 }
 
 #[derive(Clone, Debug, Default, PartialEq, Eq)]
 struct DerivedActorKnownFields {
     known_edges: BTreeMap<PlaceId, BTreeSet<PlaceId>>,
     known_closed_doors: BTreeMap<(PlaceId, PlaceId), String>,

---- planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit stdout ----

thread 'planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit' (15260) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1610:5:
assertion failed: method.trace.hidden_truth_audit_result.actor_known_only

failures:
    planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.64s

*** result: Failure(101)
