*** crates/tracewake-core/src/agent/actor_known.rs:455:68: replace && with || in ActorKnownPlanningContext::has_fact

*** mutation diff:
--- crates/tracewake-core/src/agent/actor_known.rs
+++ replace && with || in ActorKnownPlanningContext::has_fact
@@ -447,17 +447,17 @@
             }
         }
         gaps.sort();
         gaps
     }
 
     fn has_fact(&self, stable_id: &str, value: &str) -> bool {
         self.facts.iter().any(|fact| {
-            fact.stable_id() == stable_id && fact.value() == value && fact.is_actor_known()
+            fact.stable_id() == stable_id && fact.value() == value || /* ~ changed by cargo-mutants ~ */ fact.is_actor_known()
         })
     }
 }
 
 #[derive(Clone, Debug, Default, PartialEq, Eq)]
 struct DerivedActorKnownFields {
     known_edges: BTreeMap<PlaceId, BTreeSet<PlaceId>>,
     known_closed_doors: BTreeMap<(PlaceId, PlaceId), String>,

---- agent::actor_known::tests::structured_fact_gaps_require_exact_actor_known_stable_id_and_value stdout ----

thread 'agent::actor_known::tests::structured_fact_gaps_require_exact_actor_known_stable_id_and_value' (1703) panicked at crates/tracewake-core/src/agent/actor_known.rs:760:9:
assertion `left == right` failed
  left: []
 right: ["known_food_sources:food_hidden"]

failures:
    agent::actor_known::tests::structured_fact_gaps_require_exact_actor_known_stable_id_and_value

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
