*** crates/tracewake-core/src/agent/actor_known.rs:472:9: replace DerivedActorKnownFields::from_facts -> Self with Default::default()

*** mutation diff:
--- crates/tracewake-core/src/agent/actor_known.rs
+++ replace DerivedActorKnownFields::from_facts -> Self with Default::default()
@@ -464,73 +464,17 @@
     known_containers_by_place: BTreeMap<PlaceId, BTreeSet<ContainerId>>,
     known_food_sources: BTreeSet<String>,
     known_sleep_places: BTreeSet<PlaceId>,
     known_workplaces: BTreeMap<WorkplaceId, PlaceId>,
 }
 
 impl DerivedActorKnownFields {
     fn from_facts(facts: &[ActorKnownFact]) -> Self {
-        let mut derived = Self::default();
-        for fact in facts.iter().filter(|fact| fact.is_actor_known()) {
-            match fact.stable_id() {
-                "known_route_surface" => {
-                    if let Some((from, to)) =
-                        fact.value().split_once("->").and_then(|(from, to)| {
-                            Some((PlaceId::new(from).ok()?, PlaceId::new(to).ok()?))
-                        })
-                    {
-                        derived.known_edges.entry(from).or_default().insert(to);
-                    }
-                }
-                "known_closed_door_surface" => {
-                    if let Some((edge, door_id)) = fact.value().split_once('@') {
-                        if let Some((from, to)) = edge.split_once("->").and_then(|(from, to)| {
-                            Some((PlaceId::new(from).ok()?, PlaceId::new(to).ok()?))
-                        }) {
-                            derived
-                                .known_closed_doors
-                                .insert((from, to), door_id.to_string());
-                        }
-                    }
-                }
-                "known_container_surface" => {
-                    if let Some((container_id, place_id)) = fact.value().split_once('@') {
-                        if let (Ok(container_id), Ok(place_id)) =
-                            (ContainerId::new(container_id), PlaceId::new(place_id))
-                        {
-                            derived
-                                .known_containers_by_place
-                                .entry(place_id)
-                                .or_default()
-                                .insert(container_id);
-                        }
-                    }
-                }
-                "actor_knows_food_source" => {
-                    derived.known_food_sources.insert(fact.value().to_string());
-                }
-                "actor_knows_sleep_place" => {
-                    if let Ok(place_id) = PlaceId::new(fact.value()) {
-                        derived.known_sleep_places.insert(place_id);
-                    }
-                }
-                "actor_knows_workplace" => {
-                    if let Some((workplace_id, place_id)) = fact.value().split_once('@') {
-                        if let (Ok(workplace_id), Ok(place_id)) =
-                            (WorkplaceId::new(workplace_id), PlaceId::new(place_id))
-                        {
-                            derived.known_workplaces.insert(workplace_id, place_id);
-                        }
-                    }
-                }
-                _ => {}
-            }
-        }
-        derived
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 pub fn derive_hidden_truth_audit(
     context: &ActorKnownPlanningContext,
     request_facts: &[ActorKnownFact],
 ) -> HiddenTruthAudit {
     context.audit_with(request_facts)

---- aged_food_record_surfaces_as_remembered_belief stdout ----

thread 'aged_food_record_surfaces_as_remembered_belief' (19335) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2648:5:
assertion failed: surface.context().known_food_sources().contains("food_stew_home_tomas")

---- partial_food_source_knowledge_seeds_only_authored_actor_edge stdout ----

thread 'partial_food_source_knowledge_seeds_only_authored_actor_edge' (19354) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2073:5:
assertion failed: mara_known.known_food_sources().contains("food_shared_pantry")

---- episode_tamper_proration_poisons_replay stdout ----

thread 'episode_tamper_proration_poisons_replay' (19339) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2851:5:
assertion failed: has_event(&log, EventKind::SleepInterrupted)

failures:
    aged_food_record_surfaces_as_remembered_belief
    episode_tamper_proration_poisons_replay
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    partial_food_source_knowledge_seeds_only_authored_actor_edge
    planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit
    severe_safety_with_known_exit_produces_move_and_replays
    sleep_spanning_window_boundary_charges_each_tick_once

test result: FAILED. 34 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.50s

*** result: Failure(101)
