*** crates/tracewake-core/src/agent/actor_known.rs:475:17: delete match arm "known_route_surface" in DerivedActorKnownFields::from_facts

*** mutation diff:
--- crates/tracewake-core/src/agent/actor_known.rs
+++ delete match arm "known_route_surface" in DerivedActorKnownFields::from_facts
@@ -467,25 +467,17 @@
     known_workplaces: BTreeMap<WorkplaceId, PlaceId>,
 }
 
 impl DerivedActorKnownFields {
     fn from_facts(facts: &[ActorKnownFact]) -> Self {
         let mut derived = Self::default();
         for fact in facts.iter().filter(|fact| fact.is_actor_known()) {
             match fact.stable_id() {
-                "known_route_surface" => {
-                    if let Some((from, to)) =
-                        fact.value().split_once("->").and_then(|(from, to)| {
-                            Some((PlaceId::new(from).ok()?, PlaceId::new(to).ok()?))
-                        })
-                    {
-                        derived.known_edges.entry(from).or_default().insert(to);
-                    }
-                }
+                 /* ~ changed by cargo-mutants ~ */
                 "known_closed_door_surface" => {
                     if let Some((edge, door_id)) = fact.value().split_once('@') {
                         if let Some((from, to)) = edge.split_once("->").and_then(|(from, to)| {
                             Some((PlaceId::new(from).ok()?, PlaceId::new(to).ok()?))
                         }) {
                             derived
                                 .known_closed_doors
                                 .insert((from, to), door_id.to_string());

---- severe_safety_with_known_exit_produces_move_and_replays stdout ----

thread 'severe_safety_with_known_exit_produces_move_and_replays' (23469) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1715:10:
severe safety should commit a move

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (23445) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (23446) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2714:5:
assertion failed: has_event(&log, EventKind::ActorMoved)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    severe_safety_with_known_exit_produces_move_and_replays

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.41s

*** result: Failure(101)
