*** crates/tracewake-core/src/agent/actor_known.rs:484:17: delete match arm "known_closed_door_surface" in DerivedActorKnownFields::from_facts

*** mutation diff:
--- crates/tracewake-core/src/agent/actor_known.rs
+++ delete match arm "known_closed_door_surface" in DerivedActorKnownFields::from_facts
@@ -476,27 +476,17 @@
                     if let Some((from, to)) =
                         fact.value().split_once("->").and_then(|(from, to)| {
                             Some((PlaceId::new(from).ok()?, PlaceId::new(to).ok()?))
                         })
                     {
                         derived.known_edges.entry(from).or_default().insert(to);
                     }
                 }
-                "known_closed_door_surface" => {
-                    if let Some((edge, door_id)) = fact.value().split_once('@') {
-                        if let Some((from, to)) = edge.split_once("->").and_then(|(from, to)| {
-                            Some((PlaceId::new(from).ok()?, PlaceId::new(to).ok()?))
-                        }) {
-                            derived
-                                .known_closed_doors
-                                .insert((from, to), door_id.to_string());
-                        }
-                    }
-                }
+                 /* ~ changed by cargo-mutants ~ */
                 "known_container_surface" => {
                     if let Some((container_id, place_id)) = fact.value().split_once('@') {
                         if let (Ok(container_id), Ok(place_id)) =
                             (ContainerId::new(container_id), PlaceId::new(place_id))
                         {
                             derived
                                 .known_containers_by_place
                                 .entry(place_id)

---- agent::planner::tests::planner_sequences_open_then_move_to_known_place stdout ----

thread 'agent::planner::tests::planner_sequences_open_then_move_to_known_place' (27758) panicked at crates/tracewake-core/src/agent/planner.rs:511:9:
assertion `left == right` failed
  left: ["move", "move"]
 right: ["open", "move", "move"]

failures:
    agent::planner::tests::planner_sequences_open_then_move_to_known_place

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
