*** crates/tracewake-core/src/agent/actor_known.rs:495:17: delete match arm "known_container_surface" in DerivedActorKnownFields::from_facts

*** mutation diff:
--- crates/tracewake-core/src/agent/actor_known.rs
+++ delete match arm "known_container_surface" in DerivedActorKnownFields::from_facts
@@ -487,29 +487,17 @@
                             Some((PlaceId::new(from).ok()?, PlaceId::new(to).ok()?))
                         }) {
                             derived
                                 .known_closed_doors
                                 .insert((from, to), door_id.to_string());
                         }
                     }
                 }
-                "known_container_surface" => {
-                    if let Some((container_id, place_id)) = fact.value().split_once('@') {
-                        if let (Ok(container_id), Ok(place_id)) =
-                            (ContainerId::new(container_id), PlaceId::new(place_id))
-                        {
-                            derived
-                                .known_containers_by_place
-                                .entry(place_id)
-                                .or_default()
-                                .insert(container_id);
-                        }
-                    }
-                }
+                 /* ~ changed by cargo-mutants ~ */
                 "actor_knows_food_source" => {
                     derived.known_food_sources.insert(fact.value().to_string());
                 }
                 "actor_knows_sleep_place" => {
                     if let Ok(place_id) = PlaceId::new(fact.value()) {
                         derived.known_sleep_places.insert(place_id);
                     }
                 }

---- agent::actor_known::tests::structured_actor_known_fields_are_derived_from_facts stdout ----

thread 'agent::actor_known::tests::structured_actor_known_fields_are_derived_from_facts' (32235) panicked at crates/tracewake-core/src/agent/actor_known.rs:657:9:
assertion failed: context.known_containers_by_place().get(&place_id("home")).is_some_and(|containers|
        containers.contains(&ContainerId::new("pantry").unwrap()))

failures:
    agent::actor_known::tests::structured_actor_known_fields_are_derived_from_facts

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
