*** crates/tracewake-core/src/agent/actor_known.rs:508:17: delete match arm "actor_knows_food_source" in DerivedActorKnownFields::from_facts

*** mutation diff:
--- crates/tracewake-core/src/agent/actor_known.rs
+++ delete match arm "actor_knows_food_source" in DerivedActorKnownFields::from_facts
@@ -500,19 +500,17 @@
                             derived
                                 .known_containers_by_place
                                 .entry(place_id)
                                 .or_default()
                                 .insert(container_id);
                         }
                     }
                 }
-                "actor_knows_food_source" => {
-                    derived.known_food_sources.insert(fact.value().to_string());
-                }
+                 /* ~ changed by cargo-mutants ~ */
                 "actor_knows_sleep_place" => {
                     if let Ok(place_id) = PlaceId::new(fact.value()) {
                         derived.known_sleep_places.insert(place_id);
                     }
                 }
                 "actor_knows_workplace" => {
                     if let Some((workplace_id, place_id)) = fact.value().split_once('@') {
                         if let (Ok(workplace_id), Ok(place_id)) =

---- aged_food_record_surfaces_as_remembered_belief stdout ----

thread 'aged_food_record_surfaces_as_remembered_belief' (4183) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2648:5:
assertion failed: surface.context().known_food_sources().contains("food_stew_home_tomas")

---- partial_food_source_knowledge_seeds_only_authored_actor_edge stdout ----

thread 'partial_food_source_knowledge_seeds_only_authored_actor_edge' (4202) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2073:5:
assertion failed: mara_known.known_food_sources().contains("food_shared_pantry")

---- planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit stdout ----

thread 'planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit' (4207) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1603:6:
called `Result::unwrap()` on an `Err` value: NoApplicableMethod { family: EatMeal, reason: "no actor-known method inputs for eat_meal" }

failures:
    aged_food_record_surfaces_as_remembered_belief
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    partial_food_source_knowledge_seeds_only_authored_actor_edge
    planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit

test result: FAILED. 37 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.51s

*** result: Failure(101)
