*** crates/tracewake-core/src/agent/actor_known.rs:511:17: delete match arm "actor_knows_sleep_place" in DerivedActorKnownFields::from_facts

*** mutation diff:
--- crates/tracewake-core/src/agent/actor_known.rs
+++ delete match arm "actor_knows_sleep_place" in DerivedActorKnownFields::from_facts
@@ -503,21 +503,17 @@
                                 .or_default()
                                 .insert(container_id);
                         }
                     }
                 }
                 "actor_knows_food_source" => {
                     derived.known_food_sources.insert(fact.value().to_string());
                 }
-                "actor_knows_sleep_place" => {
-                    if let Ok(place_id) = PlaceId::new(fact.value()) {
-                        derived.known_sleep_places.insert(place_id);
-                    }
-                }
+                 /* ~ changed by cargo-mutants ~ */
                 "actor_knows_workplace" => {
                     if let Some((workplace_id, place_id)) = fact.value().split_once('@') {
                         if let (Ok(workplace_id), Ok(place_id)) =
                             (WorkplaceId::new(workplace_id), PlaceId::new(place_id))
                         {
                             derived.known_workplaces.insert(workplace_id, place_id);
                         }
                     }

---- episode_tamper_proration_poisons_replay stdout ----

thread 'episode_tamper_proration_poisons_replay' (8287) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2851:5:
assertion failed: has_event(&log, EventKind::SleepInterrupted)

---- sleep_spanning_window_boundary_charges_each_tick_once stdout ----

thread 'sleep_spanning_window_boundary_charges_each_tick_once' (8321) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2528:5:
assertion failed: has_event(&log, EventKind::SleepStarted)

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (8294) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2177:5:
assertion failed: has_no_human_event(&log, EventKind::SleepCompleted)

failures:
    episode_tamper_proration_poisons_replay
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    sleep_spanning_window_boundary_charges_each_tick_once

test result: FAILED. 38 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.50s

*** result: Failure(101)
