*** crates/tracewake-core/src/agent/actor_known.rs:516:17: delete match arm "actor_knows_workplace" in DerivedActorKnownFields::from_facts

*** mutation diff:
--- crates/tracewake-core/src/agent/actor_known.rs
+++ delete match arm "actor_knows_workplace" in DerivedActorKnownFields::from_facts
@@ -508,25 +508,17 @@
                 "actor_knows_food_source" => {
                     derived.known_food_sources.insert(fact.value().to_string());
                 }
                 "actor_knows_sleep_place" => {
                     if let Ok(place_id) = PlaceId::new(fact.value()) {
                         derived.known_sleep_places.insert(place_id);
                     }
                 }
-                "actor_knows_workplace" => {
-                    if let Some((workplace_id, place_id)) = fact.value().split_once('@') {
-                        if let (Ok(workplace_id), Ok(place_id)) =
-                            (WorkplaceId::new(workplace_id), PlaceId::new(place_id))
-                        {
-                            derived.known_workplaces.insert(workplace_id, place_id);
-                        }
-                    }
-                }
+                 /* ~ changed by cargo-mutants ~ */
                 _ => {}
             }
         }
         derived
     }
 }
 
 pub fn derive_hidden_truth_audit(

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (12393) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (12394) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2714:5:
assertion failed: has_event(&log, EventKind::ActorMoved)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection

test result: FAILED. 40 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.50s

*** result: Failure(101)
