*** crates/tracewake-core/src/agent/candidate.rs:21:9: replace GoalKind::stable_id -> &'static str with ""

*** mutation diff:
--- crates/tracewake-core/src/agent/candidate.rs
+++ replace GoalKind::stable_id -> &'static str with ""
@@ -13,27 +13,17 @@
     ReturnHome,
     ContinueCurrentIntention,
     IdleWithReason,
     LeaveUnsafePlace,
 }
 
 impl GoalKind {
     pub const fn stable_id(self) -> &'static str {
-        match self {
-            GoalKind::Eat => "eat",
-            GoalKind::FindFood => "find_food",
-            GoalKind::SleepOrRest => "sleep_or_rest",
-            GoalKind::GoToWork => "go_to_work",
-            GoalKind::PerformWorkBlock => "perform_work_block",
-            GoalKind::ReturnHome => "return_home",
-            GoalKind::ContinueCurrentIntention => "continue_current_intention",
-            GoalKind::IdleWithReason => "idle_with_reason",
-            GoalKind::LeaveUnsafePlace => "leave_unsafe_place",
-        }
+        "" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Copy, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
 pub enum CandidateGoalSource {
     NeedPressure,
     RoutineDuty,
     CurrentIntentionContinuation,

---- agent::candidate::tests::goal_and_source_stable_ids_cover_all_variants stdout ----

thread 'agent::candidate::tests::goal_and_source_stable_ids_cover_all_variants' (16641) panicked at crates/tracewake-core/src/agent/candidate.rs:242:9:
assertion `left == right` failed
  left: ["", "", "", "", "", "", "", "", ""]
 right: ["eat", "find_food", "sleep_or_rest", "go_to_work", "perform_work_block", "return_home", "continue_current_intention", "idle_with_reason", "leave_unsafe_place"]

failures:
    agent::candidate::tests::goal_and_source_stable_ids_cover_all_variants

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
