*** crates/tracewake-core/src/agent/candidate.rs:47:9: replace CandidateGoalSource::stable_id -> &'static str with ""

*** mutation diff:
--- crates/tracewake-core/src/agent/candidate.rs
+++ replace CandidateGoalSource::stable_id -> &'static str with ""
@@ -39,24 +39,17 @@
     CurrentIntentionContinuation,
     SafetyInterruption,
     FixtureRoutineAssignment,
     Fallback,
 }
 
 impl CandidateGoalSource {
     pub const fn stable_id(self) -> &'static str {
-        match self {
-            CandidateGoalSource::NeedPressure => "need_pressure",
-            CandidateGoalSource::RoutineDuty => "routine_duty",
-            CandidateGoalSource::CurrentIntentionContinuation => "current_intention_continuation",
-            CandidateGoalSource::SafetyInterruption => "safety_interruption",
-            CandidateGoalSource::FixtureRoutineAssignment => "fixture_routine_assignment",
-            CandidateGoalSource::Fallback => "fallback",
-        }
+        "" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Copy, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
 pub enum GoalPriority {
     SevereSafety,
     SevereHunger,
     SevereFatigue,

---- agent::candidate::tests::goal_and_source_stable_ids_cover_all_variants stdout ----

thread 'agent::candidate::tests::goal_and_source_stable_ids_cover_all_variants' (25759) panicked at crates/tracewake-core/src/agent/candidate.rs:255:9:
assertion `left == right` failed
  left: ["", "", "", "", "", ""]
 right: ["need_pressure", "routine_duty", "current_intention_continuation", "safety_interruption", "fixture_routine_assignment", "fallback"]

failures:
    agent::candidate::tests::goal_and_source_stable_ids_cover_all_variants

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
