*** crates/tracewake-core/src/agent/candidate.rs:73:9: replace GoalPriority::stable_id -> &'static str with "xyzzy"

*** mutation diff:
--- crates/tracewake-core/src/agent/candidate.rs
+++ replace GoalPriority::stable_id -> &'static str with "xyzzy"
@@ -65,27 +65,17 @@
     RoutineWindowDuty,
     ReturnHomeOrSleepWindow,
     IdleWithReason,
     MildNeedPressure,
 }
 
 impl GoalPriority {
     pub const fn stable_id(self) -> &'static str {
-        match self {
-            GoalPriority::SevereSafety => "severe_safety",
-            GoalPriority::SevereHunger => "severe_hunger",
-            GoalPriority::SevereFatigue => "severe_fatigue",
-            GoalPriority::ActiveIntentionContinuation => "active_intention_continuation",
-            GoalPriority::UrgentHungerOrFatigue => "urgent_hunger_or_fatigue",
-            GoalPriority::RoutineWindowDuty => "routine_window_duty",
-            GoalPriority::ReturnHomeOrSleepWindow => "return_home_or_sleep_window",
-            GoalPriority::IdleWithReason => "idle_with_reason",
-            GoalPriority::MildNeedPressure => "mild_need_pressure",
-        }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     pub const fn selection_rank(self) -> u8 {
         match self {
             GoalPriority::SevereSafety => 0,
             GoalPriority::SevereHunger => 1,
             GoalPriority::SevereFatigue => 2,
             GoalPriority::UrgentHungerOrFatigue => 3,

---- agent::candidate::tests::goal_priority_selection_rank_snapshot_pins_decided_order stdout ----

thread 'agent::candidate::tests::goal_priority_selection_rank_snapshot_pins_decided_order' (6970) panicked at crates/tracewake-core/src/agent/candidate.rs:343:9:
assertion `left == right` failed: Phase 3A records the foundation-defensible order: severe needs first, urgent need/routine before active continuation, active continuation before mild pressure
  left: [("xyzzy", 0), ("xyzzy", 1), ("xyzzy", 2), ("xyzzy", 3), ("xyzzy", 4), ("xyzzy", 5), ("xyzzy", 6), ("xyzzy", 7), ("xyzzy", 8)]
 right: [("severe_safety", 0), ("severe_hunger", 1), ("severe_fatigue", 2), ("urgent_hunger_or_fatigue", 3), ("routine_window_duty", 4), ("active_intention_continuation", 5), ("return_home_or_sleep_window", 6), ("idle_with_reason", 7), ("mild_need_pressure", 8)]

---- agent::decision::tests::severe_hunger_switches_and_emits_trace stdout ----

thread 'agent::decision::tests::severe_hunger_switches_and_emits_trace' (6978) panicked at crates/tracewake-core/src/agent/decision.rs:550:9:
assertion failed: matches!(&selection.lifecycle_effects[..],
    [IntentionLifecycleEffect::Interrupted { intention_id, reason },
    IntentionLifecycleEffect::Adopted { intention, reason: adoption_reason }]
    if intention_id.as_str() == "intention_work" &&
    reason.contains("severe_hunger") && intention.source ==
    IntentionSource::NeedPressure && intention.selected_goal_id ==
    selection.selected_goal.candidate_goal_id && intention.trace_ancestry ==
    vec![selection.trace.trace_id.clone()] && adoption_reason ==
    "selected candidate becomes active intention")

---- agent::decision::tests::urgent_need_vs_active_intention_follows_documented_order stdout ----

thread 'agent::decision::tests::urgent_need_vs_active_intention_follows_documented_order' (6979) panicked at crates/tracewake-core/src/agent/decision.rs:529:9:
assertion failed: matches!(&selection.lifecycle_effects[..],
    [IntentionLifecycleEffect::Interrupted { intention_id, reason },
    IntentionLifecycleEffect::Adopted { intention, .. }] if
    intention_id.as_str() == "intention_work" &&
    reason.contains("urgent_hunger_or_fatigue") && intention.source ==
    IntentionSource::NeedPressure && intention.selected_goal_id ==
    selection.selected_goal.candidate_goal_id)

failures:
    agent::candidate::tests::goal_priority_selection_rank_snapshot_pins_decided_order
    agent::decision::tests::severe_hunger_switches_and_emits_trace
    agent::decision::tests::urgent_need_vs_active_intention_follows_documented_order

test result: FAILED. 452 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
