*** crates/tracewake-core/src/agent/candidate.rs:87:9: replace GoalPriority::selection_rank -> u8 with 1

*** mutation diff:
--- crates/tracewake-core/src/agent/candidate.rs
+++ replace GoalPriority::selection_rank -> u8 with 1
@@ -79,27 +79,17 @@
             GoalPriority::RoutineWindowDuty => "routine_window_duty",
             GoalPriority::ReturnHomeOrSleepWindow => "return_home_or_sleep_window",
             GoalPriority::IdleWithReason => "idle_with_reason",
             GoalPriority::MildNeedPressure => "mild_need_pressure",
         }
     }
 
     pub const fn selection_rank(self) -> u8 {
-        match self {
-            GoalPriority::SevereSafety => 0,
-            GoalPriority::SevereHunger => 1,
-            GoalPriority::SevereFatigue => 2,
-            GoalPriority::UrgentHungerOrFatigue => 3,
-            GoalPriority::RoutineWindowDuty => 4,
-            GoalPriority::ActiveIntentionContinuation => 5,
-            GoalPriority::ReturnHomeOrSleepWindow => 6,
-            GoalPriority::IdleWithReason => 7,
-            GoalPriority::MildNeedPressure => 8,
-        }
+        1 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
 pub enum ApplicabilityResult {
     Applicable,
     Inapplicable,
 }

---- episode_tamper_proration_poisons_replay stdout ----

thread 'episode_tamper_proration_poisons_replay' (15483) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2851:5:
assertion failed: has_event(&log, EventKind::SleepInterrupted)

---- severe_safety_without_known_exit_is_local_knowledge_blocker stdout ----

thread 'severe_safety_without_known_exit_is_local_knowledge_blocker' (15515) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1777:9:
expected no-exit severe safety to fail closed

---- severe_safety_with_known_exit_produces_move_and_replays stdout ----

thread 'severe_safety_with_known_exit_produces_move_and_replays' (15514) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1715:10:
severe safety should commit a move

failures:
    episode_tamper_proration_poisons_replay
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    severe_safety_with_known_exit_produces_move_and_replays
    severe_safety_without_known_exit_is_local_knowledge_blocker
    sleep_spanning_window_boundary_charges_each_tick_once

test result: FAILED. 36 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.54s

*** result: Failure(101)
