*** crates/tracewake-core/src/agent/decision.rs:121:5: replace select_goal_and_trace -> Option<DecisionSelection> with None

*** mutation diff:
--- crates/tracewake-core/src/agent/decision.rs
+++ replace select_goal_and_trace -> Option<DecisionSelection> with None
@@ -113,92 +113,17 @@
     },
     Adopted {
         intention: Intention,
         reason: String,
     },
 }
 
 pub fn select_goal_and_trace(input: DecisionInput) -> Option<DecisionSelection> {
-    let mut applicable = input
-        .candidates
-        .iter()
-        .filter(|candidate| candidate.applicability == ApplicabilityResult::Applicable)
-        .cloned()
-        .collect::<Vec<_>>();
-    applicable.sort();
-    let selected = applicable.into_iter().next()?;
-    let active_intention = input.active_intention.clone();
-    let outcome = if selected.goal_kind == crate::agent::GoalKind::ContinueCurrentIntention {
-        DecisionOutcome::Continued
-    } else if active_intention.is_some() {
-        DecisionOutcome::Switched
-    } else {
-        DecisionOutcome::Continued
-    };
-
-    let trace_id = DecisionTraceId::new(format!(
-        "trace_decision_{}_{}_{}",
-        input.actor_id.as_str(),
-        input.decision_tick.value(),
-        selected.candidate_goal_id.as_str()
-    ))
-    .unwrap();
-    let lifecycle_effects = lifecycle_effects(
-        &input.actor_id,
-        input.decision_tick,
-        &selected,
-        active_intention.as_ref(),
-        &trace_id,
-    );
-    let rejected_goals = input
-        .candidates
-        .iter()
-        .filter(|candidate| candidate.candidate_goal_id != selected.candidate_goal_id)
-        .map(|candidate| RejectedDecisionItem {
-            stable_ref: candidate.candidate_goal_id.to_string(),
-            reason: candidate
-                .rejection_reason
-                .clone()
-                .unwrap_or_else(|| "lower_priority".to_string()),
-        })
-        .collect();
-    let hidden_truth_audit = hidden_truth_audit_from_actor_known_inputs(&input.actor_known_inputs);
-    let actor_known_inputs = input
-        .actor_known_inputs
-        .iter()
-        .map(ActorKnownInputRef::render_for_trace)
-        .collect();
-    let trace = DecisionTrace::new(
-        trace_id,
-        input.actor_id,
-        input.decision_tick,
-        input.decision_tick.advance_by(1),
-        Vec::new(),
-        active_intention,
-        input.candidates,
-        Some(selected.candidate_goal_id.clone()),
-        selected.selected_routine_method.clone(),
-        None,
-        rejected_goals,
-        Vec::new(),
-        Vec::new(),
-        actor_known_inputs,
-        None,
-        Some("selected_by_priority_order".to_string()),
-        None,
-        hidden_truth_audit,
-        outcome,
-        "deterministic candidate selection".to_string(),
-    );
-    Some(DecisionSelection {
-        selected_goal: selected,
-        trace,
-        lifecycle_effects,
-    })
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn hidden_truth_audit_from_actor_known_inputs(
     actor_known_inputs: &[ActorKnownInputRef],
 ) -> HiddenTruthAudit {
     let actor_known_only = actor_known_inputs
         .iter()
         .all(|input| !input.source_class.is_forbidden_for_cognition() && !input.explicit_unknown);

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (21108) panicked at crates/tracewake-content/tests/fixtures_load.rs:1217:5:
assertion failed: report.ordinary_pipeline_events > 0

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
