*** crates/tracewake-core/src/agent/decision.rs:124:53: replace == with != in select_goal_and_trace

*** mutation diff:
--- crates/tracewake-core/src/agent/decision.rs
+++ replace == with != in select_goal_and_trace
@@ -116,17 +116,17 @@
         reason: String,
     },
 }
 
 pub fn select_goal_and_trace(input: DecisionInput) -> Option<DecisionSelection> {
     let mut applicable = input
         .candidates
         .iter()
-        .filter(|candidate| candidate.applicability == ApplicabilityResult::Applicable)
+        .filter(|candidate| candidate.applicability != /* ~ changed by cargo-mutants ~ */ ApplicabilityResult::Applicable)
         .cloned()
         .collect::<Vec<_>>();
     applicable.sort();
     let selected = applicable.into_iter().next()?;
     let active_intention = input.active_intention.clone();
     let outcome = if selected.goal_kind == crate::agent::GoalKind::ContinueCurrentIntention {
         DecisionOutcome::Continued
     } else if active_intention.is_some() {

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (25151) panicked at crates/tracewake-content/tests/fixtures_load.rs:1217:5:
assertion failed: report.ordinary_pipeline_events > 0

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
