*** crates/tracewake-core/src/agent/decision.rs:130:41: replace == with != in select_goal_and_trace

*** mutation diff:
--- crates/tracewake-core/src/agent/decision.rs
+++ replace == with != in select_goal_and_trace
@@ -122,17 +122,17 @@
         .candidates
         .iter()
         .filter(|candidate| candidate.applicability == ApplicabilityResult::Applicable)
         .cloned()
         .collect::<Vec<_>>();
     applicable.sort();
     let selected = applicable.into_iter().next()?;
     let active_intention = input.active_intention.clone();
-    let outcome = if selected.goal_kind == crate::agent::GoalKind::ContinueCurrentIntention {
+    let outcome = if selected.goal_kind != /* ~ changed by cargo-mutants ~ */ crate::agent::GoalKind::ContinueCurrentIntention {
         DecisionOutcome::Continued
     } else if active_intention.is_some() {
         DecisionOutcome::Switched
     } else {
         DecisionOutcome::Continued
     };
 
     let trace_id = DecisionTraceId::new(format!(

---- agent::decision::tests::mild_hunger_continues_active_intention stdout ----

thread 'agent::decision::tests::mild_hunger_continues_active_intention' (29368) panicked at crates/tracewake-core/src/agent/decision.rs:508:9:
assertion `left == right` failed
  left: Switched
 right: Continued

---- agent::decision::tests::severe_hunger_switches_and_emits_trace stdout ----

thread 'agent::decision::tests::severe_hunger_switches_and_emits_trace' (29370) panicked at crates/tracewake-core/src/agent/decision.rs:549:9:
assertion `left == right` failed
  left: Continued
 right: Switched

---- agent::decision::tests::urgent_need_vs_active_intention_follows_documented_order stdout ----

thread 'agent::decision::tests::urgent_need_vs_active_intention_follows_documented_order' (29371) panicked at crates/tracewake-core/src/agent/decision.rs:528:9:
assertion `left == right` failed
  left: Continued
 right: Switched

failures:
    agent::decision::tests::mild_hunger_continues_active_intention
    agent::decision::tests::severe_hunger_switches_and_emits_trace
    agent::decision::tests::urgent_need_vs_active_intention_follows_documented_order

test result: FAILED. 452 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
