*** crates/tracewake-core/src/agent/decision.rs:155:57: replace != with == in select_goal_and_trace

*** mutation diff:
--- crates/tracewake-core/src/agent/decision.rs
+++ replace != with == in select_goal_and_trace
@@ -147,17 +147,17 @@
         input.decision_tick,
         &selected,
         active_intention.as_ref(),
         &trace_id,
     );
     let rejected_goals = input
         .candidates
         .iter()
-        .filter(|candidate| candidate.candidate_goal_id != selected.candidate_goal_id)
+        .filter(|candidate| candidate.candidate_goal_id == /* ~ changed by cargo-mutants ~ */ selected.candidate_goal_id)
         .map(|candidate| RejectedDecisionItem {
             stable_ref: candidate.candidate_goal_id.to_string(),
             reason: candidate
                 .rejection_reason
                 .clone()
                 .unwrap_or_else(|| "lower_priority".to_string()),
         })
         .collect();

---- agent::decision::tests::severe_hunger_switches_and_emits_trace stdout ----

thread 'agent::decision::tests::severe_hunger_switches_and_emits_trace' (1461) panicked at crates/tracewake-core/src/agent/decision.rs:572:9:
assertion failed: selection.trace.rejected_goals.iter().all(|rejected|
        rejected.stable_ref !=
            selection.selected_goal.candidate_goal_id.as_str())

failures:
    agent::decision::tests::severe_hunger_switches_and_emits_trace

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
