*** crates/tracewake-core/src/agent/decision.rs:21:9: replace ActorKnownInputSourceClass::stable_id -> &'static str with "xyzzy"

*** mutation diff:
--- crates/tracewake-core/src/agent/decision.rs
+++ replace ActorKnownInputSourceClass::stable_id -> &'static str with "xyzzy"
@@ -13,24 +13,17 @@
     FixturePossibility,
     PipelineValidationTruth,
     DebugOmniscience,
     UnprovenPhysicalTruth,
 }
 
 impl ActorKnownInputSourceClass {
     pub const fn stable_id(&self) -> &'static str {
-        match self {
-            Self::ActorKnown(kind) => kind.stable_id(),
-            Self::RoutineAssignment => "routine_assignment",
-            Self::FixturePossibility => "fixture_possibility",
-            Self::PipelineValidationTruth => "pipeline_validation_truth",
-            Self::DebugOmniscience => "debug_omniscience",
-            Self::UnprovenPhysicalTruth => "unproven_physical_truth",
-        }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     pub const fn is_forbidden_for_cognition(&self) -> bool {
         matches!(
             self,
             Self::PipelineValidationTruth | Self::DebugOmniscience | Self::UnprovenPhysicalTruth
         )
     }

---- agent::decision::tests::actor_known_input_source_class_stable_ids_cover_all_variants stdout ----

thread 'agent::decision::tests::actor_known_input_source_class_stable_ids_cover_all_variants' (28436) panicked at crates/tracewake-core/src/agent/decision.rs:439:9:
assertion `left == right` failed
  left: ["xyzzy", "xyzzy", "xyzzy", "xyzzy", "xyzzy", "xyzzy", "xyzzy"]
 right: ["observation", "memory", "routine_assignment", "fixture_possibility", "pipeline_validation_truth", "debug_omniscience", "unproven_physical_truth"]

failures:
    agent::decision::tests::actor_known_input_source_class_stable_ids_cover_all_variants

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
