*** crates/tracewake-core/src/agent/decision.rs:254:27: replace == with != in lifecycle_effects

*** mutation diff:
--- crates/tracewake-core/src/agent/decision.rs
+++ replace == with != in lifecycle_effects
@@ -246,17 +246,17 @@
 
 fn lifecycle_effects(
     actor_id: &ActorId,
     decision_tick: SimTick,
     selected: &CandidateGoal,
     active_intention: Option<&Intention>,
     trace_id: &DecisionTraceId,
 ) -> Vec<IntentionLifecycleEffect> {
-    if selected.goal_kind == crate::agent::GoalKind::ContinueCurrentIntention {
+    if selected.goal_kind != /* ~ changed by cargo-mutants ~ */ crate::agent::GoalKind::ContinueCurrentIntention {
         return active_intention
             .map(|intention| {
                 vec![IntentionLifecycleEffect::Continued {
                     intention_id: intention.intention_id.clone(),
                     reason: "selected active intention continuation candidate".to_string(),
                 }]
             })
             .unwrap_or_default();

---- agent::decision::tests::mild_hunger_continues_active_intention stdout ----

thread 'agent::decision::tests::mild_hunger_continues_active_intention' (27806) panicked at crates/tracewake-core/src/agent/decision.rs:509:9:
assertion `left == right` failed
 right: [Continued { intention_id: IntentionId(StableId("intention_work")), reason: "selected active intention continuation candidate" }]

---- agent::decision::tests::severe_hunger_switches_and_emits_trace stdout ----

thread 'agent::decision::tests::severe_hunger_switches_and_emits_trace' (27808) panicked at crates/tracewake-core/src/agent/decision.rs:550:9:
assertion failed: matches!(&selection.lifecycle_effects[..],
    [IntentionLifecycleEffect::Interrupted { intention_id, reason },
    IntentionLifecycleEffect::Adopted { intention, reason: adoption_reason }]
    if intention_id.as_str() == "intention_work" &&
    reason.contains("severe_hunger") && intention.source ==
    IntentionSource::NeedPressure && intention.selected_goal_id ==
    selection.selected_goal.candidate_goal_id && intention.trace_ancestry ==
    vec![selection.trace.trace_id.clone()] && adoption_reason ==
    "selected candidate becomes active intention")

---- agent::decision::tests::urgent_need_vs_active_intention_follows_documented_order stdout ----

thread 'agent::decision::tests::urgent_need_vs_active_intention_follows_documented_order' (27809) panicked at crates/tracewake-core/src/agent/decision.rs:529:9:
assertion failed: matches!(&selection.lifecycle_effects[..],
    [IntentionLifecycleEffect::Interrupted { intention_id, reason },
    IntentionLifecycleEffect::Adopted { intention, .. }] if
    intention_id.as_str() == "intention_work" &&
    reason.contains("urgent_hunger_or_fatigue") && intention.source ==
    IntentionSource::NeedPressure && intention.selected_goal_id ==
    selection.selected_goal.candidate_goal_id)

failures:
    agent::decision::tests::mild_hunger_continues_active_intention
    agent::decision::tests::severe_hunger_switches_and_emits_trace
    agent::decision::tests::urgent_need_vs_active_intention_follows_documented_order
    agent::transaction::tests::transaction_links_candidate_intention_method_plan_and_proposal

test result: FAILED. 451 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
