*** crates/tracewake-core/src/agent/decision.rs:254:5: replace lifecycle_effects -> Vec<IntentionLifecycleEffect> with vec![]

*** mutation diff:
--- crates/tracewake-core/src/agent/decision.rs
+++ replace lifecycle_effects -> Vec<IntentionLifecycleEffect> with vec![]
@@ -246,60 +246,17 @@
 
 fn lifecycle_effects(
     actor_id: &ActorId,
     decision_tick: SimTick,
     selected: &CandidateGoal,
     active_intention: Option<&Intention>,
     trace_id: &DecisionTraceId,
 ) -> Vec<IntentionLifecycleEffect> {
-    if selected.goal_kind == crate::agent::GoalKind::ContinueCurrentIntention {
-        return active_intention
-            .map(|intention| {
-                vec![IntentionLifecycleEffect::Continued {
-                    intention_id: intention.intention_id.clone(),
-                    reason: "selected active intention continuation candidate".to_string(),
-                }]
-            })
-            .unwrap_or_default();
-    }
-
-    let mut effects = Vec::new();
-    if let Some(intention) = active_intention {
-        effects.push(IntentionLifecycleEffect::Interrupted {
-            intention_id: intention.intention_id.clone(),
-            reason: format!(
-                "interrupted by {} candidate {}",
-                selected.priority.stable_id(),
-                selected.candidate_goal_id.as_str()
-            ),
-        });
-    }
-
-    effects.push(IntentionLifecycleEffect::Adopted {
-        intention: Intention::adopt(
-            IntentionId::new(format!(
-                "intention_{}_{}_{}",
-                actor_id.as_str(),
-                decision_tick.value(),
-                selected.goal_kind.stable_id()
-            ))
-            .unwrap(),
-            actor_id.clone(),
-            intention_source_for(selected),
-            selected.candidate_goal_id.clone(),
-            selected.selected_routine_method.clone(),
-            Some(selected.goal_kind.stable_id().to_string()),
-            durability_level_for(selected),
-            decision_tick,
-            trace_id.clone(),
-        ),
-        reason: "selected candidate becomes active intention".to_string(),
-    });
-    effects
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn intention_source_for(selected: &CandidateGoal) -> IntentionSource {
     match selected.source {
         crate::agent::CandidateGoalSource::NeedPressure => IntentionSource::NeedPressure,
         crate::agent::CandidateGoalSource::RoutineDuty
         | crate::agent::CandidateGoalSource::FixtureRoutineAssignment => {
             IntentionSource::RoutineDuty

---- agent::decision::tests::mild_hunger_continues_active_intention stdout ----

thread 'agent::decision::tests::mild_hunger_continues_active_intention' (23235) panicked at crates/tracewake-core/src/agent/decision.rs:466:9:
assertion `left == right` failed
  left: []
 right: [Continued { intention_id: IntentionId(StableId("intention_work")), reason: "selected active intention continuation candidate" }]

---- agent::decision::tests::severe_hunger_switches_and_emits_trace stdout ----

thread 'agent::decision::tests::severe_hunger_switches_and_emits_trace' (23237) panicked at crates/tracewake-core/src/agent/decision.rs:507:9:
assertion failed: matches!(&selection.lifecycle_effects[..],
    [IntentionLifecycleEffect::Interrupted { intention_id, reason },
    IntentionLifecycleEffect::Adopted { intention, reason: adoption_reason }]
    if intention_id.as_str() == "intention_work" &&
    reason.contains("severe_hunger") && intention.source ==
    IntentionSource::NeedPressure && intention.selected_goal_id ==
    selection.selected_goal.candidate_goal_id && intention.trace_ancestry ==
    vec![selection.trace.trace_id.clone()] && adoption_reason ==
    "selected candidate becomes active intention")

---- agent::decision::tests::urgent_need_vs_active_intention_follows_documented_order stdout ----

thread 'agent::decision::tests::urgent_need_vs_active_intention_follows_documented_order' (23238) panicked at crates/tracewake-core/src/agent/decision.rs:486:9:
assertion failed: matches!(&selection.lifecycle_effects[..],
    [IntentionLifecycleEffect::Interrupted { intention_id, reason },
    IntentionLifecycleEffect::Adopted { intention, .. }] if
    intention_id.as_str() == "intention_work" &&
    reason.contains("urgent_hunger_or_fatigue") && intention.source ==
    IntentionSource::NeedPressure && intention.selected_goal_id ==
    selection.selected_goal.candidate_goal_id)

failures:
    agent::decision::tests::mild_hunger_continues_active_intention
    agent::decision::tests::severe_hunger_switches_and_emits_trace
    agent::decision::tests::urgent_need_vs_active_intention_follows_documented_order
    agent::transaction::tests::transaction_links_candidate_intention_method_plan_and_proposal

test result: FAILED. 451 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
