*** crates/tracewake-core/src/agent/decision.rs:318:5: replace durability_level_for -> u8 with 1

*** mutation diff:
--- crates/tracewake-core/src/agent/decision.rs
+++ replace durability_level_for -> u8 with 1
@@ -310,27 +310,17 @@
         crate::agent::CandidateGoalSource::CurrentIntentionContinuation => {
             IntentionSource::CandidateGoalSelection
         }
         crate::agent::CandidateGoalSource::Fallback => IntentionSource::Fallback,
     }
 }
 
 fn durability_level_for(selected: &CandidateGoal) -> u8 {
-    match selected.priority {
-        crate::agent::GoalPriority::SevereSafety
-        | crate::agent::GoalPriority::SevereHunger
-        | crate::agent::GoalPriority::SevereFatigue => 9,
-        crate::agent::GoalPriority::ActiveIntentionContinuation => 8,
-        crate::agent::GoalPriority::UrgentHungerOrFatigue => 7,
-        crate::agent::GoalPriority::RoutineWindowDuty
-        | crate::agent::GoalPriority::ReturnHomeOrSleepWindow => 6,
-        crate::agent::GoalPriority::IdleWithReason
-        | crate::agent::GoalPriority::MildNeedPressure => 4,
-    }
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::agent::generation::{generate_candidate_goals, CandidateGenerationInput};
     use crate::agent::{
         ActorKnownFact, GoalKind, Intention, IntentionSource, NeedChangeCause, NeedKind, NeedState,

---- agent::decision::tests::durability_levels_distinguish_priority_bands stdout ----

thread 'agent::decision::tests::durability_levels_distinguish_priority_bands' (4466) panicked at crates/tracewake-core/src/agent/decision.rs:452:9:
assertion `left == right` failed
  left: 1
 right: 9

failures:
    agent::decision::tests::durability_levels_distinguish_priority_bands

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
