*** crates/tracewake-core/src/agent/decision.rs:32:9: replace ActorKnownInputSourceClass::is_forbidden_for_cognition -> bool with true

*** mutation diff:
--- crates/tracewake-core/src/agent/decision.rs
+++ replace ActorKnownInputSourceClass::is_forbidden_for_cognition -> bool with true
@@ -24,20 +24,17 @@
             Self::FixturePossibility => "fixture_possibility",
             Self::PipelineValidationTruth => "pipeline_validation_truth",
             Self::DebugOmniscience => "debug_omniscience",
             Self::UnprovenPhysicalTruth => "unproven_physical_truth",
         }
     }
 
     pub const fn is_forbidden_for_cognition(&self) -> bool {
-        matches!(
-            self,
-            Self::PipelineValidationTruth | Self::DebugOmniscience | Self::UnprovenPhysicalTruth
-        )
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq)]
 pub struct ActorKnownInputRef {
     pub fact_id: String,
     pub proposition_id: Option<String>,
     pub provenance_edge_ids: Vec<String>,

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (344) panicked at crates/tracewake-content/tests/fixtures_load.rs:1217:5:
assertion failed: report.ordinary_pipeline_events > 0

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
