*** crates/tracewake-core/src/agent/decision.rs:32:9: replace ActorKnownInputSourceClass::is_forbidden_for_cognition -> bool with false

*** mutation diff:
--- crates/tracewake-core/src/agent/decision.rs
+++ replace ActorKnownInputSourceClass::is_forbidden_for_cognition -> bool with false
@@ -24,20 +24,17 @@
             Self::FixturePossibility => "fixture_possibility",
             Self::PipelineValidationTruth => "pipeline_validation_truth",
             Self::DebugOmniscience => "debug_omniscience",
             Self::UnprovenPhysicalTruth => "unproven_physical_truth",
         }
     }
 
     pub const fn is_forbidden_for_cognition(&self) -> bool {
-        matches!(
-            self,
-            Self::PipelineValidationTruth | Self::DebugOmniscience | Self::UnprovenPhysicalTruth
-        )
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq)]
 pub struct ActorKnownInputRef {
     pub fact_id: String,
     pub proposition_id: Option<String>,
     pub provenance_edge_ids: Vec<String>,

---- agent::decision::tests::hidden_truth_audit_rejects_forbidden_provenance_without_banned_words stdout ----

thread 'agent::decision::tests::hidden_truth_audit_rejects_forbidden_provenance_without_banned_words' (4560) panicked at crates/tracewake-core/src/agent/decision.rs:600:9:
assertion failed: !audit.actor_known_only

failures:
    agent::decision::tests::hidden_truth_audit_rejects_forbidden_provenance_without_banned_words

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
