*** crates/tracewake-core/src/agent/decision.rs:67:31: delete ! in ActorKnownInputRef::from_fact

*** mutation diff:
--- crates/tracewake-core/src/agent/decision.rs
+++ delete ! in ActorKnownInputRef::from_fact
@@ -59,17 +59,17 @@
             source_event_ids: fact
                 .source_event_ids()
                 .iter()
                 .map(|event_id| event_id.as_str().to_string())
                 .collect(),
             source_class,
             confidence: None,
             staleness: None,
-            explicit_unknown: !fact.is_actor_known(),
+            explicit_unknown:  /* ~ changed by cargo-mutants ~ */fact.is_actor_known(),
             display_note: fact.proof_note(),
         }
     }
 
     pub fn render_for_trace(&self) -> String {
         let source_events = if self.source_event_ids.is_empty() {
             "-".to_string()
         } else {

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (8947) panicked at crates/tracewake-content/tests/fixtures_load.rs:1217:5:
assertion failed: report.ordinary_pipeline_events > 0

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
