*** crates/tracewake-core/src/agent/decision.rs:73:9: replace ActorKnownInputRef::render_for_trace -> String with String::new()

*** mutation diff:
--- crates/tracewake-core/src/agent/decision.rs
+++ replace ActorKnownInputRef::render_for_trace -> String with String::new()
@@ -65,28 +65,17 @@
             confidence: None,
             staleness: None,
             explicit_unknown: !fact.is_actor_known(),
             display_note: fact.proof_note(),
         }
     }
 
     pub fn render_for_trace(&self) -> String {
-        let source_events = if self.source_event_ids.is_empty() {
-            "-".to_string()
-        } else {
-            self.source_event_ids.join(",")
-        };
-        format!(
-            "{}|source_class={}|explicit_unknown={}|source_events={}",
-            self.display_note,
-            self.source_class.stable_id(),
-            self.explicit_unknown,
-            source_events
-        )
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq)]
 pub struct DecisionInput {
     pub actor_id: ActorId,
     pub decision_tick: SimTick,
     pub candidates: Vec<CandidateGoal>,

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (12978) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
