*** crates/tracewake-core/src/agent/decision.rs:73:9: replace ActorKnownInputRef::render_for_trace -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-core/src/agent/decision.rs
+++ replace ActorKnownInputRef::render_for_trace -> String with "xyzzy".into()
@@ -65,28 +65,17 @@
             confidence: None,
             staleness: None,
             explicit_unknown: !fact.is_actor_known(),
             display_note: fact.proof_note(),
         }
     }
 
     pub fn render_for_trace(&self) -> String {
-        let source_events = if self.source_event_ids.is_empty() {
-            "-".to_string()
-        } else {
-            self.source_event_ids.join(",")
-        };
-        format!(
-            "{}|source_class={}|explicit_unknown={}|source_events={}",
-            self.display_note,
-            self.source_class.stable_id(),
-            self.explicit_unknown,
-            source_events
-        )
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq)]
 pub struct DecisionInput {
     pub actor_id: ActorId,
     pub decision_tick: SimTick,
     pub candidates: Vec<CandidateGoal>,

---- no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash stdout ----

thread 'no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash' (17053) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2914:18:
actor-known input records source_events

---- no_human_decision_context_hash_gate_fails_when_source_evidence_tampered stdout ----

thread 'no_human_decision_context_hash_gate_fails_when_source_evidence_tampered' (17054) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:831:5:
actor-known input records source_events

failures:
    no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash
    no_human_decision_context_hash_gate_fails_when_source_evidence_tampered

test result: FAILED. 40 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
