*** crates/tracewake-core/src/agent/generation.rs:101:13: delete match arm (NeedKind::Fatigue, NeedBand::Urgent) in generate_candidate_goals

*** mutation diff:
--- crates/tracewake-core/src/agent/generation.rs
+++ delete match arm (NeedKind::Fatigue, NeedBand::Urgent) in generate_candidate_goals
@@ -93,27 +93,17 @@
                 GoalPriority::UrgentHungerOrFatigue,
                 "hunger is urgent",
             )),
             (NeedKind::Hunger, NeedBand::Severe) => candidates.push(hunger_candidate(
                 input,
                 GoalPriority::SevereHunger,
                 "hunger is severe",
             )),
-            (NeedKind::Fatigue, NeedBand::Urgent) => candidates.push(candidate(
-                input,
-                "sleep_or_rest",
-                CandidateGoalSource::NeedPressure,
-                GoalKind::SleepOrRest,
-                GoalPriority::UrgentHungerOrFatigue,
-                "fatigue is urgent",
-                actor_known_fact_notes(&input.actor_known_facts),
-                ApplicabilityResult::Applicable,
-                None,
-            )),
+             /* ~ changed by cargo-mutants ~ */
             (NeedKind::Fatigue, NeedBand::Severe) => candidates.push(candidate(
                 input,
                 "sleep_or_rest",
                 CandidateGoalSource::NeedPressure,
                 GoalKind::SleepOrRest,
                 GoalPriority::SevereFatigue,
                 "fatigue is severe",
                 actor_known_fact_notes(&input.actor_known_facts),

---- tui_runs_no_human_day_and_inspects_real_post_run_panels stdout ----

thread 'tui_runs_no_human_day_and_inspects_real_post_run_panels' (32361) panicked at crates/tracewake-tui/tests/tui_acceptance.rs:674:5:
assertion failed: metrics.contains("need_crossings=5")

failures:
    tui_runs_no_human_day_and_inspects_real_post_run_panels

test result: FAILED. 10 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
