*** crates/tracewake-core/src/agent/generation.rs:112:13: delete match arm (NeedKind::Fatigue, NeedBand::Severe) in generate_candidate_goals

*** mutation diff:
--- crates/tracewake-core/src/agent/generation.rs
+++ delete match arm (NeedKind::Fatigue, NeedBand::Severe) in generate_candidate_goals
@@ -104,27 +104,17 @@
                 CandidateGoalSource::NeedPressure,
                 GoalKind::SleepOrRest,
                 GoalPriority::UrgentHungerOrFatigue,
                 "fatigue is urgent",
                 actor_known_fact_notes(&input.actor_known_facts),
                 ApplicabilityResult::Applicable,
                 None,
             )),
-            (NeedKind::Fatigue, NeedBand::Severe) => candidates.push(candidate(
-                input,
-                "sleep_or_rest",
-                CandidateGoalSource::NeedPressure,
-                GoalKind::SleepOrRest,
-                GoalPriority::SevereFatigue,
-                "fatigue is severe",
-                actor_known_fact_notes(&input.actor_known_facts),
-                ApplicabilityResult::Applicable,
-                None,
-            )),
+             /* ~ changed by cargo-mutants ~ */
             (NeedKind::Safety, NeedBand::Severe) => candidates.push(candidate(
                 input,
                 "leave_unsafe_place",
                 CandidateGoalSource::SafetyInterruption,
                 GoalKind::LeaveUnsafePlace,
                 GoalPriority::SevereSafety,
                 "safety is severe",
                 actor_known_fact_notes(&input.actor_known_facts),

---- episode_tamper_proration_poisons_replay stdout ----

thread 'episode_tamper_proration_poisons_replay' (3958) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2851:5:
assertion failed: has_event(&log, EventKind::SleepInterrupted)

failures:
    episode_tamper_proration_poisons_replay

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.59s

*** result: Failure(101)
