*** crates/tracewake-core/src/agent/generation.rs:123:13: delete match arm (NeedKind::Safety, NeedBand::Severe) in generate_candidate_goals

*** mutation diff:
--- crates/tracewake-core/src/agent/generation.rs
+++ delete match arm (NeedKind::Safety, NeedBand::Severe) in generate_candidate_goals
@@ -115,27 +115,17 @@
                 CandidateGoalSource::NeedPressure,
                 GoalKind::SleepOrRest,
                 GoalPriority::SevereFatigue,
                 "fatigue is severe",
                 actor_known_fact_notes(&input.actor_known_facts),
                 ApplicabilityResult::Applicable,
                 None,
             )),
-            (NeedKind::Safety, NeedBand::Severe) => candidates.push(candidate(
-                input,
-                "leave_unsafe_place",
-                CandidateGoalSource::SafetyInterruption,
-                GoalKind::LeaveUnsafePlace,
-                GoalPriority::SevereSafety,
-                "safety is severe",
-                actor_known_fact_notes(&input.actor_known_facts),
-                ApplicabilityResult::Applicable,
-                None,
-            )),
+             /* ~ changed by cargo-mutants ~ */
             _ => {}
         }
     }
 
     if let Some(goal_kind) = input.routine_window_goal {
         candidates.push(candidate(
             input,
             goal_kind.stable_id(),

---- severe_safety_without_known_exit_is_local_knowledge_blocker stdout ----

thread 'severe_safety_without_known_exit_is_local_knowledge_blocker' (8090) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1777:9:
expected no-exit severe safety to fail closed

---- severe_safety_with_known_exit_produces_move_and_replays stdout ----

thread 'severe_safety_with_known_exit_produces_move_and_replays' (8089) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1715:10:
severe safety should commit a move

failures:
    severe_safety_with_known_exit_produces_move_and_replays
    severe_safety_without_known_exit_is_local_knowledge_blocker

test result: FAILED. 40 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.58s

*** result: Failure(101)
