*** crates/tracewake-core/src/agent/generation.rs:180:38: replace == with != in hunger_candidate

*** mutation diff:
--- crates/tracewake-core/src/agent/generation.rs
+++ replace == with != in hunger_candidate
@@ -172,17 +172,17 @@
 fn hunger_candidate(
     input: &CandidateGenerationInput,
     priority: GoalPriority,
     reason: &str,
 ) -> CandidateGoal {
     let knows_food = input
         .actor_known_facts
         .iter()
-        .any(|fact| fact.stable_id() == "actor_knows_food_source" && fact.is_actor_known());
+        .any(|fact| fact.stable_id() != /* ~ changed by cargo-mutants ~ */ "actor_knows_food_source" && fact.is_actor_known());
     candidate(
         input,
         if knows_food { "eat" } else { "find_food" },
         CandidateGoalSource::NeedPressure,
         if knows_food {
             GoalKind::Eat
         } else {
             GoalKind::FindFood

---- planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit stdout ----

thread 'planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit' (16748) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1603:6:
called `Result::unwrap()` on an `Err` value: NoApplicableMethod { family: FindFood, reason: "no actor-known method inputs for find_food" }

failures:
    planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.61s

*** result: Failure(101)
