*** crates/tracewake-core/src/agent/generation.rs:180:67: replace && with || in hunger_candidate

*** mutation diff:
--- crates/tracewake-core/src/agent/generation.rs
+++ replace && with || in hunger_candidate
@@ -172,17 +172,17 @@
 fn hunger_candidate(
     input: &CandidateGenerationInput,
     priority: GoalPriority,
     reason: &str,
 ) -> CandidateGoal {
     let knows_food = input
         .actor_known_facts
         .iter()
-        .any(|fact| fact.stable_id() == "actor_knows_food_source" && fact.is_actor_known());
+        .any(|fact| fact.stable_id() == "actor_knows_food_source" || /* ~ changed by cargo-mutants ~ */ fact.is_actor_known());
     candidate(
         input,
         if knows_food { "eat" } else { "find_food" },
         CandidateGoalSource::NeedPressure,
         if knows_food {
             GoalKind::Eat
         } else {
             GoalKind::FindFood

---- agent::generation::tests::hidden_true_food_location_is_not_used_without_actor_belief stdout ----

thread 'agent::generation::tests::hidden_true_food_location_is_not_used_without_actor_belief' (12326) panicked at crates/tracewake-core/src/agent/generation.rs:448:9:
assertion failed: output.candidates.iter().any(|candidate|
        candidate.goal_kind == GoalKind::FindFood)

---- agent::generation::tests::unproven_food_fact_does_not_make_eat_applicable stdout ----

thread 'agent::generation::tests::unproven_food_fact_does_not_make_eat_applicable' (12331) panicked at crates/tracewake-core/src/agent/generation.rs:476:9:
assertion failed: output.candidates.iter().any(|candidate|
        candidate.goal_kind == GoalKind::FindFood)

failures:
    agent::generation::tests::hidden_true_food_location_is_not_used_without_actor_belief
    agent::generation::tests::unproven_food_fact_does_not_make_eat_applicable

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
