*** crates/tracewake-core/src/agent/generation.rs:199:5: replace actor_known_fact_notes -> Vec<String> with vec![String::new()]

*** mutation diff:
--- crates/tracewake-core/src/agent/generation.rs
+++ replace actor_known_fact_notes -> Vec<String> with vec![String::new()]
@@ -191,20 +191,17 @@
         reason,
         actor_known_fact_notes(&input.actor_known_facts),
         ApplicabilityResult::Applicable,
         None,
     )
 }
 
 fn actor_known_fact_notes(actor_known_facts: &[ActorKnownFact]) -> Vec<String> {
-    actor_known_facts
-        .iter()
-        .map(ActorKnownFact::proof_note)
-        .collect()
+    vec![String::new()] /* ~ changed by cargo-mutants ~ */
 }
 
 fn actor_known_input_refs(actor_known_facts: &[ActorKnownFact]) -> Vec<ActorKnownInputRef> {
     actor_known_facts
         .iter()
         .map(ActorKnownInputRef::from_fact)
         .collect()
 }

---- agent::generation::tests::generated_candidates_carry_actor_known_fact_notes stdout ----

thread 'agent::generation::tests::generated_candidates_carry_actor_known_fact_notes' (25542) panicked at crates/tracewake-core/src/agent/generation.rs:413:9:
assertion failed: output.candidates.iter().all(|candidate|
        candidate.belief_inputs == vec![expected_note.clone()])

failures:
    agent::generation::tests::generated_candidates_carry_actor_known_fact_notes

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
