*** crates/tracewake-core/src/agent/generation.rs:206:5: replace actor_known_input_refs -> Vec<ActorKnownInputRef> with vec![]

*** mutation diff:
--- crates/tracewake-core/src/agent/generation.rs
+++ replace actor_known_input_refs -> Vec<ActorKnownInputRef> with vec![]
@@ -198,20 +198,17 @@
 fn actor_known_fact_notes(actor_known_facts: &[ActorKnownFact]) -> Vec<String> {
     actor_known_facts
         .iter()
         .map(ActorKnownFact::proof_note)
         .collect()
 }
 
 fn actor_known_input_refs(actor_known_facts: &[ActorKnownFact]) -> Vec<ActorKnownInputRef> {
-    actor_known_facts
-        .iter()
-        .map(ActorKnownInputRef::from_fact)
-        .collect()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 #[allow(clippy::too_many_arguments)]
 fn candidate(
     input: &CandidateGenerationInput,
     suffix: &str,
     source: CandidateGoalSource,
     goal_kind: GoalKind,

---- no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash stdout ----

thread 'no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash' (2045) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2907:5:

---- severe_safety_with_known_exit_produces_move_and_replays stdout ----

thread 'severe_safety_with_known_exit_produces_move_and_replays' (2067) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1735:5:

---- no_human_decision_context_hash_gate_fails_when_source_evidence_tampered stdout ----

thread 'no_human_decision_context_hash_gate_fails_when_source_evidence_tampered' (2046) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:802:18:
decision trace records actor-known inputs

failures:
    no_human_day_real_run_replays_metrics_and_trace_projection
    no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash
    no_human_decision_context_hash_gate_fails_when_source_evidence_tampered
    severe_safety_with_known_exit_produces_move_and_replays

test result: FAILED. 38 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
