*** crates/tracewake-core/src/agent/generation.rs:59:5: replace need_crossing_triggers_candidate_reevaluation -> bool with true

*** mutation diff:
--- crates/tracewake-core/src/agent/generation.rs
+++ replace need_crossing_triggers_candidate_reevaluation -> bool with true
@@ -51,17 +51,17 @@
         actor_known_facts: input.actor_known_facts.clone(),
         routine_window_goal: input.routine_window_goal,
     })
 }
 
 pub const fn need_crossing_triggers_candidate_reevaluation(
     crossing: &NeedThresholdCrossing,
 ) -> bool {
-    matches!(crossing.direction, ThresholdDirection::IncreasingPressure)
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn generate_candidate_goals(input: &CandidateGenerationInput) -> CandidateGenerationOutput {
     let mut candidates = Vec::new();
     let active_needs = input
         .needs
         .iter()
         .map(|need| pressure_for_need(&input.actor_id, need))

---- agent::generation::tests::increasing_threshold_crossing_requests_candidate_reevaluation stdout ----

thread 'agent::generation::tests::increasing_threshold_crossing_requests_candidate_reevaluation' (9047) panicked at crates/tracewake-core/src/agent/generation.rs:531:9:
assertion failed: !need_crossing_triggers_candidate_reevaluation(&recovery.unwrap())

failures:
    agent::generation::tests::increasing_threshold_crossing_requests_candidate_reevaluation

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
