*** crates/tracewake-core/src/agent/generation.rs:86:13: delete match arm (NeedKind::Hunger, NeedBand::Rising) in generate_candidate_goals

*** mutation diff:
--- crates/tracewake-core/src/agent/generation.rs
+++ delete match arm (NeedKind::Hunger, NeedBand::Rising) in generate_candidate_goals
@@ -78,21 +78,17 @@
             actor_known_fact_notes(&input.actor_known_facts),
             ApplicabilityResult::Applicable,
             None,
         ));
     }
 
     for need in &input.needs {
         match (need.kind(), need.band()) {
-            (NeedKind::Hunger, NeedBand::Rising) => candidates.push(hunger_candidate(
-                input,
-                GoalPriority::MildNeedPressure,
-                "hunger is rising",
-            )),
+             /* ~ changed by cargo-mutants ~ */
             (NeedKind::Hunger, NeedBand::Urgent) => candidates.push(hunger_candidate(
                 input,
                 GoalPriority::UrgentHungerOrFatigue,
                 "hunger is urgent",
             )),
             (NeedKind::Hunger, NeedBand::Severe) => candidates.push(hunger_candidate(
                 input,
                 GoalPriority::SevereHunger,

---- agent::generation::tests::rising_hunger_adds_eat_candidate_without_erasing_active_intention stdout ----

thread 'agent::generation::tests::rising_hunger_adds_eat_candidate_without_erasing_active_intention' (18179) panicked at crates/tracewake-core/src/agent/generation.rs:331:9:
assertion failed: output.candidates.iter().any(|candidate| candidate.goal_kind == GoalKind::Eat)

failures:
    agent::generation::tests::rising_hunger_adds_eat_candidate_without_erasing_active_intention

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
