*** crates/tracewake-core/src/agent/generation.rs:91:13: delete match arm (NeedKind::Hunger, NeedBand::Urgent) in generate_candidate_goals

*** mutation diff:
--- crates/tracewake-core/src/agent/generation.rs
+++ delete match arm (NeedKind::Hunger, NeedBand::Urgent) in generate_candidate_goals
@@ -83,21 +83,17 @@
 
     for need in &input.needs {
         match (need.kind(), need.band()) {
             (NeedKind::Hunger, NeedBand::Rising) => candidates.push(hunger_candidate(
                 input,
                 GoalPriority::MildNeedPressure,
                 "hunger is rising",
             )),
-            (NeedKind::Hunger, NeedBand::Urgent) => candidates.push(hunger_candidate(
-                input,
-                GoalPriority::UrgentHungerOrFatigue,
-                "hunger is urgent",
-            )),
+             /* ~ changed by cargo-mutants ~ */
             (NeedKind::Hunger, NeedBand::Severe) => candidates.push(hunger_candidate(
                 input,
                 GoalPriority::SevereHunger,
                 "hunger is severe",
             )),
             (NeedKind::Fatigue, NeedBand::Urgent) => candidates.push(candidate(
                 input,
                 "sleep_or_rest",

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (22585) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2214:10:
canonical day includes a no-human consumed-food event to clone

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.58s

*** result: Failure(101)
