*** crates/tracewake-core/src/agent/generation.rs:96:13: delete match arm (NeedKind::Hunger, NeedBand::Severe) in generate_candidate_goals

*** mutation diff:
--- crates/tracewake-core/src/agent/generation.rs
+++ delete match arm (NeedKind::Hunger, NeedBand::Severe) in generate_candidate_goals
@@ -88,21 +88,17 @@
                 GoalPriority::MildNeedPressure,
                 "hunger is rising",
             )),
             (NeedKind::Hunger, NeedBand::Urgent) => candidates.push(hunger_candidate(
                 input,
                 GoalPriority::UrgentHungerOrFatigue,
                 "hunger is urgent",
             )),
-            (NeedKind::Hunger, NeedBand::Severe) => candidates.push(hunger_candidate(
-                input,
-                GoalPriority::SevereHunger,
-                "hunger is severe",
-            )),
+             /* ~ changed by cargo-mutants ~ */
             (NeedKind::Fatigue, NeedBand::Urgent) => candidates.push(candidate(
                 input,
                 "sleep_or_rest",
                 CandidateGoalSource::NeedPressure,
                 GoalKind::SleepOrRest,
                 GoalPriority::UrgentHungerOrFatigue,
                 "fatigue is urgent",
                 actor_known_fact_notes(&input.actor_known_facts),

---- no_hidden_truth_fixture_keeps_hidden_food_out_of_planner_inputs stdout ----

thread 'no_hidden_truth_fixture_keeps_hidden_food_out_of_planner_inputs' (26683) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1909:5:
assertion `left == right` failed
  left: IdleWithReason
 right: FindFood

---- planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit stdout ----

thread 'planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit' (26697) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1603:6:
called `Result::unwrap()` on an `Err` value: NoApplicableMethod { family: GoToWork, reason: "no actor-known method inputs for go_to_work" }

failures:
    no_hidden_truth_fixture_keeps_hidden_food_out_of_planner_inputs
    planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit

test result: FAILED. 40 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.62s

*** result: Failure(101)
