*** crates/tracewake-core/src/agent/htn.rs:157:9: replace TemplateConditionResolution::rejected_items -> Vec<RejectedDecisionItem> with vec![]

*** mutation diff:
--- crates/tracewake-core/src/agent/htn.rs
+++ replace TemplateConditionResolution::rejected_items -> Vec<RejectedDecisionItem> with vec![]
@@ -149,28 +149,17 @@
 struct TemplateConditionResolution {
     proof_sources: Vec<String>,
     rejected_conditions: Vec<(RoutineCondition, String)>,
     unknown_conditions: Vec<(RoutineCondition, String)>,
 }
 
 impl TemplateConditionResolution {
     fn rejected_items(&self, template: &RoutineTemplate) -> Vec<RejectedDecisionItem> {
-        self.rejected_conditions
-            .iter()
-            .chain(self.unknown_conditions.iter())
-            .map(|(condition, reason)| RejectedDecisionItem {
-                stable_ref: format!(
-                    "{}:{}",
-                    template.template_id.as_str(),
-                    condition.stable_id()
-                ),
-                reason: reason.clone(),
-            })
-            .collect()
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 }
 
 fn resolve_template_conditions(
     template: &RoutineTemplate,
     actor_known_state: &ActorKnownPlanningState,
     actor_known_facts: &[ActorKnownFact],
 ) -> TemplateConditionResolution {

---- planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit stdout ----

thread 'planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit' (14426) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1611:5:
assertion failed: !method.trace.rejected_methods.is_empty()

failures:
    planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.60s

*** result: Failure(101)
