*** crates/tracewake-core/src/agent/htn.rs:177:5: replace resolve_template_conditions -> TemplateConditionResolution with Default::default()

*** mutation diff:
--- crates/tracewake-core/src/agent/htn.rs
+++ replace resolve_template_conditions -> TemplateConditionResolution with Default::default()
@@ -169,38 +169,17 @@
     }
 }
 
 fn resolve_template_conditions(
     template: &RoutineTemplate,
     actor_known_state: &ActorKnownPlanningState,
     actor_known_facts: &[ActorKnownFact],
 ) -> TemplateConditionResolution {
-    let mut resolution = TemplateConditionResolution::default();
-    for condition in template
-        .applicability_conditions
-        .iter()
-        .chain(template.preconditions.iter())
-    {
-        match resolve_condition(condition, actor_known_state, actor_known_facts) {
-            ConditionResolution::Satisfied { proof_source } => {
-                resolution
-                    .proof_sources
-                    .push(format!("{}={proof_source}", condition.stable_id()));
-            }
-            ConditionResolution::Rejected { reason } => {
-                resolution.rejected_conditions.push((*condition, reason));
-            }
-            ConditionResolution::Unknown { reason } => {
-                resolution.unknown_conditions.push((*condition, reason));
-            }
-        }
-    }
-    resolution.proof_sources.sort();
-    resolution
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn resolve_condition(
     condition: &RoutineCondition,
     actor_known_state: &ActorKnownPlanningState,
     actor_known_facts: &[ActorKnownFact],
 ) -> ConditionResolution {
     match condition {

---- episode_tamper_proration_poisons_replay stdout ----

thread 'episode_tamper_proration_poisons_replay' (18517) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2851:5:
assertion failed: has_event(&log, EventKind::SleepInterrupted)

---- planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit stdout ----

thread 'planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit' (18537) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1611:5:
assertion failed: !method.trace.rejected_methods.is_empty()

failures:
    episode_tamper_proration_poisons_replay
    planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit

test result: FAILED. 40 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.59s

*** result: Failure(101)
