*** crates/tracewake-core/src/agent/htn.rs:221:17: replace && with || in resolve_condition

*** mutation diff:
--- crates/tracewake-core/src/agent/htn.rs
+++ replace && with || in resolve_condition
@@ -213,17 +213,17 @@
         RoutineCondition::FoodSourceBelievedAccessible => {
             if actor_known_state.known_food_sources().is_empty() {
                 return rejected(condition, "food source is not actor-known accessible");
             }
             satisfied(condition, "actor_known_state:known_food_sources")
         }
         RoutineCondition::ActorHasFoodSearchKnowledge => {
             if actor_known_state.known_food_sources().is_empty()
-                && !has_modeled_fact(actor_known_facts, "food_search_knowledge_local_visible")
+                || /* ~ changed by cargo-mutants ~ */ !has_modeled_fact(actor_known_facts, "food_search_knowledge_local_visible")
             {
                 return unknown(condition, "no modeled actor-known food search source");
             }
             satisfied(condition, "actor_known_state:food_search_source")
         }
         RoutineCondition::SearchSurfaceActorKnown => {
             if actor_known_state.known_food_sources().is_empty()
                 && actor_known_state.known_containers_by_place().is_empty()

---- agent::htn::tests::each_required_family_selects_applicable_method stdout ----

thread 'agent::htn::tests::each_required_family_selects_applicable_method' (22791) panicked at crates/tracewake-core/src/agent/htn.rs:454:22:
called `Result::unwrap()` on an `Err` value: NoApplicableMethod { family: FindFood, reason: "no actor-known method inputs for find_food" }

---- agent::htn::tests::modeled_food_search_conditions_require_actor_known_fact_or_state_surface stdout ----

thread 'agent::htn::tests::modeled_food_search_conditions_require_actor_known_fact_or_state_surface' (22795) panicked at crates/tracewake-core/src/agent/htn.rs:689:9:
assertion `left == right` failed
  left: Unknown { reason: "actor_has_food_search_knowledge unknown: no modeled actor-known food search source" }
 right: Satisfied { proof_source: "actor_has_food_search_knowledge:actor_known_state:food_search_source" }

failures:
    agent::htn::tests::each_required_family_selects_applicable_method
    agent::htn::tests::modeled_food_search_conditions_require_actor_known_fact_or_state_surface

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
