*** crates/tracewake-core/src/agent/htn.rs:221:20: delete ! in resolve_condition

*** mutation diff:
--- crates/tracewake-core/src/agent/htn.rs
+++ delete ! in resolve_condition
@@ -213,17 +213,17 @@
         RoutineCondition::FoodSourceBelievedAccessible => {
             if actor_known_state.known_food_sources().is_empty() {
                 return rejected(condition, "food source is not actor-known accessible");
             }
             satisfied(condition, "actor_known_state:known_food_sources")
         }
         RoutineCondition::ActorHasFoodSearchKnowledge => {
             if actor_known_state.known_food_sources().is_empty()
-                && !has_modeled_fact(actor_known_facts, "food_search_knowledge_local_visible")
+                &&  /* ~ changed by cargo-mutants ~ */has_modeled_fact(actor_known_facts, "food_search_knowledge_local_visible")
             {
                 return unknown(condition, "no modeled actor-known food search source");
             }
             satisfied(condition, "actor_known_state:food_search_source")
         }
         RoutineCondition::SearchSurfaceActorKnown => {
             if actor_known_state.known_food_sources().is_empty()
                 && actor_known_state.known_containers_by_place().is_empty()

---- agent::htn::tests::modeled_food_search_conditions_require_actor_known_fact_or_state_surface stdout ----

thread 'agent::htn::tests::modeled_food_search_conditions_require_actor_known_fact_or_state_surface' (27354) panicked at crates/tracewake-core/src/agent/htn.rs:682:9:
assertion failed: matches!(no_search, ConditionResolution::Unknown { .. })

---- agent::htn::tests::rejected_method_conditions_are_recorded_before_selected_method stdout ----

thread 'agent::htn::tests::rejected_method_conditions_are_recorded_before_selected_method' (27356) panicked at crates/tracewake-core/src/agent/htn.rs:619:9:
assertion failed: selection.trace.rejected_methods.iter().any(|item|
        item.stable_ref ==
                "routine_a_rejected_find_food:actor_has_food_search_knowledge"
            && item.reason.contains("unknown"))

failures:
    agent::htn::tests::modeled_food_search_conditions_require_actor_known_fact_or_state_surface
    agent::htn::tests::rejected_method_conditions_are_recorded_before_selected_method

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
