*** crates/tracewake-core/src/agent/htn.rs:229:17: replace && with || in resolve_condition

*** mutation diff:
--- crates/tracewake-core/src/agent/htn.rs
+++ replace && with || in resolve_condition
@@ -221,17 +221,17 @@
                 && !has_modeled_fact(actor_known_facts, "food_search_knowledge_local_visible")
             {
                 return unknown(condition, "no modeled actor-known food search source");
             }
             satisfied(condition, "actor_known_state:food_search_source")
         }
         RoutineCondition::SearchSurfaceActorKnown => {
             if actor_known_state.known_food_sources().is_empty()
-                && actor_known_state.known_containers_by_place().is_empty()
+                || /* ~ changed by cargo-mutants ~ */ actor_known_state.known_containers_by_place().is_empty()
                 && !has_modeled_fact(actor_known_facts, "food_search_knowledge_local_visible")
             {
                 return unknown(condition, "no actor-known search surface");
             }
             satisfied(condition, "actor_known_state:search_surface")
         }
         RoutineCondition::KnownRouteSurface => {
             if actor_known_state.known_edges().is_empty()

---- agent::htn::tests::each_required_family_selects_applicable_method stdout ----

thread 'agent::htn::tests::each_required_family_selects_applicable_method' (4000) panicked at crates/tracewake-core/src/agent/htn.rs:454:22:
called `Result::unwrap()` on an `Err` value: NoApplicableMethod { family: FindFood, reason: "no actor-known method inputs for find_food" }

---- agent::htn::tests::modeled_food_search_conditions_require_actor_known_fact_or_state_surface stdout ----

thread 'agent::htn::tests::modeled_food_search_conditions_require_actor_known_fact_or_state_surface' (4004) panicked at crates/tracewake-core/src/agent/htn.rs:706:9:
assertion `left == right` failed
  left: Unknown { reason: "search_surface_actor_known unknown: no actor-known search surface" }
 right: Satisfied { proof_source: "search_surface_actor_known:actor_known_state:search_surface" }

failures:
    agent::htn::tests::each_required_family_selects_applicable_method
    agent::htn::tests::modeled_food_search_conditions_require_actor_known_fact_or_state_surface

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
