*** crates/tracewake-core/src/agent/htn.rs:230:20: delete ! in resolve_condition

*** mutation diff:
--- crates/tracewake-core/src/agent/htn.rs
+++ delete ! in resolve_condition
@@ -222,17 +222,17 @@
             {
                 return unknown(condition, "no modeled actor-known food search source");
             }
             satisfied(condition, "actor_known_state:food_search_source")
         }
         RoutineCondition::SearchSurfaceActorKnown => {
             if actor_known_state.known_food_sources().is_empty()
                 && actor_known_state.known_containers_by_place().is_empty()
-                && !has_modeled_fact(actor_known_facts, "food_search_knowledge_local_visible")
+                &&  /* ~ changed by cargo-mutants ~ */has_modeled_fact(actor_known_facts, "food_search_knowledge_local_visible")
             {
                 return unknown(condition, "no actor-known search surface");
             }
             satisfied(condition, "actor_known_state:search_surface")
         }
         RoutineCondition::KnownRouteSurface => {
             if actor_known_state.known_edges().is_empty()
                 && !has_modeled_fact(actor_known_facts, condition.stable_id())

---- agent::htn::tests::modeled_food_search_conditions_require_actor_known_fact_or_state_surface stdout ----

thread 'agent::htn::tests::modeled_food_search_conditions_require_actor_known_fact_or_state_surface' (8564) panicked at crates/tracewake-core/src/agent/htn.rs:699:9:
assertion failed: matches!(no_surface, ConditionResolution::Unknown { .. })

failures:
    agent::htn::tests::modeled_food_search_conditions_require_actor_known_fact_or_state_surface

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
