*** crates/tracewake-core/src/agent/htn.rs:238:20: delete ! in resolve_condition

*** mutation diff:
--- crates/tracewake-core/src/agent/htn.rs
+++ delete ! in resolve_condition
@@ -230,17 +230,17 @@
                 && !has_modeled_fact(actor_known_facts, "food_search_knowledge_local_visible")
             {
                 return unknown(condition, "no actor-known search surface");
             }
             satisfied(condition, "actor_known_state:search_surface")
         }
         RoutineCondition::KnownRouteSurface => {
             if actor_known_state.known_edges().is_empty()
-                && !has_modeled_fact(actor_known_facts, condition.stable_id())
+                &&  /* ~ changed by cargo-mutants ~ */has_modeled_fact(actor_known_facts, condition.stable_id())
             {
                 return unknown(condition, "no actor-known route surface");
             }
             satisfied(condition, "actor_known_state:known_edges")
         }
         RoutineCondition::ActorKnowsWorkplace
         | RoutineCondition::WorkplaceAssignmentActive
         | RoutineCondition::ActorKnowsHome

---- agent::htn::tests::known_route_surface_accepts_either_known_edges_or_modeled_fact stdout ----

thread 'agent::htn::tests::known_route_surface_accepts_either_known_edges_or_modeled_fact' (17680) panicked at crates/tracewake-core/src/agent/htn.rs:734:9:
assertion failed: matches!(resolve_condition(&RoutineCondition::KnownRouteSurface,
    &no_edges_state, &[]), ConditionResolution::Unknown { .. })

failures:
    agent::htn::tests::known_route_surface_accepts_either_known_edges_or_modeled_fact

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
