*** crates/tracewake-core/src/agent/htn.rs:281:5: replace has_modeled_fact -> bool with true

*** mutation diff:
--- crates/tracewake-core/src/agent/htn.rs
+++ replace has_modeled_fact -> bool with true
@@ -273,17 +273,17 @@
                     format!("missing actor-known input {}", condition.stable_id()),
                 )
             }
         }
     }
 }
 
 fn has_modeled_fact(actor_known_facts: &[ActorKnownFact], expected: &str) -> bool {
-    modeled_fact_proof(actor_known_facts, expected).is_some()
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn modeled_fact_proof(actor_known_facts: &[ActorKnownFact], expected: &str) -> Option<String> {
     actor_known_facts
         .iter()
         .find(|fact| fact.stable_id() == expected && fact.is_actor_known())
         .map(|fact| fact.proof_note())
 }

---- episode_tamper_proration_poisons_replay stdout ----

thread 'episode_tamper_proration_poisons_replay' (22074) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2851:5:
assertion failed: has_event(&log, EventKind::SleepInterrupted)

failures:
    episode_tamper_proration_poisons_replay

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.61s

*** result: Failure(101)
