*** crates/tracewake-core/src/agent/htn.rs:281:5: replace has_modeled_fact -> bool with false

*** mutation diff:
--- crates/tracewake-core/src/agent/htn.rs
+++ replace has_modeled_fact -> bool with false
@@ -273,17 +273,17 @@
                     format!("missing actor-known input {}", condition.stable_id()),
                 )
             }
         }
     }
 }
 
 fn has_modeled_fact(actor_known_facts: &[ActorKnownFact], expected: &str) -> bool {
-    modeled_fact_proof(actor_known_facts, expected).is_some()
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn modeled_fact_proof(actor_known_facts: &[ActorKnownFact], expected: &str) -> Option<String> {
     actor_known_facts
         .iter()
         .find(|fact| fact.stable_id() == expected && fact.is_actor_known())
         .map(|fact| fact.proof_note())
 }

---- agent::htn::tests::known_route_surface_accepts_either_known_edges_or_modeled_fact stdout ----

thread 'agent::htn::tests::known_route_surface_accepts_either_known_edges_or_modeled_fact' (26338) panicked at crates/tracewake-core/src/agent/htn.rs:738:9:
assertion failed: matches!(resolve_condition(&RoutineCondition::KnownRouteSurface,
    &no_edges_state,
    &[observed_fact("known_route_surface", "home_tomas->market_square",
    "test:route_notice",)],), ConditionResolution::Satisfied { .. })

---- agent::htn::tests::modeled_food_search_conditions_require_actor_known_fact_or_state_surface stdout ----

thread 'agent::htn::tests::modeled_food_search_conditions_require_actor_known_fact_or_state_surface' (26340) panicked at crates/tracewake-core/src/agent/htn.rs:689:9:
assertion `left == right` failed
  left: Unknown { reason: "actor_has_food_search_knowledge unknown: no modeled actor-known food search source" }
 right: Satisfied { proof_source: "actor_has_food_search_knowledge:actor_known_state:food_search_source" }

failures:
    agent::htn::tests::known_route_surface_accepts_either_known_edges_or_modeled_fact
    agent::htn::tests::modeled_food_search_conditions_require_actor_known_fact_or_state_surface

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
