*** crates/tracewake-core/src/agent/htn.rs:285:5: replace modeled_fact_proof -> Option<String> with None

*** mutation diff:
--- crates/tracewake-core/src/agent/htn.rs
+++ replace modeled_fact_proof -> Option<String> with None
@@ -277,20 +277,17 @@
     }
 }
 
 fn has_modeled_fact(actor_known_facts: &[ActorKnownFact], expected: &str) -> bool {
     modeled_fact_proof(actor_known_facts, expected).is_some()
 }
 
 fn modeled_fact_proof(actor_known_facts: &[ActorKnownFact], expected: &str) -> Option<String> {
-    actor_known_facts
-        .iter()
-        .find(|fact| fact.stable_id() == expected && fact.is_actor_known())
-        .map(|fact| fact.proof_note())
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn satisfied(condition: &RoutineCondition, proof_source: impl Into<String>) -> ConditionResolution {
     ConditionResolution::Satisfied {
         proof_source: format!("{}:{}", condition.stable_id(), proof_source.into()),
     }
 }

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (30697) panicked at crates/tracewake-content/tests/fixtures_load.rs:1217:5:
assertion failed: report.ordinary_pipeline_events > 0

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
