*** crates/tracewake-core/src/agent/htn.rs:285:5: replace modeled_fact_proof -> Option<String> with Some(String::new())

*** mutation diff:
--- crates/tracewake-core/src/agent/htn.rs
+++ replace modeled_fact_proof -> Option<String> with Some(String::new())
@@ -277,20 +277,17 @@
     }
 }
 
 fn has_modeled_fact(actor_known_facts: &[ActorKnownFact], expected: &str) -> bool {
     modeled_fact_proof(actor_known_facts, expected).is_some()
 }
 
 fn modeled_fact_proof(actor_known_facts: &[ActorKnownFact], expected: &str) -> Option<String> {
-    actor_known_facts
-        .iter()
-        .find(|fact| fact.stable_id() == expected && fact.is_actor_known())
-        .map(|fact| fact.proof_note())
+    Some(String::new()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn satisfied(condition: &RoutineCondition, proof_source: impl Into<String>) -> ConditionResolution {
     ConditionResolution::Satisfied {
         proof_source: format!("{}:{}", condition.stable_id(), proof_source.into()),
     }
 }

---- episode_tamper_proration_poisons_replay stdout ----

thread 'episode_tamper_proration_poisons_replay' (2295) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2851:5:
assertion failed: has_event(&log, EventKind::SleepInterrupted)

---- planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit stdout ----

thread 'planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit' (2315) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1611:5:
assertion failed: !method.trace.rejected_methods.is_empty()

failures:
    episode_tamper_proration_poisons_replay
    planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit

test result: FAILED. 40 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.60s

*** result: Failure(101)
