*** crates/tracewake-core/src/agent/htn.rs:287:51: replace && with || in modeled_fact_proof

*** mutation diff:
--- crates/tracewake-core/src/agent/htn.rs
+++ replace && with || in modeled_fact_proof
@@ -279,17 +279,17 @@
 
 fn has_modeled_fact(actor_known_facts: &[ActorKnownFact], expected: &str) -> bool {
     modeled_fact_proof(actor_known_facts, expected).is_some()
 }
 
 fn modeled_fact_proof(actor_known_facts: &[ActorKnownFact], expected: &str) -> Option<String> {
     actor_known_facts
         .iter()
-        .find(|fact| fact.stable_id() == expected && fact.is_actor_known())
+        .find(|fact| fact.stable_id() == expected || /* ~ changed by cargo-mutants ~ */ fact.is_actor_known())
         .map(|fact| fact.proof_note())
 }
 
 fn satisfied(condition: &RoutineCondition, proof_source: impl Into<String>) -> ConditionResolution {
     ConditionResolution::Satisfied {
         proof_source: format!("{}:{}", condition.stable_id(), proof_source.into()),
     }
 }

---- episode_tamper_proration_poisons_replay stdout ----

thread 'episode_tamper_proration_poisons_replay' (10494) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2851:5:
assertion failed: has_event(&log, EventKind::SleepInterrupted)

---- planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit stdout ----

thread 'planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit' (10514) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1611:5:
assertion failed: !method.trace.rejected_methods.is_empty()

failures:
    episode_tamper_proration_poisons_replay
    planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit

test result: FAILED. 40 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.62s

*** result: Failure(101)
