*** crates/tracewake-core/src/agent/htn.rs:53:44: replace == with != in select_method_from_templates

*** mutation diff:
--- crates/tracewake-core/src/agent/htn.rs
+++ replace == with != in select_method_from_templates
@@ -45,17 +45,17 @@
     actor_known_state: &ActorKnownPlanningState,
     actor_known_facts: &[ActorKnownFact],
     tick: SimTick,
     templates: &[RoutineTemplate],
 ) -> Result<MethodSelection, MethodSelectionFailure> {
     let family = family_for_goal(selected_goal.goal_kind);
     let mut candidates = templates
         .iter()
-        .filter(|template| template.family == family)
+        .filter(|template| template.family != /* ~ changed by cargo-mutants ~ */ family)
         .cloned()
         .collect::<Vec<_>>();
     candidates.sort_by(|left, right| left.template_id.cmp(&right.template_id));
     let mut rejected_methods = Vec::new();
     let mut selected = None;
     let mut selected_proofs = Vec::new();
     for template in candidates {
         let resolution =

---- planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit stdout ----

thread 'planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit' (6216) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1603:6:
called `Result::unwrap()` on an `Err` value: NoApplicableMethod { family: EatMeal, reason: "no actor-known method inputs for eat_meal" }

---- episode_tamper_proration_poisons_replay stdout ----

thread 'episode_tamper_proration_poisons_replay' (6196) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2851:5:
assertion failed: has_event(&log, EventKind::SleepInterrupted)

failures:
    episode_tamper_proration_poisons_replay
    planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit

test result: FAILED. 40 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.58s

*** result: Failure(101)
