*** crates/tracewake-core/src/agent/htn.rs:63:54: replace && with || in select_method_from_templates

*** mutation diff:
--- crates/tracewake-core/src/agent/htn.rs
+++ replace && with || in select_method_from_templates
@@ -55,17 +55,17 @@
         .collect::<Vec<_>>();
     candidates.sort_by(|left, right| left.template_id.cmp(&right.template_id));
     let mut rejected_methods = Vec::new();
     let mut selected = None;
     let mut selected_proofs = Vec::new();
     for template in candidates {
         let resolution =
             resolve_template_conditions(&template, actor_known_state, actor_known_facts);
-        if resolution.rejected_conditions.is_empty() && resolution.unknown_conditions.is_empty() {
+        if resolution.rejected_conditions.is_empty() || /* ~ changed by cargo-mutants ~ */ resolution.unknown_conditions.is_empty() {
             selected_proofs = resolution.proof_sources;
             selected = Some(template);
             break;
         }
         rejected_methods.extend(resolution.rejected_items(&template));
     }
 
     let Some(template) = selected else {

---- planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit stdout ----

thread 'planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit' (10315) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1611:5:
assertion failed: !method.trace.rejected_methods.is_empty()

---- episode_tamper_proration_poisons_replay stdout ----

thread 'episode_tamper_proration_poisons_replay' (10295) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2851:5:
assertion failed: has_event(&log, EventKind::SleepInterrupted)

failures:
    episode_tamper_proration_poisons_replay
    planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit

test result: FAILED. 40 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.60s

*** result: Failure(101)
