*** crates/tracewake-core/src/agent/intention.rs:106:9: replace Intention::record_progress with ()

*** mutation diff:
--- crates/tracewake-core/src/agent/intention.rs
+++ replace Intention::record_progress with ()
@@ -98,18 +98,17 @@
             last_progress_tick: start_tick,
             status: IntentionStatus::Active,
             status_reason: None,
             trace_ancestry: vec![trace_id],
         }
     }
 
     pub fn record_progress(&mut self, tick: SimTick, step: impl Into<String>) {
-        self.last_progress_tick = tick;
-        self.current_step = Some(step.into());
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn suspend(&mut self, reason: impl Into<String>) -> Result<(), IntentionTransitionError> {
         self.transition(IntentionStatus::Suspended, reason)
     }
 
     pub fn complete(&mut self, reason: impl Into<String>) -> Result<(), IntentionTransitionError> {
         self.transition(IntentionStatus::Completed, reason)

---- agent_apply_matrix_observes_parser_arms_transitions_and_causality stdout ----

thread 'agent_apply_matrix_observes_parser_arms_transitions_and_causality' (13316) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:2521:5:
assertion `left == right` failed
  left: SimTick(0)
 right: SimTick(33)

failures:
    agent_apply_matrix_observes_parser_arms_transitions_and_causality

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
