*** crates/tracewake-core/src/agent/intention.rs:111:9: replace Intention::suspend -> Result<(), IntentionTransitionError> with Ok(())

*** mutation diff:
--- crates/tracewake-core/src/agent/intention.rs
+++ replace Intention::suspend -> Result<(), IntentionTransitionError> with Ok(())
@@ -103,17 +103,17 @@
     }
 
     pub fn record_progress(&mut self, tick: SimTick, step: impl Into<String>) {
         self.last_progress_tick = tick;
         self.current_step = Some(step.into());
     }
 
     pub fn suspend(&mut self, reason: impl Into<String>) -> Result<(), IntentionTransitionError> {
-        self.transition(IntentionStatus::Suspended, reason)
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn complete(&mut self, reason: impl Into<String>) -> Result<(), IntentionTransitionError> {
         self.transition(IntentionStatus::Completed, reason)
     }
 
     pub fn fail(&mut self, reason: impl Into<String>) -> Result<(), IntentionTransitionError> {
         self.transition(IntentionStatus::Failed, reason)

---- agent::intention::tests::active_intention_transitions_are_reason_bearing stdout ----

thread 'agent::intention::tests::active_intention_transitions_are_reason_bearing' (17581) panicked at crates/tracewake-core/src/agent/intention.rs:247:13:
assertion `left == right` failed
  left: Active
 right: Suspended

---- agent::intention::tests::suspended_intention_can_reactivate_with_reason stdout ----

thread 'agent::intention::tests::suspended_intention_can_reactivate_with_reason' (17585) panicked at crates/tracewake-core/src/agent/intention.rs:277:54:
called `Result::unwrap()` on an `Err` value: IllegalTransition { from: Active, to: Active }

---- events::apply::tests::agent_intention_transition_event_records_status_and_reason stdout ----

thread 'events::apply::tests::agent_intention_transition_event_records_status_and_reason' (17739) panicked at crates/tracewake-core/src/events/apply.rs:2154:9:
assertion `left == right` failed
  left: Active
 right: Suspended

failures:
    agent::intention::tests::active_intention_transitions_are_reason_bearing
    agent::intention::tests::suspended_intention_can_reactivate_with_reason
    events::apply::tests::agent_intention_transition_event_records_status_and_reason

test result: FAILED. 452 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
