*** crates/tracewake-core/src/agent/intention.rs:115:9: replace Intention::complete -> Result<(), IntentionTransitionError> with Ok(())

*** mutation diff:
--- crates/tracewake-core/src/agent/intention.rs
+++ replace Intention::complete -> Result<(), IntentionTransitionError> with Ok(())
@@ -107,17 +107,17 @@
         self.current_step = Some(step.into());
     }
 
     pub fn suspend(&mut self, reason: impl Into<String>) -> Result<(), IntentionTransitionError> {
         self.transition(IntentionStatus::Suspended, reason)
     }
 
     pub fn complete(&mut self, reason: impl Into<String>) -> Result<(), IntentionTransitionError> {
-        self.transition(IntentionStatus::Completed, reason)
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn fail(&mut self, reason: impl Into<String>) -> Result<(), IntentionTransitionError> {
         self.transition(IntentionStatus::Failed, reason)
     }
 
     pub fn abandon(&mut self, reason: impl Into<String>) -> Result<(), IntentionTransitionError> {
         self.transition(IntentionStatus::Abandoned, reason)

---- agent::intention::tests::completed_intention_cannot_be_reactivated_without_fresh_adoption stdout ----

thread 'agent::intention::tests::completed_intention_cannot_be_reactivated_without_fresh_adoption' (22142) panicked at crates/tracewake-core/src/agent/intention.rs:257:9:
assertion `left == right` failed
  left: IllegalTransition { from: Active, to: Active }
 right: IllegalTransition { from: Completed, to: Active }

---- agent::intention::tests::active_intention_transitions_are_reason_bearing stdout ----

thread 'agent::intention::tests::active_intention_transitions_are_reason_bearing' (22140) panicked at crates/tracewake-core/src/agent/intention.rs:247:13:
assertion `left == right` failed
  left: Active
 right: Completed

failures:
    agent::intention::tests::active_intention_transitions_are_reason_bearing
    agent::intention::tests::completed_intention_cannot_be_reactivated_without_fresh_adoption

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
