*** crates/tracewake-core/src/agent/intention.rs:119:9: replace Intention::fail -> Result<(), IntentionTransitionError> with Ok(())

*** mutation diff:
--- crates/tracewake-core/src/agent/intention.rs
+++ replace Intention::fail -> Result<(), IntentionTransitionError> with Ok(())
@@ -111,17 +111,17 @@
         self.transition(IntentionStatus::Suspended, reason)
     }
 
     pub fn complete(&mut self, reason: impl Into<String>) -> Result<(), IntentionTransitionError> {
         self.transition(IntentionStatus::Completed, reason)
     }
 
     pub fn fail(&mut self, reason: impl Into<String>) -> Result<(), IntentionTransitionError> {
-        self.transition(IntentionStatus::Failed, reason)
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn abandon(&mut self, reason: impl Into<String>) -> Result<(), IntentionTransitionError> {
         self.transition(IntentionStatus::Abandoned, reason)
     }
 
     pub fn interrupt(&mut self, reason: impl Into<String>) -> Result<(), IntentionTransitionError> {
         self.transition(IntentionStatus::Interrupted, reason)

---- agent::intention::tests::active_intention_transitions_are_reason_bearing stdout ----

thread 'agent::intention::tests::active_intention_transitions_are_reason_bearing' (26699) panicked at crates/tracewake-core/src/agent/intention.rs:247:13:
assertion `left == right` failed
  left: Active
 right: Failed

---- agent::intention::tests::completed_intention_cannot_be_reactivated_without_fresh_adoption stdout ----

thread 'agent::intention::tests::completed_intention_cannot_be_reactivated_without_fresh_adoption' (26701) panicked at crates/tracewake-core/src/agent/intention.rs:265:44:
called `Result::unwrap_err()` on an `Ok` value: ()

failures:
    agent::intention::tests::active_intention_transitions_are_reason_bearing
    agent::intention::tests::completed_intention_cannot_be_reactivated_without_fresh_adoption

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
