*** crates/tracewake-core/src/agent/intention.rs:123:9: replace Intention::abandon -> Result<(), IntentionTransitionError> with Ok(())

*** mutation diff:
--- crates/tracewake-core/src/agent/intention.rs
+++ replace Intention::abandon -> Result<(), IntentionTransitionError> with Ok(())
@@ -115,17 +115,17 @@
         self.transition(IntentionStatus::Completed, reason)
     }
 
     pub fn fail(&mut self, reason: impl Into<String>) -> Result<(), IntentionTransitionError> {
         self.transition(IntentionStatus::Failed, reason)
     }
 
     pub fn abandon(&mut self, reason: impl Into<String>) -> Result<(), IntentionTransitionError> {
-        self.transition(IntentionStatus::Abandoned, reason)
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn interrupt(&mut self, reason: impl Into<String>) -> Result<(), IntentionTransitionError> {
         self.transition(IntentionStatus::Interrupted, reason)
     }
 
     pub fn reactivate(
         &mut self,

---- agent::intention::tests::active_intention_transitions_are_reason_bearing stdout ----

thread 'agent::intention::tests::active_intention_transitions_are_reason_bearing' (31258) panicked at crates/tracewake-core/src/agent/intention.rs:247:13:
assertion `left == right` failed
  left: Active
 right: Abandoned

failures:
    agent::intention::tests::active_intention_transitions_are_reason_bearing

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
