*** crates/tracewake-core/src/agent/intention.rs:127:9: replace Intention::interrupt -> Result<(), IntentionTransitionError> with Ok(())

*** mutation diff:
--- crates/tracewake-core/src/agent/intention.rs
+++ replace Intention::interrupt -> Result<(), IntentionTransitionError> with Ok(())
@@ -119,17 +119,17 @@
         self.transition(IntentionStatus::Failed, reason)
     }
 
     pub fn abandon(&mut self, reason: impl Into<String>) -> Result<(), IntentionTransitionError> {
         self.transition(IntentionStatus::Abandoned, reason)
     }
 
     pub fn interrupt(&mut self, reason: impl Into<String>) -> Result<(), IntentionTransitionError> {
-        self.transition(IntentionStatus::Interrupted, reason)
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn reactivate(
         &mut self,
         reason: impl Into<String>,
     ) -> Result<(), IntentionTransitionError> {
         if self.status != IntentionStatus::Suspended {
             return Err(IntentionTransitionError::IllegalTransition {

---- agent::intention::tests::active_intention_transitions_are_reason_bearing stdout ----

thread 'agent::intention::tests::active_intention_transitions_are_reason_bearing' (3349) panicked at crates/tracewake-core/src/agent/intention.rs:247:13:
assertion `left == right` failed
  left: Active
 right: Interrupted

failures:
    agent::intention::tests::active_intention_transitions_are_reason_bearing

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
