*** crates/tracewake-core/src/agent/intention.rs:134:24: replace != with == in Intention::reactivate

*** mutation diff:
--- crates/tracewake-core/src/agent/intention.rs
+++ replace != with == in Intention::reactivate
@@ -126,17 +126,17 @@
     pub fn interrupt(&mut self, reason: impl Into<String>) -> Result<(), IntentionTransitionError> {
         self.transition(IntentionStatus::Interrupted, reason)
     }
 
     pub fn reactivate(
         &mut self,
         reason: impl Into<String>,
     ) -> Result<(), IntentionTransitionError> {
-        if self.status != IntentionStatus::Suspended {
+        if self.status == /* ~ changed by cargo-mutants ~ */ IntentionStatus::Suspended {
             return Err(IntentionTransitionError::IllegalTransition {
                 from: self.status,
                 to: IntentionStatus::Active,
             });
         }
 
         self.status = IntentionStatus::Active;
         self.status_reason = Some(reason.into());

---- agent::intention::tests::completed_intention_cannot_be_reactivated_without_fresh_adoption stdout ----

thread 'agent::intention::tests::completed_intention_cannot_be_reactivated_without_fresh_adoption' (12470) panicked at crates/tracewake-core/src/agent/intention.rs:258:49:
called `Result::unwrap_err()` on an `Ok` value: ()

---- agent::intention::tests::suspended_intention_can_reactivate_with_reason stdout ----

thread 'agent::intention::tests::suspended_intention_can_reactivate_with_reason' (12472) panicked at crates/tracewake-core/src/agent/intention.rs:277:54:
called `Result::unwrap()` on an `Err` value: IllegalTransition { from: Suspended, to: Active }

failures:
    agent::intention::tests::completed_intention_cannot_be_reactivated_without_fresh_adoption
    agent::intention::tests::suspended_intention_can_reactivate_with_reason

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
