*** crates/tracewake-core/src/agent/intention.rs:134:9: replace Intention::reactivate -> Result<(), IntentionTransitionError> with Ok(())

*** mutation diff:
--- crates/tracewake-core/src/agent/intention.rs
+++ replace Intention::reactivate -> Result<(), IntentionTransitionError> with Ok(())
@@ -126,26 +126,17 @@
     pub fn interrupt(&mut self, reason: impl Into<String>) -> Result<(), IntentionTransitionError> {
         self.transition(IntentionStatus::Interrupted, reason)
     }
 
     pub fn reactivate(
         &mut self,
         reason: impl Into<String>,
     ) -> Result<(), IntentionTransitionError> {
-        if self.status != IntentionStatus::Suspended {
-            return Err(IntentionTransitionError::IllegalTransition {
-                from: self.status,
-                to: IntentionStatus::Active,
-            });
-        }
-
-        self.status = IntentionStatus::Active;
-        self.status_reason = Some(reason.into());
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn transition(
         &mut self,
         to: IntentionStatus,
         reason: impl Into<String>,
     ) -> Result<(), IntentionTransitionError> {
         if self.status.is_terminal() {

---- agent::intention::tests::completed_intention_cannot_be_reactivated_without_fresh_adoption stdout ----

thread 'agent::intention::tests::completed_intention_cannot_be_reactivated_without_fresh_adoption' (7911) panicked at crates/tracewake-core/src/agent/intention.rs:249:49:
called `Result::unwrap_err()` on an `Ok` value: ()

---- agent::intention::tests::suspended_intention_can_reactivate_with_reason stdout ----

thread 'agent::intention::tests::suspended_intention_can_reactivate_with_reason' (7913) panicked at crates/tracewake-core/src/agent/intention.rs:270:9:
assertion `left == right` failed
  left: Suspended
 right: Active

failures:
    agent::intention::tests::completed_intention_cannot_be_reactivated_without_fresh_adoption
    agent::intention::tests::suspended_intention_can_reactivate_with_reason

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
