*** crates/tracewake-core/src/agent/intention.rs:151:9: replace Intention::transition -> Result<(), IntentionTransitionError> with Ok(())

*** mutation diff:
--- crates/tracewake-core/src/agent/intention.rs
+++ replace Intention::transition -> Result<(), IntentionTransitionError> with Ok(())
@@ -143,32 +143,17 @@
         Ok(())
     }
 
     fn transition(
         &mut self,
         to: IntentionStatus,
         reason: impl Into<String>,
     ) -> Result<(), IntentionTransitionError> {
-        if self.status.is_terminal() {
-            return Err(IntentionTransitionError::IllegalTransition {
-                from: self.status,
-                to,
-            });
-        }
-
-        if self.status == to {
-            return Err(IntentionTransitionError::NoopTransition {
-                status: self.status,
-            });
-        }
-
-        self.status = to;
-        self.status_reason = Some(reason.into());
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Debug, Default, PartialEq, Eq)]
 pub struct ActorIntentions {
     pub active: Option<Intention>,
     pub suspended: Vec<Intention>,
 }

---- agent::intention::tests::suspended_intention_can_reactivate_with_reason stdout ----

thread 'agent::intention::tests::suspended_intention_can_reactivate_with_reason' (17031) panicked at crates/tracewake-core/src/agent/intention.rs:262:54:
called `Result::unwrap()` on an `Err` value: IllegalTransition { from: Active, to: Active }

---- agent::intention::tests::completed_intention_cannot_be_reactivated_without_fresh_adoption stdout ----

thread 'agent::intention::tests::completed_intention_cannot_be_reactivated_without_fresh_adoption' (17029) panicked at crates/tracewake-core/src/agent/intention.rs:242:9:
assertion `left == right` failed
  left: IllegalTransition { from: Active, to: Active }
 right: IllegalTransition { from: Completed, to: Active }

---- agent::intention::tests::active_intention_transitions_are_reason_bearing stdout ----

thread 'agent::intention::tests::active_intention_transitions_are_reason_bearing' (17027) panicked at crates/tracewake-core/src/agent/intention.rs:232:13:
assertion `left == right` failed
  left: Active
 right: Suspended

failures:
    agent::intention::tests::active_intention_transitions_are_reason_bearing
    agent::intention::tests::completed_intention_cannot_be_reactivated_without_fresh_adoption
    agent::intention::tests::suspended_intention_can_reactivate_with_reason
    events::apply::tests::agent_intention_transition_event_records_status_and_reason

test result: FAILED. 451 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
