*** crates/tracewake-core/src/agent/intention.rs:158:24: replace == with != in Intention::transition

*** mutation diff:
--- crates/tracewake-core/src/agent/intention.rs
+++ replace == with != in Intention::transition
@@ -150,17 +150,17 @@
     ) -> Result<(), IntentionTransitionError> {
         if self.status.is_terminal() {
             return Err(IntentionTransitionError::IllegalTransition {
                 from: self.status,
                 to,
             });
         }
 
-        if self.status == to {
+        if self.status != /* ~ changed by cargo-mutants ~ */ to {
             return Err(IntentionTransitionError::NoopTransition {
                 status: self.status,
             });
         }
 
         self.status = to;
         self.status_reason = Some(reason.into());
         Ok(())

---- agent::intention::tests::active_intention_transitions_are_reason_bearing stdout ----

thread 'agent::intention::tests::active_intention_transitions_are_reason_bearing' (21586) panicked at crates/tracewake-core/src/agent/intention.rs:239:73:
called `Result::unwrap()` on an `Err` value: NoopTransition { status: Active }

---- agent::intention::tests::completed_intention_cannot_be_reactivated_without_fresh_adoption stdout ----

thread 'agent::intention::tests::completed_intention_cannot_be_reactivated_without_fresh_adoption' (21588) panicked at crates/tracewake-core/src/agent/intention.rs:255:48:
called `Result::unwrap()` on an `Err` value: NoopTransition { status: Active }

---- agent::intention::tests::suspended_intention_can_reactivate_with_reason stdout ----

thread 'agent::intention::tests::suspended_intention_can_reactivate_with_reason' (21590) panicked at crates/tracewake-core/src/agent/intention.rs:276:43:
called `Result::unwrap()` on an `Err` value: NoopTransition { status: Active }

failures:
    agent::intention::tests::active_intention_transitions_are_reason_bearing
    agent::intention::tests::completed_intention_cannot_be_reactivated_without_fresh_adoption
    agent::intention::tests::suspended_intention_can_reactivate_with_reason
    events::apply::tests::agent_intention_transition_event_records_status_and_reason

test result: FAILED. 451 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
