*** crates/tracewake-core/src/agent/intention.rs:16:9: replace IntentionStatus::stable_id -> &'static str with ""

*** mutation diff:
--- crates/tracewake-core/src/agent/intention.rs
+++ replace IntentionStatus::stable_id -> &'static str with ""
@@ -8,24 +8,17 @@
     Completed,
     Failed,
     Abandoned,
     Interrupted,
 }
 
 impl IntentionStatus {
     pub const fn stable_id(self) -> &'static str {
-        match self {
-            IntentionStatus::Active => "active",
-            IntentionStatus::Suspended => "suspended",
-            IntentionStatus::Completed => "completed",
-            IntentionStatus::Failed => "failed",
-            IntentionStatus::Abandoned => "abandoned",
-            IntentionStatus::Interrupted => "interrupted",
-        }
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     pub const fn is_terminal(self) -> bool {
         matches!(
             self,
             IntentionStatus::Completed
                 | IntentionStatus::Failed
                 | IntentionStatus::Abandoned

---- agent::intention::tests::intention_status_stable_ids_cover_all_variants stdout ----

thread 'agent::intention::tests::intention_status_stable_ids_cover_all_variants' (18903) panicked at crates/tracewake-core/src/agent/intention.rs:306:13:
assertion `left == right` failed
  left: ""
 right: "active"

failures:
    agent::intention::tests::intention_status_stable_ids_cover_all_variants

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
