*** crates/tracewake-core/src/agent/intention.rs:178:29: replace != with == in ActorIntentions::adopt_active

*** mutation diff:
--- crates/tracewake-core/src/agent/intention.rs
+++ replace != with == in ActorIntentions::adopt_active
@@ -170,17 +170,17 @@
 #[derive(Clone, Debug, Default, PartialEq, Eq)]
 pub struct ActorIntentions {
     pub active: Option<Intention>,
     pub suspended: Vec<Intention>,
 }
 
 impl ActorIntentions {
     pub fn adopt_active(&mut self, intention: Intention) -> Result<(), IntentionTransitionError> {
-        if intention.status != IntentionStatus::Active {
+        if intention.status == /* ~ changed by cargo-mutants ~ */ IntentionStatus::Active {
             return Err(IntentionTransitionError::AdoptedIntentionNotActive {
                 status: intention.status,
             });
         }
 
         if self.active.is_some() {
             return Err(IntentionTransitionError::ActiveIntentionAlreadyExists);
         }

---- agent::intention::tests::actor_intentions_allow_at_most_one_active_intention stdout ----

thread 'agent::intention::tests::actor_intentions_allow_at_most_one_active_intention' (30705) panicked at crates/tracewake-core/src/agent/intention.rs:291:14:
called `Result::unwrap()` on an `Err` value: AdoptedIntentionNotActive { status: Active }

failures:
    agent::intention::tests::actor_intentions_allow_at_most_one_active_intention

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
