*** crates/tracewake-core/src/agent/intention.rs:178:9: replace ActorIntentions::adopt_active -> Result<(), IntentionTransitionError> with Ok(())

*** mutation diff:
--- crates/tracewake-core/src/agent/intention.rs
+++ replace ActorIntentions::adopt_active -> Result<(), IntentionTransitionError> with Ok(())
@@ -170,28 +170,17 @@
 #[derive(Clone, Debug, Default, PartialEq, Eq)]
 pub struct ActorIntentions {
     pub active: Option<Intention>,
     pub suspended: Vec<Intention>,
 }
 
 impl ActorIntentions {
     pub fn adopt_active(&mut self, intention: Intention) -> Result<(), IntentionTransitionError> {
-        if intention.status != IntentionStatus::Active {
-            return Err(IntentionTransitionError::AdoptedIntentionNotActive {
-                status: intention.status,
-            });
-        }
-
-        if self.active.is_some() {
-            return Err(IntentionTransitionError::ActiveIntentionAlreadyExists);
-        }
-
-        self.active = Some(intention);
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq)]
 pub enum IntentionTransitionError {
     IllegalTransition {
         from: IntentionStatus,
         to: IntentionStatus,

---- agent::intention::tests::actor_intentions_allow_at_most_one_active_intention stdout ----

thread 'agent::intention::tests::actor_intentions_allow_at_most_one_active_intention' (26146) panicked at crates/tracewake-core/src/agent/intention.rs:285:18:
called `Result::unwrap_err()` on an `Ok` value: ()

failures:
    agent::intention::tests::actor_intentions_allow_at_most_one_active_intention

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
