*** crates/tracewake-core/src/agent/intention.rs:27:9: replace IntentionStatus::is_terminal -> bool with true

*** mutation diff:
--- crates/tracewake-core/src/agent/intention.rs
+++ replace IntentionStatus::is_terminal -> bool with true
@@ -19,23 +19,17 @@
             IntentionStatus::Completed => "completed",
             IntentionStatus::Failed => "failed",
             IntentionStatus::Abandoned => "abandoned",
             IntentionStatus::Interrupted => "interrupted",
         }
     }
 
     pub const fn is_terminal(self) -> bool {
-        matches!(
-            self,
-            IntentionStatus::Completed
-                | IntentionStatus::Failed
-                | IntentionStatus::Abandoned
-                | IntentionStatus::Interrupted
-        )
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Copy, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
 pub enum IntentionSource {
     NeedPressure,
     RoutineDuty,
     CandidateGoalSelection,

---- agent::intention::tests::active_intention_transitions_are_reason_bearing stdout ----

thread 'agent::intention::tests::active_intention_transitions_are_reason_bearing' (28018) panicked at crates/tracewake-core/src/agent/intention.rs:233:73:
called `Result::unwrap()` on an `Err` value: IllegalTransition { from: Active, to: Suspended }

---- agent::intention::tests::completed_intention_cannot_be_reactivated_without_fresh_adoption stdout ----

thread 'agent::intention::tests::completed_intention_cannot_be_reactivated_without_fresh_adoption' (28020) panicked at crates/tracewake-core/src/agent/intention.rs:249:48:
called `Result::unwrap()` on an `Err` value: IllegalTransition { from: Active, to: Completed }

---- agent::intention::tests::intention_status_stable_ids_cover_all_variants stdout ----

thread 'agent::intention::tests::intention_status_stable_ids_cover_all_variants' (28021) panicked at crates/tracewake-core/src/agent/intention.rs:308:13:
assertion `left == right` failed
  left: true
 right: false

failures:
    agent::intention::tests::active_intention_transitions_are_reason_bearing
    agent::intention::tests::completed_intention_cannot_be_reactivated_without_fresh_adoption
    agent::intention::tests::intention_status_stable_ids_cover_all_variants
    agent::intention::tests::suspended_intention_can_reactivate_with_reason
    events::apply::tests::agent_intention_transition_event_records_status_and_reason

test result: FAILED. 450 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
