*** crates/tracewake-core/src/agent/intention.rs:27:9: replace IntentionStatus::is_terminal -> bool with false

*** mutation diff:
--- crates/tracewake-core/src/agent/intention.rs
+++ replace IntentionStatus::is_terminal -> bool with false
@@ -19,23 +19,17 @@
             IntentionStatus::Completed => "completed",
             IntentionStatus::Failed => "failed",
             IntentionStatus::Abandoned => "abandoned",
             IntentionStatus::Interrupted => "interrupted",
         }
     }
 
     pub const fn is_terminal(self) -> bool {
-        matches!(
-            self,
-            IntentionStatus::Completed
-                | IntentionStatus::Failed
-                | IntentionStatus::Abandoned
-                | IntentionStatus::Interrupted
-        )
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Copy, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
 pub enum IntentionSource {
     NeedPressure,
     RoutineDuty,
     CandidateGoalSelection,

---- agent::intention::tests::intention_status_stable_ids_cover_all_variants stdout ----

thread 'agent::intention::tests::intention_status_stable_ids_cover_all_variants' (32580) panicked at crates/tracewake-core/src/agent/intention.rs:308:13:
assertion `left == right` failed
  left: false
 right: true

---- agent::intention::tests::completed_intention_cannot_be_reactivated_without_fresh_adoption stdout ----

thread 'agent::intention::tests::completed_intention_cannot_be_reactivated_without_fresh_adoption' (32579) panicked at crates/tracewake-core/src/agent/intention.rs:259:44:
called `Result::unwrap_err()` on an `Ok` value: ()

failures:
    agent::intention::tests::completed_intention_cannot_be_reactivated_without_fresh_adoption
    agent::intention::tests::intention_status_stable_ids_cover_all_variants

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
