*** crates/tracewake-core/src/agent/intention.rs:49:9: replace IntentionSource::stable_id -> &'static str with ""

*** mutation diff:
--- crates/tracewake-core/src/agent/intention.rs
+++ replace IntentionSource::stable_id -> &'static str with ""
@@ -41,24 +41,17 @@
     CandidateGoalSelection,
     SafetyInterruption,
     FixtureRoutineAssignment,
     Fallback,
 }
 
 impl IntentionSource {
     pub const fn stable_id(self) -> &'static str {
-        match self {
-            IntentionSource::NeedPressure => "need_pressure",
-            IntentionSource::RoutineDuty => "routine_duty",
-            IntentionSource::CandidateGoalSelection => "candidate_goal_selection",
-            IntentionSource::SafetyInterruption => "safety_interruption",
-            IntentionSource::FixtureRoutineAssignment => "fixture_routine_assignment",
-            IntentionSource::Fallback => "fallback",
-        }
+        "" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
 pub struct Intention {
     pub intention_id: IntentionId,
     pub actor_id: ActorId,
     pub source: IntentionSource,

---- episode_tamper_proration_poisons_replay stdout ----

thread 'episode_tamper_proration_poisons_replay' (4496) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:
agent event applies to live state: BadPayload { key: "source", value: "" }

---- severe_safety_with_known_exit_produces_move_and_replays stdout ----

thread 'severe_safety_with_known_exit_produces_move_and_replays' (4527) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:
agent event applies to live state: BadPayload { key: "source", value: "" }

---- wait_then_window_passive_charges_each_tick_once stdout ----

thread 'wait_then_window_passive_charges_each_tick_once' (4532) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:
agent event applies to live state: BadPayload { key: "source", value: "" }

failures:
    episode_tamper_proration_poisons_replay
    severe_safety_with_known_exit_produces_move_and_replays
    wait_then_window_passive_charges_each_tick_once

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.63s

*** result: Failure(101)
