*** crates/tracewake-core/src/agent/methods.rs:138:5: replace all_steps_are_proposals -> bool with false

*** mutation diff:
--- crates/tracewake-core/src/agent/methods.rs
+++ replace all_steps_are_proposals -> bool with false
@@ -130,21 +130,17 @@
         GoalKind::ReturnHome => RoutineFamily::ReturnHome,
         GoalKind::LeaveUnsafePlace => RoutineFamily::LeaveUnsafePlace,
         GoalKind::ContinueCurrentIntention => RoutineFamily::ContinueCurrentIntention,
         GoalKind::IdleWithReason => RoutineFamily::Wait,
     }
 }
 
 pub fn all_steps_are_proposals(template: &RoutineTemplate) -> bool {
-    template.steps.iter().all(|step| match step.proposed() {
-        RoutineStepProposal::Action(action_id) => !action_id.as_str().is_empty(),
-        RoutineStepProposal::Wait(reason) => !reason.is_empty(),
-        RoutineStepProposal::Diagnostic(diagnostic) => !diagnostic.stable_id().is_empty(),
-    })
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn step(kind: &str, action_id: &str) -> RoutineStep {
     let action_id = SemanticActionId::new(action_id).unwrap();
     match kind {
         "move_toward_place" => RoutineStep::MoveTowardPlace { action_id },
         "check_known_container" => RoutineStep::CheckKnownContainer { action_id },
         "consume_accessible_food" => RoutineStep::ConsumeAccessibleFood { action_id },

---- agent::methods::tests::proposal_step_validation_rejects_empty_wait_payload stdout ----

thread 'agent::methods::tests::proposal_step_validation_rejects_empty_wait_payload' (11417) panicked at crates/tracewake-core/src/agent/methods.rs:257:9:
assertion failed: all_steps_are_proposals(&template)

---- agent::methods::tests::all_required_families_have_proposal_steps stdout ----

thread 'agent::methods::tests::all_required_families_have_proposal_steps' (11413) panicked at crates/tracewake-core/src/agent/methods.rs:216:9:
assertion failed: templates.iter().all(all_steps_are_proposals)

---- agent::methods::tests::proposal_step_validation_accepts_typed_diagnostic_payload stdout ----

thread 'agent::methods::tests::proposal_step_validation_accepts_typed_diagnostic_payload' (11416) panicked at crates/tracewake-core/src/agent/methods.rs:275:9:
assertion failed: all_steps_are_proposals(&template)

failures:
    agent::methods::tests::all_required_families_have_proposal_steps
    agent::methods::tests::proposal_step_validation_accepts_typed_diagnostic_payload
    agent::methods::tests::proposal_step_validation_rejects_empty_wait_payload

test result: FAILED. 452 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
