*** crates/tracewake-core/src/agent/methods.rs:139:51: delete ! in all_steps_are_proposals

*** mutation diff:
--- crates/tracewake-core/src/agent/methods.rs
+++ delete ! in all_steps_are_proposals
@@ -131,17 +131,17 @@
         GoalKind::LeaveUnsafePlace => RoutineFamily::LeaveUnsafePlace,
         GoalKind::ContinueCurrentIntention => RoutineFamily::ContinueCurrentIntention,
         GoalKind::IdleWithReason => RoutineFamily::Wait,
     }
 }
 
 pub fn all_steps_are_proposals(template: &RoutineTemplate) -> bool {
     template.steps.iter().all(|step| match step.proposed() {
-        RoutineStepProposal::Action(action_id) => !action_id.as_str().is_empty(),
+        RoutineStepProposal::Action(action_id) =>  /* ~ changed by cargo-mutants ~ */action_id.as_str().is_empty(),
         RoutineStepProposal::Wait(reason) => !reason.is_empty(),
         RoutineStepProposal::Diagnostic(diagnostic) => !diagnostic.stable_id().is_empty(),
     })
 }
 
 fn step(kind: &str, action_id: &str) -> RoutineStep {
     let action_id = SemanticActionId::new(action_id).unwrap();
     match kind {

---- agent::methods::tests::all_required_families_have_proposal_steps stdout ----

thread 'agent::methods::tests::all_required_families_have_proposal_steps' (15972) panicked at crates/tracewake-core/src/agent/methods.rs:220:9:
assertion failed: templates.iter().all(all_steps_are_proposals)

failures:
    agent::methods::tests::all_required_families_have_proposal_steps

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
