*** crates/tracewake-core/src/agent/methods.rs:140:46: delete ! in all_steps_are_proposals

*** mutation diff:
--- crates/tracewake-core/src/agent/methods.rs
+++ delete ! in all_steps_are_proposals
@@ -132,17 +132,17 @@
         GoalKind::ContinueCurrentIntention => RoutineFamily::ContinueCurrentIntention,
         GoalKind::IdleWithReason => RoutineFamily::Wait,
     }
 }
 
 pub fn all_steps_are_proposals(template: &RoutineTemplate) -> bool {
     template.steps.iter().all(|step| match step.proposed() {
         RoutineStepProposal::Action(action_id) => !action_id.as_str().is_empty(),
-        RoutineStepProposal::Wait(reason) => !reason.is_empty(),
+        RoutineStepProposal::Wait(reason) =>  /* ~ changed by cargo-mutants ~ */reason.is_empty(),
         RoutineStepProposal::Diagnostic(diagnostic) => !diagnostic.stable_id().is_empty(),
     })
 }
 
 fn step(kind: &str, action_id: &str) -> RoutineStep {
     let action_id = SemanticActionId::new(action_id).unwrap();
     match kind {
         "move_toward_place" => RoutineStep::MoveTowardPlace { action_id },

---- agent::methods::tests::all_required_families_have_proposal_steps stdout ----

thread 'agent::methods::tests::all_required_families_have_proposal_steps' (20531) panicked at crates/tracewake-core/src/agent/methods.rs:220:9:
assertion failed: templates.iter().all(all_steps_are_proposals)

---- agent::methods::tests::proposal_step_validation_rejects_empty_wait_payload stdout ----

thread 'agent::methods::tests::proposal_step_validation_rejects_empty_wait_payload' (20535) panicked at crates/tracewake-core/src/agent/methods.rs:261:9:
assertion failed: all_steps_are_proposals(&template)

failures:
    agent::methods::tests::all_required_families_have_proposal_steps
    agent::methods::tests::proposal_step_validation_rejects_empty_wait_payload

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
