*** crates/tracewake-core/src/agent/methods.rs:141:56: delete ! in all_steps_are_proposals

*** mutation diff:
--- crates/tracewake-core/src/agent/methods.rs
+++ delete ! in all_steps_are_proposals
@@ -133,17 +133,17 @@
         GoalKind::IdleWithReason => RoutineFamily::Wait,
     }
 }
 
 pub fn all_steps_are_proposals(template: &RoutineTemplate) -> bool {
     template.steps.iter().all(|step| match step.proposed() {
         RoutineStepProposal::Action(action_id) => !action_id.as_str().is_empty(),
         RoutineStepProposal::Wait(reason) => !reason.is_empty(),
-        RoutineStepProposal::Diagnostic(diagnostic) => !diagnostic.stable_id().is_empty(),
+        RoutineStepProposal::Diagnostic(diagnostic) =>  /* ~ changed by cargo-mutants ~ */diagnostic.stable_id().is_empty(),
     })
 }
 
 fn step(kind: &str, action_id: &str) -> RoutineStep {
     let action_id = SemanticActionId::new(action_id).unwrap();
     match kind {
         "move_toward_place" => RoutineStep::MoveTowardPlace { action_id },
         "check_known_container" => RoutineStep::CheckKnownContainer { action_id },

---- agent::methods::tests::proposal_step_validation_accepts_typed_diagnostic_payload stdout ----

thread 'agent::methods::tests::proposal_step_validation_accepts_typed_diagnostic_payload' (25093) panicked at crates/tracewake-core/src/agent/methods.rs:279:9:
assertion failed: all_steps_are_proposals(&template)

failures:
    agent::methods::tests::proposal_step_validation_accepts_typed_diagnostic_payload

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
