*** crates/tracewake-core/src/agent/methods.rs:148:9: delete match arm "move_toward_place" in step

*** mutation diff:
--- crates/tracewake-core/src/agent/methods.rs
+++ delete match arm "move_toward_place" in step
@@ -140,17 +140,17 @@
         RoutineStepProposal::Wait(reason) => !reason.is_empty(),
         RoutineStepProposal::Diagnostic(diagnostic) => !diagnostic.stable_id().is_empty(),
     })
 }
 
 fn step(kind: &str, action_id: &str) -> RoutineStep {
     let action_id = SemanticActionId::new(action_id).unwrap();
     match kind {
-        "move_toward_place" => RoutineStep::MoveTowardPlace { action_id },
+         /* ~ changed by cargo-mutants ~ */
         "check_known_container" => RoutineStep::CheckKnownContainer { action_id },
         "consume_accessible_food" => RoutineStep::ConsumeAccessibleFood { action_id },
         "start_scheduled_sleep" => RoutineStep::StartScheduledSleep { action_id },
         "start_work_block" => RoutineStep::StartWorkBlock { action_id },
         "continue_current_step" => RoutineStep::ContinueCurrentStep { action_id },
         "fallback_to_find_food" => RoutineStep::FallbackToFindFood { action_id },
         _ => panic!("unsupported routine step kind {kind}"),
     }

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (29449) panicked at crates/tracewake-core/src/agent/methods.rs:155:14:
unsupported routine step kind move_toward_place

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
