*** crates/tracewake-core/src/agent/methods.rs:150:9: delete match arm "consume_accessible_food" in step

*** mutation diff:
--- crates/tracewake-core/src/agent/methods.rs
+++ delete match arm "consume_accessible_food" in step
@@ -142,17 +142,17 @@
     })
 }
 
 fn step(kind: &str, action_id: &str) -> RoutineStep {
     let action_id = SemanticActionId::new(action_id).unwrap();
     match kind {
         "move_toward_place" => RoutineStep::MoveTowardPlace { action_id },
         "check_known_container" => RoutineStep::CheckKnownContainer { action_id },
-        "consume_accessible_food" => RoutineStep::ConsumeAccessibleFood { action_id },
+         /* ~ changed by cargo-mutants ~ */
         "start_scheduled_sleep" => RoutineStep::StartScheduledSleep { action_id },
         "start_work_block" => RoutineStep::StartWorkBlock { action_id },
         "continue_current_step" => RoutineStep::ContinueCurrentStep { action_id },
         "fallback_to_find_food" => RoutineStep::FallbackToFindFood { action_id },
         _ => panic!("unsupported routine step kind {kind}"),
     }
 }

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (5043) panicked at crates/tracewake-core/src/agent/methods.rs:155:14:
unsupported routine step kind consume_accessible_food

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
