*** crates/tracewake-core/src/agent/need.rs:104:9: replace NeedThresholdCrossing::stable_id -> String with String::new()

*** mutation diff:
--- crates/tracewake-core/src/agent/need.rs
+++ replace NeedThresholdCrossing::stable_id -> String with String::new()
@@ -96,22 +96,17 @@
 pub struct NeedThresholdCrossing {
     pub from: NeedBand,
     pub to: NeedBand,
     pub direction: ThresholdDirection,
 }
 
 impl NeedThresholdCrossing {
     pub fn stable_id(&self) -> String {
-        format!(
-            "{}>{}:{}",
-            self.from.stable_id(),
-            self.to.stable_id(),
-            self.direction.stable_id()
-        )
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 
     fn parse(value: &str) -> Result<Option<Self>, NeedParseError> {
         if value == "none" {
             return Ok(None);
         }
         let (bands, direction) = value
             .split_once(':')

---- agent::need::tests::last_change_source_label_is_deterministic_for_debug_and_replay stdout ----

thread 'agent::need::tests::last_change_source_label_is_deterministic_for_debug_and_replay' (8036) panicked at crates/tracewake-core/src/agent/need.rs:613:18:
called `Result::unwrap()` on an `Err` value: InvalidThresholdCrossing

---- agent::need::tests::threshold_crossing_round_trips_and_persists_last_crossing stdout ----

thread 'agent::need::tests::threshold_crossing_round_trips_and_persists_last_crossing' (8044) panicked at crates/tracewake-core/src/agent/need.rs:523:82:
called `Result::unwrap()` on an `Err` value: InvalidThresholdCrossing

failures:
    agent::need::tests::last_change_source_label_is_deterministic_for_debug_and_replay
    agent::need::tests::threshold_crossing_round_trips_and_persists_last_crossing

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
