*** crates/tracewake-core/src/agent/need.rs:113:18: replace == with != in NeedThresholdCrossing::parse

*** mutation diff:
--- crates/tracewake-core/src/agent/need.rs
+++ replace == with != in NeedThresholdCrossing::parse
@@ -105,17 +105,17 @@
             "{}>{}:{}",
             self.from.stable_id(),
             self.to.stable_id(),
             self.direction.stable_id()
         )
     }
 
     fn parse(value: &str) -> Result<Option<Self>, NeedParseError> {
-        if value == "none" {
+        if value != /* ~ changed by cargo-mutants ~ */ "none" {
             return Ok(None);
         }
         let (bands, direction) = value
             .split_once(':')
             .ok_or(NeedParseError::InvalidThresholdCrossing)?;
         let (from, to) = bands
             .split_once('>')
             .ok_or(NeedParseError::InvalidThresholdCrossing)?;

---- agent::need::tests::need_state_deserialize_rejects_wrong_shape_version_and_value stdout ----

thread 'agent::need::tests::need_state_deserialize_rejects_wrong_shape_version_and_value' (21728) panicked at crates/tracewake-core/src/agent/need.rs:557:18:
called `Result::unwrap()` on an `Err` value: InvalidThresholdCrossing

---- agent::need::tests::need_state_round_trips_through_canonical_bytes stdout ----

thread 'agent::need::tests::need_state_round_trips_through_canonical_bytes' (21729) panicked at crates/tracewake-core/src/agent/need.rs:384:70:
called `Result::unwrap()` on an `Err` value: InvalidThresholdCrossing

---- agent::need::tests::threshold_crossing_round_trips_and_persists_last_crossing stdout ----

thread 'agent::need::tests::threshold_crossing_round_trips_and_persists_last_crossing' (21733) panicked at crates/tracewake-core/src/agent/need.rs:510:9:
assertion `left == right` failed
  left: None
 right: Some(NeedThresholdCrossing { from: Comfortable, to: Severe, direction: IncreasingPressure })

failures:
    agent::need::tests::need_state_deserialize_rejects_wrong_shape_version_and_value
    agent::need::tests::need_state_round_trips_through_canonical_bytes
    agent::need::tests::threshold_crossing_round_trips_and_persists_last_crossing

test result: FAILED. 452 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
