*** crates/tracewake-core/src/agent/need.rs:113:9: replace NeedThresholdCrossing::parse -> Result<Option<Self>, NeedParseError> with Ok(None)

*** mutation diff:
--- crates/tracewake-core/src/agent/need.rs
+++ replace NeedThresholdCrossing::parse -> Result<Option<Self>, NeedParseError> with Ok(None)
@@ -105,30 +105,17 @@
             "{}>{}:{}",
             self.from.stable_id(),
             self.to.stable_id(),
             self.direction.stable_id()
         )
     }
 
     fn parse(value: &str) -> Result<Option<Self>, NeedParseError> {
-        if value == "none" {
-            return Ok(None);
-        }
-        let (bands, direction) = value
-            .split_once(':')
-            .ok_or(NeedParseError::InvalidThresholdCrossing)?;
-        let (from, to) = bands
-            .split_once('>')
-            .ok_or(NeedParseError::InvalidThresholdCrossing)?;
-        Ok(Some(Self {
-            from: NeedBand::parse(from)?,
-            to: NeedBand::parse(to)?,
-            direction: ThresholdDirection::parse(direction)?,
-        }))
+        Ok(None) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
 pub enum NeedChangeCause {
     FixtureInitial,
     TickDelta,
     ActionEffect(ActionId),

---- agent::need::tests::threshold_crossing_round_trips_and_persists_last_crossing stdout ----

thread 'agent::need::tests::threshold_crossing_round_trips_and_persists_last_crossing' (17162) panicked at crates/tracewake-core/src/agent/need.rs:497:9:
assertion `left == right` failed
  left: None
 right: Some(NeedThresholdCrossing { from: Comfortable, to: Severe, direction: IncreasingPressure })

failures:
    agent::need::tests::threshold_crossing_round_trips_and_persists_last_crossing

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
