*** crates/tracewake-core/src/agent/need.rs:140:9: replace NeedChangeCause::stable_id -> String with String::new()

*** mutation diff:
--- crates/tracewake-core/src/agent/need.rs
+++ replace NeedChangeCause::stable_id -> String with String::new()
@@ -132,29 +132,17 @@
     FixtureInitial,
     TickDelta,
     ActionEffect(ActionId),
     RoutineEffect(RoutineExecutionId),
 }
 
 impl NeedChangeCause {
     pub fn stable_id(&self) -> String {
-        match self {
-            NeedChangeCause::FixtureInitial => "fixture_initial".to_string(),
-            NeedChangeCause::TickDelta => "tick_delta".to_string(),
-            NeedChangeCause::ActionEffect(action_id) => {
-                format!("action_effect:{}", action_id.serialize_canonical())
-            }
-            NeedChangeCause::RoutineEffect(routine_execution_id) => {
-                format!(
-                    "routine_effect:{}",
-                    routine_execution_id.serialize_canonical()
-                )
-            }
-        }
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 
     fn parse(value: &str) -> Result<Self, NeedParseError> {
         if value == "fixture_initial" {
             return Ok(Self::FixtureInitial);
         }
         if value == "tick_delta" {
             return Ok(Self::TickDelta);

---- agent::need::tests::last_change_source_label_is_deterministic_for_debug_and_replay stdout ----

thread 'agent::need::tests::last_change_source_label_is_deterministic_for_debug_and_replay' (26284) panicked at crates/tracewake-core/src/agent/need.rs:603:9:
assertion `left == right` failed
  left: ""
 right: "action_effect:eat"

---- agent::need::tests::need_state_round_trips_through_canonical_bytes stdout ----

thread 'agent::need::tests::need_state_round_trips_through_canonical_bytes' (26288) panicked at crates/tracewake-core/src/agent/need.rs:372:70:
called `Result::unwrap()` on an `Err` value: InvalidCause

---- agent::need::tests::threshold_crossing_round_trips_and_persists_last_crossing stdout ----

thread 'agent::need::tests::threshold_crossing_round_trips_and_persists_last_crossing' (26292) panicked at crates/tracewake-core/src/agent/need.rs:516:82:
called `Result::unwrap()` on an `Err` value: InvalidCause

failures:
    agent::need::tests::last_change_source_label_is_deterministic_for_debug_and_replay
    agent::need::tests::need_state_round_trips_through_canonical_bytes
    agent::need::tests::threshold_crossing_round_trips_and_persists_last_crossing
    projections::tests::view_models_embodied_phase3a_status_is_viewer_scoped_and_actor_known

test result: FAILED. 451 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
