*** crates/tracewake-core/src/agent/need.rs:156:18: replace == with != in NeedChangeCause::parse

*** mutation diff:
--- crates/tracewake-core/src/agent/need.rs
+++ replace == with != in NeedChangeCause::parse
@@ -148,17 +148,17 @@
                     "routine_effect:{}",
                     routine_execution_id.serialize_canonical()
                 )
             }
         }
     }
 
     fn parse(value: &str) -> Result<Self, NeedParseError> {
-        if value == "fixture_initial" {
+        if value != /* ~ changed by cargo-mutants ~ */ "fixture_initial" {
             return Ok(Self::FixtureInitial);
         }
         if value == "tick_delta" {
             return Ok(Self::TickDelta);
         }
         if let Some(action_id) = value.strip_prefix("action_effect:") {
             return Ok(Self::ActionEffect(
                 ActionId::new(action_id).map_err(NeedParseError::InvalidId)?,

---- agent::need::tests::need_state_round_trips_through_canonical_bytes stdout ----

thread 'agent::need::tests::need_state_round_trips_through_canonical_bytes' (2950) panicked at crates/tracewake-core/src/agent/need.rs:386:9:
assertion `left == right` failed
  left: NeedState { kind: Hunger, value: 250, last_change_cause: FixtureInitial, last_threshold_crossing: None }
 right: NeedState { kind: Hunger, value: 250, last_change_cause: ActionEffect(ActionId(StableId("eat.breakfast"))), last_threshold_crossing: None }

---- agent::need::tests::last_change_source_label_is_deterministic_for_debug_and_replay stdout ----

thread 'agent::need::tests::last_change_source_label_is_deterministic_for_debug_and_replay' (2946) panicked at crates/tracewake-core/src/agent/need.rs:616:9:
assertion `left == right` failed
  left: "fixture_initial"
 right: "action_effect:eat"

---- agent::need::tests::need_state_deserialize_rejects_wrong_shape_version_and_value stdout ----

thread 'agent::need::tests::need_state_deserialize_rejects_wrong_shape_version_and_value' (2949) panicked at crates/tracewake-core/src/agent/need.rs:557:18:
called `Result::unwrap()` on an `Err` value: InvalidCause

failures:
    agent::need::tests::last_change_source_label_is_deterministic_for_debug_and_replay
    agent::need::tests::need_state_deserialize_rejects_wrong_shape_version_and_value
    agent::need::tests::need_state_round_trips_through_canonical_bytes
    agent::need::tests::threshold_crossing_round_trips_and_persists_last_crossing

test result: FAILED. 451 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
