*** crates/tracewake-core/src/agent/need.rs:159:18: replace == with != in NeedChangeCause::parse

*** mutation diff:
--- crates/tracewake-core/src/agent/need.rs
+++ replace == with != in NeedChangeCause::parse
@@ -151,17 +151,17 @@
             }
         }
     }
 
     fn parse(value: &str) -> Result<Self, NeedParseError> {
         if value == "fixture_initial" {
             return Ok(Self::FixtureInitial);
         }
-        if value == "tick_delta" {
+        if value != /* ~ changed by cargo-mutants ~ */ "tick_delta" {
             return Ok(Self::TickDelta);
         }
         if let Some(action_id) = value.strip_prefix("action_effect:") {
             return Ok(Self::ActionEffect(
                 ActionId::new(action_id).map_err(NeedParseError::InvalidId)?,
             ));
         }
         if let Some(routine_execution_id) = value.strip_prefix("routine_effect:") {

---- agent::need::tests::last_change_source_label_is_deterministic_for_debug_and_replay stdout ----

thread 'agent::need::tests::last_change_source_label_is_deterministic_for_debug_and_replay' (7506) panicked at crates/tracewake-core/src/agent/need.rs:616:9:
assertion `left == right` failed
  left: "tick_delta"
 right: "action_effect:eat"

---- agent::need::tests::need_state_round_trips_through_canonical_bytes stdout ----

thread 'agent::need::tests::need_state_round_trips_through_canonical_bytes' (7510) panicked at crates/tracewake-core/src/agent/need.rs:386:9:
assertion `left == right` failed
  left: NeedState { kind: Hunger, value: 250, last_change_cause: TickDelta, last_threshold_crossing: None }
 right: NeedState { kind: Hunger, value: 250, last_change_cause: ActionEffect(ActionId(StableId("eat.breakfast"))), last_threshold_crossing: None }

---- agent::need::tests::threshold_crossing_round_trips_and_persists_last_crossing stdout ----

thread 'agent::need::tests::threshold_crossing_round_trips_and_persists_last_crossing' (7514) panicked at crates/tracewake-core/src/agent/need.rs:530:9:
assertion `left == right` failed
  left: "need_state_v2|fatigue|0750|tick_delta|comfortable>severe:increasing_pressure"
 right: "need_state_v2|fatigue|0750|routine_effect:routine_exec_sleep|comfortable>severe:increasing_pressure"

failures:
    agent::need::tests::last_change_source_label_is_deterministic_for_debug_and_replay
    agent::need::tests::need_state_round_trips_through_canonical_bytes
    agent::need::tests::threshold_crossing_round_trips_and_persists_last_crossing

test result: FAILED. 452 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
