*** crates/tracewake-core/src/agent/need.rs:17:9: replace NeedKind::stable_id -> &'static str with ""

*** mutation diff:
--- crates/tracewake-core/src/agent/need.rs
+++ replace NeedKind::stable_id -> &'static str with ""
@@ -9,21 +9,17 @@
 pub enum NeedKind {
     Hunger,
     Fatigue,
     Safety,
 }
 
 impl NeedKind {
     pub const fn stable_id(self) -> &'static str {
-        match self {
-            NeedKind::Hunger => "hunger",
-            NeedKind::Fatigue => "fatigue",
-            NeedKind::Safety => "safety",
-        }
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     fn parse(value: &str) -> Result<Self, NeedParseError> {
         match value {
             "hunger" => Ok(Self::Hunger),
             "fatigue" => Ok(Self::Fatigue),
             "safety" => Ok(Self::Safety),
             _ => Err(NeedParseError::InvalidNeedKind),

---- load::tests::shuffled_input_paths_load_to_same_canonical_world stdout ----

thread 'load::tests::shuffled_input_paths_load_to_same_canonical_world' (25159) panicked at crates/tracewake-content/src/load.rs:509:10:
called `Result::unwrap()` on an `Err` value: Validation(ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: ParseSchema, path: "fixture.line", code: "bad_line", message: "bad fixture line bad need kind " }] } })

---- serialization::tests::fixture_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::fixture_serialization_round_trips_byte_identically' (25164) panicked at crates/tracewake-content/src/serialization.rs:891:50:
called `Result::unwrap()` on an `Err` value: BadLine("bad need kind ")

---- validate::tests::fixture_missing_actor_need_seed_rejected_001 stdout ----

thread 'validate::tests::fixture_missing_actor_need_seed_rejected_001' (25172) panicked at crates/tracewake-content/src/validate.rs:3183:9:
assertion failed: report.errors.iter().any(|error|
        {
            error.phase == ValidationPhase::State &&
                    error.code == "missing_actor_need_seed" &&
                error.path == "initial_needs.actor_tomas.safety"
        })

failures:
    load::tests::shuffled_input_paths_load_to_same_canonical_world
    serialization::tests::fixture_serialization_round_trips_byte_identically
    validate::tests::fixture_missing_actor_need_seed_rejected_001
    validate::tests::fixture_schema_v1_golden_bytes_load_001
    validate::tests::fixture_schema_version_unsupported_rejected_001
    validate::tests::fixture_serialization_golden_bytes_are_pinned_001
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 27 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
