*** crates/tracewake-core/src/agent/need.rs:199:9: replace NeedState::value -> u16 with 0

*** mutation diff:
--- crates/tracewake-core/src/agent/need.rs
+++ replace NeedState::value -> u16 with 0
@@ -191,17 +191,17 @@
         }
     }
 
     pub const fn kind(&self) -> NeedKind {
         self.kind
     }
 
     pub const fn value(&self) -> u16 {
-        self.value
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     pub const fn band(&self) -> NeedBand {
         NeedBand::for_value(self.value)
     }
 
     pub const fn last_change_cause(&self) -> &NeedChangeCause {
         &self.last_change_cause

---- fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering stdout ----

thread 'fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering' (11855) panicked at crates/tracewake-content/tests/fixtures_load.rs:1248:5:
assertion `left == right` failed
  left: 0
 right: 350

failures:
    fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
