*** crates/tracewake-core/src/agent/need.rs:211:9: replace NeedState::last_threshold_crossing -> Option<NeedThresholdCrossing> with None

*** mutation diff:
--- crates/tracewake-core/src/agent/need.rs
+++ replace NeedState::last_threshold_crossing -> Option<NeedThresholdCrossing> with None
@@ -203,17 +203,17 @@
         NeedBand::for_value(self.value)
     }
 
     pub const fn last_change_cause(&self) -> &NeedChangeCause {
         &self.last_change_cause
     }
 
     pub const fn last_threshold_crossing(&self) -> Option<NeedThresholdCrossing> {
-        self.last_threshold_crossing
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn last_change_source_label(&self) -> String {
         self.last_change_cause.stable_id()
     }
 
     pub fn apply_delta(
         &mut self,

---- agent::need::tests::threshold_crossing_round_trips_and_persists_last_crossing stdout ----

thread 'agent::need::tests::threshold_crossing_round_trips_and_persists_last_crossing' (20183) panicked at crates/tracewake-core/src/agent/need.rs:525:9:
assertion `left == right` failed
  left: None
 right: Some(NeedThresholdCrossing { from: Comfortable, to: Severe, direction: IncreasingPressure })

failures:
    agent::need::tests::threshold_crossing_round_trips_and_persists_last_crossing

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
