*** crates/tracewake-core/src/agent/need.rs:215:9: replace NeedState::last_change_source_label -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-core/src/agent/need.rs
+++ replace NeedState::last_change_source_label -> String with "xyzzy".into()
@@ -207,17 +207,17 @@
         &self.last_change_cause
     }
 
     pub const fn last_threshold_crossing(&self) -> Option<NeedThresholdCrossing> {
         self.last_threshold_crossing
     }
 
     pub fn last_change_source_label(&self) -> String {
-        self.last_change_cause.stable_id()
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn apply_delta(
         &mut self,
         delta: i32,
         cause: NeedChangeCause,
     ) -> Option<NeedThresholdCrossing> {
         let previous = self.value;

---- agent::need::tests::last_change_source_label_is_deterministic_for_debug_and_replay stdout ----

thread 'agent::need::tests::last_change_source_label_is_deterministic_for_debug_and_replay' (29305) panicked at crates/tracewake-core/src/agent/need.rs:615:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "action_effect:eat"

failures:
    agent::need::tests::last_change_source_label_is_deterministic_for_debug_and_replay

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
