*** crates/tracewake-core/src/agent/need.rs:223:9: replace NeedState::apply_delta -> Option<NeedThresholdCrossing> with None

*** mutation diff:
--- crates/tracewake-core/src/agent/need.rs
+++ replace NeedState::apply_delta -> Option<NeedThresholdCrossing> with None
@@ -215,24 +215,17 @@
         self.last_change_cause.stable_id()
     }
 
     pub fn apply_delta(
         &mut self,
         delta: i32,
         cause: NeedChangeCause,
     ) -> Option<NeedThresholdCrossing> {
-        let previous = self.value;
-        self.value = clamp_need_value(i32::from(previous) + delta);
-        self.last_change_cause = cause;
-        let crossing = Self::threshold_crossing(previous, self.value);
-        if crossing.is_some() {
-            self.last_threshold_crossing = crossing;
-        }
-        crossing
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn threshold_crossing(from_value: u16, to_value: u16) -> Option<NeedThresholdCrossing> {
         let from = NeedBand::for_value(from_value);
         let to = NeedBand::for_value(to_value);
         if from == to {
             return None;
         }

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (1220) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (1221) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2714:5:
assertion failed: has_event(&log, EventKind::ActorMoved)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection

test result: FAILED. 40 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.50s

*** result: Failure(101)
