*** crates/tracewake-core/src/agent/need.rs:224:59: replace + with - in NeedState::apply_delta

*** mutation diff:
--- crates/tracewake-core/src/agent/need.rs
+++ replace + with - in NeedState::apply_delta
@@ -216,17 +216,17 @@
     }
 
     pub fn apply_delta(
         &mut self,
         delta: i32,
         cause: NeedChangeCause,
     ) -> Option<NeedThresholdCrossing> {
         let previous = self.value;
-        self.value = clamp_need_value(i32::from(previous) + delta);
+        self.value = clamp_need_value(i32::from(previous) - /* ~ changed by cargo-mutants ~ */ delta);
         self.last_change_cause = cause;
         let crossing = Self::threshold_crossing(previous, self.value);
         if crossing.is_some() {
             self.last_threshold_crossing = crossing;
         }
         crossing
     }

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (5331) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (5332) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2714:5:
assertion failed: has_event(&log, EventKind::ActorMoved)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection

test result: FAILED. 40 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.61s

*** result: Failure(101)
