*** crates/tracewake-core/src/agent/need.rs:234:9: replace NeedState::threshold_crossing -> Option<NeedThresholdCrossing> with None

*** mutation diff:
--- crates/tracewake-core/src/agent/need.rs
+++ replace NeedState::threshold_crossing -> Option<NeedThresholdCrossing> with None
@@ -226,33 +226,17 @@
         let crossing = Self::threshold_crossing(previous, self.value);
         if crossing.is_some() {
             self.last_threshold_crossing = crossing;
         }
         crossing
     }
 
     pub fn threshold_crossing(from_value: u16, to_value: u16) -> Option<NeedThresholdCrossing> {
-        let from = NeedBand::for_value(from_value);
-        let to = NeedBand::for_value(to_value);
-        if from == to {
-            return None;
-        }
-
-        let direction = match to_value.cmp(&from_value) {
-            std::cmp::Ordering::Greater => ThresholdDirection::IncreasingPressure,
-            std::cmp::Ordering::Less => ThresholdDirection::DecreasingPressure,
-            std::cmp::Ordering::Equal => return None,
-        };
-
-        Some(NeedThresholdCrossing {
-            from,
-            to,
-            direction,
-        })
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn derive_pressure(
         &self,
         actor_id: ActorId,
         crossing: Option<NeedThresholdCrossing>,
         actor_known_explanation: impl Into<String>,
         debug_detail: impl Into<String>,

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (13530) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2468:5:
assertion failed: has_event(&log, EventKind::NeedThresholdCrossed)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.59s

*** result: Failure(101)
