*** crates/tracewake-core/src/agent/need.rs:236:17: replace == with != in NeedState::threshold_crossing

*** mutation diff:
--- crates/tracewake-core/src/agent/need.rs
+++ replace == with != in NeedState::threshold_crossing
@@ -228,17 +228,17 @@
             self.last_threshold_crossing = crossing;
         }
         crossing
     }
 
     pub fn threshold_crossing(from_value: u16, to_value: u16) -> Option<NeedThresholdCrossing> {
         let from = NeedBand::for_value(from_value);
         let to = NeedBand::for_value(to_value);
-        if from == to {
+        if from != /* ~ changed by cargo-mutants ~ */ to {
             return None;
         }
 
         let direction = match to_value.cmp(&from_value) {
             std::cmp::Ordering::Greater => ThresholdDirection::IncreasingPressure,
             std::cmp::Ordering::Less => ThresholdDirection::DecreasingPressure,
             std::cmp::Ordering::Equal => return None,
         };

---- actions::defs::eat::tests::eat_consumes_one_serving_and_emits_non_crossing_hunger_delta stdout ----

thread 'actions::defs::eat::tests::eat_consumes_one_serving_and_emits_non_crossing_hunger_delta' (17689) panicked at crates/tracewake-core/src/actions/defs/eat.rs:441:9:
assertion `left == right` failed
  left: 3
 right: 2

---- actions::defs::eat::tests::eat_hunger_delta_emits_threshold_crossing_when_band_changes stdout ----

thread 'actions::defs::eat::tests::eat_hunger_delta_emits_threshold_crossing_when_band_changes' (17693) panicked at crates/tracewake-core/src/actions/defs/eat.rs:473:26:
index out of bounds: the len is 2 but the index is 2

---- actions::defs::need_events::tests::shared_emitter_pairs_upward_and_downward_band_crossings stdout ----

thread 'actions::defs::need_events::tests::shared_emitter_pairs_upward_and_downward_band_crossings' (17705) panicked at crates/tracewake-core/src/actions/defs/need_events.rs:165:9:
assertion `left == right` failed
  left: 1
 right: 2

failures:
    actions::defs::eat::tests::eat_consumes_one_serving_and_emits_non_crossing_hunger_delta
    actions::defs::eat::tests::eat_hunger_delta_emits_threshold_crossing_when_band_changes
    actions::defs::need_events::tests::shared_emitter_pairs_upward_and_downward_band_crossings
    actions::defs::sleep::tests::sleep_completion_recovers_fatigue_by_elapsed_duration
    actions::defs::wait::tests::wait_threshold_crossing_sets_reevaluation_flag
    actions::defs::wait::tests::wait_without_threshold_crossing_keeps_reevaluation_flag_false
    actions::defs::work::tests::work_completion_emits_output_marker_and_need_costs
    agent::generation::tests::increasing_threshold_crossing_requests_candidate_reevaluation
    agent::need::tests::apply_delta_clamps_without_underflow_or_overflow
    agent::need::tests::pressure_is_derived_from_state_and_not_stored_authority
    agent::need::tests::

test result: FAILED. 438 passed; 17 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
