*** crates/tracewake-core/src/agent/need.rs:26:13: delete match arm "hunger" in NeedKind::parse

*** mutation diff:
--- crates/tracewake-core/src/agent/need.rs
+++ delete match arm "hunger" in NeedKind::parse
@@ -18,17 +18,17 @@
             NeedKind::Hunger => "hunger",
             NeedKind::Fatigue => "fatigue",
             NeedKind::Safety => "safety",
         }
     }
 
     fn parse(value: &str) -> Result<Self, NeedParseError> {
         match value {
-            "hunger" => Ok(Self::Hunger),
+             /* ~ changed by cargo-mutants ~ */
             "fatigue" => Ok(Self::Fatigue),
             "safety" => Ok(Self::Safety),
             _ => Err(NeedParseError::InvalidNeedKind),
         }
     }
 }
 
 #[derive(Clone, Copy, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]

---- agent::need::tests::last_change_source_label_is_deterministic_for_debug_and_replay stdout ----

thread 'agent::need::tests::last_change_source_label_is_deterministic_for_debug_and_replay' (977) panicked at crates/tracewake-core/src/agent/need.rs:618:18:
called `Result::unwrap()` on an `Err` value: InvalidNeedKind

---- agent::need::tests::need_state_round_trips_through_canonical_bytes stdout ----

thread 'agent::need::tests::need_state_round_trips_through_canonical_bytes' (981) panicked at crates/tracewake-core/src/agent/need.rs:384:70:
called `Result::unwrap()` on an `Err` value: InvalidNeedKind

---- agent::need::tests::need_state_deserialize_rejects_wrong_shape_version_and_value stdout ----

thread 'agent::need::tests::need_state_deserialize_rejects_wrong_shape_version_and_value' (980) panicked at crates/tracewake-core/src/agent/need.rs:557:18:
called `Result::unwrap()` on an `Err` value: InvalidNeedKind

failures:
    agent::need::tests::last_change_source_label_is_deterministic_for_debug_and_replay
    agent::need::tests::need_state_deserialize_rejects_wrong_shape_version_and_value
    agent::need::tests::need_state_round_trips_through_canonical_bytes
    agent::need::tests::need_vocabulary_parses_every_canonical_stable_id

test result: FAILED. 451 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
