*** crates/tracewake-core/src/agent/need.rs:275:9: replace NeedState::serialize_canonical -> String with String::new()

*** mutation diff:
--- crates/tracewake-core/src/agent/need.rs
+++ replace NeedState::serialize_canonical -> String with String::new()
@@ -267,26 +267,17 @@
             source_ancestry: self.last_change_cause.clone(),
             interrupt_eligible: matches!(band, NeedBand::Urgent | NeedBand::Severe),
             actor_known_explanation: actor_known_explanation.into(),
             debug_detail: debug_detail.into(),
         }
     }
 
     pub fn serialize_canonical(&self) -> String {
-        format!(
-            "need_state_v2|{}|{:04}|{}|{}",
-            self.kind.stable_id(),
-            self.value,
-            self.last_change_cause.stable_id(),
-            self.last_threshold_crossing
-                .as_ref()
-                .map(NeedThresholdCrossing::stable_id)
-                .unwrap_or_else(|| "none".to_string())
-        )
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn serialize_canonical_bytes(&self) -> Vec<u8> {
         self.serialize_canonical().into_bytes()
     }
 
     pub fn deserialize_canonical(value: &[u8]) -> Result<Self, NeedParseError> {
         let value = std::str::from_utf8(value).map_err(|_| NeedParseError::InvalidUtf8)?;

---- agent::need::tests::last_change_source_label_is_deterministic_for_debug_and_replay stdout ----

thread 'agent::need::tests::last_change_source_label_is_deterministic_for_debug_and_replay' (22388) panicked at crates/tracewake-core/src/agent/need.rs:609:18:
called `Result::unwrap()` on an `Err` value: InvalidShape

---- agent::need::tests::need_state_round_trips_through_canonical_bytes stdout ----

thread 'agent::need::tests::need_state_round_trips_through_canonical_bytes' (22392) panicked at crates/tracewake-core/src/agent/need.rs:375:70:
called `Result::unwrap()` on an `Err` value: InvalidShape

---- agent::need::tests::threshold_crossing_round_trips_and_persists_last_crossing stdout ----

thread 'agent::need::tests::threshold_crossing_round_trips_and_persists_last_crossing' (22396) panicked at crates/tracewake-core/src/agent/need.rs:519:82:
called `Result::unwrap()` on an `Err` value: InvalidShape

failures:
    agent::need::tests::last_change_source_label_is_deterministic_for_debug_and_replay
    agent::need::tests::need_state_round_trips_through_canonical_bytes
    agent::need::tests::threshold_crossing_round_trips_and_persists_last_crossing
    checksum::tests::agent_checksum_changes_for_each_authoritative_field_family
    replay::rebuild::tests::agent_state_rebuild_is_deterministic_and_catches_need_delta_divergence

test result: FAILED. 450 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
