*** crates/tracewake-core/src/agent/need.rs:27:13: delete match arm "fatigue" in NeedKind::parse

*** mutation diff:
--- crates/tracewake-core/src/agent/need.rs
+++ delete match arm "fatigue" in NeedKind::parse
@@ -19,17 +19,17 @@
             NeedKind::Fatigue => "fatigue",
             NeedKind::Safety => "safety",
         }
     }
 
     fn parse(value: &str) -> Result<Self, NeedParseError> {
         match value {
             "hunger" => Ok(Self::Hunger),
-            "fatigue" => Ok(Self::Fatigue),
+             /* ~ changed by cargo-mutants ~ */
             "safety" => Ok(Self::Safety),
             _ => Err(NeedParseError::InvalidNeedKind),
         }
     }
 }
 
 #[derive(Clone, Copy, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
 pub enum NeedBand {

---- agent::need::tests::need_vocabulary_parses_every_canonical_stable_id stdout ----

thread 'agent::need::tests::need_vocabulary_parses_every_canonical_stable_id' (5541) panicked at crates/tracewake-core/src/agent/need.rs:397:13:
assertion `left == right` failed
  left: Err(InvalidNeedKind)
 right: Ok(Fatigue)

---- agent::need::tests::threshold_crossing_round_trips_and_persists_last_crossing stdout ----

thread 'agent::need::tests::threshold_crossing_round_trips_and_persists_last_crossing' (5544) panicked at crates/tracewake-core/src/agent/need.rs:528:82:
called `Result::unwrap()` on an `Err` value: InvalidNeedKind

failures:
    agent::need::tests::need_vocabulary_parses_every_canonical_stable_id
    agent::need::tests::threshold_crossing_round_trips_and_persists_last_crossing

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
