*** crates/tracewake-core/src/agent/need.rs:28:13: delete match arm "safety" in NeedKind::parse

*** mutation diff:
--- crates/tracewake-core/src/agent/need.rs
+++ delete match arm "safety" in NeedKind::parse
@@ -20,17 +20,17 @@
             NeedKind::Safety => "safety",
         }
     }
 
     fn parse(value: &str) -> Result<Self, NeedParseError> {
         match value {
             "hunger" => Ok(Self::Hunger),
             "fatigue" => Ok(Self::Fatigue),
-            "safety" => Ok(Self::Safety),
+             /* ~ changed by cargo-mutants ~ */
             _ => Err(NeedParseError::InvalidNeedKind),
         }
     }
 }
 
 #[derive(Clone, Copy, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
 pub enum NeedBand {
     Comfortable,

---- agent::need::tests::need_vocabulary_parses_every_canonical_stable_id stdout ----

thread 'agent::need::tests::need_vocabulary_parses_every_canonical_stable_id' (10101) panicked at crates/tracewake-core/src/agent/need.rs:397:13:
assertion `left == right` failed
  left: Err(InvalidNeedKind)
 right: Ok(Safety)

failures:
    agent::need::tests::need_vocabulary_parses_every_canonical_stable_id

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
