*** crates/tracewake-core/src/agent/need.rs:299:36: replace || with && in NeedState::deserialize_canonical

*** mutation diff:
--- crates/tracewake-core/src/agent/need.rs
+++ replace || with && in NeedState::deserialize_canonical
@@ -291,17 +291,17 @@
     pub fn deserialize_canonical(value: &[u8]) -> Result<Self, NeedParseError> {
         let value = std::str::from_utf8(value).map_err(|_| NeedParseError::InvalidUtf8)?;
         let mut fields = value.split('|');
         let version = fields.next().ok_or(NeedParseError::InvalidShape)?;
         let kind = fields.next().ok_or(NeedParseError::InvalidShape)?;
         let need_value = fields.next().ok_or(NeedParseError::InvalidShape)?;
         let cause = fields.next().ok_or(NeedParseError::InvalidShape)?;
         let crossing = fields.next().ok_or(NeedParseError::InvalidShape)?;
-        if fields.next().is_some() || version != "need_state_v2" {
+        if fields.next().is_some() && /* ~ changed by cargo-mutants ~ */ version != "need_state_v2" {
             return Err(NeedParseError::InvalidShape);
         }
 
         let need_value = need_value
             .parse::<u16>()
             .map_err(|_| NeedParseError::InvalidValue)?;
         if need_value > NEED_MAX {
             return Err(NeedParseError::InvalidValue);

---- agent::need::tests::need_state_deserialize_rejects_wrong_shape_version_and_value stdout ----

thread 'agent::need::tests::need_state_deserialize_rejects_wrong_shape_version_and_value' (12731) panicked at crates/tracewake-core/src/agent/need.rs:542:14:
called `Result::unwrap_err()` on an `Ok` value: NeedState { kind: Hunger, value: 250, last_change_cause: FixtureInitial, last_threshold_crossing: None }

failures:
    agent::need::tests::need_state_deserialize_rejects_wrong_shape_version_and_value

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
