*** crates/tracewake-core/src/agent/need.rs:306:23: replace > with < in NeedState::deserialize_canonical

*** mutation diff:
--- crates/tracewake-core/src/agent/need.rs
+++ replace > with < in NeedState::deserialize_canonical
@@ -298,17 +298,17 @@
         let crossing = fields.next().ok_or(NeedParseError::InvalidShape)?;
         if fields.next().is_some() || version != "need_state_v2" {
             return Err(NeedParseError::InvalidShape);
         }
 
         let need_value = need_value
             .parse::<u16>()
             .map_err(|_| NeedParseError::InvalidValue)?;
-        if need_value > NEED_MAX {
+        if need_value < /* ~ changed by cargo-mutants ~ */ NEED_MAX {
             return Err(NeedParseError::InvalidValue);
         }
 
         Ok(Self {
             kind: NeedKind::parse(kind)?,
             value: need_value,
             last_change_cause: NeedChangeCause::parse(cause)?,
             last_threshold_crossing: NeedThresholdCrossing::parse(crossing)?,

---- agent::need::tests::last_change_source_label_is_deterministic_for_debug_and_replay stdout ----

thread 'agent::need::tests::last_change_source_label_is_deterministic_for_debug_and_replay' (26405) panicked at crates/tracewake-core/src/agent/need.rs:618:18:
called `Result::unwrap()` on an `Err` value: InvalidValue

---- agent::need::tests::need_state_deserialize_rejects_wrong_shape_version_and_value stdout ----

thread 'agent::need::tests::need_state_deserialize_rejects_wrong_shape_version_and_value' (26408) panicked at crates/tracewake-core/src/agent/need.rs:552:18:
called `Result::unwrap_err()` on an `Ok` value: NeedState { kind: Hunger, value: 1001, last_change_cause: FixtureInitial, last_threshold_crossing: None }

---- agent::need::tests::threshold_crossing_round_trips_and_persists_last_crossing stdout ----

thread 'agent::need::tests::threshold_crossing_round_trips_and_persists_last_crossing' (26413) panicked at crates/tracewake-core/src/agent/need.rs:528:82:
called `Result::unwrap()` on an `Err` value: InvalidValue

failures:
    agent::need::tests::last_change_source_label_is_deterministic_for_debug_and_replay
    agent::need::tests::need_state_deserialize_rejects_wrong_shape_version_and_value
    agent::need::tests::need_state_round_trips_through_canonical_bytes
    agent::need::tests::threshold_crossing_round_trips_and_persists_last_crossing

test result: FAILED. 451 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
