*** crates/tracewake-core/src/agent/need.rs:306:23: replace > with >= in NeedState::deserialize_canonical

*** mutation diff:
--- crates/tracewake-core/src/agent/need.rs
+++ replace > with >= in NeedState::deserialize_canonical
@@ -298,17 +298,17 @@
         let crossing = fields.next().ok_or(NeedParseError::InvalidShape)?;
         if fields.next().is_some() || version != "need_state_v2" {
             return Err(NeedParseError::InvalidShape);
         }
 
         let need_value = need_value
             .parse::<u16>()
             .map_err(|_| NeedParseError::InvalidValue)?;
-        if need_value > NEED_MAX {
+        if need_value >= /* ~ changed by cargo-mutants ~ */ NEED_MAX {
             return Err(NeedParseError::InvalidValue);
         }
 
         Ok(Self {
             kind: NeedKind::parse(kind)?,
             value: need_value,
             last_change_cause: NeedChangeCause::parse(cause)?,
             last_threshold_crossing: NeedThresholdCrossing::parse(crossing)?,

---- agent::need::tests::need_state_deserialize_rejects_wrong_shape_version_and_value stdout ----

thread 'agent::need::tests::need_state_deserialize_rejects_wrong_shape_version_and_value' (30967) panicked at crates/tracewake-core/src/agent/need.rs:557:18:
called `Result::unwrap()` on an `Err` value: InvalidValue

failures:
    agent::need::tests::need_state_deserialize_rejects_wrong_shape_version_and_value

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
