*** crates/tracewake-core/src/agent/need.rs:368:5: replace clamp_need_value -> u16 with 0

*** mutation diff:
--- crates/tracewake-core/src/agent/need.rs
+++ replace clamp_need_value -> u16 with 0
@@ -360,17 +360,17 @@
             NeedParseError::InvalidId(err) => write!(f, "invalid need cause ID: {err}"),
         }
     }
 }
 
 impl std::error::Error for NeedParseError {}
 
 fn clamp_need_value(value: i32) -> u16 {
-    value.clamp(i32::from(NEED_MIN), i32::from(NEED_MAX)) as u16
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn need_state_round_trips_through_canonical_bytes() {

---- fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering stdout ----

thread 'fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering' (7381) panicked at crates/tracewake-content/tests/fixtures_load.rs:1248:5:
assertion `left == right` failed
  left: 0
 right: 350

failures:
    fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
