*** crates/tracewake-core/src/agent/need.rs:44:9: replace NeedBand::stable_id -> &'static str with ""

*** mutation diff:
--- crates/tracewake-core/src/agent/need.rs
+++ replace NeedBand::stable_id -> &'static str with ""
@@ -36,22 +36,17 @@
     Comfortable,
     Rising,
     Urgent,
     Severe,
 }
 
 impl NeedBand {
     pub const fn stable_id(self) -> &'static str {
-        match self {
-            NeedBand::Comfortable => "comfortable",
-            NeedBand::Rising => "rising",
-            NeedBand::Urgent => "urgent",
-            NeedBand::Severe => "severe",
-        }
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     pub const fn for_value(value: u16) -> Self {
         match value {
             0..=249 => Self::Comfortable,
             250..=499 => Self::Rising,
             500..=749 => Self::Urgent,
             _ => Self::Severe,

---- actions::defs::eat::tests::eat_hunger_delta_emits_threshold_crossing_when_band_changes stdout ----

thread 'actions::defs::eat::tests::eat_hunger_delta_emits_threshold_crossing_when_band_changes' (14531) panicked at crates/tracewake-core/src/actions/defs/eat.rs:476:9:
assertion `left == right` failed
  left: Some("")
 right: Some("urgent")

---- actions::defs::sleep::tests::sleep_completion_recovers_fatigue_by_elapsed_duration stdout ----

thread 'actions::defs::sleep::tests::sleep_completion_recovers_fatigue_by_elapsed_duration' (14549) panicked at crates/tracewake-core/src/actions/defs/sleep.rs:623:9:
assertion failed: events.iter().any(|event|
        {
            event.event_type == EventKind::NeedThresholdCrossed &&
                        event.payload.iter().any(|field|
                                field.key == "need_kind" && field.value == "fatigue") &&
                    event.payload.iter().any(|field|
                            field.key == "from_band" && field.value == "rising") &&
                event.payload.iter().any(|field|
                        field.key == "to_band" && field.value == "comfortable")
        })

---- actions::defs::wait::tests::wait_threshold_crossing_sets_reevaluation_flag stdout ----

thread 'actions::defs::wait::tests::wait_threshold_crossing_sets_reevaluation_flag' (14567) panicked at crates/tracewake-core/src/actions/defs/wait.rs:434:9:
assertion failed: threshold.payload.iter().any(|field|
        field.key == "from_band" && field.value == "comfortable")

failures:
    actions::defs::eat::tests::eat_hunger_delta_emits_threshold_crossing_when_band_changes
    actions::defs::sleep::tests::sleep_completion_recovers_fatigue_by_elapsed_duration
    actions::defs::wait::tests::wait_threshold_crossing_sets_reevaluation_flag
    actions::defs::work::tests::work_completion_emits_output_marker_and_need_costs
    agent::need::tests::last_change_source_label_is_deterministic_for_debug_and_replay
    agent::need::tests::need_vocabulary_parses_every_canonical_stable_id
    agent::need::tests::threshold_crossing_round_trips_and_persists_last_crossing
    debug_reports::tests::debug_reports_phase3a_surfaces_are_deterministic_and_read_only
    projections::tests::view_models_embodied_phase3a_status_is_viewer_scoped_and_actor_known
    scheduler::no_human::tests::severe_need_threshold_marks_active_intention_interruption_cause
    scheduler::no_human::tests

test result: FAILED. 444 passed; 11 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
