*** crates/tracewake-core/src/agent/need.rs:54:13: delete match arm 0..= 249 in NeedBand::for_value

*** mutation diff:
--- crates/tracewake-core/src/agent/need.rs
+++ delete match arm 0..= 249 in NeedBand::for_value
@@ -46,17 +46,17 @@
             NeedBand::Rising => "rising",
             NeedBand::Urgent => "urgent",
             NeedBand::Severe => "severe",
         }
     }
 
     pub const fn for_value(value: u16) -> Self {
         match value {
-            0..=249 => Self::Comfortable,
+             /* ~ changed by cargo-mutants ~ */
             250..=499 => Self::Rising,
             500..=749 => Self::Urgent,
             _ => Self::Severe,
         }
     }
 
     fn parse(value: &str) -> Result<Self, NeedParseError> {
         match value {

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (23567) panicked at crates/tracewake-content/tests/fixtures_load.rs:1217:5:
assertion failed: report.ordinary_pipeline_events > 0

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
