*** crates/tracewake-core/src/agent/need.rs:55:13: delete match arm 250..= 499 in NeedBand::for_value

*** mutation diff:
--- crates/tracewake-core/src/agent/need.rs
+++ delete match arm 250..= 499 in NeedBand::for_value
@@ -47,17 +47,17 @@
             NeedBand::Urgent => "urgent",
             NeedBand::Severe => "severe",
         }
     }
 
     pub const fn for_value(value: u16) -> Self {
         match value {
             0..=249 => Self::Comfortable,
-            250..=499 => Self::Rising,
+             /* ~ changed by cargo-mutants ~ */
             500..=749 => Self::Urgent,
             _ => Self::Severe,
         }
     }
 
     fn parse(value: &str) -> Result<Self, NeedParseError> {
         match value {
             "comfortable" => Ok(Self::Comfortable),

---- sleep_eat_work_fixture_logs_need_effects_and_replays stdout ----

thread 'sleep_eat_work_fixture_logs_need_effects_and_replays' (27666) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1269:5:
assertion failed: has_event(&log, EventKind::SleepCompleted)

---- sleep_spanning_window_boundary_charges_each_tick_once stdout ----

thread 'sleep_spanning_window_boundary_charges_each_tick_once' (27667) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2529:5:
assertion failed: has_event(&log, EventKind::SleepCompleted)

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (27640) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2177:5:
assertion failed: has_no_human_event(&log, EventKind::SleepCompleted)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    sleep_eat_work_fixture_logs_need_effects_and_replays
    sleep_spanning_window_boundary_charges_each_tick_once

test result: FAILED. 38 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.47s

*** result: Failure(101)
