*** crates/tracewake-core/src/agent/need.rs:56:13: delete match arm 500..= 749 in NeedBand::for_value

*** mutation diff:
--- crates/tracewake-core/src/agent/need.rs
+++ delete match arm 500..= 749 in NeedBand::for_value
@@ -48,17 +48,17 @@
             NeedBand::Severe => "severe",
         }
     }
 
     pub const fn for_value(value: u16) -> Self {
         match value {
             0..=249 => Self::Comfortable,
             250..=499 => Self::Rising,
-            500..=749 => Self::Urgent,
+             /* ~ changed by cargo-mutants ~ */
             _ => Self::Severe,
         }
     }
 
     fn parse(value: &str) -> Result<Self, NeedParseError> {
         match value {
             "comfortable" => Ok(Self::Comfortable),
             "rising" => Ok(Self::Rising),

---- actions::defs::eat::tests::eat_hunger_delta_emits_threshold_crossing_when_band_changes stdout ----

thread 'actions::defs::eat::tests::eat_hunger_delta_emits_threshold_crossing_when_band_changes' (31791) panicked at crates/tracewake-core/src/actions/defs/eat.rs:476:9:
assertion `left == right` failed
  left: Some("severe")
 right: Some("urgent")

---- agent::decision::tests::urgent_need_vs_active_intention_follows_documented_order stdout ----

thread 'agent::decision::tests::urgent_need_vs_active_intention_follows_documented_order' (31886) panicked at crates/tracewake-core/src/agent/decision.rs:524:9:
assertion `left == right` failed
  left: SevereHunger
 right: UrgentHungerOrFatigue

---- agent::generation::tests::increasing_threshold_crossing_requests_candidate_reevaluation stdout ----

thread 'agent::generation::tests::increasing_threshold_crossing_requests_candidate_reevaluation' (31890) panicked at crates/tracewake-core/src/agent/generation.rs:527:9:
assertion `left == right` failed
  left: Severe
 right: Urgent

failures:
    actions::defs::eat::tests::eat_hunger_delta_emits_threshold_crossing_when_band_changes
    agent::decision::tests::urgent_need_vs_active_intention_follows_documented_order
    agent::generation::tests::increasing_threshold_crossing_requests_candidate_reevaluation
    agent::need::tests::apply_delta_clamps_without_underflow_or_overflow
    agent::need::tests::need_bands_match_phase_3a_boundaries
    agent::need::tests::pressure_is_derived_from_state_and_not_stored_authority
    projections::tests::view_models_embodied_phase3a_status_is_viewer_scoped_and_actor_known
    scheduler::no_human::tests::severe_need_threshold_marks_active_intention_interruption_cause
    scheduler::no_human::tests::severe_passive_need_interrupt_payload_requires_severe_crossing_and_active_intention

test result: FAILED. 446 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
