*** crates/tracewake-core/src/agent/need.rs:63:13: delete match arm "comfortable" in NeedBand::parse

*** mutation diff:
--- crates/tracewake-core/src/agent/need.rs
+++ delete match arm "comfortable" in NeedBand::parse
@@ -55,17 +55,17 @@
             250..=499 => Self::Rising,
             500..=749 => Self::Urgent,
             _ => Self::Severe,
         }
     }
 
     fn parse(value: &str) -> Result<Self, NeedParseError> {
         match value {
-            "comfortable" => Ok(Self::Comfortable),
+             /* ~ changed by cargo-mutants ~ */
             "rising" => Ok(Self::Rising),
             "urgent" => Ok(Self::Urgent),
             "severe" => Ok(Self::Severe),
             _ => Err(NeedParseError::InvalidNeedBand),
         }
     }
 }

---- agent::need::tests::need_vocabulary_parses_every_canonical_stable_id stdout ----

thread 'agent::need::tests::need_vocabulary_parses_every_canonical_stable_id' (4023) panicked at crates/tracewake-core/src/agent/need.rs:407:13:
assertion `left == right` failed
  left: Err(InvalidNeedBand)
 right: Ok(Comfortable)

---- agent::need::tests::threshold_crossing_round_trips_and_persists_last_crossing stdout ----

thread 'agent::need::tests::threshold_crossing_round_trips_and_persists_last_crossing' (4026) panicked at crates/tracewake-core/src/agent/need.rs:509:84:
called `Result::unwrap()` on an `Err` value: InvalidNeedBand

failures:
    agent::need::tests::need_vocabulary_parses_every_canonical_stable_id
    agent::need::tests::threshold_crossing_round_trips_and_persists_last_crossing

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
