*** crates/tracewake-core/src/agent/need.rs:64:13: delete match arm "rising" in NeedBand::parse

*** mutation diff:
--- crates/tracewake-core/src/agent/need.rs
+++ delete match arm "rising" in NeedBand::parse
@@ -56,17 +56,17 @@
             500..=749 => Self::Urgent,
             _ => Self::Severe,
         }
     }
 
     fn parse(value: &str) -> Result<Self, NeedParseError> {
         match value {
             "comfortable" => Ok(Self::Comfortable),
-            "rising" => Ok(Self::Rising),
+             /* ~ changed by cargo-mutants ~ */
             "urgent" => Ok(Self::Urgent),
             "severe" => Ok(Self::Severe),
             _ => Err(NeedParseError::InvalidNeedBand),
         }
     }
 }
 
 #[derive(Clone, Copy, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]

---- agent::need::tests::last_change_source_label_is_deterministic_for_debug_and_replay stdout ----

thread 'agent::need::tests::last_change_source_label_is_deterministic_for_debug_and_replay' (8578) panicked at crates/tracewake-core/src/agent/need.rs:618:18:
called `Result::unwrap()` on an `Err` value: InvalidNeedBand

---- agent::need::tests::need_vocabulary_parses_every_canonical_stable_id stdout ----

thread 'agent::need::tests::need_vocabulary_parses_every_canonical_stable_id' (8583) panicked at crates/tracewake-core/src/agent/need.rs:407:13:
assertion `left == right` failed
  left: Err(InvalidNeedBand)
 right: Ok(Rising)

failures:
    agent::need::tests::last_change_source_label_is_deterministic_for_debug_and_replay
    agent::need::tests::need_vocabulary_parses_every_canonical_stable_id

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
