*** crates/tracewake-core/src/agent/need.rs:66:13: delete match arm "severe" in NeedBand::parse

*** mutation diff:
--- crates/tracewake-core/src/agent/need.rs
+++ delete match arm "severe" in NeedBand::parse
@@ -58,17 +58,17 @@
         }
     }
 
     fn parse(value: &str) -> Result<Self, NeedParseError> {
         match value {
             "comfortable" => Ok(Self::Comfortable),
             "rising" => Ok(Self::Rising),
             "urgent" => Ok(Self::Urgent),
-            "severe" => Ok(Self::Severe),
+             /* ~ changed by cargo-mutants ~ */
             _ => Err(NeedParseError::InvalidNeedBand),
         }
     }
 }
 
 #[derive(Clone, Copy, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
 pub enum ThresholdDirection {
     IncreasingPressure,

---- agent::need::tests::threshold_crossing_round_trips_and_persists_last_crossing stdout ----

thread 'agent::need::tests::threshold_crossing_round_trips_and_persists_last_crossing' (17704) panicked at crates/tracewake-core/src/agent/need.rs:509:84:
called `Result::unwrap()` on an `Err` value: InvalidNeedBand

---- agent::need::tests::need_vocabulary_parses_every_canonical_stable_id stdout ----

thread 'agent::need::tests::need_vocabulary_parses_every_canonical_stable_id' (17701) panicked at crates/tracewake-core/src/agent/need.rs:407:13:
assertion `left == right` failed
  left: Err(InvalidNeedBand)
 right: Ok(Severe)

failures:
    agent::need::tests::need_vocabulary_parses_every_canonical_stable_id
    agent::need::tests::threshold_crossing_round_trips_and_persists_last_crossing

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
