*** crates/tracewake-core/src/agent/need.rs:80:9: replace ThresholdDirection::stable_id -> &'static str with "xyzzy"

*** mutation diff:
--- crates/tracewake-core/src/agent/need.rs
+++ replace ThresholdDirection::stable_id -> &'static str with "xyzzy"
@@ -72,20 +72,17 @@
 #[derive(Clone, Copy, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
 pub enum ThresholdDirection {
     IncreasingPressure,
     DecreasingPressure,
 }
 
 impl ThresholdDirection {
     pub const fn stable_id(self) -> &'static str {
-        match self {
-            ThresholdDirection::IncreasingPressure => "increasing_pressure",
-            ThresholdDirection::DecreasingPressure => "decreasing_pressure",
-        }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     fn parse(value: &str) -> Result<Self, NeedParseError> {
         match value {
             "increasing_pressure" => Ok(Self::IncreasingPressure),
             "decreasing_pressure" => Ok(Self::DecreasingPressure),
             _ => Err(NeedParseError::InvalidThresholdDirection),
         }

---- agent::need::tests::last_change_source_label_is_deterministic_for_debug_and_replay stdout ----

thread 'agent::need::tests::last_change_source_label_is_deterministic_for_debug_and_replay' (26814) panicked at crates/tracewake-core/src/agent/need.rs:615:18:
called `Result::unwrap()` on an `Err` value: InvalidThresholdDirection

---- agent::need::tests::threshold_crossing_round_trips_and_persists_last_crossing stdout ----

thread 'agent::need::tests::threshold_crossing_round_trips_and_persists_last_crossing' (26822) panicked at crates/tracewake-core/src/agent/need.rs:525:82:
called `Result::unwrap()` on an `Err` value: InvalidThresholdDirection

---- agent::need::tests::need_vocabulary_parses_every_canonical_stable_id stdout ----

thread 'agent::need::tests::need_vocabulary_parses_every_canonical_stable_id' (26819) panicked at crates/tracewake-core/src/agent/need.rs:419:13:
assertion `left == right` failed
  left: "xyzzy"
 right: "increasing_pressure"

failures:
    agent::need::tests::last_change_source_label_is_deterministic_for_debug_and_replay
    agent::need::tests::need_vocabulary_parses_every_canonical_stable_id
    agent::need::tests::threshold_crossing_round_trips_and_persists_last_crossing

test result: FAILED. 452 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
