*** crates/tracewake-core/src/agent/need.rs:88:13: delete match arm "increasing_pressure" in ThresholdDirection::parse

*** mutation diff:
--- crates/tracewake-core/src/agent/need.rs
+++ delete match arm "increasing_pressure" in ThresholdDirection::parse
@@ -80,17 +80,17 @@
         match self {
             ThresholdDirection::IncreasingPressure => "increasing_pressure",
             ThresholdDirection::DecreasingPressure => "decreasing_pressure",
         }
     }
 
     fn parse(value: &str) -> Result<Self, NeedParseError> {
         match value {
-            "increasing_pressure" => Ok(Self::IncreasingPressure),
+             /* ~ changed by cargo-mutants ~ */
             "decreasing_pressure" => Ok(Self::DecreasingPressure),
             _ => Err(NeedParseError::InvalidThresholdDirection),
         }
     }
 }
 
 #[derive(Clone, Copy, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
 pub struct NeedThresholdCrossing {

---- agent::need::tests::need_vocabulary_parses_every_canonical_stable_id stdout ----

thread 'agent::need::tests::need_vocabulary_parses_every_canonical_stable_id' (31390) panicked at crates/tracewake-core/src/agent/need.rs:421:13:
assertion `left == right` failed
  left: Err(InvalidThresholdDirection)
 right: Ok(IncreasingPressure)

---- agent::need::tests::threshold_crossing_round_trips_and_persists_last_crossing stdout ----

thread 'agent::need::tests::threshold_crossing_round_trips_and_persists_last_crossing' (31393) panicked at crates/tracewake-core/src/agent/need.rs:509:84:
called `Result::unwrap()` on an `Err` value: InvalidThresholdDirection

failures:
    agent::need::tests::need_vocabulary_parses_every_canonical_stable_id
    agent::need::tests::threshold_crossing_round_trips_and_persists_last_crossing

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
