*** crates/tracewake-core/src/agent/need.rs:89:13: delete match arm "decreasing_pressure" in ThresholdDirection::parse

*** mutation diff:
--- crates/tracewake-core/src/agent/need.rs
+++ delete match arm "decreasing_pressure" in ThresholdDirection::parse
@@ -81,17 +81,17 @@
             ThresholdDirection::IncreasingPressure => "increasing_pressure",
             ThresholdDirection::DecreasingPressure => "decreasing_pressure",
         }
     }
 
     fn parse(value: &str) -> Result<Self, NeedParseError> {
         match value {
             "increasing_pressure" => Ok(Self::IncreasingPressure),
-            "decreasing_pressure" => Ok(Self::DecreasingPressure),
+             /* ~ changed by cargo-mutants ~ */
             _ => Err(NeedParseError::InvalidThresholdDirection),
         }
     }
 }
 
 #[derive(Clone, Copy, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
 pub struct NeedThresholdCrossing {
     pub from: NeedBand,

---- agent::need::tests::last_change_source_label_is_deterministic_for_debug_and_replay stdout ----

thread 'agent::need::tests::last_change_source_label_is_deterministic_for_debug_and_replay' (3476) panicked at crates/tracewake-core/src/agent/need.rs:618:18:
called `Result::unwrap()` on an `Err` value: InvalidThresholdDirection

---- agent::need::tests::need_vocabulary_parses_every_canonical_stable_id stdout ----

thread 'agent::need::tests::need_vocabulary_parses_every_canonical_stable_id' (3481) panicked at crates/tracewake-core/src/agent/need.rs:421:13:
assertion `left == right` failed
  left: Err(InvalidThresholdDirection)
 right: Ok(DecreasingPressure)

failures:
    agent::need::tests::last_change_source_label_is_deterministic_for_debug_and_replay
    agent::need::tests::need_vocabulary_parses_every_canonical_stable_id

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
