*** crates/tracewake-core/src/agent/no_human_surface.rs:152:9: replace NoHumanActorKnownSurfaceBuilder::consume_projection_records with ()

*** mutation diff:
--- crates/tracewake-core/src/agent/no_human_surface.rs
+++ replace NoHumanActorKnownSurfaceBuilder::consume_projection_records with ()
@@ -144,29 +144,17 @@
             self.known_sleep_places,
             self.known_workplaces,
             self.facts,
         );
         SealedActorKnownSurface::new(context)
     }
 
     fn consume_projection_records(&mut self, projection: &EpistemicProjection) {
-        let context = KnowledgeContext::embodied(
-            self.actor_id.clone(),
-            self.decision_tick.unwrap_or(SimTick::ZERO),
-        );
-        for classified in
-            projection.classified_actor_known_records_for_context(&context, &self.current_place_id)
-        {
-            self.consume_projection_record(
-                classified.record(),
-                classified.freshness(),
-                classified.source_tick(),
-            );
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn consume_projection_record(
         &mut self,
         record: &ActorKnownProjectionRecord,
         freshness: ActorKnownProjectionFreshness,
         source_tick: SimTick,
     ) {

---- aged_food_record_surfaces_as_remembered_belief stdout ----

thread 'aged_food_record_surfaces_as_remembered_belief' (15539) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2648:5:
assertion failed: surface.context().known_food_sources().contains("food_stew_home_tomas")

---- partial_food_source_knowledge_seeds_only_authored_actor_edge stdout ----

thread 'partial_food_source_knowledge_seeds_only_authored_actor_edge' (15558) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2073:5:
assertion failed: mara_known.known_food_sources().contains("food_shared_pantry")

---- planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit stdout ----

thread 'planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit' (15563) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1603:6:
called `Result::unwrap()` on an `Err` value: NoApplicableMethod { family: EatMeal, reason: "no actor-known method inputs for eat_meal" }

failures:
    aged_food_record_surfaces_as_remembered_belief
    episode_tamper_proration_poisons_replay
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    partial_food_source_knowledge_seeds_only_authored_actor_edge
    planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit
    severe_safety_with_known_exit_produces_move_and_replays
    sleep_spanning_window_boundary_charges_each_tick_once

test result: FAILED. 34 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.30s

*** result: Failure(101)
