*** crates/tracewake-core/src/agent/no_human_surface.rs:173:9: replace NoHumanActorKnownSurfaceBuilder::consume_projection_record with ()

*** mutation diff:
--- crates/tracewake-core/src/agent/no_human_surface.rs
+++ replace NoHumanActorKnownSurfaceBuilder::consume_projection_record with ()
@@ -165,98 +165,17 @@
     }
 
     fn consume_projection_record(
         &mut self,
         record: &ActorKnownProjectionRecord,
         freshness: ActorKnownProjectionFreshness,
         source_tick: SimTick,
     ) {
-        let policy = record.policy();
-        let fact_policy = ProjectionFactPolicy {
-            freshness,
-            source_tick,
-            accessibility_scope: policy.accessibility_scope(),
-        };
-        match record {
-            ActorKnownProjectionRecord::Route {
-                from_place_id,
-                to_place_id,
-                source,
-                source_event_id,
-                ..
-            } => {
-                self.known_edges
-                    .entry(from_place_id.clone())
-                    .or_default()
-                    .insert(to_place_id.clone());
-                self.push_projection_fact(
-                    freshness,
-                    "known_route_surface",
-                    format!("{}->{}", from_place_id.as_str(), to_place_id.as_str()),
-                    source.source_label(),
-                    source_tick,
-                    SourceEventIds::checked(vec![source_event_id.clone()])
-                        .expect("projection record source ids are non-empty"),
-                );
-            }
-            ActorKnownProjectionRecord::FoodSource {
-                food_source_id,
-                place_id: _,
-                believed_servings: _,
-                source,
-                source_event_id,
-                ..
-            } => {
-                self.add_food_source_knowledge(
-                    food_source_id,
-                    source.source_label(),
-                    vec![source_event_id.clone()],
-                    fact_policy,
-                );
-            }
-            ActorKnownProjectionRecord::SleepPlace {
-                place_id,
-                sleep_affordance_id,
-                source,
-                source_event_id,
-                ..
-            } => {
-                self.add_sleep_place_knowledge(
-                    place_id.clone(),
-                    sleep_affordance_id.as_deref(),
-                    source.source_label(),
-                    vec![source_event_id.clone()],
-                    fact_policy,
-                );
-            }
-            ActorKnownProjectionRecord::Workplace {
-                workplace_id,
-                place_id,
-                believed_access_open,
-                source,
-                source_event_id,
-                ..
-            } => {
-                self.add_role_assignment_notice(
-                    workplace_id.clone(),
-                    place_id.clone(),
-                    *believed_access_open,
-                    source.source_label(),
-                    vec![source_event_id.clone()],
-                    fact_policy,
-                );
-            }
-            ActorKnownProjectionRecord::CurrentPlace { .. }
-            | ActorKnownProjectionRecord::CarriedItem { .. }
-            | ActorKnownProjectionRecord::LocalDoor { .. }
-            | ActorKnownProjectionRecord::LocalContainer { .. }
-            | ActorKnownProjectionRecord::LocalItem { .. }
-            | ActorKnownProjectionRecord::LocalActor { .. } => {}
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn push_projection_fact(
         &mut self,
         freshness: ActorKnownProjectionFreshness,
         stable_id: impl Into<String>,
         value: impl Into<String>,
         source: impl Into<String>,

---- aged_food_record_surfaces_as_remembered_belief stdout ----

thread 'aged_food_record_surfaces_as_remembered_belief' (19639) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2648:5:
assertion failed: surface.context().known_food_sources().contains("food_stew_home_tomas")

---- partial_food_source_knowledge_seeds_only_authored_actor_edge stdout ----

thread 'partial_food_source_knowledge_seeds_only_authored_actor_edge' (19658) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2073:5:
assertion failed: mara_known.known_food_sources().contains("food_shared_pantry")

---- episode_tamper_proration_poisons_replay stdout ----

thread 'episode_tamper_proration_poisons_replay' (19643) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2851:5:
assertion failed: has_event(&log, EventKind::SleepInterrupted)

failures:
    aged_food_record_surfaces_as_remembered_belief
    episode_tamper_proration_poisons_replay
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    partial_food_source_knowledge_seeds_only_authored_actor_edge
    planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit
    severe_safety_with_known_exit_produces_move_and_replays
    sleep_spanning_window_boundary_charges_each_tick_once

test result: FAILED. 34 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.30s

*** result: Failure(101)
