*** crates/tracewake-core/src/agent/no_human_surface.rs:266:9: replace NoHumanActorKnownSurfaceBuilder::push_projection_fact with ()

*** mutation diff:
--- crates/tracewake-core/src/agent/no_human_surface.rs
+++ replace NoHumanActorKnownSurfaceBuilder::push_projection_fact with ()
@@ -258,38 +258,17 @@
         &mut self,
         freshness: ActorKnownProjectionFreshness,
         stable_id: impl Into<String>,
         value: impl Into<String>,
         source: impl Into<String>,
         source_tick: SimTick,
         source_event_ids: SourceEventIds,
     ) {
-        match freshness {
-            ActorKnownProjectionFreshness::CurrentlyPerceived => {
-                self.facts.push(ActorKnownFact::observed_now(
-                    self.actor_id.clone(),
-                    stable_id,
-                    value,
-                    source,
-                    Some(source_tick),
-                    source_event_ids,
-                ));
-            }
-            ActorKnownProjectionFreshness::Remembered => {
-                self.facts.push(ActorKnownFact::remembered_belief(
-                    self.actor_id.clone(),
-                    stable_id,
-                    value,
-                    source,
-                    Some(source_tick),
-                    source_event_ids,
-                ));
-            }
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn add_role_assignment_notice(
         &mut self,
         workplace_id: WorkplaceId,
         place_id: PlaceId,
         believed_access_open: bool,
         source: impl Into<String>,

---- aged_food_record_surfaces_as_remembered_belief stdout ----

thread 'aged_food_record_surfaces_as_remembered_belief' (23738) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2648:5:
assertion failed: surface.context().known_food_sources().contains("food_stew_home_tomas")

---- episode_tamper_proration_poisons_replay stdout ----

thread 'episode_tamper_proration_poisons_replay' (23742) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2851:5:
assertion failed: has_event(&log, EventKind::SleepInterrupted)

---- planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit stdout ----

thread 'planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit' (23762) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1603:6:
called `Result::unwrap()` on an `Err` value: NoApplicableMethod { family: EatMeal, reason: "no actor-known method inputs for eat_meal" }

failures:
    aged_food_record_surfaces_as_remembered_belief
    episode_tamper_proration_poisons_replay
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    partial_food_source_knowledge_seeds_only_authored_actor_edge
    planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit
    severe_safety_with_known_exit_produces_move_and_replays
    sleep_spanning_window_boundary_charges_each_tick_once

test result: FAILED. 34 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.33s

*** result: Failure(101)
