*** crates/tracewake-core/src/agent/no_human_surface.rs:299:9: replace NoHumanActorKnownSurfaceBuilder::add_role_assignment_notice with ()

*** mutation diff:
--- crates/tracewake-core/src/agent/no_human_surface.rs
+++ replace NoHumanActorKnownSurfaceBuilder::add_role_assignment_notice with ()
@@ -291,68 +291,17 @@
         &mut self,
         workplace_id: WorkplaceId,
         place_id: PlaceId,
         believed_access_open: bool,
         source: impl Into<String>,
         source_event_ids: Vec<EventId>,
         policy: ProjectionFactPolicy,
     ) {
-        let source_event_ids = SourceEventIds::checked(source_event_ids)
-            .expect("role notice source ids are non-empty");
-        let source = source.into();
-        self.known_workplaces
-            .insert(workplace_id.clone(), place_id.clone());
-        self.facts.push(ActorKnownFact::routine_assignment(
-            self.actor_id.clone(),
-            "actor_knows_workplace",
-            format!("{}@{}", workplace_id.as_str(), place_id.as_str()),
-            format!("role_assignment_notice:{source}"),
-            Some(policy.source_tick),
-            source_event_ids.clone(),
-        ));
-        self.facts.push(ActorKnownFact::routine_assignment(
-            self.actor_id.clone(),
-            "workplace_assignment_active",
-            workplace_id.as_str(),
-            format!("role_assignment_notice:{source}"),
-            Some(policy.source_tick),
-            source_event_ids.clone(),
-        ));
-        if policy.accessibility_scope == ActorKnownProjectionAccessibilityScope::FromAnyPlace {
-            self.facts.push(ActorKnownFact::routine_assignment(
-                self.actor_id.clone(),
-                "workplace_believed_accessible",
-                format!("{}:{}", workplace_id.as_str(), believed_access_open),
-                format!("role_assignment_notice:{source}"),
-                Some(policy.source_tick),
-                source_event_ids.clone(),
-            ));
-        }
-        if place_id == self.current_place_id {
-            if let Some(current_place_witness_event_id) = &self.current_place_witness_event_id {
-                let current_place_source_event_ids =
-                    SourceEventIds::checked(vec![current_place_witness_event_id.clone()])
-                        .expect("place witness id is non-empty");
-                for stable_id in [
-                    "actor_at_workplace",
-                    "assigned_workplace_known",
-                    "at_workplace",
-                ] {
-                    self.facts.push(ActorKnownFact::observed_now(
-                        self.actor_id.clone(),
-                        stable_id,
-                        place_id.as_str(),
-                        "evented_perception:actor_at_workplace",
-                        self.decision_tick,
-                        current_place_source_event_ids.clone(),
-                    ));
-                }
-            }
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn add_food_source_knowledge(
         &mut self,
         food_source: &str,
         source: impl Into<String>,
         source_event_ids: Vec<EventId>,
         policy: ProjectionFactPolicy,

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (27849) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (27850) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2714:5:
assertion failed: has_event(&log, EventKind::ActorMoved)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection

test result: FAILED. 40 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.50s

*** result: Failure(101)
