*** crates/tracewake-core/src/agent/no_human_surface.rs:320:39: replace == with != in NoHumanActorKnownSurfaceBuilder::add_role_assignment_notice

*** mutation diff:
--- crates/tracewake-core/src/agent/no_human_surface.rs
+++ replace == with != in NoHumanActorKnownSurfaceBuilder::add_role_assignment_notice
@@ -312,17 +312,17 @@
         self.facts.push(ActorKnownFact::routine_assignment(
             self.actor_id.clone(),
             "workplace_assignment_active",
             workplace_id.as_str(),
             format!("role_assignment_notice:{source}"),
             Some(policy.source_tick),
             source_event_ids.clone(),
         ));
-        if policy.accessibility_scope == ActorKnownProjectionAccessibilityScope::FromAnyPlace {
+        if policy.accessibility_scope != /* ~ changed by cargo-mutants ~ */ ActorKnownProjectionAccessibilityScope::FromAnyPlace {
             self.facts.push(ActorKnownFact::routine_assignment(
                 self.actor_id.clone(),
                 "workplace_believed_accessible",
                 format!("{}:{}", workplace_id.as_str(), believed_access_open),
                 format!("role_assignment_notice:{source}"),
                 Some(policy.source_tick),
                 source_event_ids.clone(),
             ));

---- agent::no_human_surface::tests::workplace_accessible_fact_requires_from_any_place_scope stdout ----

thread 'agent::no_human_surface::tests::workplace_accessible_fact_requires_from_any_place_scope' (32142) panicked at crates/tracewake-core/src/agent/no_human_surface.rs:749:9:
assertion failed: reachable_fact_ids.contains(&"workplace_believed_accessible")

---- agent::no_human_surface::tests::same_tick_workplace_notice_tie_uses_source_event_id_on_no_human_surface stdout ----

thread 'agent::no_human_surface::tests::same_tick_workplace_notice_tie_uses_source_event_id_on_no_human_surface' (32139) panicked at crates/tracewake-core/src/agent/no_human_surface.rs:947:14:
superseded workplace notice should mint one access fact

---- agent::no_human_surface::tests::workplace_notices_supersede_before_no_human_facts_are_minted stdout ----

thread 'agent::no_human_surface::tests::workplace_notices_supersede_before_no_human_facts_are_minted' (32144) panicked at crates/tracewake-core/src/agent/no_human_surface.rs:900:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    agent::no_human_surface::tests::same_tick_workplace_notice_tie_uses_source_event_id_on_no_human_surface
    agent::no_human_surface::tests::workplace_accessible_fact_requires_from_any_place_scope
    agent::no_human_surface::tests::workplace_notices_supersede_before_no_human_facts_are_minted
    agent::perception::tests::workplace_same_tick_tie_breaks_on_source_event_id_for_both_surfaces
    epistemics::projection::tests::actor_known_projection_policy_table_detects_synthetic_row_mutations
    epistemics::projection::tests::actor_known_projection_policy_table_drives_record_behavior

test result: FAILED. 449 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
