*** crates/tracewake-core/src/agent/no_human_surface.rs:330:21: replace == with != in NoHumanActorKnownSurfaceBuilder::add_role_assignment_notice

*** mutation diff:
--- crates/tracewake-core/src/agent/no_human_surface.rs
+++ replace == with != in NoHumanActorKnownSurfaceBuilder::add_role_assignment_notice
@@ -322,17 +322,17 @@
                 self.actor_id.clone(),
                 "workplace_believed_accessible",
                 format!("{}:{}", workplace_id.as_str(), believed_access_open),
                 format!("role_assignment_notice:{source}"),
                 Some(policy.source_tick),
                 source_event_ids.clone(),
             ));
         }
-        if place_id == self.current_place_id {
+        if place_id != /* ~ changed by cargo-mutants ~ */ self.current_place_id {
             if let Some(current_place_witness_event_id) = &self.current_place_witness_event_id {
                 let current_place_source_event_ids =
                     SourceEventIds::checked(vec![current_place_witness_event_id.clone()])
                         .expect("place witness id is non-empty");
                 for stable_id in [
                     "actor_at_workplace",
                     "assigned_workplace_known",
                     "at_workplace",

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (4039) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.59s

*** result: Failure(101)
