*** crates/tracewake-core/src/agent/no_human_surface.rs:360:9: replace NoHumanActorKnownSurfaceBuilder::add_food_source_knowledge with ()

*** mutation diff:
--- crates/tracewake-core/src/agent/no_human_surface.rs
+++ replace NoHumanActorKnownSurfaceBuilder::add_food_source_knowledge with ()
@@ -352,38 +352,17 @@
 
     fn add_food_source_knowledge(
         &mut self,
         food_source: &str,
         source: impl Into<String>,
         source_event_ids: Vec<EventId>,
         policy: ProjectionFactPolicy,
     ) {
-        let source_event_ids =
-            SourceEventIds::checked(source_event_ids).expect("food source ids are non-empty");
-        let source = source.into();
-        self.known_food_sources.insert(food_source.to_string());
-        self.push_projection_fact(
-            policy.freshness,
-            "actor_knows_food_source",
-            food_source,
-            source.clone(),
-            policy.source_tick,
-            source_event_ids.clone(),
-        );
-        if policy.accessibility_scope == ActorKnownProjectionAccessibilityScope::FromAnyPlace {
-            self.push_projection_fact(
-                policy.freshness,
-                "food_source_believed_accessible",
-                food_source,
-                source,
-                policy.source_tick,
-                source_event_ids,
-            );
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn add_sleep_place_knowledge(
         &mut self,
         place_id: PlaceId,
         sleep_affordance_id: Option<&str>,
         source: impl Into<String>,
         source_event_ids: Vec<EventId>,

---- aged_food_record_surfaces_as_remembered_belief stdout ----

thread 'aged_food_record_surfaces_as_remembered_belief' (8128) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2648:5:
assertion failed: surface.context().known_food_sources().contains("food_stew_home_tomas")

---- partial_food_source_knowledge_seeds_only_authored_actor_edge stdout ----

thread 'partial_food_source_knowledge_seeds_only_authored_actor_edge' (8147) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2073:5:
assertion failed: mara_known.known_food_sources().contains("food_shared_pantry")

---- planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit stdout ----

thread 'planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit' (8152) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1603:6:
called `Result::unwrap()` on an `Err` value: NoApplicableMethod { family: EatMeal, reason: "no actor-known method inputs for eat_meal" }

failures:
    aged_food_record_surfaces_as_remembered_belief
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    partial_food_source_knowledge_seeds_only_authored_actor_edge
    planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit

test result: FAILED. 37 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.41s

*** result: Failure(101)
