*** crates/tracewake-core/src/agent/no_human_surface.rs:392:9: replace NoHumanActorKnownSurfaceBuilder::add_sleep_place_knowledge with ()

*** mutation diff:
--- crates/tracewake-core/src/agent/no_human_surface.rs
+++ replace NoHumanActorKnownSurfaceBuilder::add_sleep_place_knowledge with ()
@@ -384,48 +384,17 @@
     fn add_sleep_place_knowledge(
         &mut self,
         place_id: PlaceId,
         sleep_affordance_id: Option<&str>,
         source: impl Into<String>,
         source_event_ids: Vec<EventId>,
         policy: ProjectionFactPolicy,
     ) {
-        let source_event_ids =
-            SourceEventIds::checked(source_event_ids).expect("sleep source ids are non-empty");
-        let source = source.into();
-        self.known_sleep_places.insert(place_id.clone());
-        if let Some(sleep_affordance_id) = sleep_affordance_id {
-            self.push_projection_fact(
-                policy.freshness,
-                "actor_knows_sleep_affordance",
-                sleep_affordance_id,
-                source.clone(),
-                policy.source_tick,
-                source_event_ids.clone(),
-            );
-        }
-        self.push_projection_fact(
-            policy.freshness,
-            "actor_knows_sleep_place",
-            place_id.as_str(),
-            source.clone(),
-            policy.source_tick,
-            source_event_ids.clone(),
-        );
-        if policy.accessibility_scope == ActorKnownProjectionAccessibilityScope::FromAnyPlace {
-            self.push_projection_fact(
-                policy.freshness,
-                "sleep_place_believed_accessible",
-                place_id.as_str(),
-                source,
-                policy.source_tick,
-                source_event_ids,
-            );
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn add_window_framing_facts(
         &mut self,
         agent_state: &AgentState,
         window_id: &str,
         window_end_tick: SimTick,
         current_place_witness_event_id: Option<EventId>,

---- episode_tamper_proration_poisons_replay stdout ----

thread 'episode_tamper_proration_poisons_replay' (16790) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2851:5:
assertion failed: has_event(&log, EventKind::SleepInterrupted)

---- sleep_spanning_window_boundary_charges_each_tick_once stdout ----

thread 'sleep_spanning_window_boundary_charges_each_tick_once' (16824) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2528:5:
assertion failed: has_event(&log, EventKind::SleepStarted)

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (16797) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2177:5:
assertion failed: has_no_human_event(&log, EventKind::SleepCompleted)

failures:
    episode_tamper_proration_poisons_replay
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    sleep_spanning_window_boundary_charges_each_tick_once

test result: FAILED. 38 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.45s

*** result: Failure(101)
