*** crates/tracewake-core/src/agent/no_human_surface.rs:414:39: replace == with != in NoHumanActorKnownSurfaceBuilder::add_sleep_place_knowledge

*** mutation diff:
--- crates/tracewake-core/src/agent/no_human_surface.rs
+++ replace == with != in NoHumanActorKnownSurfaceBuilder::add_sleep_place_knowledge
@@ -406,17 +406,17 @@
         self.push_projection_fact(
             policy.freshness,
             "actor_knows_sleep_place",
             place_id.as_str(),
             source.clone(),
             policy.source_tick,
             source_event_ids.clone(),
         );
-        if policy.accessibility_scope == ActorKnownProjectionAccessibilityScope::FromAnyPlace {
+        if policy.accessibility_scope != /* ~ changed by cargo-mutants ~ */ ActorKnownProjectionAccessibilityScope::FromAnyPlace {
             self.push_projection_fact(
                 policy.freshness,
                 "sleep_place_believed_accessible",
                 place_id.as_str(),
                 source,
                 policy.source_tick,
                 source_event_ids,
             );

---- episode_tamper_proration_poisons_replay stdout ----

thread 'episode_tamper_proration_poisons_replay' (20889) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2851:5:
assertion failed: has_event(&log, EventKind::SleepInterrupted)

---- sleep_spanning_window_boundary_charges_each_tick_once stdout ----

thread 'sleep_spanning_window_boundary_charges_each_tick_once' (20923) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2528:5:
assertion failed: has_event(&log, EventKind::SleepStarted)

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (20896) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2177:5:
assertion failed: has_no_human_event(&log, EventKind::SleepCompleted)

failures:
    episode_tamper_proration_poisons_replay
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    sleep_spanning_window_boundary_charges_each_tick_once

test result: FAILED. 38 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.46s

*** result: Failure(101)
