*** crates/tracewake-core/src/agent/no_human_surface.rs:517:5: replace has_active_intention -> bool with false

*** mutation diff:
--- crates/tracewake-core/src/agent/no_human_surface.rs
+++ replace has_active_intention -> bool with false
@@ -509,19 +509,17 @@
                 self.decision_tick,
                 frame_source_event_ids,
             ));
         }
     }
 }
 
 fn has_active_intention(agent_state: &AgentState, actor_id: &ActorId) -> bool {
-    agent_state
-        .active_intention_by_actor()
-        .contains_key(actor_id)
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::agent::htn::{resolve_condition, ConditionResolution};
     use crate::agent::{
         plan_local_actions, LocalPlanRequest, PlannerGoal, RoutineCondition, RoutineStep,

---- agent::no_human_surface::tests::active_intention_presence_uses_actor_specific_index stdout ----

thread 'agent::no_human_surface::tests::active_intention_presence_uses_actor_specific_index' (1302) panicked at crates/tracewake-core/src/agent/no_human_surface.rs:663:9:
assertion failed: has_active_intention(&agent_state, &actor_id)

failures:
    agent::no_human_surface::tests::active_intention_presence_uses_actor_specific_index

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
