*** crates/tracewake-core/src/agent/perception.rs:169:13: replace && with || in current_place_perception_events

*** mutation diff:
--- crates/tracewake-core/src/agent/perception.rs
+++ replace && with || in current_place_perception_events
@@ -161,17 +161,17 @@
                 .into_iter()
                 .chain([PayloadField::new("portable", item.portable.to_string())])
                 .collect(),
         });
     }
 
     for local_actor_id in state.actors().keys().filter(|local_actor_id| {
         *local_actor_id != actor_id
-            && state
+            || /* ~ changed by cargo-mutants ~ */ state
                 .actors()
                 .get(*local_actor_id)
                 .is_some_and(|local_actor| local_actor.current_place_id == current_place_id)
     }) {
         observations.push(PerceivedThing {
             kind: "visible_actor",
             subject_id: current_place_id.as_str().to_string(),
             target_id: local_actor_id.as_str().to_string(),

---- agent::perception::tests::current_place_perception_emits_only_current_place_without_visible_surfaces stdout ----

thread 'agent::perception::tests::current_place_perception_emits_only_current_place_without_visible_surfaces' (22312) panicked at crates/tracewake-core/src/agent/perception.rs:979:9:
assertion `left == right` failed
  left: 2
 right: 1

---- agent::perception::tests::current_place_perception_emits_window_keyed_observation_events stdout ----

thread 'agent::perception::tests::current_place_perception_emits_window_keyed_observation_events' (22313) panicked at crates/tracewake-core/src/agent/perception.rs:759:9:
assertion `left == right` failed
  left: {"current_place", "visible_actor", "visible_exit", "visible_food_supply", "visible_sleep_affordance"}
 right: {"current_place", "visible_exit", "visible_food_supply", "visible_sleep_affordance"}

---- scheduler::no_human::tests::no_human_day_records_current_place_perception_before_decision stdout ----

thread 'scheduler::no_human::tests::no_human_day_records_current_place_perception_before_decision' (22550) panicked at crates/tracewake-core/src/scheduler.rs:4507:13:
assertion `left == right` failed
  left: 5
 right: 4

failures:
    agent::perception::tests::current_place_perception_emits_only_current_place_without_visible_surfaces
    agent::perception::tests::current_place_perception_emits_window_keyed_observation_events
    scheduler::no_human::tests::no_human_day_records_current_place_perception_before_decision

test result: FAILED. 452 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
