*** crates/tracewake-core/src/agent/perception.rs:172:73: replace == with != in current_place_perception_events

*** mutation diff:
--- crates/tracewake-core/src/agent/perception.rs
+++ replace == with != in current_place_perception_events
@@ -164,17 +164,17 @@
         });
     }
 
     for local_actor_id in state.actors().keys().filter(|local_actor_id| {
         *local_actor_id != actor_id
             && state
                 .actors()
                 .get(*local_actor_id)
-                .is_some_and(|local_actor| local_actor.current_place_id == current_place_id)
+                .is_some_and(|local_actor| local_actor.current_place_id != /* ~ changed by cargo-mutants ~ */ current_place_id)
     }) {
         observations.push(PerceivedThing {
             kind: "visible_actor",
             subject_id: current_place_id.as_str().to_string(),
             target_id: local_actor_id.as_str().to_string(),
             place_id: current_place_id.clone(),
             servings: None,
             payload: Vec::new(),

---- bind_render_submit_rerender_and_show_why_not stdout ----

thread 'bind_render_submit_rerender_and_show_why_not' (316) panicked at crates/tracewake-tui/tests/embodied_flow.rs:19:5:
assertion `left == right` failed
  left: "hkc.actor_tomas.0.6"
 right: "hkc.actor_tomas.0.7"

---- phase3a_embodied_view_renders_needs_routine_affordances_without_hidden_truth stdout ----

thread 'phase3a_embodied_view_renders_needs_routine_affordances_without_hidden_truth' (320) panicked at crates/tracewake-tui/tests/embodied_flow.rs:76:5:
assertion failed: !rendered.contains("actor_mara")

failures:
    bind_render_submit_rerender_and_show_why_not
    phase3a_embodied_view_renders_needs_routine_affordances_without_hidden_truth

test result: FAILED. 4 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
