*** crates/tracewake-core/src/agent/perception.rs:201:42: replace && with || in current_place_perception_events

*** mutation diff:
--- crates/tracewake-core/src/agent/perception.rs
+++ replace && with || in current_place_perception_events
@@ -193,17 +193,17 @@
             payload: Vec::new(),
         });
     }
 
     for sleep_affordance in state
         .sleep_affordances()
         .values()
         .filter(|sleep_affordance| {
-            sleep_affordance.access_open && sleep_affordance.place_id == current_place_id
+            sleep_affordance.access_open || /* ~ changed by cargo-mutants ~ */ sleep_affordance.place_id == current_place_id
         })
     {
         observations.push(PerceivedThing {
             kind: "visible_sleep_affordance",
             subject_id: current_place_id.as_str().to_string(),
             target_id: sleep_affordance.sleep_affordance_id.as_str().to_string(),
             place_id: current_place_id.clone(),
             servings: None,

---- phase3a_embodied_view_renders_needs_routine_affordances_without_hidden_truth stdout ----

thread 'phase3a_embodied_view_renders_needs_routine_affordances_without_hidden_truth' (5952) panicked at crates/tracewake-tui/tests/embodied_flow.rs:73:5:
assertion failed: !rendered.contains("Sleep here")

failures:
    phase3a_embodied_view_renders_needs_routine_affordances_without_hidden_truth

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
