*** crates/tracewake-core/src/agent/perception.rs:201:71: replace == with != in current_place_perception_events

*** mutation diff:
--- crates/tracewake-core/src/agent/perception.rs
+++ replace == with != in current_place_perception_events
@@ -193,17 +193,17 @@
             payload: Vec::new(),
         });
     }
 
     for sleep_affordance in state
         .sleep_affordances()
         .values()
         .filter(|sleep_affordance| {
-            sleep_affordance.access_open && sleep_affordance.place_id == current_place_id
+            sleep_affordance.access_open && sleep_affordance.place_id != /* ~ changed by cargo-mutants ~ */ current_place_id
         })
     {
         observations.push(PerceivedThing {
             kind: "visible_sleep_affordance",
             subject_id: current_place_id.as_str().to_string(),
             target_id: sleep_affordance.sleep_affordance_id.as_str().to_string(),
             place_id: current_place_id.clone(),
             servings: None,

---- agent::perception::tests::current_place_knowledge_context_uses_latest_projection_window_for_sleep_affordances stdout ----

thread 'agent::perception::tests::current_place_knowledge_context_uses_latest_projection_window_for_sleep_affordances' (10222) panicked at crates/tracewake-core/src/agent/perception.rs:1107:9:
assertion failed: stale_context.actor_known_sleep_affordances().iter().any(|fact|
        fact.sleep_affordance_id().as_str() == "bed_tomas")

---- agent::perception::tests::embodied_context_filters_reclassified_records_by_declared_scope_but_no_human_keeps_memory stdout ----

thread 'agent::perception::tests::embodied_context_filters_reclassified_records_by_declared_scope_but_no_human_keeps_memory' (10227) panicked at crates/tracewake-core/src/agent/perception.rs:1191:14:
shared classifier keeps remembered sleep place

---- agent::perception::tests::current_place_perception_emits_window_keyed_observation_events stdout ----

thread 'agent::perception::tests::current_place_perception_emits_window_keyed_observation_events' (10226) panicked at crates/tracewake-core/src/agent/perception.rs:759:9:
assertion `left == right` failed
  left: {"current_place", "visible_exit", "visible_food_supply"}
 right: {"current_place", "visible_exit", "visible_food_supply", "visible_sleep_affordance"}

failures:
    agent::perception::tests::current_place_knowledge_context_uses_latest_projection_window_for_sleep_affordances
    agent::perception::tests::current_place_perception_emits_window_keyed_observation_events
    agent::perception::tests::embodied_context_filters_reclassified_records_by_declared_scope_but_no_human_keeps_memory
    scheduler::no_human::tests::no_human_day_counts_duration_completion_as_window_progress
    scheduler::no_human::tests::no_human_day_records_current_place_perception_before_decision

test result: FAILED. 450 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
