*** crates/tracewake-core/src/agent/perception.rs:26:5: replace record_current_place_perception -> Vec<EventEnvelope> with vec![]

*** mutation diff:
--- crates/tracewake-core/src/agent/perception.rs
+++ replace record_current_place_perception -> Vec<EventEnvelope> with vec![]
@@ -18,23 +18,17 @@
 
 pub fn record_current_place_perception(
     log: &mut EventLog,
     state: &PhysicalState,
     actor_id: &ActorId,
     decision_tick: SimTick,
     content_manifest_id: &ContentManifestId,
 ) -> Vec<EventEnvelope> {
-    current_place_perception_events(state, actor_id, decision_tick, content_manifest_id)
-        .into_iter()
-        .map(|event| {
-            log.append(event)
-                .expect("current-place perception event is versioned")
-        })
-        .collect()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn record_current_place_perception_and_project(
     log: &mut EventLog,
     state: &mut PhysicalState,
     _agent_state: &mut AgentState,
     epistemic_projection: &mut EpistemicProjection,
     actor_id: &ActorId,

---- aged_food_record_surfaces_as_remembered_belief stdout ----

thread 'aged_food_record_surfaces_as_remembered_belief' (5665) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2626:5:
assertion failed: perception_events.iter().any(|event|
        {
            event.event_type == EventKind::ObservationRecorded &&
                payload(event, "target_id") == Some("food_stew_home_tomas")
        })

---- severe_safety_with_known_exit_produces_move_and_replays stdout ----

thread 'severe_safety_with_known_exit_produces_move_and_replays' (5700) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1715:10:
severe safety should commit a move

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (5676) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

failures:
    aged_food_record_surfaces_as_remembered_belief
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    severe_safety_with_known_exit_produces_move_and_replays

test result: FAILED. 38 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.30s

*** result: Failure(101)
