*** crates/tracewake-core/src/agent/perception.rs:297:20: delete ! in current_place_knowledge_context

*** mutation diff:
--- crates/tracewake-core/src/agent/perception.rs
+++ delete ! in current_place_knowledge_context
@@ -289,17 +289,17 @@
             classified.is_latest_current_place_record(),
         );
         match classified.record() {
             ActorKnownProjectionRecord::Route {
                 from_place_id,
                 to_place_id,
                 ..
             } => {
-                if !included_by_policy {
+                if  /* ~ changed by cargo-mutants ~ */included_by_policy {
                     continue;
                 }
                 routes.push(ActorKnownRouteFact::new(
                     from_place_id.clone(),
                     to_place_id.clone(),
                     source_key,
                 ));
             }

---- epistemics::projection::tests::actor_known_projection_policy_table_drives_record_behavior stdout ----

thread 'epistemics::projection::tests::actor_known_projection_policy_table_drives_record_behavior' (14890) panicked at crates/tracewake-core/src/epistemics/projection.rs:2166:9:
policy table rows must drive emitted no-human and embodied surface behavior: ["route embodied expected true observed false"]

failures:
    epistemics::projection::tests::actor_known_projection_policy_table_drives_record_behavior

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
