*** crates/tracewake-core/src/agent/perception.rs:44:5: replace record_current_place_perception_and_project -> Vec<EventEnvelope> with vec![]

*** mutation diff:
--- crates/tracewake-core/src/agent/perception.rs
+++ replace record_current_place_perception_and_project -> Vec<EventEnvelope> with vec![]
@@ -36,22 +36,17 @@
     log: &mut EventLog,
     state: &mut PhysicalState,
     _agent_state: &mut AgentState,
     epistemic_projection: &mut EpistemicProjection,
     actor_id: &ActorId,
     decision_tick: SimTick,
     content_manifest_id: &ContentManifestId,
 ) -> Vec<EventEnvelope> {
-    let events =
-        record_current_place_perception(log, state, actor_id, decision_tick, content_manifest_id);
-    for event in &events {
-        project_perception_event(epistemic_projection, event);
-    }
-    events
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn current_place_perception_events(
     state: &PhysicalState,
     actor_id: &ActorId,
     decision_tick: SimTick,
     content_manifest_id: &ContentManifestId,
 ) -> Vec<EventEnvelope> {

---- aged_food_record_surfaces_as_remembered_belief stdout ----

thread 'aged_food_record_surfaces_as_remembered_belief' (9777) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2626:5:
assertion failed: perception_events.iter().any(|event|
        {
            event.event_type == EventKind::ObservationRecorded &&
                payload(event, "target_id") == Some("food_stew_home_tomas")
        })

failures:
    aged_food_record_surfaces_as_remembered_belief

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.60s

*** result: Failure(101)
