*** crates/tracewake-core/src/agent/perception.rs:474:5: replace project_perception_event with ()

*** mutation diff:
--- crates/tracewake-core/src/agent/perception.rs
+++ replace project_perception_event with ()
@@ -466,47 +466,17 @@
         doors,
         containers,
         items,
         local_actors,
     )
 }
 
 fn project_perception_event(projection: &mut EpistemicProjection, event: &EventEnvelope) {
-    let Some(actor_id) = event.actor_id.clone() else {
-        return;
-    };
-    let Some(place_id) = event.place_id.clone() else {
-        return;
-    };
-    let Some(observation_id) =
-        payload_value(event, "observation_id").and_then(|value| ObservationId::new(value).ok())
-    else {
-        return;
-    };
-    let Some(observed_tick) = payload_value(event, "observed_tick")
-        .and_then(|value| value.parse::<u64>().ok())
-        .map(SimTick::new)
-    else {
-        return;
-    };
-    let observation = Observation::new(
-        observation_id,
-        actor_id,
-        Channel::DirectSight,
-        observed_tick,
-        place_id.clone(),
-        ObservationSubject::Place(place_id.clone()),
-        ObservationTarget::Place(place_id),
-        Confidence::MAX,
-        SourceRef::Event(event.event_id.clone()),
-    )
-    .with_raw_payload(event.payload.clone());
-    projection.insert_observation(observation);
-    projection.record_applied_event(event.event_id.clone());
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn is_visible_exit_target(state: &PhysicalState, place_id: &PlaceId) -> bool {
     let Some(place) = state.places().get(place_id) else {
         return false;
     };
     place.visibility_default.is_visible()
 }

---- aged_food_record_surfaces_as_remembered_belief stdout ----

thread 'aged_food_record_surfaces_as_remembered_belief' (28259) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2648:5:
assertion failed: surface.context().known_food_sources().contains("food_stew_home_tomas")

failures:
    aged_food_record_surfaces_as_remembered_belief

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.61s

*** result: Failure(101)
