*** crates/tracewake-core/src/agent/perception.rs:508:5: replace is_visible_exit_target -> bool with true

*** mutation diff:
--- crates/tracewake-core/src/agent/perception.rs
+++ replace is_visible_exit_target -> bool with true
@@ -500,20 +500,17 @@
         SourceRef::Event(event.event_id.clone()),
     )
     .with_raw_payload(event.payload.clone());
     projection.insert_observation(observation);
     projection.record_applied_event(event.event_id.clone());
 }
 
 fn is_visible_exit_target(state: &PhysicalState, place_id: &PlaceId) -> bool {
-    let Some(place) = state.places().get(place_id) else {
-        return false;
-    };
-    place.visibility_default.is_visible()
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn payload_value<'a>(event: &'a EventEnvelope, key: &str) -> Option<&'a str> {
     event
         .payload
         .iter()
         .find(|field| field.key == key)
         .map(|field| field.value.as_str())

---- no_hidden_truth_fixture_keeps_hidden_food_out_of_planner_inputs stdout ----

thread 'no_hidden_truth_fixture_keeps_hidden_food_out_of_planner_inputs' (32368) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1975:9:
assertion failed: !no_human_log.events().iter().any(|event|
            {
                event.ordering_key.target_ids.iter().any(|target|
                                target == forbidden) ||
                        event.participants.iter().any(|participant|
                                participant == forbidden) ||
                    event.payload.iter().any(|field|
                            field.value.contains(forbidden))
            })

failures:
    no_hidden_truth_fixture_keeps_hidden_food_out_of_planner_inputs

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.61s

*** result: Failure(101)
