*** crates/tracewake-core/src/agent/perception.rs:508:5: replace is_visible_exit_target -> bool with false

*** mutation diff:
--- crates/tracewake-core/src/agent/perception.rs
+++ replace is_visible_exit_target -> bool with false
@@ -500,20 +500,17 @@
         SourceRef::Event(event.event_id.clone()),
     )
     .with_raw_payload(event.payload.clone());
     projection.insert_observation(observation);
     projection.record_applied_event(event.event_id.clone());
 }
 
 fn is_visible_exit_target(state: &PhysicalState, place_id: &PlaceId) -> bool {
-    let Some(place) = state.places().get(place_id) else {
-        return false;
-    };
-    place.visibility_default.is_visible()
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn payload_value<'a>(event: &'a EventEnvelope, key: &str) -> Option<&'a str> {
     event
         .payload
         .iter()
         .find(|field| field.key == key)
         .map(|field| field.value.as_str())

---- severe_safety_with_known_exit_produces_move_and_replays stdout ----

thread 'severe_safety_with_known_exit_produces_move_and_replays' (4024) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1715:10:
severe safety should commit a move

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (4000) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (4001) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2714:5:
assertion failed: has_event(&log, EventKind::ActorMoved)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    severe_safety_with_known_exit_produces_move_and_replays

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.43s

*** result: Failure(101)
