*** crates/tracewake-core/src/agent/perception.rs:537:5: replace visible_item_payload -> Option<Vec<PayloadField>> with Some(vec![])

*** mutation diff:
--- crates/tracewake-core/src/agent/perception.rs
+++ replace visible_item_payload -> Option<Vec<PayloadField>> with Some(vec![])
@@ -529,37 +529,17 @@
     payload: Vec<PayloadField>,
 }
 
 fn visible_item_payload(
     state: &PhysicalState,
     current_place_id: &PlaceId,
     location: &Location,
 ) -> Option<Vec<PayloadField>> {
-    match location {
-        Location::AtPlace(place_id) if place_id == current_place_id => Some(vec![
-            PayloadField::new("item_source_kind", "place"),
-            PayloadField::new("item_source_place_id", place_id.as_str()),
-        ]),
-        Location::InContainer(container_id) => {
-            let container = state.containers().get(container_id)?;
-            if !matches!(&container.location, Location::AtPlace(place_id) if place_id == current_place_id)
-            {
-                return None;
-            }
-            if !container.is_open && !container.contents_visible_when_closed {
-                return None;
-            }
-            Some(vec![
-                PayloadField::new("item_source_kind", "container"),
-                PayloadField::new("item_source_container_id", container_id.as_str()),
-            ])
-        }
-        Location::CarriedBy(_) | Location::AtPlace(_) => None,
-    }
+    Some(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 fn observation_event(
     actor_id: &ActorId,
     decision_tick: SimTick,
     index: u64,
     content_manifest_id: &ContentManifestId,
     perceived: PerceivedThing,

---- agent::perception::tests::visible_item_perception_reveals_open_container_without_closed_visibility stdout ----

thread 'agent::perception::tests::visible_item_perception_reveals_open_container_without_closed_visibility' (29263) panicked at crates/tracewake-core/src/agent/perception.rs:875:9:
assertion `left == right` failed
  left: None
 right: Some("container")

---- agent::perception::tests::visible_item_perception_follows_current_place_match_not_id_prose stdout ----

thread 'agent::perception::tests::visible_item_perception_follows_current_place_match_not_id_prose' (29262) panicked at crates/tracewake-core/src/agent/perception.rs:819:9:
assertion `left == right` failed
  left: None
 right: Some("place")

failures:
    agent::perception::tests::visible_item_perception_follows_current_place_match_not_id_prose
    agent::perception::tests::visible_item_perception_reveals_open_container_without_closed_visibility

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
