*** crates/tracewake-core/src/agent/perception.rs:538:40: replace match guard place_id == current_place_id with false in visible_item_payload

*** mutation diff:
--- crates/tracewake-core/src/agent/perception.rs
+++ replace match guard place_id == current_place_id with false in visible_item_payload
@@ -530,17 +530,17 @@
 }
 
 fn visible_item_payload(
     state: &PhysicalState,
     current_place_id: &PlaceId,
     location: &Location,
 ) -> Option<Vec<PayloadField>> {
     match location {
-        Location::AtPlace(place_id) if place_id == current_place_id => Some(vec![
+        Location::AtPlace(place_id) if false /* ~ changed by cargo-mutants ~ */ => Some(vec![
             PayloadField::new("item_source_kind", "place"),
             PayloadField::new("item_source_place_id", place_id.as_str()),
         ]),
         Location::InContainer(container_id) => {
             let container = state.containers().get(container_id)?;
             if !matches!(&container.location, Location::AtPlace(place_id) if place_id == current_place_id)
             {
                 return None;

---- agent::perception::tests::visible_item_perception_follows_current_place_match_not_id_prose stdout ----

thread 'agent::perception::tests::visible_item_perception_follows_current_place_match_not_id_prose' (5925) panicked at crates/tracewake-core/src/agent/perception.rs:838:14:
item at the actor's current place is perceived

failures:
    agent::perception::tests::visible_item_perception_follows_current_place_match_not_id_prose

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
