*** crates/tracewake-core/src/agent/perception.rs:544:16: delete ! in visible_item_payload

*** mutation diff:
--- crates/tracewake-core/src/agent/perception.rs
+++ delete ! in visible_item_payload
@@ -536,17 +536,17 @@
 ) -> Option<Vec<PayloadField>> {
     match location {
         Location::AtPlace(place_id) if place_id == current_place_id => Some(vec![
             PayloadField::new("item_source_kind", "place"),
             PayloadField::new("item_source_place_id", place_id.as_str()),
         ]),
         Location::InContainer(container_id) => {
             let container = state.containers().get(container_id)?;
-            if !matches!(&container.location, Location::AtPlace(place_id) if place_id == current_place_id)
+            if  /* ~ changed by cargo-mutants ~ */matches!(&container.location, Location::AtPlace(place_id) if place_id == current_place_id)
             {
                 return None;
             }
             if !container.is_open && !container.contents_visible_when_closed {
                 return None;
             }
             Some(vec![
                 PayloadField::new("item_source_kind", "container"),

---- agent::perception::tests::visible_item_perception_reveals_open_container_without_closed_visibility stdout ----

thread 'agent::perception::tests::visible_item_perception_reveals_open_container_without_closed_visibility' (15044) panicked at crates/tracewake-core/src/agent/perception.rs:894:14:
item in an open container at the current place is perceived

failures:
    agent::perception::tests::visible_item_perception_reveals_open_container_without_closed_visibility

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
