*** crates/tracewake-core/src/agent/perception.rs:548:35: replace && with || in visible_item_payload

*** mutation diff:
--- crates/tracewake-core/src/agent/perception.rs
+++ replace && with || in visible_item_payload
@@ -540,17 +540,17 @@
             PayloadField::new("item_source_place_id", place_id.as_str()),
         ]),
         Location::InContainer(container_id) => {
             let container = state.containers().get(container_id)?;
             if !matches!(&container.location, Location::AtPlace(place_id) if place_id == current_place_id)
             {
                 return None;
             }
-            if !container.is_open && !container.contents_visible_when_closed {
+            if !container.is_open || /* ~ changed by cargo-mutants ~ */ !container.contents_visible_when_closed {
                 return None;
             }
             Some(vec![
                 PayloadField::new("item_source_kind", "container"),
                 PayloadField::new("item_source_container_id", container_id.as_str()),
             ])
         }
         Location::CarriedBy(_) | Location::AtPlace(_) => None,

---- agent::perception::tests::visible_item_perception_reveals_open_container_without_closed_visibility stdout ----

thread 'agent::perception::tests::visible_item_perception_reveals_open_container_without_closed_visibility' (19603) panicked at crates/tracewake-core/src/agent/perception.rs:894:14:
item in an open container at the current place is perceived

failures:
    agent::perception::tests::visible_item_perception_reveals_open_container_without_closed_visibility

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
