*** crates/tracewake-core/src/agent/perception.rs:548:38: delete ! in visible_item_payload

*** mutation diff:
--- crates/tracewake-core/src/agent/perception.rs
+++ delete ! in visible_item_payload
@@ -540,17 +540,17 @@
             PayloadField::new("item_source_place_id", place_id.as_str()),
         ]),
         Location::InContainer(container_id) => {
             let container = state.containers().get(container_id)?;
             if !matches!(&container.location, Location::AtPlace(place_id) if place_id == current_place_id)
             {
                 return None;
             }
-            if !container.is_open && !container.contents_visible_when_closed {
+            if !container.is_open &&  /* ~ changed by cargo-mutants ~ */container.contents_visible_when_closed {
                 return None;
             }
             Some(vec![
                 PayloadField::new("item_source_kind", "container"),
                 PayloadField::new("item_source_container_id", container_id.as_str()),
             ])
         }
         Location::CarriedBy(_) | Location::AtPlace(_) => None,

---- debug_item_does_not_leak_to_following_view_or_change_checksum stdout ----

thread 'debug_item_does_not_leak_to_following_view_or_change_checksum' (30055) panicked at crates/tracewake-tui/tests/command_loop_session.rs:101:5:
assertion failed: !following_view.contains("coin_stack_01")

failures:
    debug_item_does_not_leak_to_following_view_or_change_checksum

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.27s

*** result: Failure(101)
