*** crates/tracewake-core/src/agent/perception.rs:58:5: replace current_place_perception_events -> Vec<EventEnvelope> with vec![]

*** mutation diff:
--- crates/tracewake-core/src/agent/perception.rs
+++ replace current_place_perception_events -> Vec<EventEnvelope> with vec![]
@@ -50,185 +50,17 @@
 }
 
 pub fn current_place_perception_events(
     state: &PhysicalState,
     actor_id: &ActorId,
     decision_tick: SimTick,
     content_manifest_id: &ContentManifestId,
 ) -> Vec<EventEnvelope> {
-    let Some(actor) = state.actors().get(actor_id) else {
-        return Vec::new();
-    };
-    let current_place_id = actor.current_place_id.clone();
-    let mut observations = Vec::new();
-
-    if let Some(place) = state.places().get(&current_place_id) {
-        observations.push(PerceivedThing {
-            kind: "current_place",
-            subject_id: current_place_id.as_str().to_string(),
-            target_id: current_place_id.as_str().to_string(),
-            place_id: current_place_id.clone(),
-            servings: None,
-            payload: vec![PayloadField::new(
-                "display_label",
-                place.display_label.clone(),
-            )],
-        });
-
-        for adjacent_place_id in &place.adjacent_place_ids {
-            if !is_visible_exit_target(state, adjacent_place_id) {
-                continue;
-            }
-            observations.push(PerceivedThing {
-                kind: "visible_exit",
-                subject_id: current_place_id.as_str().to_string(),
-                target_id: adjacent_place_id.as_str().to_string(),
-                place_id: current_place_id.clone(),
-                servings: None,
-                payload: Vec::new(),
-            });
-        }
-    }
-
-    for item_id in &actor.carried_item_ids {
-        let Some(item) = state.items().get(item_id) else {
-            continue;
-        };
-        observations.push(PerceivedThing {
-            kind: "carried_item",
-            subject_id: current_place_id.as_str().to_string(),
-            target_id: item.item_id.as_str().to_string(),
-            place_id: current_place_id.clone(),
-            servings: None,
-            payload: vec![
-                PayloadField::new("item_source_kind", "carried"),
-                PayloadField::new("item_source_actor_id", actor.actor_id.as_str()),
-                PayloadField::new("portable", item.portable.to_string()),
-            ],
-        });
-    }
-
-    for door in state
-        .doors()
-        .values()
-        .filter(|door| door.connects_place(&current_place_id))
-    {
-        observations.push(PerceivedThing {
-            kind: "visible_door",
-            subject_id: current_place_id.as_str().to_string(),
-            target_id: door.door_id.as_str().to_string(),
-            place_id: current_place_id.clone(),
-            servings: None,
-            payload: vec![
-                PayloadField::new("endpoint_a", door.endpoint_a.as_str()),
-                PayloadField::new("endpoint_b", door.endpoint_b.as_str()),
-                PayloadField::new("is_open", door.is_open.to_string()),
-                PayloadField::new("is_locked", door.is_locked.to_string()),
-                PayloadField::new(
-                    "blocks_movement_when_closed",
-                    door.blocks_movement_when_closed.to_string(),
-                ),
-            ],
-        });
-    }
-
-    for container in state.containers().values().filter(|container| {
-        matches!(&container.location, Location::AtPlace(place_id) if place_id == &current_place_id)
-    }) {
-        observations.push(PerceivedThing {
-            kind: "visible_container",
-            subject_id: current_place_id.as_str().to_string(),
-            target_id: container.container_id.as_str().to_string(),
-            place_id: current_place_id.clone(),
-            servings: None,
-            payload: vec![
-                PayloadField::new("is_open", container.is_open.to_string()),
-                PayloadField::new("is_locked", container.is_locked.to_string()),
-            ],
-        });
-    }
-
-    for item in state.items().values() {
-        let Some(payload) = visible_item_payload(state, &current_place_id, &item.location) else {
-            continue;
-        };
-        observations.push(PerceivedThing {
-            kind: "visible_item",
-            subject_id: current_place_id.as_str().to_string(),
-            target_id: item.item_id.as_str().to_string(),
-            place_id: current_place_id.clone(),
-            servings: None,
-            payload: payload
-                .into_iter()
-                .chain([PayloadField::new("portable", item.portable.to_string())])
-                .collect(),
-        });
-    }
-
-    for local_actor_id in state.actors().keys().filter(|local_actor_id| {
-        *local_actor_id != actor_id
-            && state
-                .actors()
-                .get(*local_actor_id)
-                .is_some_and(|local_actor| local_actor.current_place_id == current_place_id)
-    }) {
-        observations.push(PerceivedThing {
-            kind: "visible_actor",
-            subject_id: current_place_id.as_str().to_string(),
-            target_id: local_actor_id.as_str().to_string(),
-            place_id: current_place_id.clone(),
-            servings: None,
-            payload: Vec::new(),
-        });
-    }
-
-    for food in state.food_supplies().values().filter(|food| {
-        matches!(&food.location, Location::AtPlace(place_id) if place_id == &current_place_id)
-    }) {
-        observations.push(PerceivedThing {
-            kind: "visible_food_supply",
-            subject_id: current_place_id.as_str().to_string(),
-            target_id: food.food_supply_id.as_str().to_string(),
-            place_id: current_place_id.clone(),
-            servings: Some(food.servings),
-            payload: Vec::new(),
-        });
-    }
-
-    for sleep_affordance in state
-        .sleep_affordances()
-        .values()
-        .filter(|sleep_affordance| {
-            sleep_affordance.access_open && sleep_affordance.place_id == current_place_id
-        })
-    {
-        observations.push(PerceivedThing {
-            kind: "visible_sleep_affordance",
-            subject_id: current_place_id.as_str().to_string(),
-            target_id: sleep_affordance.sleep_affordance_id.as_str().to_string(),
-            place_id: current_place_id.clone(),
-            servings: None,
-            payload: Vec::new(),
-        });
-    }
-
-    observations
-        .into_iter()
-        .enumerate()
-        .map(|(index, perceived)| {
-            observation_event(
-                actor_id,
-                decision_tick,
-                index as u64,
-                content_manifest_id,
-                perceived,
-            )
-        })
-        .collect()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn current_place_knowledge_context(
     state: &PhysicalState,
     epistemic_projection: Option<&EpistemicProjection>,
     actor_id: &ActorId,
     decision_tick: SimTick,
     _content_manifest_id: &ContentManifestId,

---- aged_food_record_surfaces_as_remembered_belief stdout ----

thread 'aged_food_record_surfaces_as_remembered_belief' (13888) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2626:5:
assertion failed: perception_events.iter().any(|event|
        {
            event.event_type == EventKind::ObservationRecorded &&
                payload(event, "target_id") == Some("food_stew_home_tomas")
        })

---- severe_safety_with_known_exit_produces_move_and_replays stdout ----

thread 'severe_safety_with_known_exit_produces_move_and_replays' (13923) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1715:10:
severe safety should commit a move

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (13899) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

failures:
    aged_food_record_surfaces_as_remembered_belief
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    severe_safety_with_known_exit_produces_move_and_replays

test result: FAILED. 38 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.30s

*** result: Failure(101)
