*** crates/tracewake-core/src/agent/perception.rs:78:16: delete ! in current_place_perception_events

*** mutation diff:
--- crates/tracewake-core/src/agent/perception.rs
+++ delete ! in current_place_perception_events
@@ -70,17 +70,17 @@
             servings: None,
             payload: vec![PayloadField::new(
                 "display_label",
                 place.display_label.clone(),
             )],
         });
 
         for adjacent_place_id in &place.adjacent_place_ids {
-            if !is_visible_exit_target(state, adjacent_place_id) {
+            if  /* ~ changed by cargo-mutants ~ */is_visible_exit_target(state, adjacent_place_id) {
                 continue;
             }
             observations.push(PerceivedThing {
                 kind: "visible_exit",
                 subject_id: current_place_id.as_str().to_string(),
                 target_id: adjacent_place_id.as_str().to_string(),
                 place_id: current_place_id.clone(),
                 servings: None,

---- no_hidden_truth_fixture_keeps_hidden_food_out_of_planner_inputs stdout ----

thread 'no_hidden_truth_fixture_keeps_hidden_food_out_of_planner_inputs' (18009) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1975:9:
assertion failed: !no_human_log.events().iter().any(|event|
            {
                event.ordering_key.target_ids.iter().any(|target|
                                target == forbidden) ||
                        event.participants.iter().any(|participant|
                                participant == forbidden) ||
                    event.payload.iter().any(|field|
                            field.value.contains(forbidden))
            })

---- severe_safety_with_known_exit_produces_move_and_replays stdout ----

thread 'severe_safety_with_known_exit_produces_move_and_replays' (18034) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1715:10:
severe safety should commit a move

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (18010) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

failures:
    no_hidden_truth_fixture_keeps_hidden_food_out_of_planner_inputs
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    severe_safety_with_known_exit_produces_move_and_replays

test result: FAILED. 38 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.45s

*** result: Failure(101)
