*** crates/tracewake-core/src/agent/planner.rs:126:33: replace == with != in plan_start_sleep

*** mutation diff:
--- crates/tracewake-core/src/agent/planner.rs
+++ replace == with != in plan_start_sleep
@@ -118,17 +118,17 @@
 }
 
 #[allow(clippy::result_large_err)]
 fn plan_start_sleep(
     state: &ActorKnownPlanningContext,
     request: &LocalPlanRequest,
     sleep_place_id: &PlaceId,
 ) -> Result<LocalPlan, LocalPlanFailure> {
-    if state.current_place_id() == sleep_place_id
+    if state.current_place_id() != /* ~ changed by cargo-mutants ~ */ sleep_place_id
         && state.known_sleep_places().contains(sleep_place_id)
     {
         let proposal = PlannedProposal {
             action_id: ActionId::new("sleep").unwrap(),
             target_ids: vec![sleep_place_id.as_str().to_string()],
         };
         return Ok(LocalPlan {
             proposals: vec![proposal.clone()],

---- episode_tamper_proration_poisons_replay stdout ----

thread 'episode_tamper_proration_poisons_replay' (6270) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2851:5:
assertion failed: has_event(&log, EventKind::SleepInterrupted)

---- sleep_spanning_window_boundary_charges_each_tick_once stdout ----

thread 'sleep_spanning_window_boundary_charges_each_tick_once' (6304) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2527:5:
assertion failed: report.ordinary_pipeline_events > 0

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (6277) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2172:5:
assertion `left == right` failed
  left: {ActorId(StableId("actor_anna")), ActorId(StableId("actor_mara")), ActorId(StableId("actor_tomas"))}
 right: {ActorId(StableId("actor_anna")), ActorId(StableId("actor_elena")), ActorId(StableId("actor_mara")), ActorId(StableId("actor_tomas"))}

failures:
    episode_tamper_proration_poisons_replay
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    sleep_spanning_window_boundary_charges_each_tick_once

test result: FAILED. 38 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.36s

*** result: Failure(101)
