*** crates/tracewake-core/src/agent/planner.rs:127:9: replace && with || in plan_start_sleep

*** mutation diff:
--- crates/tracewake-core/src/agent/planner.rs
+++ replace && with || in plan_start_sleep
@@ -119,17 +119,17 @@
 
 #[allow(clippy::result_large_err)]
 fn plan_start_sleep(
     state: &ActorKnownPlanningContext,
     request: &LocalPlanRequest,
     sleep_place_id: &PlaceId,
 ) -> Result<LocalPlan, LocalPlanFailure> {
     if state.current_place_id() == sleep_place_id
-        && state.known_sleep_places().contains(sleep_place_id)
+        || /* ~ changed by cargo-mutants ~ */ state.known_sleep_places().contains(sleep_place_id)
     {
         let proposal = PlannedProposal {
             action_id: ActionId::new("sleep").unwrap(),
             target_ids: vec![sleep_place_id.as_str().to_string()],
         };
         return Ok(LocalPlan {
             proposals: vec![proposal.clone()],
             trace: trace(

---- agent::planner::tests::start_sleep_requires_current_place_and_actor_known_sleep_place stdout ----

thread 'agent::planner::tests::start_sleep_requires_current_place_and_actor_known_sleep_place' (1932) panicked at crates/tracewake-core/src/agent/planner.rs:655:10:

failures:
    agent::planner::tests::start_sleep_requires_current_place_and_actor_known_sleep_place

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
