*** crates/tracewake-core/src/agent/planner.rs:165:57: replace && with || in plan_start_work_block

*** mutation diff:
--- crates/tracewake-core/src/agent/planner.rs
+++ replace && with || in plan_start_work_block
@@ -157,17 +157,17 @@
     state: &ActorKnownPlanningContext,
     request: &LocalPlanRequest,
     workplace_id: &str,
 ) -> Result<LocalPlan, LocalPlanFailure> {
     if state
         .known_workplaces()
         .iter()
         .any(|(known_workplace_id, place_id)| {
-            known_workplace_id.as_str() == workplace_id && place_id == state.current_place_id()
+            known_workplace_id.as_str() == workplace_id || /* ~ changed by cargo-mutants ~ */ place_id == state.current_place_id()
         })
     {
         let proposal = PlannedProposal {
             action_id: ActionId::new("work_block").unwrap(),
             target_ids: vec![workplace_id.to_string()],
         };
         return Ok(LocalPlan {
             proposals: vec![proposal.clone()],

---- agent::planner::tests::start_work_block_requires_matching_workplace_at_current_place stdout ----

thread 'agent::planner::tests::start_work_block_requires_matching_workplace_at_current_place' (10604) panicked at crates/tracewake-core/src/agent/planner.rs:707:10:

failures:
    agent::planner::tests::start_work_block_requires_matching_workplace_at_current_place

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
