*** crates/tracewake-core/src/agent/planner.rs:165:69: replace == with != in plan_start_work_block

*** mutation diff:
--- crates/tracewake-core/src/agent/planner.rs
+++ replace == with != in plan_start_work_block
@@ -157,17 +157,17 @@
     state: &ActorKnownPlanningContext,
     request: &LocalPlanRequest,
     workplace_id: &str,
 ) -> Result<LocalPlan, LocalPlanFailure> {
     if state
         .known_workplaces()
         .iter()
         .any(|(known_workplace_id, place_id)| {
-            known_workplace_id.as_str() == workplace_id && place_id == state.current_place_id()
+            known_workplace_id.as_str() == workplace_id && place_id != /* ~ changed by cargo-mutants ~ */ state.current_place_id()
         })
     {
         let proposal = PlannedProposal {
             action_id: ActionId::new("work_block").unwrap(),
             target_ids: vec![workplace_id.to_string()],
         };
         return Ok(LocalPlan {
             proposals: vec![proposal.clone()],

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (19046) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.55s

*** result: Failure(101)
