*** crates/tracewake-core/src/agent/planner.rs:200:33: replace == with != in plan_route

*** mutation diff:
--- crates/tracewake-core/src/agent/planner.rs
+++ replace == with != in plan_route
@@ -192,17 +192,17 @@
 }
 
 #[allow(clippy::result_large_err)]
 fn plan_route(
     state: &ActorKnownPlanningContext,
     request: &LocalPlanRequest,
     target: &PlaceId,
 ) -> Result<LocalPlan, LocalPlanFailure> {
-    if state.current_place_id() == target {
+    if state.current_place_id() != /* ~ changed by cargo-mutants ~ */ target {
         return Ok(LocalPlan {
             proposals: Vec::new(),
             trace: trace(
                 state,
                 request,
                 vec!["already_at_target".to_string()],
                 Vec::new(),
                 Vec::new(),

---- severe_safety_with_known_exit_produces_move_and_replays stdout ----

thread 'severe_safety_with_known_exit_produces_move_and_replays' (23181) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1715:10:
severe safety should commit a move

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (23157) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (23158) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2714:5:
assertion failed: has_event(&log, EventKind::ActorMoved)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    severe_safety_with_known_exit_produces_move_and_replays

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.40s

*** result: Failure(101)
