*** crates/tracewake-core/src/agent/planner.rs:220:23: replace >= with < in plan_route

*** mutation diff:
--- crates/tracewake-core/src/agent/planner.rs
+++ replace >= with < in plan_route
@@ -212,17 +212,17 @@
     }
 
     let mut queue = VecDeque::from([(state.current_place_id().clone(), Vec::<PlaceId>::new())]);
     let mut visited = BTreeSet::from([state.current_place_id().clone()]);
     let mut candidates = Vec::new();
     let mut expansions = 0_usize;
 
     while let Some((place_id, path)) = queue.pop_front() {
-        if expansions >= request.budget {
+        if expansions < /* ~ changed by cargo-mutants ~ */ request.budget {
             return Err(failure(
                 state,
                 request,
                 BlockerCategory::PlannerBudgetExhausted,
                 "planner budget exhausted",
                 candidates,
             ));
         }

---- severe_safety_with_known_exit_produces_move_and_replays stdout ----

thread 'severe_safety_with_known_exit_produces_move_and_replays' (27280) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1715:10:
severe safety should commit a move

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (27256) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (27257) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2714:5:
assertion failed: has_event(&log, EventKind::ActorMoved)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    severe_safety_with_known_exit_produces_move_and_replays

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.42s

*** result: Failure(101)
