*** crates/tracewake-core/src/agent/planner.rs:229:20: replace += with -= in plan_route

*** mutation diff:
--- crates/tracewake-core/src/agent/planner.rs
+++ replace += with -= in plan_route
@@ -221,17 +221,17 @@
             return Err(failure(
                 state,
                 request,
                 BlockerCategory::PlannerBudgetExhausted,
                 "planner budget exhausted",
                 candidates,
             ));
         }
-        expansions += 1;
+        expansions -= /* ~ changed by cargo-mutants ~ */ 1;
         let neighbors = state
             .known_edges()
             .get(&place_id)
             .cloned()
             .unwrap_or_default();
         for neighbor in neighbors {
             candidates.push(format!("edge:{}->{}", place_id.as_str(), neighbor.as_str()));
             if !visited.insert(neighbor.clone()) {

---- no_human_need_ledger_has_no_duplicate_regime_charges stdout ----

thread 'no_human_need_ledger_has_no_duplicate_regime_charges' (31359) panicked at crates/tracewake-core/src/agent/planner.rs:229:9:
attempt to subtract with overflow

---- severe_safety_with_known_exit_produces_move_and_replays stdout ----

thread 'severe_safety_with_known_exit_produces_move_and_replays' (31379) panicked at crates/tracewake-core/src/agent/planner.rs:229:9:
attempt to subtract with overflow

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (31355) panicked at crates/tracewake-core/src/agent/planner.rs:229:9:
attempt to subtract with overflow

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    no_human_decision_context_hash_gate_fails_when_source_evidence_tampered
    no_human_need_ledger_has_no_duplicate_regime_charges
    severe_safety_with_known_exit_produces_move_and_replays

test result: FAILED. 37 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
