*** crates/tracewake-core/src/agent/planner.rs:229:20: replace += with *= in plan_route

*** mutation diff:
--- crates/tracewake-core/src/agent/planner.rs
+++ replace += with *= in plan_route
@@ -221,17 +221,17 @@
             return Err(failure(
                 state,
                 request,
                 BlockerCategory::PlannerBudgetExhausted,
                 "planner budget exhausted",
                 candidates,
             ));
         }
-        expansions += 1;
+        expansions *= /* ~ changed by cargo-mutants ~ */ 1;
         let neighbors = state
             .known_edges()
             .get(&place_id)
             .cloned()
             .unwrap_or_default();
         for neighbor in neighbors {
             candidates.push(format!("edge:{}->{}", place_id.as_str(), neighbor.as_str()));
             if !visited.insert(neighbor.clone()) {

---- agent::planner::tests::budget_exhaustion_reports_candidates_tried stdout ----

thread 'agent::planner::tests::budget_exhaustion_reports_candidates_tried' (3197) panicked at crates/tracewake-core/src/agent/planner.rs:521:10:

failures:
    agent::planner::tests::budget_exhaustion_reports_candidates_tried

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
