*** crates/tracewake-core/src/agent/planner.rs:237:16: delete ! in plan_route

*** mutation diff:
--- crates/tracewake-core/src/agent/planner.rs
+++ delete ! in plan_route
@@ -229,17 +229,17 @@
         expansions += 1;
         let neighbors = state
             .known_edges()
             .get(&place_id)
             .cloned()
             .unwrap_or_default();
         for neighbor in neighbors {
             candidates.push(format!("edge:{}->{}", place_id.as_str(), neighbor.as_str()));
-            if !visited.insert(neighbor.clone()) {
+            if  /* ~ changed by cargo-mutants ~ */visited.insert(neighbor.clone()) {
                 continue;
             }
             let mut next_path = path.clone();
             next_path.push(neighbor.clone());
             if &neighbor == target {
                 let proposals = proposals_for_path(state, state.current_place_id(), &next_path);
                 return Ok(LocalPlan {
                     trace: trace(

---- severe_safety_with_known_exit_produces_move_and_replays stdout ----

thread 'severe_safety_with_known_exit_produces_move_and_replays' (7570) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1715:10:
severe safety should commit a move

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (7546) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (7547) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2714:5:
assertion failed: has_event(&log, EventKind::ActorMoved)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    severe_safety_with_known_exit_produces_move_and_replays

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.42s

*** result: Failure(101)
