*** crates/tracewake-core/src/agent/planner.rs:274:5: replace proposals_for_path -> Vec<PlannedProposal> with vec![]

*** mutation diff:
--- crates/tracewake-core/src/agent/planner.rs
+++ replace proposals_for_path -> Vec<PlannedProposal> with vec![]
@@ -266,32 +266,17 @@
     ))
 }
 
 fn proposals_for_path(
     state: &ActorKnownPlanningContext,
     start: &PlaceId,
     path: &[PlaceId],
 ) -> Vec<PlannedProposal> {
-    let mut proposals = Vec::new();
-    let mut from = start.clone();
-    for to in path {
-        if let Some(door_id) = state.known_closed_doors().get(&(from.clone(), to.clone())) {
-            proposals.push(PlannedProposal {
-                action_id: ActionId::new("open").unwrap(),
-                target_ids: vec![door_id.clone()],
-            });
-        }
-        proposals.push(PlannedProposal {
-            action_id: ActionId::new("move").unwrap(),
-            target_ids: vec![to.to_string()],
-        });
-        from = to.clone();
-    }
-    proposals
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 #[allow(clippy::result_large_err)]
 fn plan_check_container(
     state: &ActorKnownPlanningContext,
     request: &LocalPlanRequest,
     container_id: &ContainerId,
 ) -> Result<LocalPlan, LocalPlanFailure> {

---- severe_safety_with_known_exit_produces_move_and_replays stdout ----

thread 'severe_safety_with_known_exit_produces_move_and_replays' (15768) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1715:10:
severe safety should commit a move

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (15744) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (15745) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2714:5:
assertion failed: has_event(&log, EventKind::ActorMoved)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    severe_safety_with_known_exit_produces_move_and_replays

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.41s

*** result: Failure(101)
