*** crates/tracewake-core/src/agent/routine.rs:133:47: replace != with == in RoutineStep::deserialize_canonical

*** mutation diff:
--- crates/tracewake-core/src/agent/routine.rs
+++ replace != with == in RoutineStep::deserialize_canonical
@@ -125,17 +125,17 @@
     }
 
     pub fn deserialize_canonical(value: &[u8]) -> Result<Self, RoutineStepParseError> {
         let value = std::str::from_utf8(value).map_err(|_| RoutineStepParseError::InvalidUtf8)?;
         let mut fields = value.split('|');
         let version = fields.next().ok_or(RoutineStepParseError::InvalidShape)?;
         let kind = fields.next().ok_or(RoutineStepParseError::InvalidShape)?;
         let payload = fields.next().ok_or(RoutineStepParseError::InvalidShape)?;
-        if fields.next().is_some() || version != "routine_step_v1" {
+        if fields.next().is_some() || version == /* ~ changed by cargo-mutants ~ */ "routine_step_v1" {
             return Err(RoutineStepParseError::InvalidShape);
         }
 
         let action = || {
             SemanticActionId::new(payload).map_err(RoutineStepParseError::InvalidSemanticActionId)
         };
         let text = || decode_text_payload(payload);

---- validate::tests::phase3a_sleep_routine_requires_authored_sleep_surface_or_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_routine_requires_authored_sleep_surface_or_diagnostic' (21600) panicked at crates/tracewake-content/src/validate.rs:3674:9:
assertion `left == right` failed
  left: InvalidShape
 right: InvalidDiagnosticKind

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (21602) panicked at crates/tracewake-content/src/validate.rs:3650:59:

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (21601) panicked at crates/tracewake-content/src/validate.rs:3685:49:

failures:
    validate::tests::phase3a_sleep_routine_requires_authored_sleep_surface_or_diagnostic
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted

test result: FAILED. 33 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
