*** crates/tracewake-core/src/agent/routine.rs:143:13: delete match arm "select_known_place" in RoutineStep::deserialize_canonical

*** mutation diff:
--- crates/tracewake-core/src/agent/routine.rs
+++ delete match arm "select_known_place" in RoutineStep::deserialize_canonical
@@ -135,19 +135,17 @@
         }
 
         let action = || {
             SemanticActionId::new(payload).map_err(RoutineStepParseError::InvalidSemanticActionId)
         };
         let text = || decode_text_payload(payload);
 
         match kind {
-            "select_known_place" => Ok(Self::SelectKnownPlace {
-                action_id: action()?,
-            }),
+             /* ~ changed by cargo-mutants ~ */
             "move_toward_place" => Ok(Self::MoveTowardPlace {
                 action_id: action()?,
             }),
             "open_known_container" => Ok(Self::OpenKnownContainer {
                 action_id: action()?,
             }),
             "check_known_container" => Ok(Self::CheckKnownContainer {
                 action_id: action()?,

---- agent::routine::tests::routine_steps_round_trip_canonically_and_expose_proposals stdout ----

thread 'agent::routine::tests::routine_steps_round_trip_canonically_and_expose_proposals' (25898) panicked at crates/tracewake-core/src/agent/routine.rs:722:76:
called `Result::unwrap()` on an `Err` value: InvalidStepKind

failures:
    agent::routine::tests::routine_steps_round_trip_canonically_and_expose_proposals

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
