*** crates/tracewake-core/src/agent/routine.rs:152:13: delete match arm "check_known_container" in RoutineStep::deserialize_canonical

*** mutation diff:
--- crates/tracewake-core/src/agent/routine.rs
+++ delete match arm "check_known_container" in RoutineStep::deserialize_canonical
@@ -144,19 +144,17 @@
                 action_id: action()?,
             }),
             "move_toward_place" => Ok(Self::MoveTowardPlace {
                 action_id: action()?,
             }),
             "open_known_container" => Ok(Self::OpenKnownContainer {
                 action_id: action()?,
             }),
-            "check_known_container" => Ok(Self::CheckKnownContainer {
-                action_id: action()?,
-            }),
+             /* ~ changed by cargo-mutants ~ */
             "consume_accessible_food" => Ok(Self::ConsumeAccessibleFood {
                 action_id: action()?,
             }),
             "start_scheduled_sleep" => Ok(Self::StartScheduledSleep {
                 action_id: action()?,
             }),
             "complete_scheduled_sleep" => Ok(Self::CompleteScheduledSleep {
                 action_id: action()?,

---- agent::routine::tests::routine_steps_round_trip_canonically_and_expose_proposals stdout ----

thread 'agent::routine::tests::routine_steps_round_trip_canonically_and_expose_proposals' (6580) panicked at crates/tracewake-core/src/agent/routine.rs:722:76:
called `Result::unwrap()` on an `Err` value: InvalidStepKind

failures:
    agent::routine::tests::routine_steps_round_trip_canonically_and_expose_proposals

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
