*** crates/tracewake-core/src/agent/routine.rs:155:13: delete match arm "consume_accessible_food" in RoutineStep::deserialize_canonical

*** mutation diff:
--- crates/tracewake-core/src/agent/routine.rs
+++ delete match arm "consume_accessible_food" in RoutineStep::deserialize_canonical
@@ -147,19 +147,17 @@
                 action_id: action()?,
             }),
             "open_known_container" => Ok(Self::OpenKnownContainer {
                 action_id: action()?,
             }),
             "check_known_container" => Ok(Self::CheckKnownContainer {
                 action_id: action()?,
             }),
-            "consume_accessible_food" => Ok(Self::ConsumeAccessibleFood {
-                action_id: action()?,
-            }),
+             /* ~ changed by cargo-mutants ~ */
             "start_scheduled_sleep" => Ok(Self::StartScheduledSleep {
                 action_id: action()?,
             }),
             "complete_scheduled_sleep" => Ok(Self::CompleteScheduledSleep {
                 action_id: action()?,
             }),
             "start_work_block" => Ok(Self::StartWorkBlock {
                 action_id: action()?,

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (10875) panicked at crates/tracewake-content/tests/fixtures_load.rs:1172:6:
called `Result::unwrap()` on an `Err` value: Validation(ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: ParseSchema, path: "fixture.line", code: "bad_line", message: "bad fixture line invalid routine step kind" }] } })

---- phase3a_load_emits_authored_prehistory_seed_events stdout ----

thread 'phase3a_load_emits_authored_prehistory_seed_events' (10872) panicked at crates/tracewake-content/tests/fixtures_load.rs:761:6:
called `Result::unwrap()` on an `Err` value: Validation(ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: ParseSchema, path: "fixture.line", code: "bad_line", message: "bad fixture line invalid routine step kind" }] } })

---- all_fixtures_load_deterministically_and_validate stdout ----

thread 'all_fixtures_load_deterministically_and_validate' (10847) panicked at crates/tracewake-content/tests/fixtures_load.rs:591:54:

failures:
    all_fixtures_load_deterministically_and_validate
    phase3a_load_emits_authored_prehistory_seed_events
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 31 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
