*** crates/tracewake-core/src/agent/routine.rs:158:13: delete match arm "start_scheduled_sleep" in RoutineStep::deserialize_canonical

*** mutation diff:
--- crates/tracewake-core/src/agent/routine.rs
+++ delete match arm "start_scheduled_sleep" in RoutineStep::deserialize_canonical
@@ -150,19 +150,17 @@
                 action_id: action()?,
             }),
             "check_known_container" => Ok(Self::CheckKnownContainer {
                 action_id: action()?,
             }),
             "consume_accessible_food" => Ok(Self::ConsumeAccessibleFood {
                 action_id: action()?,
             }),
-            "start_scheduled_sleep" => Ok(Self::StartScheduledSleep {
-                action_id: action()?,
-            }),
+             /* ~ changed by cargo-mutants ~ */
             "complete_scheduled_sleep" => Ok(Self::CompleteScheduledSleep {
                 action_id: action()?,
             }),
             "start_work_block" => Ok(Self::StartWorkBlock {
                 action_id: action()?,
             }),
             "complete_work_block" => Ok(Self::CompleteWorkBlock {
                 action_id: action()?,

---- phase3a_load_emits_authored_prehistory_seed_events stdout ----

thread 'phase3a_load_emits_authored_prehistory_seed_events' (14903) panicked at crates/tracewake-content/tests/fixtures_load.rs:761:6:
called `Result::unwrap()` on an `Err` value: Validation(ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: ParseSchema, path: "fixture.line", code: "bad_line", message: "bad fixture line invalid routine step kind" }] } })

---- all_fixtures_load_deterministically_and_validate stdout ----

thread 'all_fixtures_load_deterministically_and_validate' (14878) panicked at crates/tracewake-content/tests/fixtures_load.rs:591:54:

failures:
    all_fixtures_load_deterministically_and_validate
    phase3a_load_emits_authored_prehistory_seed_events

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
