*** crates/tracewake-core/src/agent/routine.rs:161:13: delete match arm "complete_scheduled_sleep" in RoutineStep::deserialize_canonical

*** mutation diff:
--- crates/tracewake-core/src/agent/routine.rs
+++ delete match arm "complete_scheduled_sleep" in RoutineStep::deserialize_canonical
@@ -153,19 +153,17 @@
                 action_id: action()?,
             }),
             "consume_accessible_food" => Ok(Self::ConsumeAccessibleFood {
                 action_id: action()?,
             }),
             "start_scheduled_sleep" => Ok(Self::StartScheduledSleep {
                 action_id: action()?,
             }),
-            "complete_scheduled_sleep" => Ok(Self::CompleteScheduledSleep {
-                action_id: action()?,
-            }),
+             /* ~ changed by cargo-mutants ~ */
             "start_work_block" => Ok(Self::StartWorkBlock {
                 action_id: action()?,
             }),
             "complete_work_block" => Ok(Self::CompleteWorkBlock {
                 action_id: action()?,
             }),
             "wait_until" => Ok(Self::WaitUntil { reason: text()? }),
             "continue_current_step" => Ok(Self::ContinueCurrentStep {

---- agent::routine::tests::routine_steps_round_trip_canonically_and_expose_proposals stdout ----

thread 'agent::routine::tests::routine_steps_round_trip_canonically_and_expose_proposals' (19201) panicked at crates/tracewake-core/src/agent/routine.rs:722:76:
called `Result::unwrap()` on an `Err` value: InvalidStepKind

failures:
    agent::routine::tests::routine_steps_round_trip_canonically_and_expose_proposals

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
