*** crates/tracewake-core/src/agent/routine.rs:164:13: delete match arm "start_work_block" in RoutineStep::deserialize_canonical

*** mutation diff:
--- crates/tracewake-core/src/agent/routine.rs
+++ delete match arm "start_work_block" in RoutineStep::deserialize_canonical
@@ -156,19 +156,17 @@
                 action_id: action()?,
             }),
             "start_scheduled_sleep" => Ok(Self::StartScheduledSleep {
                 action_id: action()?,
             }),
             "complete_scheduled_sleep" => Ok(Self::CompleteScheduledSleep {
                 action_id: action()?,
             }),
-            "start_work_block" => Ok(Self::StartWorkBlock {
-                action_id: action()?,
-            }),
+             /* ~ changed by cargo-mutants ~ */
             "complete_work_block" => Ok(Self::CompleteWorkBlock {
                 action_id: action()?,
             }),
             "wait_until" => Ok(Self::WaitUntil { reason: text()? }),
             "continue_current_step" => Ok(Self::ContinueCurrentStep {
                 action_id: action()?,
             }),
             "fallback_to_find_food" => Ok(Self::FallbackToFindFood {

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (23460) panicked at crates/tracewake-content/src/validate.rs:3650:59:

failures:
    validate::tests::phase3a_valid_routine_content_is_accepted

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
