*** crates/tracewake-core/src/agent/routine.rs:167:13: delete match arm "complete_work_block" in RoutineStep::deserialize_canonical

*** mutation diff:
--- crates/tracewake-core/src/agent/routine.rs
+++ delete match arm "complete_work_block" in RoutineStep::deserialize_canonical
@@ -159,19 +159,17 @@
                 action_id: action()?,
             }),
             "complete_scheduled_sleep" => Ok(Self::CompleteScheduledSleep {
                 action_id: action()?,
             }),
             "start_work_block" => Ok(Self::StartWorkBlock {
                 action_id: action()?,
             }),
-            "complete_work_block" => Ok(Self::CompleteWorkBlock {
-                action_id: action()?,
-            }),
+             /* ~ changed by cargo-mutants ~ */
             "wait_until" => Ok(Self::WaitUntil { reason: text()? }),
             "continue_current_step" => Ok(Self::ContinueCurrentStep {
                 action_id: action()?,
             }),
             "fallback_to_find_food" => Ok(Self::FallbackToFindFood {
                 action_id: action()?,
             }),
             "fail_with_typed_diagnostic" => Ok(Self::FailWithTypedDiagnostic {

---- agent::routine::tests::routine_steps_round_trip_canonically_and_expose_proposals stdout ----

thread 'agent::routine::tests::routine_steps_round_trip_canonically_and_expose_proposals' (27756) panicked at crates/tracewake-core/src/agent/routine.rs:722:76:
called `Result::unwrap()` on an `Err` value: InvalidStepKind

failures:
    agent::routine::tests::routine_steps_round_trip_canonically_and_expose_proposals

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
