*** crates/tracewake-core/src/agent/routine.rs:171:13: delete match arm "continue_current_step" in RoutineStep::deserialize_canonical

*** mutation diff:
--- crates/tracewake-core/src/agent/routine.rs
+++ delete match arm "continue_current_step" in RoutineStep::deserialize_canonical
@@ -163,19 +163,17 @@
             }),
             "start_work_block" => Ok(Self::StartWorkBlock {
                 action_id: action()?,
             }),
             "complete_work_block" => Ok(Self::CompleteWorkBlock {
                 action_id: action()?,
             }),
             "wait_until" => Ok(Self::WaitUntil { reason: text()? }),
-            "continue_current_step" => Ok(Self::ContinueCurrentStep {
-                action_id: action()?,
-            }),
+             /* ~ changed by cargo-mutants ~ */
             "fallback_to_find_food" => Ok(Self::FallbackToFindFood {
                 action_id: action()?,
             }),
             "fail_with_typed_diagnostic" => Ok(Self::FailWithTypedDiagnostic {
                 diagnostic: RoutineDiagnosticKind::parse(text()?.as_str())
                     .map_err(|_| RoutineStepParseError::InvalidDiagnosticKind)?,
             }),
             _ => Err(RoutineStepParseError::InvalidStepKind),

---- all_fixtures_load_deterministically_and_validate stdout ----

thread 'all_fixtures_load_deterministically_and_validate' (3586) panicked at crates/tracewake-content/tests/fixtures_load.rs:591:54:

failures:
    all_fixtures_load_deterministically_and_validate

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
