*** crates/tracewake-core/src/agent/routine.rs:177:13: delete match arm "fail_with_typed_diagnostic" in RoutineStep::deserialize_canonical

*** mutation diff:
--- crates/tracewake-core/src/agent/routine.rs
+++ delete match arm "fail_with_typed_diagnostic" in RoutineStep::deserialize_canonical
@@ -169,20 +169,17 @@
             }),
             "wait_until" => Ok(Self::WaitUntil { reason: text()? }),
             "continue_current_step" => Ok(Self::ContinueCurrentStep {
                 action_id: action()?,
             }),
             "fallback_to_find_food" => Ok(Self::FallbackToFindFood {
                 action_id: action()?,
             }),
-            "fail_with_typed_diagnostic" => Ok(Self::FailWithTypedDiagnostic {
-                diagnostic: RoutineDiagnosticKind::parse(text()?.as_str())
-                    .map_err(|_| RoutineStepParseError::InvalidDiagnosticKind)?,
-            }),
+             /* ~ changed by cargo-mutants ~ */
             _ => Err(RoutineStepParseError::InvalidStepKind),
         }
     }
 }
 
 #[derive(Clone, Copy, Debug, PartialEq, Eq)]
 pub enum RoutineStepProposal<'a> {
     Action(&'a SemanticActionId),

---- validate::tests::phase3a_sleep_routine_requires_authored_sleep_surface_or_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_routine_requires_authored_sleep_surface_or_diagnostic' (11639) panicked at crates/tracewake-content/src/validate.rs:3674:9:
assertion `left == right` failed
  left: InvalidStepKind
 right: InvalidDiagnosticKind

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (11640) panicked at crates/tracewake-content/src/validate.rs:3685:49:

failures:
    validate::tests::phase3a_sleep_routine_requires_authored_sleep_surface_or_diagnostic
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic

test result: FAILED. 34 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
