*** crates/tracewake-core/src/agent/routine.rs:200:9: replace RoutineDiagnosticKind::stable_id -> &'static str with "xyzzy"

*** mutation diff:
--- crates/tracewake-core/src/agent/routine.rs
+++ replace RoutineDiagnosticKind::stable_id -> &'static str with "xyzzy"
@@ -192,19 +192,17 @@
 
 #[derive(Clone, Copy, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
 pub enum RoutineDiagnosticKind {
     NoSleepAffordance,
 }
 
 impl RoutineDiagnosticKind {
     pub const fn stable_id(self) -> &'static str {
-        match self {
-            Self::NoSleepAffordance => "no_sleep_affordance",
-        }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn parse(value: &str) -> Result<Self, RoutineDiagnosticKindParseError> {
         match value {
             "no_sleep_affordance" => Ok(Self::NoSleepAffordance),
             _ => Err(RoutineDiagnosticKindParseError),
         }
     }

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (19632) panicked at crates/tracewake-content/src/validate.rs:3685:49:

failures:
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
