*** crates/tracewake-core/src/agent/routine.rs:207:13: delete match arm "no_sleep_affordance" in RoutineDiagnosticKind::parse

*** mutation diff:
--- crates/tracewake-core/src/agent/routine.rs
+++ delete match arm "no_sleep_affordance" in RoutineDiagnosticKind::parse
@@ -199,17 +199,17 @@
     pub const fn stable_id(self) -> &'static str {
         match self {
             Self::NoSleepAffordance => "no_sleep_affordance",
         }
     }
 
     pub fn parse(value: &str) -> Result<Self, RoutineDiagnosticKindParseError> {
         match value {
-            "no_sleep_affordance" => Ok(Self::NoSleepAffordance),
+             /* ~ changed by cargo-mutants ~ */
             _ => Err(RoutineDiagnosticKindParseError),
         }
     }
 }
 
 #[derive(Clone, Copy, Debug, PartialEq, Eq)]
 pub struct RoutineDiagnosticKindParseError;

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (23640) panicked at crates/tracewake-content/src/validate.rs:3685:49:

failures:
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
