*** crates/tracewake-core/src/agent/routine.rs:242:9: replace RoutineCondition::stable_id -> &'static str with "xyzzy"

*** mutation diff:
--- crates/tracewake-core/src/agent/routine.rs
+++ replace RoutineCondition::stable_id -> &'static str with "xyzzy"
@@ -234,38 +234,17 @@
     FixtureAuthoredPossibility,
     SharedPipelinePreconditions,
     AssignedWorkplaceKnown,
     AtWorkplace,
 }
 
 impl RoutineCondition {
     pub const fn stable_id(&self) -> &'static str {
-        match self {
-            Self::ActorKnowsFoodSource => "actor_knows_food_source",
-            Self::ActorKnowsWorkplace => "actor_knows_workplace",
-            Self::WorkplaceAssignmentActive => "workplace_assignment_active",
-            Self::ActorKnowsHome => "actor_knows_home",
-            Self::ActorKnowsSleepPlace => "actor_knows_sleep_place",
-            Self::ActorHasFoodSearchKnowledge => "actor_has_food_search_knowledge",
-            Self::ActiveIntentionPresent => "active_intention_present",
-            Self::SleepStateCanEnd => "sleep_state_can_end",
-            Self::FoodSourceBelievedAccessible => "food_source_believed_accessible",
-            Self::ActorAtWorkplace => "actor_at_workplace",
-            Self::SleepPlaceBelievedAccessible => "sleep_place_believed_accessible",
-            Self::SearchSurfaceActorKnown => "search_surface_actor_known",
-            Self::NextStepAvailable => "next_step_available",
-            Self::KnownRouteSurface => "known_route_surface",
-            Self::ModeledWaitReason => "modeled_wait_reason",
-            Self::ReevaluationWindowKnown => "reevaluation_window_known",
-            Self::FixtureAuthoredPossibility => "fixture_authored_possibility",
-            Self::SharedPipelinePreconditions => "shared_pipeline_preconditions",
-            Self::AssignedWorkplaceKnown => "assigned_workplace_known",
-            Self::AtWorkplace => "at_workplace",
-        }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn parse(value: &str) -> Option<Self> {
         match value {
             "actor_knows_food_source" => Some(Self::ActorKnowsFoodSource),
             "actor_knows_workplace" => Some(Self::ActorKnowsWorkplace),
             "workplace_assignment_active" => Some(Self::WorkplaceAssignmentActive),
             "actor_knows_home" => Some(Self::ActorKnowsHome),

---- validate::tests::fixture_serialization_golden_bytes_are_pinned_001 stdout ----

thread 'validate::tests::fixture_serialization_golden_bytes_are_pinned_001' (31623) panicked at crates/tracewake-content/src/validate.rs:3216:13:
assertion `left == right` failed: phase3a serialization golden changed

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (31632) panicked at crates/tracewake-content/src/validate.rs:3685:49:

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (31633) panicked at crates/tracewake-content/src/validate.rs:3650:59:

failures:
    validate::tests::fixture_serialization_golden_bytes_are_pinned_001
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted

test result: FAILED. 33 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
