*** crates/tracewake-core/src/agent/routine.rs:25:9: replace RoutineFamily::stable_id -> &'static str with "xyzzy"

*** mutation diff:
--- crates/tracewake-core/src/agent/routine.rs
+++ replace RoutineFamily::stable_id -> &'static str with "xyzzy"
@@ -17,29 +17,17 @@
     LeaveUnsafePlace,
     ContinueCurrentIntention,
     Wait,
     IdleWithReason,
 }
 
 impl RoutineFamily {
     pub const fn stable_id(self) -> &'static str {
-        match self {
-            RoutineFamily::MorningWake => "morning_wake",
-            RoutineFamily::EatMeal => "eat_meal",
-            RoutineFamily::GoToWork => "go_to_work",
-            RoutineFamily::WorkBlock => "work_block",
-            RoutineFamily::ReturnHome => "return_home",
-            RoutineFamily::SleepNight => "sleep_night",
-            RoutineFamily::FindFood => "find_food",
-            RoutineFamily::LeaveUnsafePlace => "leave_unsafe_place",
-            RoutineFamily::ContinueCurrentIntention => "continue_current_intention",
-            RoutineFamily::Wait => "wait",
-            RoutineFamily::IdleWithReason => "idle_with_reason",
-        }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
 pub enum RoutineStep {
     SelectKnownPlace { action_id: SemanticActionId },
     MoveTowardPlace { action_id: SemanticActionId },
     OpenKnownContainer { action_id: SemanticActionId },

---- validate::tests::fixture_serialization_golden_bytes_are_pinned_001 stdout ----

thread 'validate::tests::fixture_serialization_golden_bytes_are_pinned_001' (23811) panicked at crates/tracewake-content/src/validate.rs:3216:13:
assertion `left == right` failed: phase3a serialization golden changed

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (23820) panicked at crates/tracewake-content/src/validate.rs:3685:49:

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (23821) panicked at crates/tracewake-content/src/validate.rs:3650:59:

failures:
    validate::tests::fixture_serialization_golden_bytes_are_pinned_001
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted

test result: FAILED. 33 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
