*** crates/tracewake-core/src/agent/routine.rs:267:9: replace RoutineCondition::parse -> Option<Self> with None

*** mutation diff:
--- crates/tracewake-core/src/agent/routine.rs
+++ replace RoutineCondition::parse -> Option<Self> with None
@@ -259,39 +259,17 @@
             Self::FixtureAuthoredPossibility => "fixture_authored_possibility",
             Self::SharedPipelinePreconditions => "shared_pipeline_preconditions",
             Self::AssignedWorkplaceKnown => "assigned_workplace_known",
             Self::AtWorkplace => "at_workplace",
         }
     }
 
     pub fn parse(value: &str) -> Option<Self> {
-        match value {
-            "actor_knows_food_source" => Some(Self::ActorKnowsFoodSource),
-            "actor_knows_workplace" => Some(Self::ActorKnowsWorkplace),
-            "workplace_assignment_active" => Some(Self::WorkplaceAssignmentActive),
-            "actor_knows_home" => Some(Self::ActorKnowsHome),
-            "actor_knows_sleep_place" => Some(Self::ActorKnowsSleepPlace),
-            "actor_has_food_search_knowledge" => Some(Self::ActorHasFoodSearchKnowledge),
-            "active_intention_present" => Some(Self::ActiveIntentionPresent),
-            "sleep_state_can_end" => Some(Self::SleepStateCanEnd),
-            "food_source_believed_accessible" => Some(Self::FoodSourceBelievedAccessible),
-            "actor_at_workplace" => Some(Self::ActorAtWorkplace),
-            "sleep_place_believed_accessible" => Some(Self::SleepPlaceBelievedAccessible),
-            "search_surface_actor_known" => Some(Self::SearchSurfaceActorKnown),
-            "next_step_available" => Some(Self::NextStepAvailable),
-            "known_route_surface" => Some(Self::KnownRouteSurface),
-            "modeled_wait_reason" => Some(Self::ModeledWaitReason),
-            "reevaluation_window_known" => Some(Self::ReevaluationWindowKnown),
-            "fixture_authored_possibility" => Some(Self::FixtureAuthoredPossibility),
-            "shared_pipeline_preconditions" => Some(Self::SharedPipelinePreconditions),
-            "assigned_workplace_known" => Some(Self::AssignedWorkplaceKnown),
-            "at_workplace" => Some(Self::AtWorkplace),
-            _ => None,
-        }
+        None /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq)]
 pub struct RoutineTemplate {
     pub template_id: RoutineTemplateId,
     pub family: RoutineFamily,
     pub applicability_conditions: Vec<RoutineCondition>,

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (3161) panicked at crates/tracewake-content/src/validate.rs:3650:59:

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (3160) panicked at crates/tracewake-content/src/validate.rs:3685:49:

failures:
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted

test result: FAILED. 34 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
