*** crates/tracewake-core/src/agent/routine.rs:268:13: delete match arm "actor_knows_food_source" in RoutineCondition::parse

*** mutation diff:
--- crates/tracewake-core/src/agent/routine.rs
+++ delete match arm "actor_knows_food_source" in RoutineCondition::parse
@@ -260,17 +260,17 @@
             Self::SharedPipelinePreconditions => "shared_pipeline_preconditions",
             Self::AssignedWorkplaceKnown => "assigned_workplace_known",
             Self::AtWorkplace => "at_workplace",
         }
     }
 
     pub fn parse(value: &str) -> Option<Self> {
         match value {
-            "actor_knows_food_source" => Some(Self::ActorKnowsFoodSource),
+             /* ~ changed by cargo-mutants ~ */
             "actor_knows_workplace" => Some(Self::ActorKnowsWorkplace),
             "workplace_assignment_active" => Some(Self::WorkplaceAssignmentActive),
             "actor_knows_home" => Some(Self::ActorKnowsHome),
             "actor_knows_sleep_place" => Some(Self::ActorKnowsSleepPlace),
             "actor_has_food_search_knowledge" => Some(Self::ActorHasFoodSearchKnowledge),
             "active_intention_present" => Some(Self::ActiveIntentionPresent),
             "sleep_state_can_end" => Some(Self::SleepStateCanEnd),
             "food_source_believed_accessible" => Some(Self::FoodSourceBelievedAccessible),

---- agent::routine::tests::routine_condition_parse_covers_stable_id_vocabulary stdout ----

thread 'agent::routine::tests::routine_condition_parse_covers_stable_id_vocabulary' (7465) panicked at crates/tracewake-core/src/agent/routine.rs:764:13:
assertion `left == right` failed
  left: None
 right: Some(ActorKnowsFoodSource)

failures:
    agent::routine::tests::routine_condition_parse_covers_stable_id_vocabulary

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
