*** crates/tracewake-core/src/agent/routine.rs:271:13: delete match arm "actor_knows_home" in RoutineCondition::parse

*** mutation diff:
--- crates/tracewake-core/src/agent/routine.rs
+++ delete match arm "actor_knows_home" in RoutineCondition::parse
@@ -263,17 +263,17 @@
         }
     }
 
     pub fn parse(value: &str) -> Option<Self> {
         match value {
             "actor_knows_food_source" => Some(Self::ActorKnowsFoodSource),
             "actor_knows_workplace" => Some(Self::ActorKnowsWorkplace),
             "workplace_assignment_active" => Some(Self::WorkplaceAssignmentActive),
-            "actor_knows_home" => Some(Self::ActorKnowsHome),
+             /* ~ changed by cargo-mutants ~ */
             "actor_knows_sleep_place" => Some(Self::ActorKnowsSleepPlace),
             "actor_has_food_search_knowledge" => Some(Self::ActorHasFoodSearchKnowledge),
             "active_intention_present" => Some(Self::ActiveIntentionPresent),
             "sleep_state_can_end" => Some(Self::SleepStateCanEnd),
             "food_source_believed_accessible" => Some(Self::FoodSourceBelievedAccessible),
             "actor_at_workplace" => Some(Self::ActorAtWorkplace),
             "sleep_place_believed_accessible" => Some(Self::SleepPlaceBelievedAccessible),
             "search_surface_actor_known" => Some(Self::SearchSurfaceActorKnown),

---- serialization_round_trips_spine_variant_matrix stdout ----

thread 'serialization_round_trips_spine_variant_matrix' (20947) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:385:46:
called `Result::unwrap()` on an `Err` value: BadLine("bad routine condition actor_knows_home")

failures:
    serialization_round_trips_spine_variant_matrix

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.60s

*** result: Failure(101)
