*** crates/tracewake-core/src/agent/routine.rs:274:13: delete match arm "active_intention_present" in RoutineCondition::parse

*** mutation diff:
--- crates/tracewake-core/src/agent/routine.rs
+++ delete match arm "active_intention_present" in RoutineCondition::parse
@@ -266,17 +266,17 @@
     pub fn parse(value: &str) -> Option<Self> {
         match value {
             "actor_knows_food_source" => Some(Self::ActorKnowsFoodSource),
             "actor_knows_workplace" => Some(Self::ActorKnowsWorkplace),
             "workplace_assignment_active" => Some(Self::WorkplaceAssignmentActive),
             "actor_knows_home" => Some(Self::ActorKnowsHome),
             "actor_knows_sleep_place" => Some(Self::ActorKnowsSleepPlace),
             "actor_has_food_search_knowledge" => Some(Self::ActorHasFoodSearchKnowledge),
-            "active_intention_present" => Some(Self::ActiveIntentionPresent),
+             /* ~ changed by cargo-mutants ~ */
             "sleep_state_can_end" => Some(Self::SleepStateCanEnd),
             "food_source_believed_accessible" => Some(Self::FoodSourceBelievedAccessible),
             "actor_at_workplace" => Some(Self::ActorAtWorkplace),
             "sleep_place_believed_accessible" => Some(Self::SleepPlaceBelievedAccessible),
             "search_surface_actor_known" => Some(Self::SearchSurfaceActorKnown),
             "next_step_available" => Some(Self::NextStepAvailable),
             "known_route_surface" => Some(Self::KnownRouteSurface),
             "modeled_wait_reason" => Some(Self::ModeledWaitReason),

---- agent::routine::tests::routine_condition_parse_covers_stable_id_vocabulary stdout ----

thread 'agent::routine::tests::routine_condition_parse_covers_stable_id_vocabulary' (1891) panicked at crates/tracewake-core/src/agent/routine.rs:764:13:
assertion `left == right` failed
  left: None
 right: Some(ActiveIntentionPresent)

failures:
    agent::routine::tests::routine_condition_parse_covers_stable_id_vocabulary

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
