*** crates/tracewake-core/src/agent/routine.rs:276:13: delete match arm "food_source_believed_accessible" in RoutineCondition::parse

*** mutation diff:
--- crates/tracewake-core/src/agent/routine.rs
+++ delete match arm "food_source_believed_accessible" in RoutineCondition::parse
@@ -268,17 +268,17 @@
             "actor_knows_food_source" => Some(Self::ActorKnowsFoodSource),
             "actor_knows_workplace" => Some(Self::ActorKnowsWorkplace),
             "workplace_assignment_active" => Some(Self::WorkplaceAssignmentActive),
             "actor_knows_home" => Some(Self::ActorKnowsHome),
             "actor_knows_sleep_place" => Some(Self::ActorKnowsSleepPlace),
             "actor_has_food_search_knowledge" => Some(Self::ActorHasFoodSearchKnowledge),
             "active_intention_present" => Some(Self::ActiveIntentionPresent),
             "sleep_state_can_end" => Some(Self::SleepStateCanEnd),
-            "food_source_believed_accessible" => Some(Self::FoodSourceBelievedAccessible),
+             /* ~ changed by cargo-mutants ~ */
             "actor_at_workplace" => Some(Self::ActorAtWorkplace),
             "sleep_place_believed_accessible" => Some(Self::SleepPlaceBelievedAccessible),
             "search_surface_actor_known" => Some(Self::SearchSurfaceActorKnown),
             "next_step_available" => Some(Self::NextStepAvailable),
             "known_route_surface" => Some(Self::KnownRouteSurface),
             "modeled_wait_reason" => Some(Self::ModeledWaitReason),
             "reevaluation_window_known" => Some(Self::ReevaluationWindowKnown),
             "fixture_authored_possibility" => Some(Self::FixtureAuthoredPossibility),

---- agent::routine::tests::routine_condition_parse_covers_stable_id_vocabulary stdout ----

thread 'agent::routine::tests::routine_condition_parse_covers_stable_id_vocabulary' (11010) panicked at crates/tracewake-core/src/agent/routine.rs:764:13:
assertion `left == right` failed
  left: None
 right: Some(FoodSourceBelievedAccessible)

failures:
    agent::routine::tests::routine_condition_parse_covers_stable_id_vocabulary

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
