*** crates/tracewake-core/src/agent/routine.rs:280:13: delete match arm "next_step_available" in RoutineCondition::parse

*** mutation diff:
--- crates/tracewake-core/src/agent/routine.rs
+++ delete match arm "next_step_available" in RoutineCondition::parse
@@ -272,17 +272,17 @@
             "actor_knows_sleep_place" => Some(Self::ActorKnowsSleepPlace),
             "actor_has_food_search_knowledge" => Some(Self::ActorHasFoodSearchKnowledge),
             "active_intention_present" => Some(Self::ActiveIntentionPresent),
             "sleep_state_can_end" => Some(Self::SleepStateCanEnd),
             "food_source_believed_accessible" => Some(Self::FoodSourceBelievedAccessible),
             "actor_at_workplace" => Some(Self::ActorAtWorkplace),
             "sleep_place_believed_accessible" => Some(Self::SleepPlaceBelievedAccessible),
             "search_surface_actor_known" => Some(Self::SearchSurfaceActorKnown),
-            "next_step_available" => Some(Self::NextStepAvailable),
+             /* ~ changed by cargo-mutants ~ */
             "known_route_surface" => Some(Self::KnownRouteSurface),
             "modeled_wait_reason" => Some(Self::ModeledWaitReason),
             "reevaluation_window_known" => Some(Self::ReevaluationWindowKnown),
             "fixture_authored_possibility" => Some(Self::FixtureAuthoredPossibility),
             "shared_pipeline_preconditions" => Some(Self::SharedPipelinePreconditions),
             "assigned_workplace_known" => Some(Self::AssignedWorkplaceKnown),
             "at_workplace" => Some(Self::AtWorkplace),
             _ => None,

---- agent::routine::tests::routine_condition_parse_covers_stable_id_vocabulary stdout ----

thread 'agent::routine::tests::routine_condition_parse_covers_stable_id_vocabulary' (29246) panicked at crates/tracewake-core/src/agent/routine.rs:764:13:
assertion `left == right` failed
  left: None
 right: Some(NextStepAvailable)

failures:
    agent::routine::tests::routine_condition_parse_covers_stable_id_vocabulary

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
