*** crates/tracewake-core/src/agent/routine.rs:283:13: delete match arm "reevaluation_window_known" in RoutineCondition::parse

*** mutation diff:
--- crates/tracewake-core/src/agent/routine.rs
+++ delete match arm "reevaluation_window_known" in RoutineCondition::parse
@@ -275,17 +275,17 @@
             "sleep_state_can_end" => Some(Self::SleepStateCanEnd),
             "food_source_believed_accessible" => Some(Self::FoodSourceBelievedAccessible),
             "actor_at_workplace" => Some(Self::ActorAtWorkplace),
             "sleep_place_believed_accessible" => Some(Self::SleepPlaceBelievedAccessible),
             "search_surface_actor_known" => Some(Self::SearchSurfaceActorKnown),
             "next_step_available" => Some(Self::NextStepAvailable),
             "known_route_surface" => Some(Self::KnownRouteSurface),
             "modeled_wait_reason" => Some(Self::ModeledWaitReason),
-            "reevaluation_window_known" => Some(Self::ReevaluationWindowKnown),
+             /* ~ changed by cargo-mutants ~ */
             "fixture_authored_possibility" => Some(Self::FixtureAuthoredPossibility),
             "shared_pipeline_preconditions" => Some(Self::SharedPipelinePreconditions),
             "assigned_workplace_known" => Some(Self::AssignedWorkplaceKnown),
             "at_workplace" => Some(Self::AtWorkplace),
             _ => None,
         }
     }
 }

---- agent::routine::tests::routine_condition_parse_covers_stable_id_vocabulary stdout ----

thread 'agent::routine::tests::routine_condition_parse_covers_stable_id_vocabulary' (10456) panicked at crates/tracewake-core/src/agent/routine.rs:764:13:
assertion `left == right` failed
  left: None
 right: Some(ReevaluationWindowKnown)

failures:
    agent::routine::tests::routine_condition_parse_covers_stable_id_vocabulary

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
