*** crates/tracewake-core/src/agent/routine.rs:285:13: delete match arm "shared_pipeline_preconditions" in RoutineCondition::parse

*** mutation diff:
--- crates/tracewake-core/src/agent/routine.rs
+++ delete match arm "shared_pipeline_preconditions" in RoutineCondition::parse
@@ -277,17 +277,17 @@
             "actor_at_workplace" => Some(Self::ActorAtWorkplace),
             "sleep_place_believed_accessible" => Some(Self::SleepPlaceBelievedAccessible),
             "search_surface_actor_known" => Some(Self::SearchSurfaceActorKnown),
             "next_step_available" => Some(Self::NextStepAvailable),
             "known_route_surface" => Some(Self::KnownRouteSurface),
             "modeled_wait_reason" => Some(Self::ModeledWaitReason),
             "reevaluation_window_known" => Some(Self::ReevaluationWindowKnown),
             "fixture_authored_possibility" => Some(Self::FixtureAuthoredPossibility),
-            "shared_pipeline_preconditions" => Some(Self::SharedPipelinePreconditions),
+             /* ~ changed by cargo-mutants ~ */
             "assigned_workplace_known" => Some(Self::AssignedWorkplaceKnown),
             "at_workplace" => Some(Self::AtWorkplace),
             _ => None,
         }
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq)]

---- phase3a_load_emits_authored_prehistory_seed_events stdout ----

thread 'phase3a_load_emits_authored_prehistory_seed_events' (18784) panicked at crates/tracewake-content/tests/fixtures_load.rs:761:6:

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (18787) panicked at crates/tracewake-content/tests/fixtures_load.rs:1172:6:

---- all_fixtures_load_deterministically_and_validate stdout ----

thread 'all_fixtures_load_deterministically_and_validate' (18759) panicked at crates/tracewake-content/tests/fixtures_load.rs:591:54:

failures:
    all_fixtures_load_deterministically_and_validate
    phase3a_load_emits_authored_prehistory_seed_events
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 31 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
