*** crates/tracewake-core/src/agent/routine.rs:286:13: delete match arm "assigned_workplace_known" in RoutineCondition::parse

*** mutation diff:
--- crates/tracewake-core/src/agent/routine.rs
+++ delete match arm "assigned_workplace_known" in RoutineCondition::parse
@@ -278,17 +278,17 @@
             "sleep_place_believed_accessible" => Some(Self::SleepPlaceBelievedAccessible),
             "search_surface_actor_known" => Some(Self::SearchSurfaceActorKnown),
             "next_step_available" => Some(Self::NextStepAvailable),
             "known_route_surface" => Some(Self::KnownRouteSurface),
             "modeled_wait_reason" => Some(Self::ModeledWaitReason),
             "reevaluation_window_known" => Some(Self::ReevaluationWindowKnown),
             "fixture_authored_possibility" => Some(Self::FixtureAuthoredPossibility),
             "shared_pipeline_preconditions" => Some(Self::SharedPipelinePreconditions),
-            "assigned_workplace_known" => Some(Self::AssignedWorkplaceKnown),
+             /* ~ changed by cargo-mutants ~ */
             "at_workplace" => Some(Self::AtWorkplace),
             _ => None,
         }
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq)]
 pub struct RoutineTemplate {

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (22782) panicked at crates/tracewake-content/src/validate.rs:3650:59:

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (22781) panicked at crates/tracewake-content/src/validate.rs:3685:49:

failures:
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted

test result: FAILED. 34 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
