*** crates/tracewake-core/src/agent/routine.rs:428:9: replace RoutineExecution::start_step with ()

*** mutation diff:
--- crates/tracewake-core/src/agent/routine.rs
+++ replace RoutineExecution::start_step with ()
@@ -420,19 +420,17 @@
             reserved_resource,
             fallback_attempts: 0,
             failure_interruption_reason: None,
             trace_id,
         }
     }
 
     pub fn start_step(&mut self, tick: SimTick, action_id: SemanticActionId) {
-        self.step_status = RoutineStepStatus::InProgress;
-        self.last_progress_tick = tick;
-        self.concrete_action_ancestry.push(action_id);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn wait(&mut self, tick: SimTick) {
         self.step_status = RoutineStepStatus::Waiting;
         self.last_progress_tick = tick;
     }
 
     pub fn complete_step(&mut self, tick: SimTick) {

---- agent::routine::tests::routine_execution_transitions_record_ticks_reasons_and_fallbacks stdout ----

thread 'agent::routine::tests::routine_execution_transitions_record_ticks_reasons_and_fallbacks' (31070) panicked at crates/tracewake-core/src/agent/routine.rs:632:9:
assertion `left == right` failed
  left: NotStarted
 right: InProgress

---- events::apply::tests::agent_routine_step_event_records_progress_and_fallbacks stdout ----

thread 'events::apply::tests::agent_routine_step_event_records_progress_and_fallbacks' (31177) panicked at crates/tracewake-core/src/events/apply.rs:2182:9:
assertion `left == right` failed
  left: SimTick(0)
 right: SimTick(3)

---- scheduler::no_human::tests::duration_completion_appends_exact_matching_routine_step_once stdout ----

thread 'scheduler::no_human::tests::duration_completion_appends_exact_matching_routine_step_once' (31286) panicked at crates/tracewake-core/src/scheduler.rs:2886:17:
assertion `left == right` failed: sleep
  left: 0
 right: 1

failures:
    agent::routine::tests::routine_execution_transitions_record_ticks_reasons_and_fallbacks
    events::apply::tests::agent_routine_step_event_records_progress_and_fallbacks
    scheduler::no_human::tests::duration_completion_appends_exact_matching_routine_step_once
    scheduler::no_human::tests::no_human_day_records_routine_step_ancestry_and_replays_it

test result: FAILED. 451 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
