*** crates/tracewake-core/src/agent/routine.rs:434:9: replace RoutineExecution::wait with ()

*** mutation diff:
--- crates/tracewake-core/src/agent/routine.rs
+++ replace RoutineExecution::wait with ()
@@ -426,18 +426,17 @@
 
     pub fn start_step(&mut self, tick: SimTick, action_id: SemanticActionId) {
         self.step_status = RoutineStepStatus::InProgress;
         self.last_progress_tick = tick;
         self.concrete_action_ancestry.push(action_id);
     }
 
     pub fn wait(&mut self, tick: SimTick) {
-        self.step_status = RoutineStepStatus::Waiting;
-        self.last_progress_tick = tick;
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn complete_step(&mut self, tick: SimTick) {
         self.step_status = RoutineStepStatus::Completed;
         self.last_progress_tick = tick;
         self.failure_interruption_reason = None;
     }

---- scheduler::no_human::tests::no_human_day_detects_repeated_idle_wait stdout ----

thread 'scheduler::no_human::tests::no_human_day_detects_repeated_idle_wait' (3380) panicked at crates/tracewake-core/src/scheduler.rs:4260:13:
assertion failed: report.stuck_diagnostic_event_ids.iter().any(|event_id|
        {
            log.events().iter().find(|event|
                        &event.event_id ==
                            event_id).is_some_and(|event|
                    {
                        event.payload.iter().any(|field|
                                {
                                    field.key == "actual_source" &&
                                        field.value == "routine_repeated_idle_wait_stuck_detection"
                                })

---- scheduler::no_human::tests::routine_stuck_diagnostics_use_actor_window_and_progress_boundaries stdout ----

thread 'scheduler::no_human::tests::routine_stuck_diagnostics_use_actor_window_and_progress_boundaries' (3396) panicked at crates/tracewake-core/src/scheduler.rs:3806:13:
assertion `left == right` failed
  left: [(PastExpectedProgressWindow, RoutineExecutionId(StableId("routine_exec_past_due")))]
 right: [(PastExpectedProgressWindow, RoutineExecutionId(StableId("routine_exec_past_due"))), (RepeatedIdleWait, RoutineExecutionId(StableId("routine_exec_waiting_boundary")))]

failures:
    scheduler::no_human::tests::no_human_day_detects_repeated_idle_wait
    scheduler::no_human::tests::routine_stuck_diagnostics_use_actor_window_and_progress_boundaries

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
