*** crates/tracewake-core/src/agent/routine.rs:439:9: replace RoutineExecution::complete_step with ()

*** mutation diff:
--- crates/tracewake-core/src/agent/routine.rs
+++ replace RoutineExecution::complete_step with ()
@@ -431,19 +431,17 @@
     }
 
     pub fn wait(&mut self, tick: SimTick) {
         self.step_status = RoutineStepStatus::Waiting;
         self.last_progress_tick = tick;
     }
 
     pub fn complete_step(&mut self, tick: SimTick) {
-        self.step_status = RoutineStepStatus::Completed;
-        self.last_progress_tick = tick;
-        self.failure_interruption_reason = None;
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn fail(&mut self, tick: SimTick, reason: impl Into<String>) {
         self.step_status = RoutineStepStatus::Failed;
         self.last_progress_tick = tick;
         self.failure_interruption_reason = Some(reason.into());
     }

---- scheduler::no_human::tests::duration_completion_appends_exact_matching_routine_step_once stdout ----

thread 'scheduler::no_human::tests::duration_completion_appends_exact_matching_routine_step_once' (7937) panicked at crates/tracewake-core/src/scheduler.rs:2897:17:
assertion failed: routine_event.payload.iter().any(|field|
        {
            field.key == "routine_execution_id" &&
                field.value == matching_id.as_str()
        })

---- scheduler::no_human::tests::no_human_day_records_routine_step_ancestry_and_replays_it stdout ----

thread 'scheduler::no_human::tests::no_human_day_records_routine_step_ancestry_and_replays_it' (7945) panicked at crates/tracewake-core/src/scheduler.rs:4824:13:
assertion `left == right` failed
  left: InProgress
 right: Completed

---- scheduler::no_human::tests::work_move_starts_but_non_move_progress_completes_routine_step stdout ----

thread 'scheduler::no_human::tests::work_move_starts_but_non_move_progress_completes_routine_step' (7963) panicked at crates/tracewake-core/src/scheduler.rs:3049:13:
assertion `left == right` failed
  left: InProgress
 right: Completed

failures:
    scheduler::no_human::tests::duration_completion_appends_exact_matching_routine_step_once
    scheduler::no_human::tests::no_human_day_records_routine_step_ancestry_and_replays_it
    scheduler::no_human::tests::work_move_starts_but_non_move_progress_completes_routine_step

test result: FAILED. 452 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
