*** crates/tracewake-core/src/agent/routine.rs:445:9: replace RoutineExecution::fail with ()

*** mutation diff:
--- crates/tracewake-core/src/agent/routine.rs
+++ replace RoutineExecution::fail with ()
@@ -437,19 +437,17 @@
 
     pub fn complete_step(&mut self, tick: SimTick) {
         self.step_status = RoutineStepStatus::Completed;
         self.last_progress_tick = tick;
         self.failure_interruption_reason = None;
     }
 
     pub fn fail(&mut self, tick: SimTick, reason: impl Into<String>) {
-        self.step_status = RoutineStepStatus::Failed;
-        self.last_progress_tick = tick;
-        self.failure_interruption_reason = Some(reason.into());
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn interrupt(&mut self, tick: SimTick, reason: impl Into<String>) {
         self.step_status = RoutineStepStatus::Interrupted;
         self.last_progress_tick = tick;
         self.failure_interruption_reason = Some(reason.into());
     }

---- agent::routine::tests::routine_execution_transitions_record_ticks_reasons_and_fallbacks stdout ----

thread 'agent::routine::tests::routine_execution_transitions_record_ticks_reasons_and_fallbacks' (12280) panicked at crates/tracewake-core/src/agent/routine.rs:653:9:
assertion `left == right` failed
  left: InProgress
 right: Failed

---- scheduler::no_human::tests::no_human_day_records_blocked_routine_failure_reason stdout ----

thread 'scheduler::no_human::tests::no_human_day_records_blocked_routine_failure_reason' (12502) panicked at crates/tracewake-core/src/scheduler.rs:4953:13:
assertion `left == right` failed
  left: NotStarted
 right: Failed

failures:
    agent::routine::tests::routine_execution_transitions_record_ticks_reasons_and_fallbacks
    scheduler::no_human::tests::no_human_day_records_blocked_routine_failure_reason

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
