*** crates/tracewake-core/src/agent/routine.rs:451:9: replace RoutineExecution::interrupt with ()

*** mutation diff:
--- crates/tracewake-core/src/agent/routine.rs
+++ replace RoutineExecution::interrupt with ()
@@ -443,19 +443,17 @@
 
     pub fn fail(&mut self, tick: SimTick, reason: impl Into<String>) {
         self.step_status = RoutineStepStatus::Failed;
         self.last_progress_tick = tick;
         self.failure_interruption_reason = Some(reason.into());
     }
 
     pub fn interrupt(&mut self, tick: SimTick, reason: impl Into<String>) {
-        self.step_status = RoutineStepStatus::Interrupted;
-        self.last_progress_tick = tick;
-        self.failure_interruption_reason = Some(reason.into());
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn suspend(&mut self, tick: SimTick, reason: impl Into<String>) {
         self.step_status = RoutineStepStatus::Suspended;
         self.last_progress_tick = tick;
         self.failure_interruption_reason = Some(reason.into());
     }

---- agent::htn::tests::mid_method_failure_records_interruption_and_fallback_attempt stdout ----

thread 'agent::htn::tests::mid_method_failure_records_interruption_and_fallback_attempt' (16780) panicked at crates/tracewake-core/src/agent/htn.rs:497:9:
assertion `left == right` failed
  left: NotStarted
 right: Interrupted

---- agent::routine::tests::routine_execution_transitions_record_ticks_reasons_and_fallbacks stdout ----

thread 'agent::routine::tests::routine_execution_transitions_record_ticks_reasons_and_fallbacks' (16839) panicked at crates/tracewake-core/src/agent/routine.rs:641:9:
assertion `left == right` failed
  left: InProgress
 right: Interrupted

failures:
    agent::htn::tests::mid_method_failure_records_interruption_and_fallback_attempt
    agent::routine::tests::routine_execution_transitions_record_ticks_reasons_and_fallbacks

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
