*** crates/tracewake-core/src/agent/routine.rs:457:9: replace RoutineExecution::suspend with ()

*** mutation diff:
--- crates/tracewake-core/src/agent/routine.rs
+++ replace RoutineExecution::suspend with ()
@@ -449,19 +449,17 @@
 
     pub fn interrupt(&mut self, tick: SimTick, reason: impl Into<String>) {
         self.step_status = RoutineStepStatus::Interrupted;
         self.last_progress_tick = tick;
         self.failure_interruption_reason = Some(reason.into());
     }
 
     pub fn suspend(&mut self, tick: SimTick, reason: impl Into<String>) {
-        self.step_status = RoutineStepStatus::Suspended;
-        self.last_progress_tick = tick;
-        self.failure_interruption_reason = Some(reason.into());
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn resume(&mut self, tick: SimTick) {
         self.step_status = RoutineStepStatus::InProgress;
         self.last_progress_tick = tick;
         self.failure_interruption_reason = None;
     }

---- agent::routine::tests::routine_execution_transitions_record_ticks_reasons_and_fallbacks stdout ----

thread 'agent::routine::tests::routine_execution_transitions_record_ticks_reasons_and_fallbacks' (21398) panicked at crates/tracewake-core/src/agent/routine.rs:660:9:
assertion `left == right` failed
  left: Failed
 right: Suspended

failures:
    agent::routine::tests::routine_execution_transitions_record_ticks_reasons_and_fallbacks

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
