*** crates/tracewake-core/src/agent/routine.rs:463:9: replace RoutineExecution::resume with ()

*** mutation diff:
--- crates/tracewake-core/src/agent/routine.rs
+++ replace RoutineExecution::resume with ()
@@ -455,19 +455,17 @@
 
     pub fn suspend(&mut self, tick: SimTick, reason: impl Into<String>) {
         self.step_status = RoutineStepStatus::Suspended;
         self.last_progress_tick = tick;
         self.failure_interruption_reason = Some(reason.into());
     }
 
     pub fn resume(&mut self, tick: SimTick) {
-        self.step_status = RoutineStepStatus::InProgress;
-        self.last_progress_tick = tick;
-        self.failure_interruption_reason = None;
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn abandon(&mut self, tick: SimTick, reason: impl Into<String>) {
         self.step_status = RoutineStepStatus::Abandoned;
         self.last_progress_tick = tick;
         self.failure_interruption_reason = Some(reason.into());
     }

---- agent::routine::tests::routine_execution_transitions_record_ticks_reasons_and_fallbacks stdout ----

thread 'agent::routine::tests::routine_execution_transitions_record_ticks_reasons_and_fallbacks' (25957) panicked at crates/tracewake-core/src/agent/routine.rs:649:9:
assertion `left == right` failed
  left: Interrupted
 right: InProgress

failures:
    agent::routine::tests::routine_execution_transitions_record_ticks_reasons_and_fallbacks

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
