*** crates/tracewake-core/src/agent/routine.rs:469:9: replace RoutineExecution::abandon with ()

*** mutation diff:
--- crates/tracewake-core/src/agent/routine.rs
+++ replace RoutineExecution::abandon with ()
@@ -461,19 +461,17 @@
 
     pub fn resume(&mut self, tick: SimTick) {
         self.step_status = RoutineStepStatus::InProgress;
         self.last_progress_tick = tick;
         self.failure_interruption_reason = None;
     }
 
     pub fn abandon(&mut self, tick: SimTick, reason: impl Into<String>) {
-        self.step_status = RoutineStepStatus::Abandoned;
-        self.last_progress_tick = tick;
-        self.failure_interruption_reason = Some(reason.into());
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn record_fallback_attempt(&mut self) {
         self.fallback_attempts = self.fallback_attempts.saturating_add(1);
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq)]

---- agent::routine::tests::routine_execution_transitions_record_ticks_reasons_and_fallbacks stdout ----

thread 'agent::routine::tests::routine_execution_transitions_record_ticks_reasons_and_fallbacks' (30516) panicked at crates/tracewake-core/src/agent/routine.rs:668:9:
assertion `left == right` failed
  left: Suspended
 right: Abandoned

failures:
    agent::routine::tests::routine_execution_transitions_record_ticks_reasons_and_fallbacks

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
