*** crates/tracewake-core/src/agent/routine.rs:475:9: replace RoutineExecution::record_fallback_attempt with ()

*** mutation diff:
--- crates/tracewake-core/src/agent/routine.rs
+++ replace RoutineExecution::record_fallback_attempt with ()
@@ -467,17 +467,17 @@
 
     pub fn abandon(&mut self, tick: SimTick, reason: impl Into<String>) {
         self.step_status = RoutineStepStatus::Abandoned;
         self.last_progress_tick = tick;
         self.failure_interruption_reason = Some(reason.into());
     }
 
     pub fn record_fallback_attempt(&mut self) {
-        self.fallback_attempts = self.fallback_attempts.saturating_add(1);
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq)]
 pub enum RoutineTemplateError {
     MissingSteps,
     MissingFailureModes,
     MissingInterruptionPoints,

---- agent::htn::tests::mid_method_failure_records_interruption_and_fallback_attempt stdout ----

thread 'agent::htn::tests::mid_method_failure_records_interruption_and_fallback_attempt' (2548) panicked at crates/tracewake-core/src/agent/htn.rs:501:9:
assertion `left == right` failed
  left: 0
 right: 1

---- agent::routine::tests::routine_execution_transitions_record_ticks_reasons_and_fallbacks stdout ----

thread 'agent::routine::tests::routine_execution_transitions_record_ticks_reasons_and_fallbacks' (2607) panicked at crates/tracewake-core/src/agent/routine.rs:640:9:
assertion `left == right` failed
  left: 0
 right: 2

---- scheduler::no_human::tests::no_human_day_detects_repeated_idle_wait stdout ----

thread 'scheduler::no_human::tests::no_human_day_detects_repeated_idle_wait' (2826) panicked at crates/tracewake-core/src/scheduler.rs:4260:13:
assertion failed: report.stuck_diagnostic_event_ids.iter().any(|event_id|
        {
            log.events().iter().find(|event|
                        &event.event_id ==
                            event_id).is_some_and(|event|
                    {
                        event.payload.iter().any(|field|
                                {
                                    field.key == "actual_source" &&
                                        field.value == "routine_repeated_idle_wait_stuck_detection"
                                })

failures:
    agent::htn::tests::mid_method_failure_records_interruption_and_fallback_attempt
    agent::routine::tests::routine_execution_transitions_record_ticks_reasons_and_fallbacks
    scheduler::no_human::tests::no_human_day_detects_repeated_idle_wait
    scheduler::no_human::tests::routine_stuck_diagnostics_use_actor_window_and_progress_boundaries

test result: FAILED. 451 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
