*** crates/tracewake-core/src/agent/routine.rs:521:5: replace encode_action_step -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-core/src/agent/routine.rs
+++ replace encode_action_step -> String with "xyzzy".into()
@@ -513,21 +513,17 @@
             }
         }
     }
 }
 
 impl std::error::Error for RoutineStepParseError {}
 
 fn encode_action_step(kind: &str, action_id: &SemanticActionId) -> String {
-    format!(
-        "routine_step_v1|{}|{}",
-        kind,
-        action_id.serialize_canonical()
-    )
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 fn encode_text_step(kind: &str, value: &str) -> String {
     format!("routine_step_v1|{}|{}", kind, encode_text_payload(value))
 }
 
 fn encode_text_payload(value: &str) -> String {
     value

---- validate::tests::fixture_serialization_golden_bytes_are_pinned_001 stdout ----

thread 'validate::tests::fixture_serialization_golden_bytes_are_pinned_001' (15416) panicked at crates/tracewake-content/src/validate.rs:3216:13:
assertion `left == right` failed: phase3a serialization golden changed

---- validate::tests::phase3a_valid_routine_content_is_accepted stdout ----

thread 'validate::tests::phase3a_valid_routine_content_is_accepted' (15426) panicked at crates/tracewake-content/src/validate.rs:3650:59:

failures:
    validate::tests::fixture_serialization_golden_bytes_are_pinned_001
    validate::tests::phase3a_valid_routine_content_is_accepted

test result: FAILED. 34 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
