*** crates/tracewake-core/src/agent/routine.rs:529:5: replace encode_text_step -> String with String::new()

*** mutation diff:
--- crates/tracewake-core/src/agent/routine.rs
+++ replace encode_text_step -> String with String::new()
@@ -521,17 +521,17 @@
     format!(
         "routine_step_v1|{}|{}",
         kind,
         action_id.serialize_canonical()
     )
 }
 
 fn encode_text_step(kind: &str, value: &str) -> String {
-    format!("routine_step_v1|{}|{}", kind, encode_text_payload(value))
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn encode_text_payload(value: &str) -> String {
     value
         .as_bytes()
         .iter()
         .map(|byte| format!("{byte:02x}"))
         .collect()

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (19421) panicked at crates/tracewake-content/src/validate.rs:3685:49:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Serialization, path: "fixture", code: "serialization_drift", message: "fixture serialization changed canonical content" }] } }

failures:
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
