*** crates/tracewake-core/src/agent/routine.rs:541:5: replace decode_text_payload -> Result<String, RoutineStepParseError> with Ok(String::new())

*** mutation diff:
--- crates/tracewake-core/src/agent/routine.rs
+++ replace decode_text_payload -> Result<String, RoutineStepParseError> with Ok(String::new())
@@ -533,30 +533,17 @@
     value
         .as_bytes()
         .iter()
         .map(|byte| format!("{byte:02x}"))
         .collect()
 }
 
 fn decode_text_payload(value: &str) -> Result<String, RoutineStepParseError> {
-    if !value.len().is_multiple_of(2) {
-        return Err(RoutineStepParseError::InvalidTextPayload);
-    }
-
-    let bytes = value
-        .as_bytes()
-        .chunks_exact(2)
-        .map(|pair| {
-            let hex = std::str::from_utf8(pair).map_err(|_| RoutineStepParseError::InvalidUtf8)?;
-            u8::from_str_radix(hex, 16).map_err(|_| RoutineStepParseError::InvalidTextPayload)
-        })
-        .collect::<Result<Vec<_>, _>>()?;
-
-    String::from_utf8(bytes).map_err(|_| RoutineStepParseError::InvalidTextPayload)
+    Ok(String::new()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     fn action(value: &str) -> SemanticActionId {
         SemanticActionId::new(value).unwrap()

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (2937) panicked at crates/tracewake-content/src/validate.rs:3685:49:

failures:
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
