*** crates/tracewake-core/src/agent/routine.rs:541:8: delete ! in decode_text_payload

*** mutation diff:
--- crates/tracewake-core/src/agent/routine.rs
+++ delete ! in decode_text_payload
@@ -533,17 +533,17 @@
     value
         .as_bytes()
         .iter()
         .map(|byte| format!("{byte:02x}"))
         .collect()
 }
 
 fn decode_text_payload(value: &str) -> Result<String, RoutineStepParseError> {
-    if !value.len().is_multiple_of(2) {
+    if  /* ~ changed by cargo-mutants ~ */value.len().is_multiple_of(2) {
         return Err(RoutineStepParseError::InvalidTextPayload);
     }
 
     let bytes = value
         .as_bytes()
         .chunks_exact(2)
         .map(|pair| {
             let hex = std::str::from_utf8(pair).map_err(|_| RoutineStepParseError::InvalidUtf8)?;

---- validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic' (10930) panicked at crates/tracewake-content/src/validate.rs:3685:49:

---- validate::tests::phase3a_sleep_routine_requires_authored_sleep_surface_or_diagnostic stdout ----

thread 'validate::tests::phase3a_sleep_routine_requires_authored_sleep_surface_or_diagnostic' (10929) panicked at crates/tracewake-content/src/validate.rs:3674:9:
assertion `left == right` failed
  left: InvalidTextPayload
 right: InvalidDiagnosticKind

failures:
    validate::tests::phase3a_sleep_routine_requires_authored_sleep_surface_or_diagnostic
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic

test result: FAILED. 34 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
