*** crates/tracewake-core/src/agent/trace.rs:103:13: delete match arm "candidate_generation" in ResponsibleLayer::parse

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ delete match arm "candidate_generation" in ResponsibleLayer::parse
@@ -95,17 +95,17 @@
             Self::ViewModel => "view_model",
             Self::TestOracle => "test_oracle",
             Self::DebugQuarantine => "debug_quarantine",
         }
     }
 
     pub fn parse(value: &str) -> Result<Self, DiagnosticFieldParseError> {
         match value {
-            "candidate_generation" => Ok(Self::CandidateGeneration),
+             /* ~ changed by cargo-mutants ~ */
             "intention_lifecycle" => Ok(Self::IntentionLifecycle),
             "method_selection" => Ok(Self::MethodSelection),
             "local_planning" => Ok(Self::LocalPlanning),
             "proposal_construction" => Ok(Self::ProposalConstruction),
             "scheduler" => Ok(Self::Scheduler),
             "action_validation" => Ok(Self::ActionValidation),
             "projection" => Ok(Self::Projection),
             "view_model" => Ok(Self::ViewModel),

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (29041) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
