*** crates/tracewake-core/src/agent/trace.rs:104:13: delete match arm "intention_lifecycle" in ResponsibleLayer::parse

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ delete match arm "intention_lifecycle" in ResponsibleLayer::parse
@@ -96,17 +96,17 @@
             Self::TestOracle => "test_oracle",
             Self::DebugQuarantine => "debug_quarantine",
         }
     }
 
     pub fn parse(value: &str) -> Result<Self, DiagnosticFieldParseError> {
         match value {
             "candidate_generation" => Ok(Self::CandidateGeneration),
-            "intention_lifecycle" => Ok(Self::IntentionLifecycle),
+             /* ~ changed by cargo-mutants ~ */
             "method_selection" => Ok(Self::MethodSelection),
             "local_planning" => Ok(Self::LocalPlanning),
             "proposal_construction" => Ok(Self::ProposalConstruction),
             "scheduler" => Ok(Self::Scheduler),
             "action_validation" => Ok(Self::ActionValidation),
             "projection" => Ok(Self::Projection),
             "view_model" => Ok(Self::ViewModel),
             "test_oracle" => Ok(Self::TestOracle),

---- agent::trace::tests::decision_trace_vocabulary_parses_every_canonical_token stdout ----

thread 'agent::trace::tests::decision_trace_vocabulary_parses_every_canonical_token' (873) panicked at crates/tracewake-core/src/agent/trace.rs:1236:67:
called `Result::unwrap()` on an `Err` value: InvalidResponsibleLayer

failures:
    agent::trace::tests::decision_trace_vocabulary_parses_every_canonical_token

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
