*** crates/tracewake-core/src/agent/trace.rs:105:13: delete match arm "method_selection" in ResponsibleLayer::parse

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ delete match arm "method_selection" in ResponsibleLayer::parse
@@ -97,17 +97,17 @@
             Self::DebugQuarantine => "debug_quarantine",
         }
     }
 
     pub fn parse(value: &str) -> Result<Self, DiagnosticFieldParseError> {
         match value {
             "candidate_generation" => Ok(Self::CandidateGeneration),
             "intention_lifecycle" => Ok(Self::IntentionLifecycle),
-            "method_selection" => Ok(Self::MethodSelection),
+             /* ~ changed by cargo-mutants ~ */
             "local_planning" => Ok(Self::LocalPlanning),
             "proposal_construction" => Ok(Self::ProposalConstruction),
             "scheduler" => Ok(Self::Scheduler),
             "action_validation" => Ok(Self::ActionValidation),
             "projection" => Ok(Self::Projection),
             "view_model" => Ok(Self::ViewModel),
             "test_oracle" => Ok(Self::TestOracle),
             "debug_quarantine" => Ok(Self::DebugQuarantine),

---- agent::trace::tests::canonical_trace_deserializers_reject_bad_prefix_and_field_count stdout ----

thread 'agent::trace::tests::canonical_trace_deserializers_reject_bad_prefix_and_field_count' (5429) panicked at crates/tracewake-core/src/agent/trace.rs:1344:18:
called `Result::unwrap()` on an `Err` value: InvalidResponsibleLayer

---- agent::trace::tests::decision_trace_vocabulary_parses_every_canonical_token stdout ----

thread 'agent::trace::tests::decision_trace_vocabulary_parses_every_canonical_token' (5432) panicked at crates/tracewake-core/src/agent/trace.rs:1236:67:
called `Result::unwrap()` on an `Err` value: InvalidResponsibleLayer

failures:
    agent::trace::tests::canonical_trace_deserializers_reject_bad_prefix_and_field_count
    agent::trace::tests::decision_trace_vocabulary_parses_every_canonical_token

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
