*** crates/tracewake-core/src/agent/trace.rs:106:13: delete match arm "local_planning" in ResponsibleLayer::parse

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ delete match arm "local_planning" in ResponsibleLayer::parse
@@ -98,17 +98,17 @@
         }
     }
 
     pub fn parse(value: &str) -> Result<Self, DiagnosticFieldParseError> {
         match value {
             "candidate_generation" => Ok(Self::CandidateGeneration),
             "intention_lifecycle" => Ok(Self::IntentionLifecycle),
             "method_selection" => Ok(Self::MethodSelection),
-            "local_planning" => Ok(Self::LocalPlanning),
+             /* ~ changed by cargo-mutants ~ */
             "proposal_construction" => Ok(Self::ProposalConstruction),
             "scheduler" => Ok(Self::Scheduler),
             "action_validation" => Ok(Self::ActionValidation),
             "projection" => Ok(Self::Projection),
             "view_model" => Ok(Self::ViewModel),
             "test_oracle" => Ok(Self::TestOracle),
             "debug_quarantine" => Ok(Self::DebugQuarantine),
             _ => Err(DiagnosticFieldParseError::InvalidResponsibleLayer),

---- agent::trace::tests::canonical_trace_deserializers_reject_bad_prefix_and_field_count stdout ----

thread 'agent::trace::tests::canonical_trace_deserializers_reject_bad_prefix_and_field_count' (9989) panicked at crates/tracewake-core/src/agent/trace.rs:1390:18:
called `Result::unwrap()` on an `Err` value: InvalidResponsibleLayer

---- agent::trace::tests::every_blocker_category_serializes_and_round_trips stdout ----

thread 'agent::trace::tests::every_blocker_category_serializes_and_round_trips' (9993) panicked at crates/tracewake-core/src/agent/trace.rs:1183:80:
called `Result::unwrap()` on an `Err` value: InvalidResponsibleLayer

---- agent::trace::tests::decision_trace_vocabulary_parses_every_canonical_token stdout ----

thread 'agent::trace::tests::decision_trace_vocabulary_parses_every_canonical_token' (9992) panicked at crates/tracewake-core/src/agent/trace.rs:1236:67:
called `Result::unwrap()` on an `Err` value: InvalidResponsibleLayer

failures:
    agent::trace::tests::canonical_trace_deserializers_reject_bad_prefix_and_field_count
    agent::trace::tests::decision_trace_vocabulary_parses_every_canonical_token
    agent::trace::tests::every_blocker_category_serializes_and_round_trips
    projections::tests::no_human_metrics_helpers_use_typed_fields_and_player_terms

test result: FAILED. 451 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
