*** crates/tracewake-core/src/agent/trace.rs:108:13: delete match arm "scheduler" in ResponsibleLayer::parse

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ delete match arm "scheduler" in ResponsibleLayer::parse
@@ -100,17 +100,17 @@
 
     pub fn parse(value: &str) -> Result<Self, DiagnosticFieldParseError> {
         match value {
             "candidate_generation" => Ok(Self::CandidateGeneration),
             "intention_lifecycle" => Ok(Self::IntentionLifecycle),
             "method_selection" => Ok(Self::MethodSelection),
             "local_planning" => Ok(Self::LocalPlanning),
             "proposal_construction" => Ok(Self::ProposalConstruction),
-            "scheduler" => Ok(Self::Scheduler),
+             /* ~ changed by cargo-mutants ~ */
             "action_validation" => Ok(Self::ActionValidation),
             "projection" => Ok(Self::Projection),
             "view_model" => Ok(Self::ViewModel),
             "test_oracle" => Ok(Self::TestOracle),
             "debug_quarantine" => Ok(Self::DebugQuarantine),
             _ => Err(DiagnosticFieldParseError::InvalidResponsibleLayer),
         }
     }

---- no_human_sleep_knowledge_requires_observation_or_record_channel stdout ----

thread 'no_human_sleep_knowledge_requires_observation_or_record_channel' (18888) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:3036:5:
assertion failed: !report.stuck_diagnostic_event_ids.is_empty()

---- no_human_workplace_knowledge_requires_notice_channel stdout ----

thread 'no_human_workplace_knowledge_requires_notice_channel' (18889) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:3001:5:
assertion failed: !report.stuck_diagnostic_event_ids.is_empty()

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (18884) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2715:5:
assertion `left == right` failed
  left: PhysicalChecksum("twc1-301be54dfb7dfb00")
 right: PhysicalChecksum("twc1-68ee74360d03d456")

failures:
    no_human_day_real_run_replays_metrics_and_trace_projection
    no_human_sleep_knowledge_requires_observation_or_record_channel
    no_human_workplace_knowledge_requires_notice_channel

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.46s

*** result: Failure(101)
