*** crates/tracewake-core/src/agent/trace.rs:113:13: delete match arm "debug_quarantine" in ResponsibleLayer::parse

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ delete match arm "debug_quarantine" in ResponsibleLayer::parse
@@ -105,17 +105,17 @@
             "method_selection" => Ok(Self::MethodSelection),
             "local_planning" => Ok(Self::LocalPlanning),
             "proposal_construction" => Ok(Self::ProposalConstruction),
             "scheduler" => Ok(Self::Scheduler),
             "action_validation" => Ok(Self::ActionValidation),
             "projection" => Ok(Self::Projection),
             "view_model" => Ok(Self::ViewModel),
             "test_oracle" => Ok(Self::TestOracle),
-            "debug_quarantine" => Ok(Self::DebugQuarantine),
+             /* ~ changed by cargo-mutants ~ */
             _ => Err(DiagnosticFieldParseError::InvalidResponsibleLayer),
         }
     }
 }
 
 #[derive(Clone, Copy, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
 pub enum BlockerCode {
     None,

---- agent::trace::tests::decision_trace_vocabulary_parses_every_canonical_token stdout ----

thread 'agent::trace::tests::decision_trace_vocabulary_parses_every_canonical_token' (8978) panicked at crates/tracewake-core/src/agent/trace.rs:1236:67:
called `Result::unwrap()` on an `Err` value: InvalidResponsibleLayer

failures:
    agent::trace::tests::decision_trace_vocabulary_parses_every_canonical_token

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
