*** crates/tracewake-core/src/agent/trace.rs:143:9: replace BlockerCode::stable_id -> &'static str with ""

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ replace BlockerCode::stable_id -> &'static str with ""
@@ -135,36 +135,17 @@
     HiddenTruthInput,
     ProvenanceDangling,
     ProvenanceClassMismatch,
     ProvenanceWitnessMismatch,
 }
 
 impl BlockerCode {
     pub const fn stable_id(self) -> &'static str {
-        match self {
-            Self::None => "none",
-            Self::Physical => "physical",
-            Self::Access => "access",
-            Self::Knowledge => "knowledge",
-            Self::Resource => "resource",
-            Self::SocialNormPlaceholder => "social_norm_placeholder",
-            Self::SchedulingReservation => "scheduling_reservation",
-            Self::UnsupportedAction => "unsupported_action",
-            Self::PlannerBudgetExhausted => "planner_budget_exhausted",
-            Self::FixtureAuthoringError => "fixture_authoring_error",
-            Self::NoApplicableCandidate => "no_applicable_candidate",
-            Self::NoApplicableMethod => "no_applicable_method",
-            Self::EmptyLocalPlan => "empty_local_plan",
-            Self::LocalPlanFailed => "local_plan_failed",
-            Self::HiddenTruthInput => "hidden_truth_input",
-            Self::ProvenanceDangling => "provenance_dangling",
-            Self::ProvenanceClassMismatch => "provenance_class_mismatch",
-            Self::ProvenanceWitnessMismatch => "provenance_witness_mismatch",
-        }
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn parse(value: &str) -> Result<Self, DiagnosticFieldParseError> {
         match value {
             "none" => Ok(Self::None),
             "physical" => Ok(Self::Physical),
             "access" => Ok(Self::Access),
             "knowledge" => Ok(Self::Knowledge),

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (13268) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
