*** crates/tracewake-core/src/agent/trace.rs:167:13: delete match arm "none" in BlockerCode::parse

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ delete match arm "none" in BlockerCode::parse
@@ -159,17 +159,17 @@
             Self::ProvenanceDangling => "provenance_dangling",
             Self::ProvenanceClassMismatch => "provenance_class_mismatch",
             Self::ProvenanceWitnessMismatch => "provenance_witness_mismatch",
         }
     }
 
     pub fn parse(value: &str) -> Result<Self, DiagnosticFieldParseError> {
         match value {
-            "none" => Ok(Self::None),
+             /* ~ changed by cargo-mutants ~ */
             "physical" => Ok(Self::Physical),
             "access" => Ok(Self::Access),
             "knowledge" => Ok(Self::Knowledge),
             "resource" => Ok(Self::Resource),
             "social_norm_placeholder" => Ok(Self::SocialNormPlaceholder),
             "scheduling_reservation" => Ok(Self::SchedulingReservation),
             "unsupported_action" => Ok(Self::UnsupportedAction),
             "planner_budget_exhausted" => Ok(Self::PlannerBudgetExhausted),

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (21342) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
