*** crates/tracewake-core/src/agent/trace.rs:168:13: delete match arm "physical" in BlockerCode::parse

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ delete match arm "physical" in BlockerCode::parse
@@ -160,17 +160,17 @@
             Self::ProvenanceClassMismatch => "provenance_class_mismatch",
             Self::ProvenanceWitnessMismatch => "provenance_witness_mismatch",
         }
     }
 
     pub fn parse(value: &str) -> Result<Self, DiagnosticFieldParseError> {
         match value {
             "none" => Ok(Self::None),
-            "physical" => Ok(Self::Physical),
+             /* ~ changed by cargo-mutants ~ */
             "access" => Ok(Self::Access),
             "knowledge" => Ok(Self::Knowledge),
             "resource" => Ok(Self::Resource),
             "social_norm_placeholder" => Ok(Self::SocialNormPlaceholder),
             "scheduling_reservation" => Ok(Self::SchedulingReservation),
             "unsupported_action" => Ok(Self::UnsupportedAction),
             "planner_budget_exhausted" => Ok(Self::PlannerBudgetExhausted),
             "fixture_authoring_error" => Ok(Self::FixtureAuthoringError),

---- agent::trace::tests::every_blocker_category_serializes_and_round_trips stdout ----

thread 'agent::trace::tests::every_blocker_category_serializes_and_round_trips' (25643) panicked at crates/tracewake-core/src/agent/trace.rs:1183:80:
called `Result::unwrap()` on an `Err` value: InvalidBlockerCode

---- agent::trace::tests::decision_trace_vocabulary_parses_every_canonical_token stdout ----

thread 'agent::trace::tests::decision_trace_vocabulary_parses_every_canonical_token' (25642) panicked at crates/tracewake-core/src/agent/trace.rs:1265:62:
called `Result::unwrap()` on an `Err` value: InvalidBlockerCode

failures:
    agent::trace::tests::decision_trace_vocabulary_parses_every_canonical_token
    agent::trace::tests::every_blocker_category_serializes_and_round_trips

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
