*** crates/tracewake-core/src/agent/trace.rs:172:13: delete match arm "social_norm_placeholder" in BlockerCode::parse

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ delete match arm "social_norm_placeholder" in BlockerCode::parse
@@ -164,17 +164,17 @@
 
     pub fn parse(value: &str) -> Result<Self, DiagnosticFieldParseError> {
         match value {
             "none" => Ok(Self::None),
             "physical" => Ok(Self::Physical),
             "access" => Ok(Self::Access),
             "knowledge" => Ok(Self::Knowledge),
             "resource" => Ok(Self::Resource),
-            "social_norm_placeholder" => Ok(Self::SocialNormPlaceholder),
+             /* ~ changed by cargo-mutants ~ */
             "scheduling_reservation" => Ok(Self::SchedulingReservation),
             "unsupported_action" => Ok(Self::UnsupportedAction),
             "planner_budget_exhausted" => Ok(Self::PlannerBudgetExhausted),
             "fixture_authoring_error" => Ok(Self::FixtureAuthoringError),
             "no_applicable_candidate" => Ok(Self::NoApplicableCandidate),
             "no_applicable_method" => Ok(Self::NoApplicableMethod),
             "empty_local_plan" => Ok(Self::EmptyLocalPlan),
             "local_plan_failed" => Ok(Self::LocalPlanFailed),

---- agent::trace::tests::decision_trace_vocabulary_parses_every_canonical_token stdout ----

thread 'agent::trace::tests::decision_trace_vocabulary_parses_every_canonical_token' (11411) panicked at crates/tracewake-core/src/agent/trace.rs:1265:62:
called `Result::unwrap()` on an `Err` value: InvalidBlockerCode

---- agent::trace::tests::every_blocker_category_serializes_and_round_trips stdout ----

thread 'agent::trace::tests::every_blocker_category_serializes_and_round_trips' (11412) panicked at crates/tracewake-core/src/agent/trace.rs:1183:80:
called `Result::unwrap()` on an `Err` value: InvalidBlockerCode

failures:
    agent::trace::tests::decision_trace_vocabulary_parses_every_canonical_token
    agent::trace::tests::every_blocker_category_serializes_and_round_trips

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
