*** crates/tracewake-core/src/agent/trace.rs:175:13: delete match arm "planner_budget_exhausted" in BlockerCode::parse

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ delete match arm "planner_budget_exhausted" in BlockerCode::parse
@@ -167,17 +167,17 @@
             "none" => Ok(Self::None),
             "physical" => Ok(Self::Physical),
             "access" => Ok(Self::Access),
             "knowledge" => Ok(Self::Knowledge),
             "resource" => Ok(Self::Resource),
             "social_norm_placeholder" => Ok(Self::SocialNormPlaceholder),
             "scheduling_reservation" => Ok(Self::SchedulingReservation),
             "unsupported_action" => Ok(Self::UnsupportedAction),
-            "planner_budget_exhausted" => Ok(Self::PlannerBudgetExhausted),
+             /* ~ changed by cargo-mutants ~ */
             "fixture_authoring_error" => Ok(Self::FixtureAuthoringError),
             "no_applicable_candidate" => Ok(Self::NoApplicableCandidate),
             "no_applicable_method" => Ok(Self::NoApplicableMethod),
             "empty_local_plan" => Ok(Self::EmptyLocalPlan),
             "local_plan_failed" => Ok(Self::LocalPlanFailed),
             "hidden_truth_input" => Ok(Self::HiddenTruthInput),
             "provenance_dangling" => Ok(Self::ProvenanceDangling),
             "provenance_class_mismatch" => Ok(Self::ProvenanceClassMismatch),

---- agent::trace::tests::decision_trace_vocabulary_parses_every_canonical_token stdout ----

thread 'agent::trace::tests::decision_trace_vocabulary_parses_every_canonical_token' (24628) panicked at crates/tracewake-core/src/agent/trace.rs:1265:62:
called `Result::unwrap()` on an `Err` value: InvalidBlockerCode

---- agent::trace::tests::canonical_trace_deserializers_reject_bad_prefix_and_field_count stdout ----

thread 'agent::trace::tests::canonical_trace_deserializers_reject_bad_prefix_and_field_count' (24625) panicked at crates/tracewake-core/src/agent/trace.rs:1390:18:
called `Result::unwrap()` on an `Err` value: InvalidBlockerCode

---- agent::trace::tests::every_blocker_category_serializes_and_round_trips stdout ----

thread 'agent::trace::tests::every_blocker_category_serializes_and_round_trips' (24629) panicked at crates/tracewake-core/src/agent/trace.rs:1183:80:
called `Result::unwrap()` on an `Err` value: InvalidBlockerCode

failures:
    agent::trace::tests::canonical_trace_deserializers_reject_bad_prefix_and_field_count
    agent::trace::tests::decision_trace_vocabulary_parses_every_canonical_token
    agent::trace::tests::every_blocker_category_serializes_and_round_trips

test result: FAILED. 452 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
