*** crates/tracewake-core/src/agent/trace.rs:178:13: delete match arm "no_applicable_method" in BlockerCode::parse

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ delete match arm "no_applicable_method" in BlockerCode::parse
@@ -170,17 +170,17 @@
             "knowledge" => Ok(Self::Knowledge),
             "resource" => Ok(Self::Resource),
             "social_norm_placeholder" => Ok(Self::SocialNormPlaceholder),
             "scheduling_reservation" => Ok(Self::SchedulingReservation),
             "unsupported_action" => Ok(Self::UnsupportedAction),
             "planner_budget_exhausted" => Ok(Self::PlannerBudgetExhausted),
             "fixture_authoring_error" => Ok(Self::FixtureAuthoringError),
             "no_applicable_candidate" => Ok(Self::NoApplicableCandidate),
-            "no_applicable_method" => Ok(Self::NoApplicableMethod),
+             /* ~ changed by cargo-mutants ~ */
             "empty_local_plan" => Ok(Self::EmptyLocalPlan),
             "local_plan_failed" => Ok(Self::LocalPlanFailed),
             "hidden_truth_input" => Ok(Self::HiddenTruthInput),
             "provenance_dangling" => Ok(Self::ProvenanceDangling),
             "provenance_class_mismatch" => Ok(Self::ProvenanceClassMismatch),
             "provenance_witness_mismatch" => Ok(Self::ProvenanceWitnessMismatch),
             _ => Err(DiagnosticFieldParseError::InvalidBlockerCode),
         }

---- agent::trace::tests::canonical_trace_deserializers_reject_bad_prefix_and_field_count stdout ----

thread 'agent::trace::tests::canonical_trace_deserializers_reject_bad_prefix_and_field_count' (5835) panicked at crates/tracewake-core/src/agent/trace.rs:1344:18:
called `Result::unwrap()` on an `Err` value: InvalidBlockerCode

---- agent::trace::tests::decision_trace_vocabulary_parses_every_canonical_token stdout ----

thread 'agent::trace::tests::decision_trace_vocabulary_parses_every_canonical_token' (5838) panicked at crates/tracewake-core/src/agent/trace.rs:1265:62:
called `Result::unwrap()` on an `Err` value: InvalidBlockerCode

failures:
    agent::trace::tests::canonical_trace_deserializers_reject_bad_prefix_and_field_count
    agent::trace::tests::decision_trace_vocabulary_parses_every_canonical_token

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
