*** crates/tracewake-core/src/agent/trace.rs:179:13: delete match arm "empty_local_plan" in BlockerCode::parse

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ delete match arm "empty_local_plan" in BlockerCode::parse
@@ -171,17 +171,17 @@
             "resource" => Ok(Self::Resource),
             "social_norm_placeholder" => Ok(Self::SocialNormPlaceholder),
             "scheduling_reservation" => Ok(Self::SchedulingReservation),
             "unsupported_action" => Ok(Self::UnsupportedAction),
             "planner_budget_exhausted" => Ok(Self::PlannerBudgetExhausted),
             "fixture_authoring_error" => Ok(Self::FixtureAuthoringError),
             "no_applicable_candidate" => Ok(Self::NoApplicableCandidate),
             "no_applicable_method" => Ok(Self::NoApplicableMethod),
-            "empty_local_plan" => Ok(Self::EmptyLocalPlan),
+             /* ~ changed by cargo-mutants ~ */
             "local_plan_failed" => Ok(Self::LocalPlanFailed),
             "hidden_truth_input" => Ok(Self::HiddenTruthInput),
             "provenance_dangling" => Ok(Self::ProvenanceDangling),
             "provenance_class_mismatch" => Ok(Self::ProvenanceClassMismatch),
             "provenance_witness_mismatch" => Ok(Self::ProvenanceWitnessMismatch),
             _ => Err(DiagnosticFieldParseError::InvalidBlockerCode),
         }
     }

---- agent::trace::tests::decision_trace_vocabulary_parses_every_canonical_token stdout ----

thread 'agent::trace::tests::decision_trace_vocabulary_parses_every_canonical_token' (10397) panicked at crates/tracewake-core/src/agent/trace.rs:1265:62:
called `Result::unwrap()` on an `Err` value: InvalidBlockerCode

---- projections::tests::no_human_metrics_helpers_use_typed_fields_and_player_terms stdout ----

thread 'projections::tests::no_human_metrics_helpers_use_typed_fields_and_player_terms' (10566) panicked at crates/tracewake-core/src/projections.rs:3007:9:
assertion failed: is_typed_planner_failure_event(&empty_plan)

failures:
    agent::trace::tests::decision_trace_vocabulary_parses_every_canonical_token
    projections::tests::no_human_metrics_helpers_use_typed_fields_and_player_terms

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
