*** crates/tracewake-core/src/agent/trace.rs:184:13: delete match arm "provenance_witness_mismatch" in BlockerCode::parse

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ delete match arm "provenance_witness_mismatch" in BlockerCode::parse
@@ -176,17 +176,17 @@
             "fixture_authoring_error" => Ok(Self::FixtureAuthoringError),
             "no_applicable_candidate" => Ok(Self::NoApplicableCandidate),
             "no_applicable_method" => Ok(Self::NoApplicableMethod),
             "empty_local_plan" => Ok(Self::EmptyLocalPlan),
             "local_plan_failed" => Ok(Self::LocalPlanFailed),
             "hidden_truth_input" => Ok(Self::HiddenTruthInput),
             "provenance_dangling" => Ok(Self::ProvenanceDangling),
             "provenance_class_mismatch" => Ok(Self::ProvenanceClassMismatch),
-            "provenance_witness_mismatch" => Ok(Self::ProvenanceWitnessMismatch),
+             /* ~ changed by cargo-mutants ~ */
             _ => Err(DiagnosticFieldParseError::InvalidBlockerCode),
         }
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq)]
 pub struct TypedDiagnosticFields {
     pub responsible_layer: ResponsibleLayer,

---- agent::trace::tests::decision_trace_vocabulary_parses_every_canonical_token stdout ----

thread 'agent::trace::tests::decision_trace_vocabulary_parses_every_canonical_token' (724) panicked at crates/tracewake-core/src/agent/trace.rs:1265:62:
called `Result::unwrap()` on an `Err` value: InvalidBlockerCode

failures:
    agent::trace::tests::decision_trace_vocabulary_parses_every_canonical_token

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
