*** crates/tracewake-core/src/agent/trace.rs:26:9: replace DecisionOutcome::stable_id -> &'static str with "xyzzy"

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ replace DecisionOutcome::stable_id -> &'static str with "xyzzy"
@@ -18,24 +18,17 @@
     Waited,
     Replanned,
     Failed,
     Completed,
 }
 
 impl DecisionOutcome {
     pub const fn stable_id(self) -> &'static str {
-        match self {
-            DecisionOutcome::Continued => "continued",
-            DecisionOutcome::Switched => "switched",
-            DecisionOutcome::Waited => "waited",
-            DecisionOutcome::Replanned => "replanned",
-            DecisionOutcome::Failed => "failed",
-            DecisionOutcome::Completed => "completed",
-        }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn parse(value: &str) -> Option<Self> {
         match value {
             "continued" => Some(Self::Continued),
             "switched" => Some(Self::Switched),
             "waited" => Some(Self::Waited),
             "replanned" => Some(Self::Replanned),

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (18994) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
