*** crates/tracewake-core/src/agent/trace.rs:296:17: delete ! in DecisionTraceRecord::from_trace

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ delete ! in DecisionTraceRecord::from_trace
@@ -288,17 +288,17 @@
             window_end_tick: trace.window_end_tick,
             outcome: trace.outcome,
             candidate_goal_count: trace.candidate_goals_considered.len(),
             actor_known_context_hash: Some(actor_known_context_hash),
             actor_known_inputs,
             hidden_truth_audit_result: trace.hidden_truth_audit_result.clone(),
             typed_diagnostic: TypedDiagnosticFields::from_decision_outcome(
                 trace.outcome,
-                !trace.hidden_truth_audit_result.actor_known_only,
+                 /* ~ changed by cargo-mutants ~ */trace.hidden_truth_audit_result.actor_known_only,
             ),
         }
     }
 
     pub fn serialize_canonical(&self) -> String {
         format!(
             "decision_trace_v1|{}|{}|{}|{}|{}|{}|{}|{}|{}|{}|{}|{}|{}|{}|{}|{}",
             self.trace_id.serialize_canonical(),

---- replay_rebuild_checksum_matches_original_after_no_human_day stdout ----

thread 'replay_rebuild_checksum_matches_original_after_no_human_day' (5728) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:1066:5:
assertion `left == right` failed
  left: Some("true")
 right: Some("false")

failures:
    replay_rebuild_checksum_matches_original_after_no_human_day

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
