*** crates/tracewake-core/src/agent/trace.rs:330:12: delete ! in DecisionTraceRecord::deserialize_canonical

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ delete ! in DecisionTraceRecord::deserialize_canonical
@@ -322,17 +322,17 @@
             encode_text_payload(&self.typed_diagnostic.remediation_hint)
         )
     }
 
     pub fn deserialize_canonical(value: &[u8]) -> Result<Self, DecisionTraceRecordParseError> {
         let value =
             std::str::from_utf8(value).map_err(|_| DecisionTraceRecordParseError::InvalidUtf8)?;
         let fields: Vec<_> = value.split('|').collect();
-        if !matches!(fields.len(), 9 | 11 | 15 | 17) || fields[0] != "decision_trace_v1" {
+        if  /* ~ changed by cargo-mutants ~ */matches!(fields.len(), 9 | 11 | 15 | 17) || fields[0] != "decision_trace_v1" {
             return Err(DecisionTraceRecordParseError::InvalidShape);
         }
         let (actor_known_context_hash, actor_known_inputs, audit_index, typed_index) =
             if matches!(fields.len(), 11 | 17) {
                 let actor_known_inputs = decode_text_payload(fields[8])?
                     .lines()
                     .filter(|line| !line.is_empty())
                     .map(ToString::to_string)

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (22398) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
