*** crates/tracewake-core/src/agent/trace.rs:330:54: replace || with && in DecisionTraceRecord::deserialize_canonical

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ replace || with && in DecisionTraceRecord::deserialize_canonical
@@ -322,17 +322,17 @@
             encode_text_payload(&self.typed_diagnostic.remediation_hint)
         )
     }
 
     pub fn deserialize_canonical(value: &[u8]) -> Result<Self, DecisionTraceRecordParseError> {
         let value =
             std::str::from_utf8(value).map_err(|_| DecisionTraceRecordParseError::InvalidUtf8)?;
         let fields: Vec<_> = value.split('|').collect();
-        if !matches!(fields.len(), 9 | 11 | 15 | 17) || fields[0] != "decision_trace_v1" {
+        if !matches!(fields.len(), 9 | 11 | 15 | 17) && /* ~ changed by cargo-mutants ~ */ fields[0] != "decision_trace_v1" {
             return Err(DecisionTraceRecordParseError::InvalidShape);
         }
         let (actor_known_context_hash, actor_known_inputs, audit_index, typed_index) =
             if matches!(fields.len(), 11 | 17) {
                 let actor_known_inputs = decode_text_payload(fields[8])?
                     .lines()
                     .filter(|line| !line.is_empty())
                     .map(ToString::to_string)

---- agent::trace::tests::canonical_trace_deserializers_reject_bad_prefix_and_field_count stdout ----

thread 'agent::trace::tests::canonical_trace_deserializers_reject_bad_prefix_and_field_count' (18105) panicked at crates/tracewake-core/src/agent/trace.rs:1350:9:
assertion failed: matches!(DecisionTraceRecord::deserialize_canonical(bad_prefix.as_bytes()),
    Err(DecisionTraceRecordParseError::InvalidShape))

failures:
    agent::trace::tests::canonical_trace_deserializers_reject_bad_prefix_and_field_count

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
