*** crates/tracewake-core/src/agent/trace.rs:337:36: delete ! in DecisionTraceRecord::deserialize_canonical

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ delete ! in DecisionTraceRecord::deserialize_canonical
@@ -329,17 +329,17 @@
         let fields: Vec<_> = value.split('|').collect();
         if !matches!(fields.len(), 9 | 11 | 15 | 17) || fields[0] != "decision_trace_v1" {
             return Err(DecisionTraceRecordParseError::InvalidShape);
         }
         let (actor_known_context_hash, actor_known_inputs, audit_index, typed_index) =
             if matches!(fields.len(), 11 | 17) {
                 let actor_known_inputs = decode_text_payload(fields[8])?
                     .lines()
-                    .filter(|line| !line.is_empty())
+                    .filter(|line|  /* ~ changed by cargo-mutants ~ */line.is_empty())
                     .map(ToString::to_string)
                     .collect::<Vec<_>>();
                 let actor_known_context_hash =
                     compute_holder_known_context_hash(actor_known_inputs.clone()).hash;
                 // This checks trace serialization integrity. Replay derivability from the event
                 // log is enforced by the replay context-hash rebuild gate.
                 if fields[7] != actor_known_context_hash.as_str() {
                     return Err(DecisionTraceRecordParseError::InvalidContextHash);

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (30460) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
