*** crates/tracewake-core/src/agent/trace.rs:344:30: replace != with == in DecisionTraceRecord::deserialize_canonical

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ replace != with == in DecisionTraceRecord::deserialize_canonical
@@ -336,17 +336,17 @@
                     .lines()
                     .filter(|line| !line.is_empty())
                     .map(ToString::to_string)
                     .collect::<Vec<_>>();
                 let actor_known_context_hash =
                     compute_holder_known_context_hash(actor_known_inputs.clone()).hash;
                 // This checks trace serialization integrity. Replay derivability from the event
                 // log is enforced by the replay context-hash rebuild gate.
-                if fields[7] != actor_known_context_hash.as_str() {
+                if fields[7] == /* ~ changed by cargo-mutants ~ */ actor_known_context_hash.as_str() {
                     return Err(DecisionTraceRecordParseError::InvalidContextHash);
                 }
                 (
                     Some(actor_known_context_hash),
                     actor_known_inputs,
                     9,
                     (fields.len() == 17).then_some(11),
                 )

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (2023) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
