*** crates/tracewake-core/src/agent/trace.rs:351:35: replace == with != in DecisionTraceRecord::deserialize_canonical

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ replace == with != in DecisionTraceRecord::deserialize_canonical
@@ -343,17 +343,17 @@
                 // log is enforced by the replay context-hash rebuild gate.
                 if fields[7] != actor_known_context_hash.as_str() {
                     return Err(DecisionTraceRecordParseError::InvalidContextHash);
                 }
                 (
                     Some(actor_known_context_hash),
                     actor_known_inputs,
                     9,
-                    (fields.len() == 17).then_some(11),
+                    (fields.len() != /* ~ changed by cargo-mutants ~ */ 17).then_some(11),
                 )
             } else {
                 (None, Vec::new(), 7, (fields.len() == 15).then_some(9))
             };
         let actor_known_only =
             decode_bool(fields[audit_index]).ok_or(DecisionTraceRecordParseError::InvalidBool)?;
         Ok(Self {
             trace_id: DecisionTraceId::new(fields[1])

---- legacy_decision_trace_without_typed_diagnostic_keys_rebuilds_with_defaults stdout ----

thread 'legacy_decision_trace_without_typed_diagnostic_keys_rebuilds_with_defaults' (6712) panicked at crates/tracewake-core/src/agent/trace.rs:385:70:
index out of bounds: the len is 11 but the index is 11

failures:
    legacy_decision_trace_without_typed_diagnostic_keys_rebuilds_with_defaults

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
