*** crates/tracewake-core/src/agent/trace.rs:354:53: replace == with != in DecisionTraceRecord::deserialize_canonical

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ replace == with != in DecisionTraceRecord::deserialize_canonical
@@ -346,17 +346,17 @@
                 }
                 (
                     Some(actor_known_context_hash),
                     actor_known_inputs,
                     9,
                     (fields.len() == 17).then_some(11),
                 )
             } else {
-                (None, Vec::new(), 7, (fields.len() == 15).then_some(9))
+                (None, Vec::new(), 7, (fields.len() != /* ~ changed by cargo-mutants ~ */ 15).then_some(9))
             };
         let actor_known_only =
             decode_bool(fields[audit_index]).ok_or(DecisionTraceRecordParseError::InvalidBool)?;
         Ok(Self {
             trace_id: DecisionTraceId::new(fields[1])
                 .map_err(DecisionTraceRecordParseError::InvalidId)?,
             actor_id: ActorId::new(fields[2]).map_err(DecisionTraceRecordParseError::InvalidId)?,
             window_start_tick: SimTick::new(

---- agent::trace::tests::legacy_decision_trace_record_keeps_absent_context_hash_typed_absent stdout ----

thread 'agent::trace::tests::legacy_decision_trace_record_keeps_absent_context_hash_typed_absent' (11028) panicked at crates/tracewake-core/src/agent/trace.rs:385:70:
index out of bounds: the len is 9 but the index is 9

---- events::apply::tests::agent_trace_and_stuck_diagnostic_events_record_canonical_payloads stdout ----

thread 'events::apply::tests::agent_trace_and_stuck_diagnostic_events_record_canonical_payloads' (11125) panicked at crates/tracewake-core/src/agent/trace.rs:385:70:
index out of bounds: the len is 9 but the index is 9

failures:
    agent::trace::tests::legacy_decision_trace_record_keeps_absent_context_hash_typed_absent
    events::apply::tests::agent_trace_and_stuck_diagnostic_events_record_canonical_payloads

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
