*** crates/tracewake-core/src/agent/trace.rs:37:9: replace DecisionOutcome::parse -> Option<Self> with None

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ replace DecisionOutcome::parse -> Option<Self> with None
@@ -29,25 +29,17 @@
             DecisionOutcome::Waited => "waited",
             DecisionOutcome::Replanned => "replanned",
             DecisionOutcome::Failed => "failed",
             DecisionOutcome::Completed => "completed",
         }
     }
 
     pub fn parse(value: &str) -> Option<Self> {
-        match value {
-            "continued" => Some(Self::Continued),
-            "switched" => Some(Self::Switched),
-            "waited" => Some(Self::Waited),
-            "replanned" => Some(Self::Replanned),
-            "failed" => Some(Self::Failed),
-            "completed" => Some(Self::Completed),
-            _ => None,
-        }
+        None /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq)]
 pub struct HiddenTruthAudit {
     pub actor_known_only: bool,
     pub notes: String,
 }

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (23025) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
