*** crates/tracewake-core/src/agent/trace.rs:381:63: replace + with - in DecisionTraceRecord::deserialize_canonical

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ replace + with - in DecisionTraceRecord::deserialize_canonical
@@ -373,17 +373,17 @@
                 .ok_or(DecisionTraceRecordParseError::InvalidOutcome)?,
             candidate_goal_count: fields[6]
                 .parse()
                 .map_err(|_| DecisionTraceRecordParseError::InvalidCount)?,
             actor_known_context_hash,
             actor_known_inputs,
             hidden_truth_audit_result: HiddenTruthAudit {
                 actor_known_only,
-                notes: decode_text_payload(fields[audit_index + 1])?,
+                notes: decode_text_payload(fields[audit_index - /* ~ changed by cargo-mutants ~ */ 1])?,
             },
             typed_diagnostic: if let Some(typed_index) = typed_index {
                 TypedDiagnosticFields {
                     responsible_layer: ResponsibleLayer::parse(fields[typed_index])?,
                     blocker_code: BlockerCode::parse(fields[typed_index + 1])?,
                     input_source: decode_text_payload(fields[typed_index + 2])?,
                     actual_source: decode_text_payload(fields[typed_index + 3])?,
                     hidden_truth_referenced: decode_bool(fields[typed_index + 4])

---- agent::trace::tests::legacy_decision_trace_record_keeps_absent_context_hash_typed_absent stdout ----

thread 'agent::trace::tests::legacy_decision_trace_record_keeps_absent_context_hash_typed_absent' (15587) panicked at crates/tracewake-core/src/agent/trace.rs:1134:84:
called `Result::unwrap()` on an `Err` value: InvalidTextPayload

---- events::apply::tests::agent_trace_and_stuck_diagnostic_events_record_canonical_payloads stdout ----

thread 'events::apply::tests::agent_trace_and_stuck_diagnostic_events_record_canonical_payloads' (15684) panicked at crates/tracewake-core/src/events/apply.rs:2216:9:
assertion `left == right` failed
  left: Err(BadPayload { key: "trace_canonical", value: "decision_trace_v1|trace_breakfast|actor_tomas|1|2|completed|0|true|74657374" })
 right: Ok(Applied)

failures:
    agent::trace::tests::legacy_decision_trace_record_keeps_absent_context_hash_typed_absent
    events::apply::tests::agent_trace_and_stuck_diagnostic_events_record_canonical_payloads

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
