*** crates/tracewake-core/src/agent/trace.rs:381:63: replace + with * in DecisionTraceRecord::deserialize_canonical

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ replace + with * in DecisionTraceRecord::deserialize_canonical
@@ -373,17 +373,17 @@
                 .ok_or(DecisionTraceRecordParseError::InvalidOutcome)?,
             candidate_goal_count: fields[6]
                 .parse()
                 .map_err(|_| DecisionTraceRecordParseError::InvalidCount)?,
             actor_known_context_hash,
             actor_known_inputs,
             hidden_truth_audit_result: HiddenTruthAudit {
                 actor_known_only,
-                notes: decode_text_payload(fields[audit_index + 1])?,
+                notes: decode_text_payload(fields[audit_index * /* ~ changed by cargo-mutants ~ */ 1])?,
             },
             typed_diagnostic: if let Some(typed_index) = typed_index {
                 TypedDiagnosticFields {
                     responsible_layer: ResponsibleLayer::parse(fields[typed_index])?,
                     blocker_code: BlockerCode::parse(fields[typed_index + 1])?,
                     input_source: decode_text_payload(fields[typed_index + 2])?,
                     actual_source: decode_text_payload(fields[typed_index + 3])?,
                     hidden_truth_referenced: decode_bool(fields[typed_index + 4])

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (19875) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
