*** crates/tracewake-core/src/agent/trace.rs:38:13: delete match arm "continued" in DecisionOutcome::parse

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ delete match arm "continued" in DecisionOutcome::parse
@@ -30,17 +30,17 @@
             DecisionOutcome::Replanned => "replanned",
             DecisionOutcome::Failed => "failed",
             DecisionOutcome::Completed => "completed",
         }
     }
 
     pub fn parse(value: &str) -> Option<Self> {
         match value {
-            "continued" => Some(Self::Continued),
+             /* ~ changed by cargo-mutants ~ */
             "switched" => Some(Self::Switched),
             "waited" => Some(Self::Waited),
             "replanned" => Some(Self::Replanned),
             "failed" => Some(Self::Failed),
             "completed" => Some(Self::Completed),
             _ => None,
         }
     }

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (27068) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
