*** crates/tracewake-core/src/agent/trace.rs:397:21: delete ! in DecisionTraceRecord::deserialize_canonical

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ delete ! in DecisionTraceRecord::deserialize_canonical
@@ -389,17 +389,17 @@
                     hidden_truth_referenced: decode_bool(fields[typed_index + 4])
                         .ok_or(DecisionTraceRecordParseError::InvalidBool)?,
                     remediation_hint: decode_text_payload(fields[typed_index + 5])?,
                 }
             } else {
                 TypedDiagnosticFields::from_decision_outcome(
                     DecisionOutcome::parse(fields[5])
                         .ok_or(DecisionTraceRecordParseError::InvalidOutcome)?,
-                    !actor_known_only,
+                     /* ~ changed by cargo-mutants ~ */actor_known_only,
                 )
             },
         })
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq)]
 pub enum DecisionTraceRecordParseError {

---- agent::trace::tests::legacy_decision_trace_record_keeps_absent_context_hash_typed_absent stdout ----

thread 'agent::trace::tests::legacy_decision_trace_record_keeps_absent_context_hash_typed_absent' (32020) panicked at crates/tracewake-core/src/agent/trace.rs:1154:9:
assertion failed: record.typed_diagnostic.hidden_truth_referenced

failures:
    agent::trace::tests::legacy_decision_trace_record_keeps_absent_context_hash_typed_absent

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
