*** crates/tracewake-core/src/agent/trace.rs:39:13: delete match arm "switched" in DecisionOutcome::parse

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ delete match arm "switched" in DecisionOutcome::parse
@@ -31,17 +31,17 @@
             DecisionOutcome::Failed => "failed",
             DecisionOutcome::Completed => "completed",
         }
     }
 
     pub fn parse(value: &str) -> Option<Self> {
         match value {
             "continued" => Some(Self::Continued),
-            "switched" => Some(Self::Switched),
+             /* ~ changed by cargo-mutants ~ */
             "waited" => Some(Self::Waited),
             "replanned" => Some(Self::Replanned),
             "failed" => Some(Self::Failed),
             "completed" => Some(Self::Completed),
             _ => None,
         }
     }
 }

---- no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash stdout ----

thread 'no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash' (31143) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:

---- episode_tamper_proration_poisons_replay stdout ----

thread 'episode_tamper_proration_poisons_replay' (31134) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (31142) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:

failures:
    episode_tamper_proration_poisons_replay
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash
    no_human_decision_context_hash_gate_fails_when_source_evidence_tampered
    no_human_need_ledger_has_no_duplicate_regime_charges
    sleep_spanning_window_boundary_charges_each_tick_once

test result: FAILED. 35 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
