*** crates/tracewake-core/src/agent/trace.rs:40:13: delete match arm "waited" in DecisionOutcome::parse

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ delete match arm "waited" in DecisionOutcome::parse
@@ -32,17 +32,17 @@
             DecisionOutcome::Completed => "completed",
         }
     }
 
     pub fn parse(value: &str) -> Option<Self> {
         match value {
             "continued" => Some(Self::Continued),
             "switched" => Some(Self::Switched),
-            "waited" => Some(Self::Waited),
+             /* ~ changed by cargo-mutants ~ */
             "replanned" => Some(Self::Replanned),
             "failed" => Some(Self::Failed),
             "completed" => Some(Self::Completed),
             _ => None,
         }
     }
 }

---- agent::trace::tests::decision_trace_vocabulary_parses_every_canonical_token stdout ----

thread 'agent::trace::tests::decision_trace_vocabulary_parses_every_canonical_token' (2999) panicked at crates/tracewake-core/src/agent/trace.rs:1231:13:
assertion `left == right` failed
  left: None
 right: Some(Waited)

---- agent::trace::tests::canonical_trace_deserializers_reject_bad_prefix_and_field_count stdout ----

thread 'agent::trace::tests::canonical_trace_deserializers_reject_bad_prefix_and_field_count' (2996) panicked at crates/tracewake-core/src/agent/trace.rs:1344:18:
called `Result::unwrap()` on an `Err` value: InvalidOutcome

failures:
    agent::trace::tests::canonical_trace_deserializers_reject_bad_prefix_and_field_count
    agent::trace::tests::decision_trace_vocabulary_parses_every_canonical_token

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
