*** crates/tracewake-core/src/agent/trace.rs:41:13: delete match arm "replanned" in DecisionOutcome::parse

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ delete match arm "replanned" in DecisionOutcome::parse
@@ -33,17 +33,17 @@
         }
     }
 
     pub fn parse(value: &str) -> Option<Self> {
         match value {
             "continued" => Some(Self::Continued),
             "switched" => Some(Self::Switched),
             "waited" => Some(Self::Waited),
-            "replanned" => Some(Self::Replanned),
+             /* ~ changed by cargo-mutants ~ */
             "failed" => Some(Self::Failed),
             "completed" => Some(Self::Completed),
             _ => None,
         }
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq)]

---- agent::trace::tests::decision_trace_vocabulary_parses_every_canonical_token stdout ----

thread 'agent::trace::tests::decision_trace_vocabulary_parses_every_canonical_token' (7559) panicked at crates/tracewake-core/src/agent/trace.rs:1231:13:
assertion `left == right` failed
  left: None
 right: Some(Replanned)

failures:
    agent::trace::tests::decision_trace_vocabulary_parses_every_canonical_token

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
