*** crates/tracewake-core/src/agent/trace.rs:42:13: delete match arm "failed" in DecisionOutcome::parse

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ delete match arm "failed" in DecisionOutcome::parse
@@ -34,17 +34,17 @@
     }
 
     pub fn parse(value: &str) -> Option<Self> {
         match value {
             "continued" => Some(Self::Continued),
             "switched" => Some(Self::Switched),
             "waited" => Some(Self::Waited),
             "replanned" => Some(Self::Replanned),
-            "failed" => Some(Self::Failed),
+             /* ~ changed by cargo-mutants ~ */
             "completed" => Some(Self::Completed),
             _ => None,
         }
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq)]
 pub struct HiddenTruthAudit {

---- agent::trace::tests::decision_trace_vocabulary_parses_every_canonical_token stdout ----

thread 'agent::trace::tests::decision_trace_vocabulary_parses_every_canonical_token' (12118) panicked at crates/tracewake-core/src/agent/trace.rs:1231:13:
assertion `left == right` failed
  left: None
 right: Some(Failed)

---- agent::trace::tests::legacy_decision_trace_record_keeps_absent_context_hash_typed_absent stdout ----

thread 'agent::trace::tests::legacy_decision_trace_record_keeps_absent_context_hash_typed_absent' (12120) panicked at crates/tracewake-core/src/agent/trace.rs:1134:84:
called `Result::unwrap()` on an `Err` value: InvalidOutcome

failures:
    agent::trace::tests::decision_trace_vocabulary_parses_every_canonical_token
    agent::trace::tests::legacy_decision_trace_record_keeps_absent_context_hash_typed_absent

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
