*** crates/tracewake-core/src/agent/trace.rs:431:13: delete match arm StuckDiagnosticParseError::InvalidTextPayload | StuckDiagnosticParseError::InvalidUtf8 in <impl From<StuckDiagnosticParseError> for DecisionTraceRecordParseError>::from

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ delete match arm StuckDiagnosticParseError::InvalidTextPayload | StuckDiagnosticParseError::InvalidUtf8 in <impl From<StuckDiagnosticParseError> for DecisionTraceRecordParseError>::from
@@ -423,18 +423,17 @@
             DiagnosticFieldParseError::InvalidBlockerCode => Self::InvalidBlockerCode,
         }
     }
 }
 
 impl From<StuckDiagnosticParseError> for DecisionTraceRecordParseError {
     fn from(value: StuckDiagnosticParseError) -> Self {
         match value {
-            StuckDiagnosticParseError::InvalidTextPayload
-            | StuckDiagnosticParseError::InvalidUtf8 => Self::InvalidTextPayload,
+             /* ~ changed by cargo-mutants ~ */
             _ => Self::InvalidShape,
         }
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq)]
 pub struct RejectedDecisionItem {
     pub stable_ref: String,

---- agent::trace::tests::stuck_parse_errors_map_and_display_as_typed_failures stdout ----

thread 'agent::trace::tests::stuck_parse_errors_map_and_display_as_typed_failures' (4138) panicked at crates/tracewake-core/src/agent/trace.rs:1407:9:
assertion `left == right` failed
  left: InvalidShape
 right: InvalidTextPayload

failures:
    agent::trace::tests::stuck_parse_errors_map_and_display_as_typed_failures

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
