*** crates/tracewake-core/src/agent/trace.rs:43:13: delete match arm "completed" in DecisionOutcome::parse

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ delete match arm "completed" in DecisionOutcome::parse
@@ -35,17 +35,17 @@
 
     pub fn parse(value: &str) -> Option<Self> {
         match value {
             "continued" => Some(Self::Continued),
             "switched" => Some(Self::Switched),
             "waited" => Some(Self::Waited),
             "replanned" => Some(Self::Replanned),
             "failed" => Some(Self::Failed),
-            "completed" => Some(Self::Completed),
+             /* ~ changed by cargo-mutants ~ */
             _ => None,
         }
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq)]
 pub struct HiddenTruthAudit {
     pub actor_known_only: bool,

---- agent::trace::tests::decision_trace_vocabulary_parses_every_canonical_token stdout ----

thread 'agent::trace::tests::decision_trace_vocabulary_parses_every_canonical_token' (16677) panicked at crates/tracewake-core/src/agent/trace.rs:1231:13:
assertion `left == right` failed
  left: None
 right: Some(Completed)

---- events::apply::tests::agent_trace_and_stuck_diagnostic_events_record_canonical_payloads stdout ----

thread 'events::apply::tests::agent_trace_and_stuck_diagnostic_events_record_canonical_payloads' (16776) panicked at crates/tracewake-core/src/events/apply.rs:2216:9:
assertion `left == right` failed
  left: Err(BadPayload { key: "trace_canonical", value: "decision_trace_v1|trace_breakfast|actor_tomas|1|2|completed|0|true|74657374" })
 right: Ok(Applied)

failures:
    agent::trace::tests::decision_trace_vocabulary_parses_every_canonical_token
    events::apply::tests::agent_trace_and_stuck_diagnostic_events_record_canonical_payloads

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
