*** crates/tracewake-core/src/agent/trace.rs:517:9: replace DecisionTrace::render_summary -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ replace DecisionTrace::render_summary -> String with "xyzzy".into()
@@ -509,24 +509,17 @@
             fallback_considered,
             hidden_truth_audit_result,
             outcome,
             debug_only_details: debug_only_details.into(),
         }
     }
 
     pub fn render_summary(&self) -> String {
-        format!(
-            "trace={} actor={} outcome={} candidates={} actor_known_only={}",
-            self.trace_id.serialize_canonical(),
-            self.actor_id.serialize_canonical(),
-            self.outcome.stable_id(),
-            self.candidate_goals_considered.len(),
-            self.hidden_truth_audit_result.actor_known_only
-        )
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn serialize_canonical(&self) -> String {
         format!(
             "decision_trace_v1|{}|{}|{}|{}|{}|{}|{}|{}",
             self.trace_id.serialize_canonical(),
             self.actor_id.serialize_canonical(),
             self.window_start_tick.value(),

---- agent::trace::tests::decision_trace_exposes_food_failure_fields stdout ----

thread 'agent::trace::tests::decision_trace_exposes_food_failure_fields' (13250) panicked at crates/tracewake-core/src/agent/trace.rs:1062:9:
assertion failed: trace.render_summary().contains("outcome=failed")

failures:
    agent::trace::tests::decision_trace_exposes_food_failure_fields

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
