*** crates/tracewake-core/src/agent/trace.rs:528:9: replace DecisionTrace::serialize_canonical -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ replace DecisionTrace::serialize_canonical -> String with "xyzzy".into()
@@ -520,27 +520,17 @@
             self.actor_id.serialize_canonical(),
             self.outcome.stable_id(),
             self.candidate_goals_considered.len(),
             self.hidden_truth_audit_result.actor_known_only
         )
     }
 
     pub fn serialize_canonical(&self) -> String {
-        format!(
-            "decision_trace_v1|{}|{}|{}|{}|{}|{}|{}|{}",
-            self.trace_id.serialize_canonical(),
-            self.actor_id.serialize_canonical(),
-            self.window_start_tick.value(),
-            self.window_end_tick.value(),
-            self.outcome.stable_id(),
-            self.candidate_goals_considered.len(),
-            encode_bool(self.hidden_truth_audit_result.actor_known_only),
-            encode_text_payload(&self.hidden_truth_audit_result.notes)
-        )
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Copy, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
 pub enum BlockerCategory {
     Physical,
     Access,
     Knowledge,

---- agent::trace::tests::decision_trace_exposes_food_failure_fields stdout ----

thread 'agent::trace::tests::decision_trace_exposes_food_failure_fields' (22368) panicked at crates/tracewake-core/src/agent/trace.rs:1060:9:
assertion failed: trace.serialize_canonical().starts_with("decision_trace_v1|")

failures:
    agent::trace::tests::decision_trace_exposes_food_failure_fields

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
