*** crates/tracewake-core/src/agent/trace.rs:569:9: replace BlockerCategory::stable_id -> &'static str with "xyzzy"

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ replace BlockerCategory::stable_id -> &'static str with "xyzzy"
@@ -561,27 +561,17 @@
         Self::SocialNormPlaceholder,
         Self::SchedulingReservation,
         Self::UnsupportedAction,
         Self::PlannerBudgetExhausted,
         Self::FixtureAuthoringError,
     ];
 
     pub const fn stable_id(self) -> &'static str {
-        match self {
-            BlockerCategory::Physical => "physical",
-            BlockerCategory::Access => "access",
-            BlockerCategory::Knowledge => "knowledge",
-            BlockerCategory::Resource => "resource",
-            BlockerCategory::SocialNormPlaceholder => "social_norm_placeholder",
-            BlockerCategory::SchedulingReservation => "scheduling_reservation",
-            BlockerCategory::UnsupportedAction => "unsupported_action",
-            BlockerCategory::PlannerBudgetExhausted => "planner_budget_exhausted",
-            BlockerCategory::FixtureAuthoringError => "fixture_authoring_error",
-        }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     fn parse(value: &str) -> Result<Self, StuckDiagnosticParseError> {
         match value {
             "physical" => Ok(Self::Physical),
             "access" => Ok(Self::Access),
             "knowledge" => Ok(Self::Knowledge),
             "resource" => Ok(Self::Resource),

---- no_human_sleep_knowledge_requires_observation_or_record_channel stdout ----

thread 'no_human_sleep_knowledge_requires_observation_or_record_channel' (30806) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:3036:5:
assertion failed: !report.stuck_diagnostic_event_ids.is_empty()

---- no_human_workplace_knowledge_requires_notice_channel stdout ----

thread 'no_human_workplace_knowledge_requires_notice_channel' (30807) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:3001:5:
assertion failed: !report.stuck_diagnostic_event_ids.is_empty()

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (30802) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2715:5:
assertion `left == right` failed
  left: PhysicalChecksum("twc1-301be54dfb7dfb00")
 right: PhysicalChecksum("twc1-68ee74360d03d456")

failures:
    no_human_day_real_run_replays_metrics_and_trace_projection
    no_human_sleep_knowledge_requires_observation_or_record_channel
    no_human_workplace_knowledge_requires_notice_channel

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.44s

*** result: Failure(101)
