*** crates/tracewake-core/src/agent/trace.rs:586:13: delete match arm "knowledge" in BlockerCategory::parse

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ delete match arm "knowledge" in BlockerCategory::parse
@@ -578,17 +578,17 @@
             BlockerCategory::FixtureAuthoringError => "fixture_authoring_error",
         }
     }
 
     fn parse(value: &str) -> Result<Self, StuckDiagnosticParseError> {
         match value {
             "physical" => Ok(Self::Physical),
             "access" => Ok(Self::Access),
-            "knowledge" => Ok(Self::Knowledge),
+             /* ~ changed by cargo-mutants ~ */
             "resource" => Ok(Self::Resource),
             "social_norm_placeholder" => Ok(Self::SocialNormPlaceholder),
             "scheduling_reservation" => Ok(Self::SchedulingReservation),
             "unsupported_action" => Ok(Self::UnsupportedAction),
             "planner_budget_exhausted" => Ok(Self::PlannerBudgetExhausted),
             "fixture_authoring_error" => Ok(Self::FixtureAuthoringError),
             _ => Err(StuckDiagnosticParseError::InvalidBlockerCategory),
         }

---- agent::trace::tests::every_blocker_category_serializes_and_round_trips stdout ----

thread 'agent::trace::tests::every_blocker_category_serializes_and_round_trips' (11791) panicked at crates/tracewake-core/src/agent/trace.rs:1183:80:
called `Result::unwrap()` on an `Err` value: InvalidBlockerCategory

---- agent::trace::tests::stuck_diagnostic_vocabulary_parses_every_canonical_token stdout ----

thread 'agent::trace::tests::stuck_diagnostic_vocabulary_parses_every_canonical_token' (11794) panicked at crates/tracewake-core/src/agent/trace.rs:1279:62:
called `Result::unwrap()` on an `Err` value: InvalidBlockerCategory

failures:
    agent::trace::tests::every_blocker_category_serializes_and_round_trips
    agent::trace::tests::stuck_diagnostic_vocabulary_parses_every_canonical_token

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
