*** crates/tracewake-core/src/agent/trace.rs:587:13: delete match arm "resource" in BlockerCategory::parse

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ delete match arm "resource" in BlockerCategory::parse
@@ -579,17 +579,17 @@
         }
     }
 
     fn parse(value: &str) -> Result<Self, StuckDiagnosticParseError> {
         match value {
             "physical" => Ok(Self::Physical),
             "access" => Ok(Self::Access),
             "knowledge" => Ok(Self::Knowledge),
-            "resource" => Ok(Self::Resource),
+             /* ~ changed by cargo-mutants ~ */
             "social_norm_placeholder" => Ok(Self::SocialNormPlaceholder),
             "scheduling_reservation" => Ok(Self::SchedulingReservation),
             "unsupported_action" => Ok(Self::UnsupportedAction),
             "planner_budget_exhausted" => Ok(Self::PlannerBudgetExhausted),
             "fixture_authoring_error" => Ok(Self::FixtureAuthoringError),
             _ => Err(StuckDiagnosticParseError::InvalidBlockerCategory),
         }
     }

---- agent::trace::tests::stuck_diagnostic_vocabulary_parses_every_canonical_token stdout ----

thread 'agent::trace::tests::stuck_diagnostic_vocabulary_parses_every_canonical_token' (16353) panicked at crates/tracewake-core/src/agent/trace.rs:1279:62:
called `Result::unwrap()` on an `Err` value: InvalidBlockerCategory

---- agent::trace::tests::every_blocker_category_serializes_and_round_trips stdout ----

thread 'agent::trace::tests::every_blocker_category_serializes_and_round_trips' (16350) panicked at crates/tracewake-core/src/agent/trace.rs:1183:80:
called `Result::unwrap()` on an `Err` value: InvalidBlockerCategory

---- events::apply::tests::agent_trace_and_stuck_diagnostic_events_record_canonical_payloads stdout ----

thread 'events::apply::tests::agent_trace_and_stuck_diagnostic_events_record_canonical_payloads' (16448) panicked at crates/tracewake-core/src/events/apply.rs:2220:9:
assertion `left == right` failed
  left: Err(BadPayload { key: "diagnostic_canonical", value: "stuck_diagnostic_v1|stuck_food_missing|actor_tomas|1|2|-|-|-|-|-|-|-|resource|666f6f64|6163746f725f6b6e6f776e|6465627567|7265747279|replanning" })
 right: Ok(Applied)

failures:
    agent::trace::tests::every_blocker_category_serializes_and_round_trips
    agent::trace::tests::stuck_diagnostic_vocabulary_parses_every_canonical_token
    events::apply::tests::agent_trace_and_stuck_diagnostic_events_record_canonical_payloads

test result: FAILED. 452 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
