*** crates/tracewake-core/src/agent/trace.rs:624:9: replace StuckResultingStatus::stable_id -> &'static str with "xyzzy"

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ replace StuckResultingStatus::stable_id -> &'static str with "xyzzy"
@@ -616,24 +616,17 @@
     Replanning,
     Failed,
     Suspended,
     Completed,
 }
 
 impl StuckResultingStatus {
     pub const fn stable_id(self) -> &'static str {
-        match self {
-            StuckResultingStatus::Idle => "idle",
-            StuckResultingStatus::Waiting => "waiting",
-            StuckResultingStatus::Replanning => "replanning",
-            StuckResultingStatus::Failed => "failed",
-            StuckResultingStatus::Suspended => "suspended",
-            StuckResultingStatus::Completed => "completed",
-        }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     fn parse(value: &str) -> Result<Self, StuckDiagnosticParseError> {
         match value {
             "idle" => Ok(Self::Idle),
             "waiting" => Ok(Self::Waiting),
             "replanning" => Ok(Self::Replanning),
             "failed" => Ok(Self::Failed),

---- no_human_sleep_knowledge_requires_observation_or_record_channel stdout ----

thread 'no_human_sleep_knowledge_requires_observation_or_record_channel' (14665) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:3036:5:
assertion failed: !report.stuck_diagnostic_event_ids.is_empty()

---- no_human_workplace_knowledge_requires_notice_channel stdout ----

thread 'no_human_workplace_knowledge_requires_notice_channel' (14666) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:3001:5:
assertion failed: !report.stuck_diagnostic_event_ids.is_empty()

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (14661) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2715:5:
assertion `left == right` failed
  left: PhysicalChecksum("twc1-301be54dfb7dfb00")
 right: PhysicalChecksum("twc1-68ee74360d03d456")

failures:
    no_human_day_real_run_replays_metrics_and_trace_projection
    no_human_sleep_knowledge_requires_observation_or_record_channel
    no_human_workplace_knowledge_requires_notice_channel

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.47s

*** result: Failure(101)
