*** crates/tracewake-core/src/agent/trace.rs:636:13: delete match arm "idle" in StuckResultingStatus::parse

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ delete match arm "idle" in StuckResultingStatus::parse
@@ -628,17 +628,17 @@
             StuckResultingStatus::Failed => "failed",
             StuckResultingStatus::Suspended => "suspended",
             StuckResultingStatus::Completed => "completed",
         }
     }
 
     fn parse(value: &str) -> Result<Self, StuckDiagnosticParseError> {
         match value {
-            "idle" => Ok(Self::Idle),
+             /* ~ changed by cargo-mutants ~ */
             "waiting" => Ok(Self::Waiting),
             "replanning" => Ok(Self::Replanning),
             "failed" => Ok(Self::Failed),
             "suspended" => Ok(Self::Suspended),
             "completed" => Ok(Self::Completed),
             _ => Err(StuckDiagnosticParseError::InvalidResultingStatus),
         }
     }

---- no_human_sleep_knowledge_requires_observation_or_record_channel stdout ----

thread 'no_human_sleep_knowledge_requires_observation_or_record_channel' (18776) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:3036:5:
assertion failed: !report.stuck_diagnostic_event_ids.is_empty()

---- no_human_workplace_knowledge_requires_notice_channel stdout ----

thread 'no_human_workplace_knowledge_requires_notice_channel' (18777) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:3001:5:
assertion failed: !report.stuck_diagnostic_event_ids.is_empty()

failures:
    no_human_sleep_knowledge_requires_observation_or_record_channel
    no_human_workplace_knowledge_requires_notice_channel

test result: FAILED. 40 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.60s

*** result: Failure(101)
