*** crates/tracewake-core/src/agent/trace.rs:637:13: delete match arm "waiting" in StuckResultingStatus::parse

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ delete match arm "waiting" in StuckResultingStatus::parse
@@ -629,17 +629,17 @@
             StuckResultingStatus::Suspended => "suspended",
             StuckResultingStatus::Completed => "completed",
         }
     }
 
     fn parse(value: &str) -> Result<Self, StuckDiagnosticParseError> {
         match value {
             "idle" => Ok(Self::Idle),
-            "waiting" => Ok(Self::Waiting),
+             /* ~ changed by cargo-mutants ~ */
             "replanning" => Ok(Self::Replanning),
             "failed" => Ok(Self::Failed),
             "suspended" => Ok(Self::Suspended),
             "completed" => Ok(Self::Completed),
             _ => Err(StuckDiagnosticParseError::InvalidResultingStatus),
         }
     }
 }

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (22871) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2715:5:
assertion `left == right` failed
  left: PhysicalChecksum("twc1-301be54dfb7dfb00")
 right: PhysicalChecksum("twc1-68ee74360d03d456")

failures:
    no_human_day_real_run_replays_metrics_and_trace_projection

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.45s

*** result: Failure(101)
