*** crates/tracewake-core/src/agent/trace.rs:638:13: delete match arm "replanning" in StuckResultingStatus::parse

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ delete match arm "replanning" in StuckResultingStatus::parse
@@ -630,17 +630,17 @@
             StuckResultingStatus::Completed => "completed",
         }
     }
 
     fn parse(value: &str) -> Result<Self, StuckDiagnosticParseError> {
         match value {
             "idle" => Ok(Self::Idle),
             "waiting" => Ok(Self::Waiting),
-            "replanning" => Ok(Self::Replanning),
+             /* ~ changed by cargo-mutants ~ */
             "failed" => Ok(Self::Failed),
             "suspended" => Ok(Self::Suspended),
             "completed" => Ok(Self::Completed),
             _ => Err(StuckDiagnosticParseError::InvalidResultingStatus),
         }
     }
 }

---- agent::trace::tests::stuck_diagnostic_vocabulary_parses_every_canonical_token stdout ----

thread 'agent::trace::tests::stuck_diagnostic_vocabulary_parses_every_canonical_token' (27200) panicked at crates/tracewake-core/src/agent/trace.rs:1298:65:
called `Result::unwrap()` on an `Err` value: InvalidResultingStatus

---- events::apply::tests::agent_trace_and_stuck_diagnostic_events_record_canonical_payloads stdout ----

thread 'events::apply::tests::agent_trace_and_stuck_diagnostic_events_record_canonical_payloads' (27295) panicked at crates/tracewake-core/src/events/apply.rs:2220:9:
assertion `left == right` failed
  left: Err(BadPayload { key: "diagnostic_canonical", value: "stuck_diagnostic_v1|stuck_food_missing|actor_tomas|1|2|-|-|-|-|-|-|-|resource|666f6f64|6163746f725f6b6e6f776e|6465627567|7265747279|replanning" })
 right: Ok(Applied)

failures:
    agent::trace::tests::stuck_diagnostic_vocabulary_parses_every_canonical_token
    events::apply::tests::agent_trace_and_stuck_diagnostic_events_record_canonical_payloads

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
