*** crates/tracewake-core/src/agent/trace.rs:639:13: delete match arm "failed" in StuckResultingStatus::parse

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ delete match arm "failed" in StuckResultingStatus::parse
@@ -631,17 +631,17 @@
         }
     }
 
     fn parse(value: &str) -> Result<Self, StuckDiagnosticParseError> {
         match value {
             "idle" => Ok(Self::Idle),
             "waiting" => Ok(Self::Waiting),
             "replanning" => Ok(Self::Replanning),
-            "failed" => Ok(Self::Failed),
+             /* ~ changed by cargo-mutants ~ */
             "suspended" => Ok(Self::Suspended),
             "completed" => Ok(Self::Completed),
             _ => Err(StuckDiagnosticParseError::InvalidResultingStatus),
         }
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq)]

---- agent::trace::tests::every_blocker_category_serializes_and_round_trips stdout ----

thread 'agent::trace::tests::every_blocker_category_serializes_and_round_trips' (31756) panicked at crates/tracewake-core/src/agent/trace.rs:1183:80:
called `Result::unwrap()` on an `Err` value: InvalidResultingStatus

---- agent::trace::tests::stuck_diagnostic_vocabulary_parses_every_canonical_token stdout ----

thread 'agent::trace::tests::stuck_diagnostic_vocabulary_parses_every_canonical_token' (31759) panicked at crates/tracewake-core/src/agent/trace.rs:1298:65:
called `Result::unwrap()` on an `Err` value: InvalidResultingStatus

failures:
    agent::trace::tests::every_blocker_category_serializes_and_round_trips
    agent::trace::tests::stuck_diagnostic_vocabulary_parses_every_canonical_token

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
