*** crates/tracewake-core/src/agent/trace.rs:640:13: delete match arm "suspended" in StuckResultingStatus::parse

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ delete match arm "suspended" in StuckResultingStatus::parse
@@ -632,17 +632,17 @@
     }
 
     fn parse(value: &str) -> Result<Self, StuckDiagnosticParseError> {
         match value {
             "idle" => Ok(Self::Idle),
             "waiting" => Ok(Self::Waiting),
             "replanning" => Ok(Self::Replanning),
             "failed" => Ok(Self::Failed),
-            "suspended" => Ok(Self::Suspended),
+             /* ~ changed by cargo-mutants ~ */
             "completed" => Ok(Self::Completed),
             _ => Err(StuckDiagnosticParseError::InvalidResultingStatus),
         }
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq)]
 pub struct StuckDiagnostic {

---- agent::trace::tests::canonical_trace_deserializers_reject_bad_prefix_and_field_count stdout ----

thread 'agent::trace::tests::canonical_trace_deserializers_reject_bad_prefix_and_field_count' (3843) panicked at crates/tracewake-core/src/agent/trace.rs:1390:18:
called `Result::unwrap()` on an `Err` value: InvalidResultingStatus

---- agent::trace::tests::stuck_diagnostic_vocabulary_parses_every_canonical_token stdout ----

thread 'agent::trace::tests::stuck_diagnostic_vocabulary_parses_every_canonical_token' (3850) panicked at crates/tracewake-core/src/agent/trace.rs:1298:65:
called `Result::unwrap()` on an `Err` value: InvalidResultingStatus

failures:
    agent::trace::tests::canonical_trace_deserializers_reject_bad_prefix_and_field_count
    agent::trace::tests::stuck_diagnostic_vocabulary_parses_every_canonical_token

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
