*** crates/tracewake-core/src/agent/trace.rs:641:13: delete match arm "completed" in StuckResultingStatus::parse

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ delete match arm "completed" in StuckResultingStatus::parse
@@ -633,17 +633,17 @@
 
     fn parse(value: &str) -> Result<Self, StuckDiagnosticParseError> {
         match value {
             "idle" => Ok(Self::Idle),
             "waiting" => Ok(Self::Waiting),
             "replanning" => Ok(Self::Replanning),
             "failed" => Ok(Self::Failed),
             "suspended" => Ok(Self::Suspended),
-            "completed" => Ok(Self::Completed),
+             /* ~ changed by cargo-mutants ~ */
             _ => Err(StuckDiagnosticParseError::InvalidResultingStatus),
         }
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq)]
 pub struct StuckDiagnostic {
     pub diagnostic_id: StuckDiagnosticId,

---- agent::trace::tests::stuck_diagnostic_vocabulary_parses_every_canonical_token stdout ----

thread 'agent::trace::tests::stuck_diagnostic_vocabulary_parses_every_canonical_token' (8410) panicked at crates/tracewake-core/src/agent/trace.rs:1298:65:
called `Result::unwrap()` on an `Err` value: InvalidResultingStatus

failures:
    agent::trace::tests::stuck_diagnostic_vocabulary_parses_every_canonical_token

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
