*** crates/tracewake-core/src/agent/trace.rs:727:9: replace StuckDiagnostic::serialize_canonical -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ replace StuckDiagnostic::serialize_canonical -> String with "xyzzy".into()
@@ -719,55 +719,17 @@
     }
 
     pub fn with_typed_diagnostic(mut self, typed_diagnostic: TypedDiagnosticFields) -> Self {
         self.typed_diagnostic = typed_diagnostic;
         self
     }
 
     pub fn serialize_canonical(&self) -> String {
-        format!(
-            "stuck_diagnostic_v1|{}|{}|{}|{}|{}|{}|{}|{}|{}|{}|{}|{}|{}|{}|{}|{}|{}|{}|{}|{}|{}|{}|{}",
-            self.diagnostic_id.serialize_canonical(),
-            self.actor_id.serialize_canonical(),
-            self.window_start_tick.value(),
-            self.window_end_tick.value(),
-            encode_opt_need(self.active_need),
-            encode_opt_id(self.active_goal_id.as_ref().map(CandidateGoalId::as_str)),
-            encode_opt_id(self.active_intention_id.as_ref().map(IntentionId::as_str)),
-            encode_opt_id(
-                self.routine_template_id
-                    .as_ref()
-                    .map(RoutineTemplateId::as_str)
-            ),
-            encode_opt_id(
-                self.routine_execution_id
-                    .as_ref()
-                    .map(RoutineExecutionId::as_str)
-            ),
-            encode_opt_text(
-                self.routine_step
-                    .as_ref()
-                    .map(RoutineStep::serialize_canonical)
-                    .as_deref()
-            ),
-            encode_opt_id(self.attempted_action.as_ref().map(SemanticActionId::as_str)),
-            self.blocker_category.stable_id(),
-            encode_text_payload(&self.concrete_blocker),
-            encode_text_payload(&self.actor_known_explanation),
-            encode_text_payload(&self.debug_only_details),
-            encode_text_payload(&self.retry_abandon_fallback_outcome),
-            self.resulting_status.stable_id(),
-            self.typed_diagnostic.responsible_layer.stable_id(),
-            self.typed_diagnostic.blocker_code.stable_id(),
-            encode_text_payload(&self.typed_diagnostic.input_source),
-            encode_text_payload(&self.typed_diagnostic.actual_source),
-            encode_bool(self.typed_diagnostic.hidden_truth_referenced),
-            encode_text_payload(&self.typed_diagnostic.remediation_hint),
-        )
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn serialize_canonical_bytes(&self) -> Vec<u8> {
         self.serialize_canonical().into_bytes()
     }
 
     pub fn deserialize_canonical(value: &[u8]) -> Result<Self, StuckDiagnosticParseError> {
         let value =

---- no_human_workplace_knowledge_requires_notice_channel stdout ----

thread 'no_human_workplace_knowledge_requires_notice_channel' (16855) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:3001:5:
assertion failed: !report.stuck_diagnostic_event_ids.is_empty()

---- no_human_sleep_knowledge_requires_observation_or_record_channel stdout ----

thread 'no_human_sleep_knowledge_requires_observation_or_record_channel' (16854) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:3036:5:
assertion failed: !report.stuck_diagnostic_event_ids.is_empty()

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (16850) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2715:5:
assertion `left == right` failed
  left: PhysicalChecksum("twc1-301be54dfb7dfb00")
 right: PhysicalChecksum("twc1-68ee74360d03d456")

failures:
    no_human_day_real_run_replays_metrics_and_trace_projection
    no_human_sleep_knowledge_requires_observation_or_record_channel
    no_human_workplace_knowledge_requires_notice_channel

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.42s

*** result: Failure(101)
