*** crates/tracewake-core/src/agent/trace.rs:776:12: delete ! in StuckDiagnostic::deserialize_canonical

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ delete ! in StuckDiagnostic::deserialize_canonical
@@ -768,17 +768,17 @@
     pub fn serialize_canonical_bytes(&self) -> Vec<u8> {
         self.serialize_canonical().into_bytes()
     }
 
     pub fn deserialize_canonical(value: &[u8]) -> Result<Self, StuckDiagnosticParseError> {
         let value =
             std::str::from_utf8(value).map_err(|_| StuckDiagnosticParseError::InvalidUtf8)?;
         let fields: Vec<_> = value.split('|').collect();
-        if !matches!(fields.len(), 18 | 24) || fields[0] != "stuck_diagnostic_v1" {
+        if  /* ~ changed by cargo-mutants ~ */matches!(fields.len(), 18 | 24) || fields[0] != "stuck_diagnostic_v1" {
             return Err(StuckDiagnosticParseError::InvalidShape);
         }
         let blocker_category = BlockerCategory::parse(fields[12])?;
 
         Ok(Self {
             diagnostic_id: StuckDiagnosticId::new(fields[1])
                 .map_err(StuckDiagnosticParseError::InvalidId)?,
             actor_id: ActorId::new(fields[2]).map_err(StuckDiagnosticParseError::InvalidId)?,

---- no_human_sleep_knowledge_requires_observation_or_record_channel stdout ----

thread 'no_human_sleep_knowledge_requires_observation_or_record_channel' (6734) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:3036:5:
assertion failed: !report.stuck_diagnostic_event_ids.is_empty()

---- no_human_workplace_knowledge_requires_notice_channel stdout ----

thread 'no_human_workplace_knowledge_requires_notice_channel' (6735) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:3001:5:
assertion failed: !report.stuck_diagnostic_event_ids.is_empty()

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (6730) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2715:5:
assertion `left == right` failed
  left: PhysicalChecksum("twc1-301be54dfb7dfb00")
 right: PhysicalChecksum("twc1-68ee74360d03d456")

failures:
    no_human_day_real_run_replays_metrics_and_trace_projection
    no_human_sleep_knowledge_requires_observation_or_record_channel
    no_human_workplace_knowledge_requires_notice_channel

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.43s

*** result: Failure(101)
