*** crates/tracewake-core/src/agent/trace.rs:776:45: replace || with && in StuckDiagnostic::deserialize_canonical

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ replace || with && in StuckDiagnostic::deserialize_canonical
@@ -768,17 +768,17 @@
     pub fn serialize_canonical_bytes(&self) -> Vec<u8> {
         self.serialize_canonical().into_bytes()
     }
 
     pub fn deserialize_canonical(value: &[u8]) -> Result<Self, StuckDiagnosticParseError> {
         let value =
             std::str::from_utf8(value).map_err(|_| StuckDiagnosticParseError::InvalidUtf8)?;
         let fields: Vec<_> = value.split('|').collect();
-        if !matches!(fields.len(), 18 | 24) || fields[0] != "stuck_diagnostic_v1" {
+        if !matches!(fields.len(), 18 | 24) && /* ~ changed by cargo-mutants ~ */ fields[0] != "stuck_diagnostic_v1" {
             return Err(StuckDiagnosticParseError::InvalidShape);
         }
         let blocker_category = BlockerCategory::parse(fields[12])?;
 
         Ok(Self {
             diagnostic_id: StuckDiagnosticId::new(fields[1])
                 .map_err(StuckDiagnosticParseError::InvalidId)?,
             actor_id: ActorId::new(fields[2]).map_err(StuckDiagnosticParseError::InvalidId)?,

---- agent::trace::tests::canonical_trace_deserializers_reject_bad_prefix_and_field_count stdout ----

thread 'agent::trace::tests::canonical_trace_deserializers_reject_bad_prefix_and_field_count' (2393) panicked at crates/tracewake-core/src/agent/trace.rs:1395:9:
assertion failed: matches!(StuckDiagnostic::deserialize_canonical(bad_prefix.as_bytes()),
    Err(StuckDiagnosticParseError::InvalidShape))

failures:
    agent::trace::tests::canonical_trace_deserializers_reject_bad_prefix_and_field_count

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
