*** crates/tracewake-core/src/agent/trace.rs:816:47: replace == with != in StuckDiagnostic::deserialize_canonical

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ replace == with != in StuckDiagnostic::deserialize_canonical
@@ -808,17 +808,17 @@
             debug_only_details: decode_text_payload(fields[15])?,
             retry_abandon_fallback_outcome: decode_text_payload(fields[16])?,
             resulting_status: StuckResultingStatus::parse(
                 fields
                     .get(17)
                     .copied()
                     .ok_or(StuckDiagnosticParseError::InvalidShape)?,
             )?,
-            typed_diagnostic: if fields.len() == 24 {
+            typed_diagnostic: if fields.len() != /* ~ changed by cargo-mutants ~ */ 24 {
                 TypedDiagnosticFields {
                     responsible_layer: ResponsibleLayer::parse(fields[18])?,
                     blocker_code: BlockerCode::parse(fields[19])?,
                     input_source: decode_text_payload(fields[20])?,
                     actual_source: decode_text_payload(fields[21])?,
                     hidden_truth_referenced: decode_bool(fields[22])
                         .ok_or(StuckDiagnosticParseError::InvalidBool)?,
                     remediation_hint: decode_text_payload(fields[23])?,

---- no_human_sleep_knowledge_requires_observation_or_record_channel stdout ----

thread 'no_human_sleep_knowledge_requires_observation_or_record_channel' (14932) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:3036:5:
assertion failed: !report.stuck_diagnostic_event_ids.is_empty()

---- no_human_workplace_knowledge_requires_notice_channel stdout ----

thread 'no_human_workplace_knowledge_requires_notice_channel' (14933) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:3001:5:
assertion failed: !report.stuck_diagnostic_event_ids.is_empty()

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (14928) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2715:5:
assertion `left == right` failed
  left: PhysicalChecksum("twc1-301be54dfb7dfb00")
 right: PhysicalChecksum("twc1-68ee74360d03d456")

failures:
    no_human_day_real_run_replays_metrics_and_trace_projection
    no_human_sleep_knowledge_requires_observation_or_record_channel
    no_human_workplace_knowledge_requires_notice_channel

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.45s

*** result: Failure(101)
