*** crates/tracewake-core/src/agent/trace.rs:862:9: replace <impl fmt::Display for StuckDiagnosticParseError>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ replace <impl fmt::Display for StuckDiagnosticParseError>::fmt -> fmt::Result with Ok(Default::default())
@@ -854,40 +854,17 @@
             DiagnosticFieldParseError::InvalidResponsibleLayer => Self::InvalidResponsibleLayer,
             DiagnosticFieldParseError::InvalidBlockerCode => Self::InvalidBlockerCode,
         }
     }
 }
 
 impl fmt::Display for StuckDiagnosticParseError {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        match self {
-            StuckDiagnosticParseError::InvalidUtf8 => {
-                write!(f, "canonical stuck diagnostic bytes must be UTF-8")
-            }
-            StuckDiagnosticParseError::InvalidShape => write!(f, "invalid stuck diagnostic shape"),
-            StuckDiagnosticParseError::InvalidTick => write!(f, "invalid diagnostic tick"),
-            StuckDiagnosticParseError::InvalidNeed => write!(f, "invalid diagnostic need"),
-            StuckDiagnosticParseError::InvalidTextPayload => {
-                write!(f, "invalid diagnostic text payload")
-            }
-            StuckDiagnosticParseError::InvalidBlockerCategory => {
-                write!(f, "invalid blocker category")
-            }
-            StuckDiagnosticParseError::InvalidResultingStatus => {
-                write!(f, "invalid resulting status")
-            }
-            StuckDiagnosticParseError::InvalidRoutineStep => write!(f, "invalid routine step"),
-            StuckDiagnosticParseError::InvalidId(err) => write!(f, "invalid diagnostic ID: {err}"),
-            StuckDiagnosticParseError::InvalidBool => write!(f, "invalid diagnostic bool"),
-            StuckDiagnosticParseError::InvalidResponsibleLayer => {
-                write!(f, "invalid responsible layer")
-            }
-            StuckDiagnosticParseError::InvalidBlockerCode => write!(f, "invalid blocker code"),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl std::error::Error for StuckDiagnosticParseError {}
 
 fn encode_bool(value: bool) -> &'static str {
     if value {
         "true"

---- agent::trace::tests::stuck_parse_errors_map_and_display_as_typed_failures stdout ----

thread 'agent::trace::tests::stuck_parse_errors_map_and_display_as_typed_failures' (19270) panicked at crates/tracewake-core/src/agent/trace.rs:1413:13:
assertion failed: !rendered.is_empty()

failures:
    agent::trace::tests::stuck_parse_errors_map_and_display_as_typed_failures

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
