*** crates/tracewake-core/src/agent/trace.rs:86:9: replace ResponsibleLayer::stable_id -> &'static str with "xyzzy"

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ replace ResponsibleLayer::stable_id -> &'static str with "xyzzy"
@@ -78,29 +78,17 @@
         Self::ActionValidation,
         Self::Projection,
         Self::ViewModel,
         Self::TestOracle,
         Self::DebugQuarantine,
     ];
 
     pub const fn stable_id(self) -> &'static str {
-        match self {
-            Self::CandidateGeneration => "candidate_generation",
-            Self::IntentionLifecycle => "intention_lifecycle",
-            Self::MethodSelection => "method_selection",
-            Self::LocalPlanning => "local_planning",
-            Self::ProposalConstruction => "proposal_construction",
-            Self::Scheduler => "scheduler",
-            Self::ActionValidation => "action_validation",
-            Self::Projection => "projection",
-            Self::ViewModel => "view_model",
-            Self::TestOracle => "test_oracle",
-            Self::DebugQuarantine => "debug_quarantine",
-        }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn parse(value: &str) -> Result<Self, DiagnosticFieldParseError> {
         match value {
             "candidate_generation" => Ok(Self::CandidateGeneration),
             "intention_lifecycle" => Ok(Self::IntentionLifecycle),
             "method_selection" => Ok(Self::MethodSelection),
             "local_planning" => Ok(Self::LocalPlanning),

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (24998) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
