*** crates/tracewake-core/src/agent/trace.rs:892:5: replace encode_bool -> &'static str with "xyzzy"

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ replace encode_bool -> &'static str with "xyzzy"
@@ -884,21 +884,17 @@
             StuckDiagnosticParseError::InvalidBlockerCode => write!(f, "invalid blocker code"),
         }
     }
 }
 
 impl std::error::Error for StuckDiagnosticParseError {}
 
 fn encode_bool(value: bool) -> &'static str {
-    if value {
-        "true"
-    } else {
-        "false"
-    }
+    "xyzzy" /* ~ changed by cargo-mutants ~ */
 }
 
 fn decode_bool(value: &str) -> Option<bool> {
     match value {
         "true" => Some(true),
         "false" => Some(false),
         _ => None,
     }

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (27586) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
