*** crates/tracewake-core/src/agent/trace.rs:900:5: replace decode_bool -> Option<bool> with None

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ replace decode_bool -> Option<bool> with None
@@ -892,21 +892,17 @@
     if value {
         "true"
     } else {
         "false"
     }
 }
 
 fn decode_bool(value: &str) -> Option<bool> {
-    match value {
-        "true" => Some(true),
-        "false" => Some(false),
-        _ => None,
-    }
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn encode_opt_need(value: Option<NeedKind>) -> &'static str {
     match value {
         Some(NeedKind::Hunger) => "hunger",
         Some(NeedKind::Fatigue) => "fatigue",
         Some(NeedKind::Safety) => "safety",
         None => "-",

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (31617) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
