*** crates/tracewake-core/src/agent/trace.rs:900:5: replace decode_bool -> Option<bool> with Some(false)

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ replace decode_bool -> Option<bool> with Some(false)
@@ -892,21 +892,17 @@
     if value {
         "true"
     } else {
         "false"
     }
 }
 
 fn decode_bool(value: &str) -> Option<bool> {
-    match value {
-        "true" => Some(true),
-        "false" => Some(false),
-        _ => None,
-    }
+    Some(false) /* ~ changed by cargo-mutants ~ */
 }
 
 fn encode_opt_need(value: Option<NeedKind>) -> &'static str {
     match value {
         Some(NeedKind::Hunger) => "hunger",
         Some(NeedKind::Fatigue) => "fatigue",
         Some(NeedKind::Safety) => "safety",
         None => "-",

---- typed_diagnostic_hidden_truth_true_is_validated_and_replayed stdout ----

thread 'typed_diagnostic_hidden_truth_true_is_validated_and_replayed' (7882) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:2654:5:
assertion `left == right` failed
  left: Err(BadPayload { key: "hidden_truth_referenced", value: "true" })
 right: Ok(Applied)

failures:
    typed_diagnostic_hidden_truth_true_is_validated_and_replayed

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
