*** crates/tracewake-core/src/agent/trace.rs:901:9: delete match arm "true" in decode_bool

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ delete match arm "true" in decode_bool
@@ -893,17 +893,17 @@
         "true"
     } else {
         "false"
     }
 }
 
 fn decode_bool(value: &str) -> Option<bool> {
     match value {
-        "true" => Some(true),
+         /* ~ changed by cargo-mutants ~ */
         "false" => Some(false),
         _ => None,
     }
 }
 
 fn encode_opt_need(value: Option<NeedKind>) -> &'static str {
     match value {
         Some(NeedKind::Hunger) => "hunger",

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (11914) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
