*** crates/tracewake-core/src/agent/trace.rs:908:5: replace encode_opt_need -> &'static str with ""

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ replace encode_opt_need -> &'static str with ""
@@ -900,22 +900,17 @@
     match value {
         "true" => Some(true),
         "false" => Some(false),
         _ => None,
     }
 }
 
 fn encode_opt_need(value: Option<NeedKind>) -> &'static str {
-    match value {
-        Some(NeedKind::Hunger) => "hunger",
-        Some(NeedKind::Fatigue) => "fatigue",
-        Some(NeedKind::Safety) => "safety",
-        None => "-",
-    }
+    "" /* ~ changed by cargo-mutants ~ */
 }
 
 fn decode_opt_need(value: &str) -> Result<Option<NeedKind>, StuckDiagnosticParseError> {
     match value {
         "-" => Ok(None),
         "hunger" => Ok(Some(NeedKind::Hunger)),
         "fatigue" => Ok(Some(NeedKind::Fatigue)),
         "safety" => Ok(Some(NeedKind::Safety)),

---- no_human_sleep_knowledge_requires_observation_or_record_channel stdout ----

thread 'no_human_sleep_knowledge_requires_observation_or_record_channel' (20023) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:3036:5:
assertion failed: !report.stuck_diagnostic_event_ids.is_empty()

---- no_human_workplace_knowledge_requires_notice_channel stdout ----

thread 'no_human_workplace_knowledge_requires_notice_channel' (20024) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:3001:5:
assertion failed: !report.stuck_diagnostic_event_ids.is_empty()

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (20019) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2715:5:
assertion `left == right` failed
  left: PhysicalChecksum("twc1-301be54dfb7dfb00")
 right: PhysicalChecksum("twc1-68ee74360d03d456")

failures:
    no_human_day_real_run_replays_metrics_and_trace_projection
    no_human_sleep_knowledge_requires_observation_or_record_channel
    no_human_workplace_knowledge_requires_notice_channel

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.43s

*** result: Failure(101)
