*** crates/tracewake-core/src/agent/trace.rs:917:5: replace decode_opt_need -> Result<Option<NeedKind>, StuckDiagnosticParseError> with Ok(None)

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ replace decode_opt_need -> Result<Option<NeedKind>, StuckDiagnosticParseError> with Ok(None)
@@ -909,23 +909,17 @@
         Some(NeedKind::Hunger) => "hunger",
         Some(NeedKind::Fatigue) => "fatigue",
         Some(NeedKind::Safety) => "safety",
         None => "-",
     }
 }
 
 fn decode_opt_need(value: &str) -> Result<Option<NeedKind>, StuckDiagnosticParseError> {
-    match value {
-        "-" => Ok(None),
-        "hunger" => Ok(Some(NeedKind::Hunger)),
-        "fatigue" => Ok(Some(NeedKind::Fatigue)),
-        "safety" => Ok(Some(NeedKind::Safety)),
-        _ => Err(StuckDiagnosticParseError::InvalidNeed),
-    }
+    Ok(None) /* ~ changed by cargo-mutants ~ */
 }
 
 fn encode_opt_id(value: Option<&str>) -> String {
     value.unwrap_or("-").to_string()
 }
 
 fn decode_opt_id<T>(
     value: &str,

---- agent::trace::tests::stuck_diagnostic_vocabulary_parses_every_canonical_token stdout ----

thread 'agent::trace::tests::stuck_diagnostic_vocabulary_parses_every_canonical_token' (28447) panicked at crates/tracewake-core/src/agent/trace.rs:1302:9:
assertion `left == right` failed
  left: None
 right: Some(Hunger)

---- agent::trace::tests::every_blocker_category_serializes_and_round_trips stdout ----

thread 'agent::trace::tests::every_blocker_category_serializes_and_round_trips' (28444) panicked at crates/tracewake-core/src/agent/trace.rs:1179:13:
assertion `left == right` failed

failures:
    agent::trace::tests::every_blocker_category_serializes_and_round_trips
    agent::trace::tests::stuck_diagnostic_vocabulary_parses_every_canonical_token

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
