*** crates/tracewake-core/src/agent/trace.rs:918:9: delete match arm "-" in decode_opt_need

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ delete match arm "-" in decode_opt_need
@@ -910,17 +910,17 @@
         Some(NeedKind::Fatigue) => "fatigue",
         Some(NeedKind::Safety) => "safety",
         None => "-",
     }
 }
 
 fn decode_opt_need(value: &str) -> Result<Option<NeedKind>, StuckDiagnosticParseError> {
     match value {
-        "-" => Ok(None),
+         /* ~ changed by cargo-mutants ~ */
         "hunger" => Ok(Some(NeedKind::Hunger)),
         "fatigue" => Ok(Some(NeedKind::Fatigue)),
         "safety" => Ok(Some(NeedKind::Safety)),
         _ => Err(StuckDiagnosticParseError::InvalidNeed),
     }
 }
 
 fn encode_opt_id(value: Option<&str>) -> String {

---- no_human_sleep_knowledge_requires_observation_or_record_channel stdout ----

thread 'no_human_sleep_knowledge_requires_observation_or_record_channel' (324) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:3036:5:
assertion failed: !report.stuck_diagnostic_event_ids.is_empty()

---- no_human_workplace_knowledge_requires_notice_channel stdout ----

thread 'no_human_workplace_knowledge_requires_notice_channel' (325) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:3001:5:
assertion failed: !report.stuck_diagnostic_event_ids.is_empty()

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (320) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2715:5:
assertion `left == right` failed
  left: PhysicalChecksum("twc1-301be54dfb7dfb00")
 right: PhysicalChecksum("twc1-68ee74360d03d456")

failures:
    no_human_day_real_run_replays_metrics_and_trace_projection
    no_human_sleep_knowledge_requires_observation_or_record_channel
    no_human_workplace_knowledge_requires_notice_channel

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.43s

*** result: Failure(101)
