*** crates/tracewake-core/src/agent/trace.rs:919:9: delete match arm "hunger" in decode_opt_need

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ delete match arm "hunger" in decode_opt_need
@@ -911,17 +911,17 @@
         Some(NeedKind::Safety) => "safety",
         None => "-",
     }
 }
 
 fn decode_opt_need(value: &str) -> Result<Option<NeedKind>, StuckDiagnosticParseError> {
     match value {
         "-" => Ok(None),
-        "hunger" => Ok(Some(NeedKind::Hunger)),
+         /* ~ changed by cargo-mutants ~ */
         "fatigue" => Ok(Some(NeedKind::Fatigue)),
         "safety" => Ok(Some(NeedKind::Safety)),
         _ => Err(StuckDiagnosticParseError::InvalidNeed),
     }
 }
 
 fn encode_opt_id(value: Option<&str>) -> String {
     value.unwrap_or("-").to_string()

---- agent::trace::tests::stuck_diagnostic_vocabulary_parses_every_canonical_token stdout ----

thread 'agent::trace::tests::stuck_diagnostic_vocabulary_parses_every_canonical_token' (4649) panicked at crates/tracewake-core/src/agent/trace.rs:1308:46:
called `Result::unwrap()` on an `Err` value: InvalidNeed

---- agent::trace::tests::every_blocker_category_serializes_and_round_trips stdout ----

thread 'agent::trace::tests::every_blocker_category_serializes_and_round_trips' (4646) panicked at crates/tracewake-core/src/agent/trace.rs:1183:80:
called `Result::unwrap()` on an `Err` value: InvalidNeed

failures:
    agent::trace::tests::every_blocker_category_serializes_and_round_trips
    agent::trace::tests::stuck_diagnostic_vocabulary_parses_every_canonical_token

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
