*** crates/tracewake-core/src/agent/trace.rs:920:9: delete match arm "fatigue" in decode_opt_need

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ delete match arm "fatigue" in decode_opt_need
@@ -912,17 +912,17 @@
         None => "-",
     }
 }
 
 fn decode_opt_need(value: &str) -> Result<Option<NeedKind>, StuckDiagnosticParseError> {
     match value {
         "-" => Ok(None),
         "hunger" => Ok(Some(NeedKind::Hunger)),
-        "fatigue" => Ok(Some(NeedKind::Fatigue)),
+         /* ~ changed by cargo-mutants ~ */
         "safety" => Ok(Some(NeedKind::Safety)),
         _ => Err(StuckDiagnosticParseError::InvalidNeed),
     }
 }
 
 fn encode_opt_id(value: Option<&str>) -> String {
     value.unwrap_or("-").to_string()
 }

---- agent::trace::tests::canonical_trace_deserializers_reject_bad_prefix_and_field_count stdout ----

thread 'agent::trace::tests::canonical_trace_deserializers_reject_bad_prefix_and_field_count' (9202) panicked at crates/tracewake-core/src/agent/trace.rs:1390:18:
called `Result::unwrap()` on an `Err` value: InvalidNeed

---- agent::trace::tests::stuck_diagnostic_vocabulary_parses_every_canonical_token stdout ----

thread 'agent::trace::tests::stuck_diagnostic_vocabulary_parses_every_canonical_token' (9209) panicked at crates/tracewake-core/src/agent/trace.rs:1309:47:
called `Result::unwrap()` on an `Err` value: InvalidNeed

failures:
    agent::trace::tests::canonical_trace_deserializers_reject_bad_prefix_and_field_count
    agent::trace::tests::stuck_diagnostic_vocabulary_parses_every_canonical_token

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
