*** crates/tracewake-core/src/agent/trace.rs:921:9: delete match arm "safety" in decode_opt_need

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ delete match arm "safety" in decode_opt_need
@@ -913,17 +913,17 @@
     }
 }
 
 fn decode_opt_need(value: &str) -> Result<Option<NeedKind>, StuckDiagnosticParseError> {
     match value {
         "-" => Ok(None),
         "hunger" => Ok(Some(NeedKind::Hunger)),
         "fatigue" => Ok(Some(NeedKind::Fatigue)),
-        "safety" => Ok(Some(NeedKind::Safety)),
+         /* ~ changed by cargo-mutants ~ */
         _ => Err(StuckDiagnosticParseError::InvalidNeed),
     }
 }
 
 fn encode_opt_id(value: Option<&str>) -> String {
     value.unwrap_or("-").to_string()
 }

---- agent::trace::tests::stuck_diagnostic_vocabulary_parses_every_canonical_token stdout ----

thread 'agent::trace::tests::stuck_diagnostic_vocabulary_parses_every_canonical_token' (13768) panicked at crates/tracewake-core/src/agent/trace.rs:1310:46:
called `Result::unwrap()` on an `Err` value: InvalidNeed

failures:
    agent::trace::tests::stuck_diagnostic_vocabulary_parses_every_canonical_token

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
