*** crates/tracewake-core/src/agent/trace.rs:927:5: replace encode_opt_id -> String with String::new()

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ replace encode_opt_id -> String with String::new()
@@ -919,17 +919,17 @@
         "hunger" => Ok(Some(NeedKind::Hunger)),
         "fatigue" => Ok(Some(NeedKind::Fatigue)),
         "safety" => Ok(Some(NeedKind::Safety)),
         _ => Err(StuckDiagnosticParseError::InvalidNeed),
     }
 }
 
 fn encode_opt_id(value: Option<&str>) -> String {
-    value.unwrap_or("-").to_string()
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn decode_opt_id<T>(
     value: &str,
     parse: impl FnOnce(&str) -> Result<T, crate::ids::IdError>,
 ) -> Result<Option<T>, StuckDiagnosticParseError> {
     if value == "-" {
         Ok(None)

---- no_human_sleep_knowledge_requires_observation_or_record_channel stdout ----

thread 'no_human_sleep_knowledge_requires_observation_or_record_channel' (18101) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:3036:5:
assertion failed: !report.stuck_diagnostic_event_ids.is_empty()

---- no_human_workplace_knowledge_requires_notice_channel stdout ----

thread 'no_human_workplace_knowledge_requires_notice_channel' (18102) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:3001:5:
assertion failed: !report.stuck_diagnostic_event_ids.is_empty()

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (18097) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2715:5:
assertion `left == right` failed
  left: PhysicalChecksum("twc1-301be54dfb7dfb00")
 right: PhysicalChecksum("twc1-68ee74360d03d456")

failures:
    no_human_day_real_run_replays_metrics_and_trace_projection
    no_human_sleep_knowledge_requires_observation_or_record_channel
    no_human_workplace_knowledge_requires_notice_channel

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.46s

*** result: Failure(101)
