*** crates/tracewake-core/src/agent/trace.rs:927:5: replace encode_opt_id -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ replace encode_opt_id -> String with "xyzzy".into()
@@ -919,17 +919,17 @@
         "hunger" => Ok(Some(NeedKind::Hunger)),
         "fatigue" => Ok(Some(NeedKind::Fatigue)),
         "safety" => Ok(Some(NeedKind::Safety)),
         _ => Err(StuckDiagnosticParseError::InvalidNeed),
     }
 }
 
 fn encode_opt_id(value: Option<&str>) -> String {
-    value.unwrap_or("-").to_string()
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 fn decode_opt_id<T>(
     value: &str,
     parse: impl FnOnce(&str) -> Result<T, crate::ids::IdError>,
 ) -> Result<Option<T>, StuckDiagnosticParseError> {
     if value == "-" {
         Ok(None)

---- agent::trace::tests::every_blocker_category_serializes_and_round_trips stdout ----

thread 'agent::trace::tests::every_blocker_category_serializes_and_round_trips' (22423) panicked at crates/tracewake-core/src/agent/trace.rs:1185:13:
assertion `left == right` failed

---- events::apply::tests::agent_trace_and_stuck_diagnostic_events_record_canonical_payloads stdout ----

thread 'events::apply::tests::agent_trace_and_stuck_diagnostic_events_record_canonical_payloads' (22521) panicked at crates/tracewake-core/src/events/apply.rs:2243:9:
assertion failed: diagnostic.serialize_canonical().starts_with("stuck_diagnostic_v1|stuck_food_missing|actor_tomas|1|2|-|-|-|-|-|-|-|resource")

failures:
    agent::trace::tests::every_blocker_category_serializes_and_round_trips
    events::apply::tests::agent_trace_and_stuck_diagnostic_events_record_canonical_payloads

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
