*** crates/tracewake-core/src/agent/trace.rs:934:14: replace == with != in decode_opt_id

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ replace == with != in decode_opt_id
@@ -926,17 +926,17 @@
 fn encode_opt_id(value: Option<&str>) -> String {
     value.unwrap_or("-").to_string()
 }
 
 fn decode_opt_id<T>(
     value: &str,
     parse: impl FnOnce(&str) -> Result<T, crate::ids::IdError>,
 ) -> Result<Option<T>, StuckDiagnosticParseError> {
-    if value == "-" {
+    if value != /* ~ changed by cargo-mutants ~ */ "-" {
         Ok(None)
     } else {
         Ok(Some(
             parse(value).map_err(StuckDiagnosticParseError::InvalidId)?,
         ))
     }
 }

---- no_human_sleep_knowledge_requires_observation_or_record_channel stdout ----

thread 'no_human_sleep_knowledge_requires_observation_or_record_channel' (31330) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:3036:5:
assertion failed: !report.stuck_diagnostic_event_ids.is_empty()

---- no_human_workplace_knowledge_requires_notice_channel stdout ----

thread 'no_human_workplace_knowledge_requires_notice_channel' (31331) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:3001:5:
assertion failed: !report.stuck_diagnostic_event_ids.is_empty()

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (31326) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2715:5:
assertion `left == right` failed
  left: PhysicalChecksum("twc1-301be54dfb7dfb00")
 right: PhysicalChecksum("twc1-68ee74360d03d456")

failures:
    no_human_day_real_run_replays_metrics_and_trace_projection
    no_human_sleep_knowledge_requires_observation_or_record_channel
    no_human_workplace_knowledge_requires_notice_channel

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.43s

*** result: Failure(101)
