*** crates/tracewake-core/src/agent/trace.rs:934:5: replace decode_opt_id -> Result<Option<T>, StuckDiagnosticParseError> with Ok(None)

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ replace decode_opt_id -> Result<Option<T>, StuckDiagnosticParseError> with Ok(None)
@@ -926,23 +926,17 @@
 fn encode_opt_id(value: Option<&str>) -> String {
     value.unwrap_or("-").to_string()
 }
 
 fn decode_opt_id<T>(
     value: &str,
     parse: impl FnOnce(&str) -> Result<T, crate::ids::IdError>,
 ) -> Result<Option<T>, StuckDiagnosticParseError> {
-    if value == "-" {
-        Ok(None)
-    } else {
-        Ok(Some(
-            parse(value).map_err(StuckDiagnosticParseError::InvalidId)?,
-        ))
-    }
+    Ok(None) /* ~ changed by cargo-mutants ~ */
 }
 
 fn encode_opt_text(value: Option<&str>) -> String {
     value
         .map(encode_text_payload)
         .unwrap_or_else(|| "-".to_string())
 }

---- agent::trace::tests::every_blocker_category_serializes_and_round_trips stdout ----

thread 'agent::trace::tests::every_blocker_category_serializes_and_round_trips' (26982) panicked at crates/tracewake-core/src/agent/trace.rs:1179:13:
assertion `left == right` failed

failures:
    agent::trace::tests::every_blocker_category_serializes_and_round_trips

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
