*** crates/tracewake-core/src/agent/trace.rs:950:5: replace decode_opt_text -> Result<Option<String>, StuckDiagnosticParseError> with Ok(None)

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ replace decode_opt_text -> Result<Option<String>, StuckDiagnosticParseError> with Ok(None)
@@ -942,21 +942,17 @@
 
 fn encode_opt_text(value: Option<&str>) -> String {
     value
         .map(encode_text_payload)
         .unwrap_or_else(|| "-".to_string())
 }
 
 fn decode_opt_text(value: &str) -> Result<Option<String>, StuckDiagnosticParseError> {
-    if value == "-" {
-        Ok(None)
-    } else {
-        Ok(Some(decode_text_payload(value)?))
-    }
+    Ok(None) /* ~ changed by cargo-mutants ~ */
 }
 
 fn encode_text_payload(value: &str) -> String {
     value
         .as_bytes()
         .iter()
         .map(|byte| format!("{byte:02x}"))
         .collect()

---- agent::trace::tests::every_blocker_category_serializes_and_round_trips stdout ----

thread 'agent::trace::tests::every_blocker_category_serializes_and_round_trips' (11383) panicked at crates/tracewake-core/src/agent/trace.rs:1181:13:
assertion `left == right` failed

failures:
    agent::trace::tests::every_blocker_category_serializes_and_round_trips

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
