*** crates/tracewake-core/src/agent/trace.rs:950:5: replace decode_opt_text -> Result<Option<String>, StuckDiagnosticParseError> with Ok(Some(String::new()))

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ replace decode_opt_text -> Result<Option<String>, StuckDiagnosticParseError> with Ok(Some(String::new()))
@@ -942,21 +942,17 @@
 
 fn encode_opt_text(value: Option<&str>) -> String {
     value
         .map(encode_text_payload)
         .unwrap_or_else(|| "-".to_string())
 }
 
 fn decode_opt_text(value: &str) -> Result<Option<String>, StuckDiagnosticParseError> {
-    if value == "-" {
-        Ok(None)
-    } else {
-        Ok(Some(decode_text_payload(value)?))
-    }
+    Ok(Some(String::new())) /* ~ changed by cargo-mutants ~ */
 }
 
 fn encode_text_payload(value: &str) -> String {
     value
         .as_bytes()
         .iter()
         .map(|byte| format!("{byte:02x}"))
         .collect()

---- no_human_sleep_knowledge_requires_observation_or_record_channel stdout ----

thread 'no_human_sleep_knowledge_requires_observation_or_record_channel' (15719) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:3036:5:
assertion failed: !report.stuck_diagnostic_event_ids.is_empty()

---- no_human_workplace_knowledge_requires_notice_channel stdout ----

thread 'no_human_workplace_knowledge_requires_notice_channel' (15720) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:3001:5:
assertion failed: !report.stuck_diagnostic_event_ids.is_empty()

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (15715) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2715:5:
assertion `left == right` failed
  left: PhysicalChecksum("twc1-301be54dfb7dfb00")
 right: PhysicalChecksum("twc1-68ee74360d03d456")

failures:
    no_human_day_real_run_replays_metrics_and_trace_projection
    no_human_sleep_knowledge_requires_observation_or_record_channel
    no_human_workplace_knowledge_requires_notice_channel

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.44s

*** result: Failure(101)
