*** crates/tracewake-core/src/agent/trace.rs:958:5: replace encode_text_payload -> String with String::new()

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ replace encode_text_payload -> String with String::new()
@@ -950,21 +950,17 @@
     if value == "-" {
         Ok(None)
     } else {
         Ok(Some(decode_text_payload(value)?))
     }
 }
 
 fn encode_text_payload(value: &str) -> String {
-    value
-        .as_bytes()
-        .iter()
-        .map(|byte| format!("{byte:02x}"))
-        .collect()
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn decode_text_payload(value: &str) -> Result<String, StuckDiagnosticParseError> {
     if !value.len().is_multiple_of(2) {
         return Err(StuckDiagnosticParseError::InvalidTextPayload);
     }
 
     let bytes = value

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (27969) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:
agent event applies to live state: BadPayload { key: "trace_canonical", value: "decision_trace_v1|trace_decision_actor_mara_0_goal_actor_mara_0_continue_current_intention|actor_mara|0|1|continued|4|hkc1-89f08b86483c43a8||true||candidate_generation|none|||false|" }

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
