*** crates/tracewake-core/src/agent/trace.rs:966:5: replace decode_text_payload -> Result<String, StuckDiagnosticParseError> with Ok(String::new())

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ replace decode_text_payload -> Result<String, StuckDiagnosticParseError> with Ok(String::new())
@@ -958,31 +958,17 @@
     value
         .as_bytes()
         .iter()
         .map(|byte| format!("{byte:02x}"))
         .collect()
 }
 
 fn decode_text_payload(value: &str) -> Result<String, StuckDiagnosticParseError> {
-    if !value.len().is_multiple_of(2) {
-        return Err(StuckDiagnosticParseError::InvalidTextPayload);
-    }
-
-    let bytes = value
-        .as_bytes()
-        .chunks_exact(2)
-        .map(|pair| {
-            let hex =
-                std::str::from_utf8(pair).map_err(|_| StuckDiagnosticParseError::InvalidUtf8)?;
-            u8::from_str_radix(hex, 16).map_err(|_| StuckDiagnosticParseError::InvalidTextPayload)
-        })
-        .collect::<Result<Vec<_>, _>>()?;
-
-    String::from_utf8(bytes).map_err(|_| StuckDiagnosticParseError::InvalidTextPayload)
+    Ok(String::new()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::agent::candidate::{
         ApplicabilityResult, CandidateGoalSource, GoalKind, GoalPriority,
     };

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (3563) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
