*** crates/tracewake-core/src/agent/trace.rs:966:8: delete ! in decode_text_payload

*** mutation diff:
--- crates/tracewake-core/src/agent/trace.rs
+++ delete ! in decode_text_payload
@@ -958,17 +958,17 @@
     value
         .as_bytes()
         .iter()
         .map(|byte| format!("{byte:02x}"))
         .collect()
 }
 
 fn decode_text_payload(value: &str) -> Result<String, StuckDiagnosticParseError> {
-    if !value.len().is_multiple_of(2) {
+    if  /* ~ changed by cargo-mutants ~ */value.len().is_multiple_of(2) {
         return Err(StuckDiagnosticParseError::InvalidTextPayload);
     }
 
     let bytes = value
         .as_bytes()
         .chunks_exact(2)
         .map(|pair| {
             let hex =

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (11626) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
