*** crates/tracewake-core/src/agent/transaction.rs:149:32: replace > with < in ActorDecisionTransaction::run

*** mutation diff:
--- crates/tracewake-core/src/agent/transaction.rs
+++ replace > with < in ActorDecisionTransaction::run
@@ -141,17 +141,17 @@
                 .filter(|candidate| candidate.goal_kind != GoalKind::IdleWithReason)
                 .collect()
         };
         let mut last_method_failure: Option<(CandidateGoal, String)> = None;
         let max_method_attempts = candidates.len().saturating_add(1);
         let mut method_attempts = 0usize;
         let (selection, method) = loop {
             method_attempts = method_attempts.saturating_add(1);
-            if method_attempts > max_method_attempts {
+            if method_attempts < /* ~ changed by cargo-mutants ~ */ max_method_attempts {
                 return ActorDecisionTransactionOutcome::Stuck {
                     diagnostic: Box::new(stuck_diagnostic(
                         &input.actor_id,
                         input.decision_tick,
                         last_method_failure.as_ref().map(|(goal, _)| goal),
                         None,
                         "empty local plan",
                         "method selection retry limit exceeded without retiring the failed goal",

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (28840) panicked at crates/tracewake-content/tests/fixtures_load.rs:1217:5:
assertion failed: report.ordinary_pipeline_events > 0

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
