*** crates/tracewake-core/src/agent/transaction.rs:189:16: delete ! in ActorDecisionTransaction::run

*** mutation diff:
--- crates/tracewake-core/src/agent/transaction.rs
+++ delete ! in ActorDecisionTransaction::run
@@ -181,17 +181,17 @@
                             None,
                             None,
                             "no applicable candidate",
                             "candidate generation produced no applicable goal",
                         ),
                     }),
                 };
             };
-            if !selection.trace.hidden_truth_audit_result.actor_known_only {
+            if  /* ~ changed by cargo-mutants ~ */selection.trace.hidden_truth_audit_result.actor_known_only {
                 return ActorDecisionTransactionOutcome::Stuck {
                     diagnostic: Box::new(stuck_diagnostic_for_hidden_truth_audit(
                         &input.actor_id,
                         input.decision_tick,
                         &selection.selected_goal,
                         &selection.trace,
                     )),
                 };

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (4962) panicked at crates/tracewake-content/tests/fixtures_load.rs:1217:5:
assertion failed: report.ordinary_pipeline_events > 0

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
