*** crates/tracewake-core/src/agent/transaction.rs:212:53: replace == with != in ActorDecisionTransaction::run

*** mutation diff:
--- crates/tracewake-core/src/agent/transaction.rs
+++ replace == with != in ActorDecisionTransaction::run
@@ -204,17 +204,17 @@
                 input.decision_tick,
             ) {
                 Ok(method) => break (selection, method),
                 Err(error) => {
                     let failed_goal = selection.selected_goal.clone();
                     let error = format!("{error:?}");
                     let mut retired_failed_goal = false;
                     for candidate in candidates.iter_mut().filter(|candidate| {
-                        candidate.candidate_goal_id == failed_goal.candidate_goal_id
+                        candidate.candidate_goal_id != /* ~ changed by cargo-mutants ~ */ failed_goal.candidate_goal_id
                     }) {
                         retired_failed_goal = true;
                         candidate.applicability = ApplicabilityResult::Inapplicable;
                         candidate.rejection_reason =
                             Some(format!("method_selection_rejected:{error}"));
                     }
                     if !retired_failed_goal {
                         return ActorDecisionTransactionOutcome::Stuck {

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (8994) panicked at crates/tracewake-content/tests/fixtures_load.rs:1217:5:
assertion failed: report.ordinary_pipeline_events > 0

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
