*** crates/tracewake-core/src/agent/transaction.rs:219:24: delete ! in ActorDecisionTransaction::run

*** mutation diff:
--- crates/tracewake-core/src/agent/transaction.rs
+++ delete ! in ActorDecisionTransaction::run
@@ -211,17 +211,17 @@
                     for candidate in candidates.iter_mut().filter(|candidate| {
                         candidate.candidate_goal_id == failed_goal.candidate_goal_id
                     }) {
                         retired_failed_goal = true;
                         candidate.applicability = ApplicabilityResult::Inapplicable;
                         candidate.rejection_reason =
                             Some(format!("method_selection_rejected:{error}"));
                     }
-                    if !retired_failed_goal {
+                    if  /* ~ changed by cargo-mutants ~ */retired_failed_goal {
                         return ActorDecisionTransactionOutcome::Stuck {
                             diagnostic: Box::new(stuck_diagnostic(
                                 &input.actor_id,
                                 input.decision_tick,
                                 Some(&failed_goal),
                                 None,
                                 "empty local plan",
                                 format!("method failure did not retire selected goal: {error}"),

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (13025) panicked at crates/tracewake-content/tests/fixtures_load.rs:1217:5:
assertion failed: report.ordinary_pipeline_events > 0

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
