*** crates/tracewake-core/src/agent/transaction.rs:320:39: replace == with != in ActorDecisionTransaction::run

*** mutation diff:
--- crates/tracewake-core/src/agent/transaction.rs
+++ replace == with != in ActorDecisionTransaction::run
@@ -312,17 +312,17 @@
                 planned.action_id.as_str()
             ))
             .unwrap(),
             ProposalOrigin::Agent,
             Some(input.actor_id.clone()),
             planned.action_id.clone(),
             input.decision_tick,
         );
-        if planned.action_id.as_str() == "wait" {
+        if planned.action_id.as_str() != /* ~ changed by cargo-mutants ~ */ "wait" {
             let reason = planned
                 .target_ids
                 .first()
                 .cloned()
                 .unwrap_or_else(|| "actor_decision_idle".to_string());
             proposal.parameters.insert("reason".to_string(), reason);
         } else if planned.action_id.as_str() == "sleep" {
             proposal.target_ids = planned.target_ids.clone();

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (17056) panicked at crates/tracewake-content/tests/fixtures_load.rs:1217:5:
assertion failed: report.ordinary_pipeline_events > 0

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
