*** crates/tracewake-core/src/agent/transaction.rs:327:46: replace == with != in ActorDecisionTransaction::run

*** mutation diff:
--- crates/tracewake-core/src/agent/transaction.rs
+++ replace == with != in ActorDecisionTransaction::run
@@ -319,17 +319,17 @@
         );
         if planned.action_id.as_str() == "wait" {
             let reason = planned
                 .target_ids
                 .first()
                 .cloned()
                 .unwrap_or_else(|| "actor_decision_idle".to_string());
             proposal.parameters.insert("reason".to_string(), reason);
-        } else if planned.action_id.as_str() == "sleep" {
+        } else if planned.action_id.as_str() != /* ~ changed by cargo-mutants ~ */ "sleep" {
             proposal.target_ids = planned.target_ids.clone();
             if let Some(sleep_place_id) = planned.target_ids.first() {
                 proposal
                     .parameters
                     .insert("sleep_place_id".to_string(), sleep_place_id.clone());
                 if let Some(sleep_affordance_id) =
                     actor_known_sleep_affordance_id(input.actor_known_context)
                 {

---- episode_tamper_proration_poisons_replay stdout ----

thread 'episode_tamper_proration_poisons_replay' (21122) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2851:5:
assertion failed: has_event(&log, EventKind::SleepInterrupted)

---- sleep_spanning_window_boundary_charges_each_tick_once stdout ----

thread 'sleep_spanning_window_boundary_charges_each_tick_once' (21156) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2527:5:
assertion failed: report.ordinary_pipeline_events > 0

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (21129) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2172:5:
assertion `left == right` failed
  left: {ActorId(StableId("actor_anna")), ActorId(StableId("actor_mara")), ActorId(StableId("actor_tomas"))}
 right: {ActorId(StableId("actor_anna")), ActorId(StableId("actor_elena")), ActorId(StableId("actor_mara")), ActorId(StableId("actor_tomas"))}

failures:
    episode_tamper_proration_poisons_replay
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    sleep_spanning_window_boundary_charges_each_tick_once

test result: FAILED. 38 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.52s

*** result: Failure(101)
