*** crates/tracewake-core/src/agent/transaction.rs:383:73: replace && with || in actor_known_sleep_affordance_id

*** mutation diff:
--- crates/tracewake-core/src/agent/transaction.rs
+++ replace && with || in actor_known_sleep_affordance_id
@@ -375,17 +375,17 @@
         }))
     }
 }
 
 fn actor_known_sleep_affordance_id(context: &ActorKnownPlanningContext) -> Option<String> {
     context
         .actor_known_facts()
         .iter()
-        .find(|fact| fact.stable_id() == "actor_knows_sleep_affordance" && fact.is_actor_known())
+        .find(|fact| fact.stable_id() == "actor_knows_sleep_affordance" || /* ~ changed by cargo-mutants ~ */ fact.is_actor_known())
         .map(|fact| fact.value().to_string())
 }
 
 fn active_intention_for_actor(
     agent_state: &AgentState,
     actor_id: &ActorId,
 ) -> Option<crate::agent::Intention> {
     let intention_id = agent_state.active_intention_by_actor.get(actor_id)?;

---- episode_tamper_proration_poisons_replay stdout ----

thread 'episode_tamper_proration_poisons_replay' (5050) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2851:5:
assertion failed: has_event(&log, EventKind::SleepInterrupted)

---- sleep_spanning_window_boundary_charges_each_tick_once stdout ----

thread 'sleep_spanning_window_boundary_charges_each_tick_once' (5084) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2527:5:
assertion failed: report.ordinary_pipeline_events > 0

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (5057) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2172:5:
assertion `left == right` failed
  left: {ActorId(StableId("actor_anna")), ActorId(StableId("actor_mara")), ActorId(StableId("actor_tomas"))}
 right: {ActorId(StableId("actor_anna")), ActorId(StableId("actor_elena")), ActorId(StableId("actor_mara")), ActorId(StableId("actor_tomas"))}

failures:
    episode_tamper_proration_poisons_replay
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    sleep_spanning_window_boundary_charges_each_tick_once

test result: FAILED. 38 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.50s

*** result: Failure(101)
