*** crates/tracewake-core/src/agent/transaction.rs:391:5: replace active_intention_for_actor -> Option<crate::agent::Intention> with None

*** mutation diff:
--- crates/tracewake-core/src/agent/transaction.rs
+++ replace active_intention_for_actor -> Option<crate::agent::Intention> with None
@@ -383,18 +383,17 @@
         .find(|fact| fact.stable_id() == "actor_knows_sleep_affordance" && fact.is_actor_known())
         .map(|fact| fact.value().to_string())
 }
 
 fn active_intention_for_actor(
     agent_state: &AgentState,
     actor_id: &ActorId,
 ) -> Option<crate::agent::Intention> {
-    let intention_id = agent_state.active_intention_by_actor.get(actor_id)?;
-    agent_state.intentions.get(intention_id).cloned()
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn planner_goal_for(
     selected_goal: &CandidateGoal,
     actor_known_context: &ActorKnownPlanningContext,
 ) -> PlannerGoal {
     match selected_goal.goal_kind {
         GoalKind::Eat | GoalKind::FindFood => actor_known_food_source_for_goal(actor_known_context)

---- agent::transaction::tests::active_intention_lookup_requires_actor_specific_live_index stdout ----

thread 'agent::transaction::tests::active_intention_lookup_requires_actor_specific_live_index' (13490) panicked at crates/tracewake-core/src/agent/transaction.rs:1092:9:
assertion `left == right` failed
  left: None

failures:
    agent::transaction::tests::active_intention_lookup_requires_actor_specific_live_index

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
