*** crates/tracewake-core/src/agent/transaction.rs:430:29: replace == with != in planner_goal_for

*** mutation diff:
--- crates/tracewake-core/src/agent/transaction.rs
+++ replace == with != in planner_goal_for
@@ -422,17 +422,17 @@
                 }
             })
             .unwrap_or_else(|| PlannerGoal::WaitWithReason("no_actor_known_workplace".to_string())),
         GoalKind::PerformWorkBlock => actor_known_context
             .known_workplaces()
             .iter()
             .next()
             .map(|(workplace_id, place_id)| {
-                if place_id == actor_known_context.current_place_id() {
+                if place_id != /* ~ changed by cargo-mutants ~ */ actor_known_context.current_place_id() {
                     PlannerGoal::StartWorkBlock(workplace_id.as_str().to_string())
                 } else {
                     PlannerGoal::ReachPlace(place_id.clone())
                 }
             })
             .unwrap_or_else(|| PlannerGoal::WaitWithReason("no_actor_known_workplace".to_string())),
         GoalKind::SleepOrRest => actor_known_context
             .known_sleep_places()

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (17839) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.55s

*** result: Failure(101)
