*** crates/tracewake-core/src/agent/transaction.rs:443:36: replace == with != in planner_goal_for

*** mutation diff:
--- crates/tracewake-core/src/agent/transaction.rs
+++ replace == with != in planner_goal_for
@@ -435,17 +435,17 @@
             })
             .unwrap_or_else(|| PlannerGoal::WaitWithReason("no_actor_known_workplace".to_string())),
         GoalKind::SleepOrRest => actor_known_context
             .known_sleep_places()
             .iter()
             .next()
             .cloned()
             .map(|sleep_place_id| {
-                if &sleep_place_id == actor_known_context.current_place_id() {
+                if &sleep_place_id != /* ~ changed by cargo-mutants ~ */ actor_known_context.current_place_id() {
                     PlannerGoal::StartSleep(sleep_place_id)
                 } else {
                     PlannerGoal::ReachPlace(sleep_place_id)
                 }
             })
             .unwrap_or_else(|| {
                 PlannerGoal::WaitWithReason("no_actor_known_sleep_place".to_string())
             }),

---- episode_tamper_proration_poisons_replay stdout ----

thread 'episode_tamper_proration_poisons_replay' (21931) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2851:5:
assertion failed: has_event(&log, EventKind::SleepInterrupted)

---- sleep_spanning_window_boundary_charges_each_tick_once stdout ----

thread 'sleep_spanning_window_boundary_charges_each_tick_once' (21965) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2527:5:
assertion failed: report.ordinary_pipeline_events > 0

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (21938) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2172:5:
assertion `left == right` failed
  left: {ActorId(StableId("actor_anna")), ActorId(StableId("actor_mara")), ActorId(StableId("actor_tomas"))}
 right: {ActorId(StableId("actor_anna")), ActorId(StableId("actor_elena")), ActorId(StableId("actor_mara")), ActorId(StableId("actor_tomas"))}

failures:
    episode_tamper_proration_poisons_replay
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    sleep_spanning_window_boundary_charges_each_tick_once

test result: FAILED. 38 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.38s

*** result: Failure(101)
