*** crates/tracewake-core/src/agent/transaction.rs:469:5: replace actor_known_food_source_for_goal -> Option<String> with None

*** mutation diff:
--- crates/tracewake-core/src/agent/transaction.rs
+++ replace actor_known_food_source_for_goal -> Option<String> with None
@@ -461,26 +461,17 @@
         GoalKind::ContinueCurrentIntention | GoalKind::IdleWithReason => {
             PlannerGoal::WaitWithReason("actor_decision_reevaluation".to_string())
         }
         GoalKind::LeaveUnsafePlace => PlannerGoal::LeaveUnsafePlace,
     }
 }
 
 fn actor_known_food_source_for_goal(context: &ActorKnownPlanningContext) -> Option<String> {
-    context
-        .actor_known_facts()
-        .iter()
-        .find(|fact| {
-            fact.stable_id() == "actor_knows_food_source"
-                && fact.semantic_kind() == "observed_now"
-                && fact.is_actor_known()
-        })
-        .map(|fact| fact.value().to_string())
-        .or_else(|| context.known_food_sources().iter().next().cloned())
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn goal_for_routine_family(family: RoutineFamily) -> Option<GoalKind> {
     match family {
         RoutineFamily::SleepNight => Some(GoalKind::SleepOrRest),
         RoutineFamily::EatMeal => Some(GoalKind::Eat),
         RoutineFamily::FindFood => Some(GoalKind::FindFood),
         RoutineFamily::LeaveUnsafePlace => Some(GoalKind::LeaveUnsafePlace),

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (26037) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (26038) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2713:5:
assertion failed: has_event(&log, EventKind::FoodConsumed) ||
    has_event(&log, EventKind::EatFailed)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection

test result: FAILED. 40 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.51s

*** result: Failure(101)
