*** crates/tracewake-core/src/agent/transaction.rs:474:41: replace == with != in actor_known_food_source_for_goal

*** mutation diff:
--- crates/tracewake-core/src/agent/transaction.rs
+++ replace == with != in actor_known_food_source_for_goal
@@ -466,17 +466,17 @@
 }
 
 fn actor_known_food_source_for_goal(context: &ActorKnownPlanningContext) -> Option<String> {
     context
         .actor_known_facts()
         .iter()
         .find(|fact| {
             fact.stable_id() == "actor_knows_food_source"
-                && fact.semantic_kind() == "observed_now"
+                && fact.semantic_kind() != /* ~ changed by cargo-mutants ~ */ "observed_now"
                 && fact.is_actor_known()
         })
         .map(|fact| fact.value().to_string())
         .or_else(|| context.known_food_sources().iter().next().cloned())
 }
 
 fn goal_for_routine_family(family: RoutineFamily) -> Option<GoalKind> {
     match family {

---- agent::transaction::tests::food_goal_prefers_currently_observed_source_over_remembered_set_order stdout ----

thread 'agent::transaction::tests::food_goal_prefers_currently_observed_source_over_remembered_set_order' (18402) panicked at crates/tracewake-core/src/agent/transaction.rs:938:9:
assertion `left == right` failed
  left: Some("food_empty_pantry_mara")
 right: Some("food_stew_home_tomas")

failures:
    agent::transaction::tests::food_goal_prefers_currently_observed_source_over_remembered_set_order

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
