*** crates/tracewake-core/src/agent/transaction.rs:475:17: replace && with || in actor_known_food_source_for_goal

*** mutation diff:
--- crates/tracewake-core/src/agent/transaction.rs
+++ replace && with || in actor_known_food_source_for_goal
@@ -467,17 +467,17 @@
 
 fn actor_known_food_source_for_goal(context: &ActorKnownPlanningContext) -> Option<String> {
     context
         .actor_known_facts()
         .iter()
         .find(|fact| {
             fact.stable_id() == "actor_knows_food_source"
                 && fact.semantic_kind() == "observed_now"
-                && fact.is_actor_known()
+                || /* ~ changed by cargo-mutants ~ */ fact.is_actor_known()
         })
         .map(|fact| fact.value().to_string())
         .or_else(|| context.known_food_sources().iter().next().cloned())
 }
 
 fn goal_for_routine_family(family: RoutineFamily) -> Option<GoalKind> {
     match family {
         RoutineFamily::SleepNight => Some(GoalKind::SleepOrRest),

---- no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash stdout ----

thread 'no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash' (5869) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2904:5:
assertion failed: !records.is_empty()

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (5867) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2172:5:
assertion `left == right` failed
  left: {ActorId(StableId("actor_anna")), ActorId(StableId("actor_elena"))}
 right: {ActorId(StableId("actor_anna")), ActorId(StableId("actor_elena")), ActorId(StableId("actor_mara")), ActorId(StableId("actor_tomas"))}

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (5868) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2713:5:
assertion failed: has_event(&log, EventKind::FoodConsumed) ||
    has_event(&log, EventKind::EatFailed)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.28s

*** result: Failure(101)
