*** crates/tracewake-core/src/agent/transaction.rs:482:5: replace goal_for_routine_family -> Option<GoalKind> with None

*** mutation diff:
--- crates/tracewake-core/src/agent/transaction.rs
+++ replace goal_for_routine_family -> Option<GoalKind> with None
@@ -474,27 +474,17 @@
                 && fact.semantic_kind() == "observed_now"
                 && fact.is_actor_known()
         })
         .map(|fact| fact.value().to_string())
         .or_else(|| context.known_food_sources().iter().next().cloned())
 }
 
 fn goal_for_routine_family(family: RoutineFamily) -> Option<GoalKind> {
-    match family {
-        RoutineFamily::SleepNight => Some(GoalKind::SleepOrRest),
-        RoutineFamily::EatMeal => Some(GoalKind::Eat),
-        RoutineFamily::FindFood => Some(GoalKind::FindFood),
-        RoutineFamily::LeaveUnsafePlace => Some(GoalKind::LeaveUnsafePlace),
-        RoutineFamily::GoToWork => Some(GoalKind::GoToWork),
-        RoutineFamily::WorkBlock => Some(GoalKind::PerformWorkBlock),
-        RoutineFamily::ReturnHome => Some(GoalKind::ReturnHome),
-        RoutineFamily::ContinueCurrentIntention => Some(GoalKind::ContinueCurrentIntention),
-        RoutineFamily::MorningWake | RoutineFamily::Wait | RoutineFamily::IdleWithReason => None,
-    }
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn dangling_provenance_diagnostic(
     actor_id: &ActorId,
     tick: SimTick,
     actor_known_facts: &[crate::agent::ActorKnownFact],
     available_source_event_ids: &BTreeSet<EventId>,
 ) -> Option<StuckDiagnosticRecord> {

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (22723) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (22724) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2714:5:
assertion failed: has_event(&log, EventKind::ActorMoved)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection

test result: FAILED. 40 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.49s

*** result: Failure(101)
