*** crates/tracewake-core/src/agent/transaction.rs:501:5: replace dangling_provenance_diagnostic -> Option<StuckDiagnosticRecord> with None

*** mutation diff:
--- crates/tracewake-core/src/agent/transaction.rs
+++ replace dangling_provenance_diagnostic -> Option<StuckDiagnosticRecord> with None
@@ -493,65 +493,17 @@
 }
 
 fn dangling_provenance_diagnostic(
     actor_id: &ActorId,
     tick: SimTick,
     actor_known_facts: &[crate::agent::ActorKnownFact],
     available_source_event_ids: &BTreeSet<EventId>,
 ) -> Option<StuckDiagnosticRecord> {
-    let empty_witness_fact = actor_known_facts
-        .iter()
-        .find(|fact| fact.source_event_ids().is_empty());
-    let dangling = actor_known_facts
-        .iter()
-        .flat_map(|fact| fact.source_event_ids())
-        .find(|event_id| !available_source_event_ids.contains(*event_id));
-    let debug_only_details = if let Some(fact) = empty_witness_fact {
-        format!("empty_source_event_ids_fact={}", fact.stable_id())
-    } else {
-        let dangling = dangling?;
-        format!("dangling_source_event_id={}", dangling.as_str())
-    };
-    Some(
-        StuckDiagnosticRecord::new(
-            StuckDiagnosticId::new(format!(
-                "stuck_actor_decision_{}_{}",
-                actor_id.as_str(),
-                tick.value()
-            ))
-            .unwrap(),
-            actor_id.clone(),
-            tick,
-            tick.advance_by(1),
-            None,
-            None,
-            None,
-            None,
-            None,
-            None,
-            None,
-            BlockerCategory::Knowledge,
-            "provenance dangling",
-            "actor decision transaction rejected unresolved actor-known source event",
-            debug_only_details,
-            "typed_stuck_diagnostic",
-            StuckResultingStatus::Failed,
-        )
-        .with_typed_diagnostic(TypedDiagnosticFields {
-            responsible_layer: ResponsibleLayer::CandidateGeneration,
-            blocker_code: BlockerCode::ProvenanceDangling,
-            input_source: "actor_known_context".to_string(),
-            actual_source: "actor_decision_transaction".to_string(),
-            hidden_truth_referenced: false,
-            remediation_hint:
-                "rebuild actor-known facts only from events present in the decision log frontier"
-                    .to_string(),
-        }),
-    )
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn provenance_witness_mismatch_diagnostic(
     actor_id: &ActorId,
     tick: SimTick,
     actor_known_facts: &[crate::agent::ActorKnownFact],
     source_event_kinds: &BTreeMap<EventId, EventKind>,
 ) -> Option<StuckDiagnosticRecord> {

---- agent::transaction::tests::dangling_actor_known_source_event_fails_closed_before_proposal stdout ----

thread 'agent::transaction::tests::dangling_actor_known_source_event_fails_closed_before_proposal' (27069) panicked at crates/tracewake-core/src/agent/transaction.rs:1272:13:
expected dangling provenance stuck diagnostic

failures:
    agent::transaction::tests::dangling_actor_known_source_event_fails_closed_before_proposal

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
