*** crates/tracewake-core/src/agent/transaction.rs:507:26: delete ! in dangling_provenance_diagnostic

*** mutation diff:
--- crates/tracewake-core/src/agent/transaction.rs
+++ delete ! in dangling_provenance_diagnostic
@@ -499,17 +499,17 @@
     available_source_event_ids: &BTreeSet<EventId>,
 ) -> Option<StuckDiagnosticRecord> {
     let empty_witness_fact = actor_known_facts
         .iter()
         .find(|fact| fact.source_event_ids().is_empty());
     let dangling = actor_known_facts
         .iter()
         .flat_map(|fact| fact.source_event_ids())
-        .find(|event_id| !available_source_event_ids.contains(*event_id));
+        .find(|event_id|  /* ~ changed by cargo-mutants ~ */available_source_event_ids.contains(*event_id));
     let debug_only_details = if let Some(fact) = empty_witness_fact {
         format!("empty_source_event_ids_fact={}", fact.stable_id())
     } else {
         let dangling = dangling?;
         format!("dangling_source_event_id={}", dangling.as_str())
     };
     Some(
         StuckDiagnosticRecord::new(

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (31363) panicked at crates/tracewake-content/tests/fixtures_load.rs:1217:5:
assertion failed: report.ordinary_pipeline_events > 0

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
