*** crates/tracewake-core/src/agent/transaction.rs:558:5: replace provenance_witness_mismatch_diagnostic -> Option<StuckDiagnosticRecord> with None

*** mutation diff:
--- crates/tracewake-core/src/agent/transaction.rs
+++ replace provenance_witness_mismatch_diagnostic -> Option<StuckDiagnosticRecord> with None
@@ -550,67 +550,17 @@
 }
 
 fn provenance_witness_mismatch_diagnostic(
     actor_id: &ActorId,
     tick: SimTick,
     actor_known_facts: &[crate::agent::ActorKnownFact],
     source_event_kinds: &BTreeMap<EventId, EventKind>,
 ) -> Option<StuckDiagnosticRecord> {
-    let mismatch = actor_known_facts.iter().find_map(|fact| {
-        fact.source_event_ids().iter().find_map(|event_id| {
-            let event_kind = source_event_kinds.get(event_id)?;
-            if witness_kind_allowed(fact.stable_id(), event_kind) {
-                None
-            } else {
-                Some((fact, event_id, event_kind))
-            }
-        })
-    })?;
-    let (fact, event_id, event_kind) = mismatch;
-    Some(
-        StuckDiagnosticRecord::new(
-            StuckDiagnosticId::new(format!(
-                "stuck_actor_decision_{}_{}",
-                actor_id.as_str(),
-                tick.value()
-            ))
-            .unwrap(),
-            actor_id.clone(),
-            tick,
-            tick.advance_by(1),
-            None,
-            None,
-            None,
-            None,
-            None,
-            None,
-            None,
-            BlockerCategory::Knowledge,
-            "provenance witness mismatch",
-            "actor decision transaction rejected non-witnessing actor-known source event",
-            format!(
-                "fact={} source_event_id={} event_kind={}",
-                fact.stable_id(),
-                event_id.as_str(),
-                event_kind.stable_id()
-            ),
-            "typed_stuck_diagnostic",
-            StuckResultingStatus::Failed,
-        )
-        .with_typed_diagnostic(TypedDiagnosticFields {
-            responsible_layer: ResponsibleLayer::Projection,
-            blocker_code: BlockerCode::ProvenanceWitnessMismatch,
-            input_source: "actor_known_context".to_string(),
-            actual_source: "actor_decision_transaction".to_string(),
-            hidden_truth_referenced: false,
-            remediation_hint:
-                "cite source events whose event kind can witness the actor-known fact".to_string(),
-        }),
-    )
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn witness_kind_allowed(stable_id: &str, event_kind: &EventKind) -> bool {
     match stable_id {
         "actor_at_workplace"
         | "actor_current_place_visible"
         | "assigned_workplace_known"
         | "at_workplace"

---- agent::transaction::tests::provenance_witness_mismatch_fails_closed_before_proposal stdout ----

thread 'agent::transaction::tests::provenance_witness_mismatch_fails_closed_before_proposal' (3209) panicked at crates/tracewake-core/src/agent/transaction.rs:1372:9:
assertion `left == right` failed
  left: "no applicable method"
 right: "provenance witness mismatch"

---- agent::transaction::tests::provenance_witness_notice_only_workplace_presence_fails_closed_before_proposal stdout ----

thread 'agent::transaction::tests::provenance_witness_notice_only_workplace_presence_fails_closed_before_proposal' (3210) panicked at crates/tracewake-core/src/agent/transaction.rs:1424:9:
assertion `left == right` failed
  left: "no applicable method"
 right: "provenance witness mismatch"

---- agent::transaction::tests::provenance_witness_unlisted_stable_id_fails_closed_before_proposal stdout ----

thread 'agent::transaction::tests::provenance_witness_unlisted_stable_id_fails_closed_before_proposal' (3211) panicked at crates/tracewake-core/src/agent/transaction.rs:1474:9:
assertion `left == right` failed
  left: "no applicable method"
 right: "provenance witness mismatch"

failures:
    agent::transaction::tests::provenance_witness_mismatch_fails_closed_before_proposal
    agent::transaction::tests::provenance_witness_notice_only_workplace_presence_fails_closed_before_proposal
    agent::transaction::tests::provenance_witness_unlisted_stable_id_fails_closed_before_proposal

test result: FAILED. 452 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
