*** crates/tracewake-core/src/agent/transaction.rs:612:5: replace witness_kind_allowed -> bool with true

*** mutation diff:
--- crates/tracewake-core/src/agent/transaction.rs
+++ replace witness_kind_allowed -> bool with true
@@ -604,52 +604,17 @@
             hidden_truth_referenced: false,
             remediation_hint:
                 "cite source events whose event kind can witness the actor-known fact".to_string(),
         }),
     )
 }
 
 fn witness_kind_allowed(stable_id: &str, event_kind: &EventKind) -> bool {
-    match stable_id {
-        "actor_at_workplace"
-        | "actor_current_place_visible"
-        | "assigned_workplace_known"
-        | "at_workplace"
-        | "known_route_surface" => *event_kind == EventKind::ObservationRecorded,
-        "agent_needs_present" => *event_kind == EventKind::NeedDeltaApplied,
-        "actor_knows_food_source" | "food_source_believed_accessible" => matches!(
-            event_kind,
-            EventKind::ObservationRecorded | EventKind::StartingBeliefRecorded
-        ),
-        "actor_knows_sleep_affordance"
-        | "actor_knows_sleep_place"
-        | "sleep_place_believed_accessible" => matches!(
-            event_kind,
-            EventKind::ObservationRecorded | EventKind::StartingBeliefRecorded
-        ),
-        "actor_knows_workplace"
-        | "workplace_assignment_active"
-        | "workplace_believed_accessible" => *event_kind == EventKind::RoleAssignmentNoticeRecorded,
-        "actor_belief_projection_limitation"
-        | "modeled_wait_reason"
-        | "reevaluation_window_known" => matches!(
-            event_kind,
-            EventKind::NoHumanDayStarted | EventKind::NoHumanAdvanceStarted
-        ),
-        "active_intention_present" | "next_step_available" => matches!(
-            event_kind,
-            EventKind::IntentionStarted
-                | EventKind::IntentionContinued
-                | EventKind::IntentionResumed
-                | EventKind::NoHumanDayStarted
-                | EventKind::NoHumanAdvanceStarted
-        ),
-        _ => false,
-    }
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn provenance_class_mismatch_diagnostic(
     actor_id: &ActorId,
     tick: SimTick,
     actor_known_facts: &[crate::agent::ActorKnownFact],
 ) -> Option<StuckDiagnosticRecord> {
     let stale_observation = actor_known_facts.iter().find(|fact| {

---- agent::transaction::tests::provenance_witness_notice_only_workplace_presence_fails_closed_before_proposal stdout ----

thread 'agent::transaction::tests::provenance_witness_notice_only_workplace_presence_fails_closed_before_proposal' (7782) panicked at crates/tracewake-core/src/agent/transaction.rs:1439:9:
assertion `left == right` failed
  left: "no applicable method"
 right: "provenance witness mismatch"

---- agent::transaction::tests::provenance_witness_unlisted_stable_id_fails_closed_before_proposal stdout ----

thread 'agent::transaction::tests::provenance_witness_unlisted_stable_id_fails_closed_before_proposal' (7783) panicked at crates/tracewake-core/src/agent/transaction.rs:1489:9:
assertion `left == right` failed
  left: "no applicable method"
 right: "provenance witness mismatch"

---- agent::transaction::tests::provenance_witness_mismatch_fails_closed_before_proposal stdout ----

thread 'agent::transaction::tests::provenance_witness_mismatch_fails_closed_before_proposal' (7781) panicked at crates/tracewake-core/src/agent/transaction.rs:1387:9:
assertion `left == right` failed
  left: "no applicable method"
 right: "provenance witness mismatch"

failures:
    agent::transaction::tests::provenance_witness_mismatch_fails_closed_before_proposal
    agent::transaction::tests::provenance_witness_notice_only_workplace_presence_fails_closed_before_proposal
    agent::transaction::tests::provenance_witness_unlisted_stable_id_fails_closed_before_proposal
    agent::transaction::tests::witness_kind_allowlist_covers_no_human_intention_and_need_sources

test result: FAILED. 451 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
