*** crates/tracewake-core/src/agent/transaction.rs:612:5: replace witness_kind_allowed -> bool with false

*** mutation diff:
--- crates/tracewake-core/src/agent/transaction.rs
+++ replace witness_kind_allowed -> bool with false
@@ -604,52 +604,17 @@
             hidden_truth_referenced: false,
             remediation_hint:
                 "cite source events whose event kind can witness the actor-known fact".to_string(),
         }),
     )
 }
 
 fn witness_kind_allowed(stable_id: &str, event_kind: &EventKind) -> bool {
-    match stable_id {
-        "actor_at_workplace"
-        | "actor_current_place_visible"
-        | "assigned_workplace_known"
-        | "at_workplace"
-        | "known_route_surface" => *event_kind == EventKind::ObservationRecorded,
-        "agent_needs_present" => *event_kind == EventKind::NeedDeltaApplied,
-        "actor_knows_food_source" | "food_source_believed_accessible" => matches!(
-            event_kind,
-            EventKind::ObservationRecorded | EventKind::StartingBeliefRecorded
-        ),
-        "actor_knows_sleep_affordance"
-        | "actor_knows_sleep_place"
-        | "sleep_place_believed_accessible" => matches!(
-            event_kind,
-            EventKind::ObservationRecorded | EventKind::StartingBeliefRecorded
-        ),
-        "actor_knows_workplace"
-        | "workplace_assignment_active"
-        | "workplace_believed_accessible" => *event_kind == EventKind::RoleAssignmentNoticeRecorded,
-        "actor_belief_projection_limitation"
-        | "modeled_wait_reason"
-        | "reevaluation_window_known" => matches!(
-            event_kind,
-            EventKind::NoHumanDayStarted | EventKind::NoHumanAdvanceStarted
-        ),
-        "active_intention_present" | "next_step_available" => matches!(
-            event_kind,
-            EventKind::IntentionStarted
-                | EventKind::IntentionContinued
-                | EventKind::IntentionResumed
-                | EventKind::NoHumanDayStarted
-                | EventKind::NoHumanAdvanceStarted
-        ),
-        _ => false,
-    }
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn provenance_class_mismatch_diagnostic(
     actor_id: &ActorId,
     tick: SimTick,
     actor_known_facts: &[crate::agent::ActorKnownFact],
 ) -> Option<StuckDiagnosticRecord> {
     let stale_observation = actor_known_facts.iter().find(|fact| {

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (12057) panicked at crates/tracewake-content/tests/fixtures_load.rs:1217:5:
assertion failed: report.ordinary_pipeline_events > 0

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
