*** crates/tracewake-core/src/agent/transaction.rs:617:48: replace == with != in witness_kind_allowed

*** mutation diff:
--- crates/tracewake-core/src/agent/transaction.rs
+++ replace == with != in witness_kind_allowed
@@ -609,17 +609,17 @@
 }
 
 fn witness_kind_allowed(stable_id: &str, event_kind: &EventKind) -> bool {
     match stable_id {
         "actor_at_workplace"
         | "actor_current_place_visible"
         | "assigned_workplace_known"
         | "at_workplace"
-        | "known_route_surface" => *event_kind == EventKind::ObservationRecorded,
+        | "known_route_surface" => *event_kind != /* ~ changed by cargo-mutants ~ */ EventKind::ObservationRecorded,
         "agent_needs_present" => *event_kind == EventKind::NeedDeltaApplied,
         "actor_knows_food_source" | "food_source_believed_accessible" => matches!(
             event_kind,
             EventKind::ObservationRecorded | EventKind::StartingBeliefRecorded
         ),
         "actor_knows_sleep_affordance"
         | "actor_knows_sleep_place"
         | "sleep_place_believed_accessible" => matches!(

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (12110) panicked at crates/tracewake-content/tests/fixtures_load.rs:1217:5:
assertion failed: report.ordinary_pipeline_events > 0

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
