*** crates/tracewake-core/src/agent/transaction.rs:618:9: delete match arm "agent_needs_present" in witness_kind_allowed

*** mutation diff:
--- crates/tracewake-core/src/agent/transaction.rs
+++ delete match arm "agent_needs_present" in witness_kind_allowed
@@ -610,17 +610,17 @@
 
 fn witness_kind_allowed(stable_id: &str, event_kind: &EventKind) -> bool {
     match stable_id {
         "actor_at_workplace"
         | "actor_current_place_visible"
         | "assigned_workplace_known"
         | "at_workplace"
         | "known_route_surface" => *event_kind == EventKind::ObservationRecorded,
-        "agent_needs_present" => *event_kind == EventKind::NeedDeltaApplied,
+         /* ~ changed by cargo-mutants ~ */
         "actor_knows_food_source" | "food_source_believed_accessible" => matches!(
             event_kind,
             EventKind::ObservationRecorded | EventKind::StartingBeliefRecorded
         ),
         "actor_knows_sleep_affordance"
         | "actor_knows_sleep_place"
         | "sleep_place_believed_accessible" => matches!(
             event_kind,

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (20161) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (20162) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2714:5:
assertion failed: has_event(&log, EventKind::ActorMoved)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection

test result: FAILED. 40 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
