*** crates/tracewake-core/src/agent/transaction.rs:619:9: delete match arm "actor_knows_food_source" | "food_source_believed_accessible" in witness_kind_allowed

*** mutation diff:
--- crates/tracewake-core/src/agent/transaction.rs
+++ delete match arm "actor_knows_food_source" | "food_source_believed_accessible" in witness_kind_allowed
@@ -611,20 +611,17 @@
 fn witness_kind_allowed(stable_id: &str, event_kind: &EventKind) -> bool {
     match stable_id {
         "actor_at_workplace"
         | "actor_current_place_visible"
         | "assigned_workplace_known"
         | "at_workplace"
         | "known_route_surface" => *event_kind == EventKind::ObservationRecorded,
         "agent_needs_present" => *event_kind == EventKind::NeedDeltaApplied,
-        "actor_knows_food_source" | "food_source_believed_accessible" => matches!(
-            event_kind,
-            EventKind::ObservationRecorded | EventKind::StartingBeliefRecorded
-        ),
+         /* ~ changed by cargo-mutants ~ */
         "actor_knows_sleep_affordance"
         | "actor_knows_sleep_place"
         | "sleep_place_believed_accessible" => matches!(
             event_kind,
             EventKind::ObservationRecorded | EventKind::StartingBeliefRecorded
         ),
         "actor_knows_workplace"
         | "workplace_assignment_active"

---- no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash stdout ----

thread 'no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash' (24262) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2904:5:
assertion failed: !records.is_empty()

---- no_human_decision_context_hash_gate_fails_when_source_evidence_tampered stdout ----

thread 'no_human_decision_context_hash_gate_fails_when_source_evidence_tampered' (24263) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:811:5:
fixture contains decision trace event

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (24260) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2154:5:
assertion failed: report.ordinary_pipeline_events > 0

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash
    no_human_decision_context_hash_gate_fails_when_source_evidence_tampered

test result: FAILED. 38 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.11s

*** result: Failure(101)
