*** crates/tracewake-core/src/agent/transaction.rs:623:9: delete match arm "actor_knows_sleep_affordance" | "actor_knows_sleep_place" | "sleep_place_believed_accessible" in witness_kind_allowed

*** mutation diff:
--- crates/tracewake-core/src/agent/transaction.rs
+++ delete match arm "actor_knows_sleep_affordance" | "actor_knows_sleep_place" | "sleep_place_believed_accessible" in witness_kind_allowed
@@ -615,22 +615,17 @@
         | "assigned_workplace_known"
         | "at_workplace"
         | "known_route_surface" => *event_kind == EventKind::ObservationRecorded,
         "agent_needs_present" => *event_kind == EventKind::NeedDeltaApplied,
         "actor_knows_food_source" | "food_source_believed_accessible" => matches!(
             event_kind,
             EventKind::ObservationRecorded | EventKind::StartingBeliefRecorded
         ),
-        "actor_knows_sleep_affordance"
-        | "actor_knows_sleep_place"
-        | "sleep_place_believed_accessible" => matches!(
-            event_kind,
-            EventKind::ObservationRecorded | EventKind::StartingBeliefRecorded
-        ),
+         /* ~ changed by cargo-mutants ~ */
         "actor_knows_workplace"
         | "workplace_assignment_active"
         | "workplace_believed_accessible" => *event_kind == EventKind::RoleAssignmentNoticeRecorded,
         "actor_belief_projection_limitation"
         | "modeled_wait_reason"
         | "reevaluation_window_known" => matches!(
             event_kind,
             EventKind::NoHumanDayStarted | EventKind::NoHumanAdvanceStarted

---- episode_tamper_proration_poisons_replay stdout ----

thread 'episode_tamper_proration_poisons_replay' (28352) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2851:5:
assertion failed: has_event(&log, EventKind::SleepInterrupted)

---- sleep_spanning_window_boundary_charges_each_tick_once stdout ----

thread 'sleep_spanning_window_boundary_charges_each_tick_once' (28386) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2527:5:
assertion failed: report.ordinary_pipeline_events > 0

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (28359) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2172:5:
assertion `left == right` failed
  left: {ActorId(StableId("actor_anna")), ActorId(StableId("actor_mara")), ActorId(StableId("actor_tomas"))}
 right: {ActorId(StableId("actor_anna")), ActorId(StableId("actor_elena")), ActorId(StableId("actor_mara")), ActorId(StableId("actor_tomas"))}

failures:
    episode_tamper_proration_poisons_replay
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    sleep_spanning_window_boundary_charges_each_tick_once

test result: FAILED. 38 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.35s

*** result: Failure(101)
