*** crates/tracewake-core/src/agent/transaction.rs:631:58: replace == with != in witness_kind_allowed

*** mutation diff:
--- crates/tracewake-core/src/agent/transaction.rs
+++ replace == with != in witness_kind_allowed
@@ -623,17 +623,17 @@
         "actor_knows_sleep_affordance"
         | "actor_knows_sleep_place"
         | "sleep_place_believed_accessible" => matches!(
             event_kind,
             EventKind::ObservationRecorded | EventKind::StartingBeliefRecorded
         ),
         "actor_knows_workplace"
         | "workplace_assignment_active"
-        | "workplace_believed_accessible" => *event_kind == EventKind::RoleAssignmentNoticeRecorded,
+        | "workplace_believed_accessible" => *event_kind != /* ~ changed by cargo-mutants ~ */ EventKind::RoleAssignmentNoticeRecorded,
         "actor_belief_projection_limitation"
         | "modeled_wait_reason"
         | "reevaluation_window_known" => matches!(
             event_kind,
             EventKind::NoHumanDayStarted | EventKind::NoHumanAdvanceStarted
         ),
         "active_intention_present" | "next_step_available" => matches!(
             event_kind,

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (20282) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2172:5:
assertion `left == right` failed
  left: {ActorId(StableId("actor_elena")), ActorId(StableId("actor_mara"))}
 right: {ActorId(StableId("actor_anna")), ActorId(StableId("actor_elena")), ActorId(StableId("actor_mara")), ActorId(StableId("actor_tomas"))}

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (20283) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2714:5:
assertion failed: has_event(&log, EventKind::ActorMoved)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection

test result: FAILED. 40 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.27s

*** result: Failure(101)
