*** crates/tracewake-core/src/agent/transaction.rs:632:9: delete match arm "actor_belief_projection_limitation" | "modeled_wait_reason" | "reevaluation_window_known" in witness_kind_allowed

*** mutation diff:
--- crates/tracewake-core/src/agent/transaction.rs
+++ delete match arm "actor_belief_projection_limitation" | "modeled_wait_reason" | "reevaluation_window_known" in witness_kind_allowed
@@ -624,22 +624,17 @@
         | "actor_knows_sleep_place"
         | "sleep_place_believed_accessible" => matches!(
             event_kind,
             EventKind::ObservationRecorded | EventKind::StartingBeliefRecorded
         ),
         "actor_knows_workplace"
         | "workplace_assignment_active"
         | "workplace_believed_accessible" => *event_kind == EventKind::RoleAssignmentNoticeRecorded,
-        "actor_belief_projection_limitation"
-        | "modeled_wait_reason"
-        | "reevaluation_window_known" => matches!(
-            event_kind,
-            EventKind::NoHumanDayStarted | EventKind::NoHumanAdvanceStarted
-        ),
+         /* ~ changed by cargo-mutants ~ */
         "active_intention_present" | "next_step_available" => matches!(
             event_kind,
             EventKind::IntentionStarted
                 | EventKind::IntentionContinued
                 | EventKind::IntentionResumed
                 | EventKind::NoHumanDayStarted
                 | EventKind::NoHumanAdvanceStarted
         ),

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (4047) panicked at crates/tracewake-content/tests/fixtures_load.rs:1217:5:
assertion failed: report.ordinary_pipeline_events > 0

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
