*** crates/tracewake-core/src/agent/transaction.rs:638:9: delete match arm "active_intention_present" | "next_step_available" in witness_kind_allowed

*** mutation diff:
--- crates/tracewake-core/src/agent/transaction.rs
+++ delete match arm "active_intention_present" | "next_step_available" in witness_kind_allowed
@@ -630,24 +630,17 @@
         | "workplace_assignment_active"
         | "workplace_believed_accessible" => *event_kind == EventKind::RoleAssignmentNoticeRecorded,
         "actor_belief_projection_limitation"
         | "modeled_wait_reason"
         | "reevaluation_window_known" => matches!(
             event_kind,
             EventKind::NoHumanDayStarted | EventKind::NoHumanAdvanceStarted
         ),
-        "active_intention_present" | "next_step_available" => matches!(
-            event_kind,
-            EventKind::IntentionStarted
-                | EventKind::IntentionContinued
-                | EventKind::IntentionResumed
-                | EventKind::NoHumanDayStarted
-                | EventKind::NoHumanAdvanceStarted
-        ),
+         /* ~ changed by cargo-mutants ~ */
         _ => false,
     }
 }
 
 fn provenance_class_mismatch_diagnostic(
     actor_id: &ActorId,
     tick: SimTick,
     actor_known_facts: &[crate::agent::ActorKnownFact],

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (8079) panicked at crates/tracewake-content/tests/fixtures_load.rs:1217:5:
assertion failed: report.ordinary_pipeline_events > 0

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
