*** crates/tracewake-core/src/agent/transaction.rs:655:5: replace provenance_class_mismatch_diagnostic -> Option<StuckDiagnosticRecord> with None

*** mutation diff:
--- crates/tracewake-core/src/agent/transaction.rs
+++ replace provenance_class_mismatch_diagnostic -> Option<StuckDiagnosticRecord> with None
@@ -647,62 +647,17 @@
     }
 }
 
 fn provenance_class_mismatch_diagnostic(
     actor_id: &ActorId,
     tick: SimTick,
     actor_known_facts: &[crate::agent::ActorKnownFact],
 ) -> Option<StuckDiagnosticRecord> {
-    let stale_observation = actor_known_facts.iter().find(|fact| {
-        matches!(fact.provenance(), ActorKnownProvenance::ObservedNow { .. })
-            && fact.tick().is_some_and(|fact_tick| fact_tick < tick)
-    })?;
-    Some(
-        StuckDiagnosticRecord::new(
-            StuckDiagnosticId::new(format!(
-                "stuck_actor_decision_{}_{}",
-                actor_id.as_str(),
-                tick.value()
-            ))
-            .unwrap(),
-            actor_id.clone(),
-            tick,
-            tick.advance_by(1),
-            None,
-            None,
-            None,
-            None,
-            None,
-            None,
-            None,
-            BlockerCategory::Knowledge,
-            "provenance class mismatch",
-            "actor decision transaction rejected stale fact stamped observed_now",
-            format!(
-                "stale_observed_now_fact={} tick={}",
-                stale_observation.stable_id(),
-                stale_observation
-                    .tick()
-                    .map_or_else(|| "none".to_string(), |tick| tick.value().to_string())
-            ),
-            "typed_stuck_diagnostic",
-            StuckResultingStatus::Failed,
-        )
-        .with_typed_diagnostic(TypedDiagnosticFields {
-            responsible_layer: ResponsibleLayer::Projection,
-            blocker_code: BlockerCode::ProvenanceClassMismatch,
-            input_source: "actor_known_context".to_string(),
-            actual_source: "actor_decision_transaction".to_string(),
-            hidden_truth_referenced: false,
-            remediation_hint:
-                "mint stale projection records as remembered_belief with their source tick"
-                    .to_string(),
-        }),
-    )
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn stuck_diagnostic_for_hidden_truth_audit(
     actor_id: &ActorId,
     tick: SimTick,
     active_goal: &CandidateGoal,
     trace: &DecisionTrace,
 ) -> StuckDiagnosticRecord {

---- agent::transaction::tests::provenance_class_mismatch_fails_closed_before_proposal stdout ----

thread 'agent::transaction::tests::provenance_class_mismatch_fails_closed_before_proposal' (24621) panicked at crates/tracewake-core/src/agent/transaction.rs:1323:13:
expected provenance class mismatch stuck diagnostic

failures:
    agent::transaction::tests::provenance_class_mismatch_fails_closed_before_proposal

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
