*** crates/tracewake-core/src/agent/transaction.rs:657:13: replace && with || in provenance_class_mismatch_diagnostic

*** mutation diff:
--- crates/tracewake-core/src/agent/transaction.rs
+++ replace && with || in provenance_class_mismatch_diagnostic
@@ -649,17 +649,17 @@
 
 fn provenance_class_mismatch_diagnostic(
     actor_id: &ActorId,
     tick: SimTick,
     actor_known_facts: &[crate::agent::ActorKnownFact],
 ) -> Option<StuckDiagnosticRecord> {
     let stale_observation = actor_known_facts.iter().find(|fact| {
         matches!(fact.provenance(), ActorKnownProvenance::ObservedNow { .. })
-            && fact.tick().is_some_and(|fact_tick| fact_tick < tick)
+            || /* ~ changed by cargo-mutants ~ */ fact.tick().is_some_and(|fact_tick| fact_tick < tick)
     })?;
     Some(
         StuckDiagnosticRecord::new(
             StuckDiagnosticId::new(format!(
                 "stuck_actor_decision_{}_{}",
                 actor_id.as_str(),
                 tick.value()
             ))

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (28910) panicked at crates/tracewake-content/tests/fixtures_load.rs:1217:5:
assertion failed: report.ordinary_pipeline_events > 0

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
