*** crates/tracewake-core/src/agent/transaction.rs:657:62: replace < with > in provenance_class_mismatch_diagnostic

*** mutation diff:
--- crates/tracewake-core/src/agent/transaction.rs
+++ replace < with > in provenance_class_mismatch_diagnostic
@@ -649,17 +649,17 @@
 
 fn provenance_class_mismatch_diagnostic(
     actor_id: &ActorId,
     tick: SimTick,
     actor_known_facts: &[crate::agent::ActorKnownFact],
 ) -> Option<StuckDiagnosticRecord> {
     let stale_observation = actor_known_facts.iter().find(|fact| {
         matches!(fact.provenance(), ActorKnownProvenance::ObservedNow { .. })
-            && fact.tick().is_some_and(|fact_tick| fact_tick < tick)
+            && fact.tick().is_some_and(|fact_tick| fact_tick > /* ~ changed by cargo-mutants ~ */ tick)
     })?;
     Some(
         StuckDiagnosticRecord::new(
             StuckDiagnosticId::new(format!(
                 "stuck_actor_decision_{}_{}",
                 actor_id.as_str(),
                 tick.value()
             ))

---- agent::transaction::tests::provenance_class_mismatch_fails_closed_before_proposal stdout ----

thread 'agent::transaction::tests::provenance_class_mismatch_fails_closed_before_proposal' (4786) panicked at crates/tracewake-core/src/agent/transaction.rs:1368:13:
expected provenance class mismatch stuck diagnostic

failures:
    agent::transaction::tests::provenance_class_mismatch_fails_closed_before_proposal

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
