*** crates/tracewake-core/src/agent/transaction.rs:74:9: replace SealedProposal::target_ids -> &[String] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/tracewake-core/src/agent/transaction.rs
+++ replace SealedProposal::target_ids -> &[String] with Vec::leak(Vec::new())
@@ -66,17 +66,17 @@
         &self.proposal.proposal_id
     }
 
     pub fn action_id(&self) -> &crate::ids::ActionId {
         &self.proposal.action_id
     }
 
     pub fn target_ids(&self) -> &[String] {
-        &self.proposal.target_ids
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn parameters(&self) -> &BTreeMap<String, String> {
         &self.proposal.parameters
     }
 
     pub fn into_proposal(self) -> Proposal {
         self.proposal

---- agent::transaction::tests::severe_safety_with_known_exit_proposes_move_before_hunger stdout ----

thread 'agent::transaction::tests::severe_safety_with_known_exit_proposes_move_before_hunger' (15979) panicked at crates/tracewake-core/src/agent/transaction.rs:1564:9:
assertion `left == right` failed
  left: []
 right: ["workshop_tomas"]

---- agent::transaction::tests::transaction_links_candidate_intention_method_plan_and_proposal stdout ----

thread 'agent::transaction::tests::transaction_links_candidate_intention_method_plan_and_proposal' (15982) panicked at crates/tracewake-core/src/agent/transaction.rs:1229:9:
assertion `left == right` failed
  left: []
 right: ["food_stew"]

failures:
    agent::transaction::tests::severe_safety_with_known_exit_proposes_move_before_hunger
    agent::transaction::tests::transaction_links_candidate_intention_method_plan_and_proposal

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
