*** crates/tracewake-core/src/agent/transaction.rs:754:9: delete match arm "no applicable candidate" in stuck_diagnostic

*** mutation diff:
--- crates/tracewake-core/src/agent/transaction.rs
+++ delete match arm "no applicable candidate" in stuck_diagnostic
@@ -746,20 +746,17 @@
     tick: SimTick,
     active_goal: Option<&CandidateGoal>,
     routine_step: Option<RoutineStep>,
     concrete_blocker: impl Into<String>,
     debug: impl Into<String>,
 ) -> StuckDiagnosticRecord {
     let concrete_blocker = concrete_blocker.into();
     let (responsible_layer, blocker_code) = match concrete_blocker.as_str() {
-        "no applicable candidate" => (
-            ResponsibleLayer::CandidateGeneration,
-            BlockerCode::NoApplicableCandidate,
-        ),
+         /* ~ changed by cargo-mutants ~ */
         "no applicable method" => (
             ResponsibleLayer::MethodSelection,
             BlockerCode::NoApplicableMethod,
         ),
         "empty local plan" => (ResponsibleLayer::LocalPlanning, BlockerCode::EmptyLocalPlan),
         _ => (
             ResponsibleLayer::LocalPlanning,
             BlockerCode::PlannerBudgetExhausted,

---- agent::transaction::tests::stuck_diagnostic_maps_candidate_and_local_plan_blockers stdout ----

thread 'agent::transaction::tests::stuck_diagnostic_maps_candidate_and_local_plan_blockers' (13407) panicked at crates/tracewake-core/src/agent/transaction.rs:1158:9:
assertion `left == right` failed
  left: LocalPlanning
 right: CandidateGeneration

failures:
    agent::transaction::tests::stuck_diagnostic_maps_candidate_and_local_plan_blockers

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
