*** crates/tracewake-core/src/agent/transaction.rs:758:9: delete match arm "no applicable method" in stuck_diagnostic

*** mutation diff:
--- crates/tracewake-core/src/agent/transaction.rs
+++ delete match arm "no applicable method" in stuck_diagnostic
@@ -750,20 +750,17 @@
     debug: impl Into<String>,
 ) -> StuckDiagnosticRecord {
     let concrete_blocker = concrete_blocker.into();
     let (responsible_layer, blocker_code) = match concrete_blocker.as_str() {
         "no applicable candidate" => (
             ResponsibleLayer::CandidateGeneration,
             BlockerCode::NoApplicableCandidate,
         ),
-        "no applicable method" => (
-            ResponsibleLayer::MethodSelection,
-            BlockerCode::NoApplicableMethod,
-        ),
+         /* ~ changed by cargo-mutants ~ */
         "empty local plan" => (ResponsibleLayer::LocalPlanning, BlockerCode::EmptyLocalPlan),
         _ => (
             ResponsibleLayer::LocalPlanning,
             BlockerCode::PlannerBudgetExhausted,
         ),
     };
     StuckDiagnosticRecord::new(
         StuckDiagnosticId::new(format!(

---- agent::transaction::tests::duplicate_failed_candidates_are_retired_together stdout ----

thread 'agent::transaction::tests::duplicate_failed_candidates_are_retired_together' (17956) panicked at crates/tracewake-core/src/agent/transaction.rs:1642:9:
assertion `left == right` failed
  left: LocalPlanning
 right: MethodSelection

failures:
    agent::transaction::tests::duplicate_failed_candidates_are_retired_together

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
