*** crates/tracewake-core/src/agent/transaction.rs:762:9: delete match arm "empty local plan" in stuck_diagnostic

*** mutation diff:
--- crates/tracewake-core/src/agent/transaction.rs
+++ delete match arm "empty local plan" in stuck_diagnostic
@@ -754,17 +754,17 @@
         "no applicable candidate" => (
             ResponsibleLayer::CandidateGeneration,
             BlockerCode::NoApplicableCandidate,
         ),
         "no applicable method" => (
             ResponsibleLayer::MethodSelection,
             BlockerCode::NoApplicableMethod,
         ),
-        "empty local plan" => (ResponsibleLayer::LocalPlanning, BlockerCode::EmptyLocalPlan),
+         /* ~ changed by cargo-mutants ~ */
         _ => (
             ResponsibleLayer::LocalPlanning,
             BlockerCode::PlannerBudgetExhausted,
         ),
     };
     StuckDiagnosticRecord::new(
         StuckDiagnosticId::new(format!(
             "stuck_actor_decision_{}_{}",

---- agent::transaction::tests::stuck_diagnostic_maps_candidate_and_local_plan_blockers stdout ----

thread 'agent::transaction::tests::stuck_diagnostic_maps_candidate_and_local_plan_blockers' (22525) panicked at crates/tracewake-core/src/agent/transaction.rs:1182:9:
assertion `left == right` failed
  left: PlannerBudgetExhausted
 right: EmptyLocalPlan

failures:
    agent::transaction::tests::stuck_diagnostic_maps_candidate_and_local_plan_blockers

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
