*** crates/tracewake-core/src/agent/transaction.rs:78:9: replace SealedProposal::parameters -> &BTreeMap<String, String> with Box::leak(Box::new(BTreeMap::from_iter([("xyzzy".into(), "xyzzy".into())])))

*** mutation diff:
--- crates/tracewake-core/src/agent/transaction.rs
+++ replace SealedProposal::parameters -> &BTreeMap<String, String> with Box::leak(Box::new(BTreeMap::from_iter([("xyzzy".into(), "xyzzy".into())])))
@@ -70,17 +70,17 @@
         &self.proposal.action_id
     }
 
     pub fn target_ids(&self) -> &[String] {
         &self.proposal.target_ids
     }
 
     pub fn parameters(&self) -> &BTreeMap<String, String> {
-        &self.proposal.parameters
+        Box::leak(Box::new(BTreeMap::from_iter([("xyzzy".into(), "xyzzy".into())]))) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn into_proposal(self) -> Proposal {
         self.proposal
     }
 }
 
 pub struct ActorDecisionTransaction;

---- agent::transaction::tests::transaction_links_candidate_intention_method_plan_and_proposal stdout ----

thread 'agent::transaction::tests::transaction_links_candidate_intention_method_plan_and_proposal' (15428) panicked at crates/tracewake-core/src/agent/transaction.rs:1218:9:
assertion `left == right` failed
  left: None
 right: Some("goal_actor_tomas_12_eat")

---- agent::transaction::tests::severe_safety_with_known_exit_proposes_move_before_hunger stdout ----

thread 'agent::transaction::tests::severe_safety_with_known_exit_proposes_move_before_hunger' (15425) panicked at crates/tracewake-core/src/agent/transaction.rs:1568:9:
assertion `left == right` failed
  left: None
 right: Some("goal_actor_tomas_16_leave_unsafe_place")

failures:
    agent::transaction::tests::severe_safety_with_known_exit_proposes_move_before_hunger
    agent::transaction::tests::transaction_links_candidate_intention_method_plan_and_proposal

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
