*** crates/tracewake-core/src/checksum.rs:146:22: replace ^= with |= in PhysicalChecksum::from_canonical_lines

*** mutation diff:
--- crates/tracewake-core/src/checksum.rs
+++ replace ^= with |= in PhysicalChecksum::from_canonical_lines
@@ -138,17 +138,17 @@
     pub fn as_str(&self) -> &str {
         &self.0
     }
 
     pub fn from_canonical_lines(lines: &[String]) -> Self {
         let mut hash = 0xcbf2_9ce4_8422_2325_u64;
         for line in lines {
             for byte in line.as_bytes().iter().copied().chain([b'\n']) {
-                hash ^= u64::from(byte);
+                hash |= /* ~ changed by cargo-mutants ~ */ u64::from(byte);
                 hash = hash.wrapping_mul(0x0000_0100_0000_01b3);
             }
         }
         Self(format!("twc1-{hash:016x}"))
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq)]

---- checksum::tests::agent_checksum_changes_for_each_authoritative_field_family stdout ----

thread 'checksum::tests::agent_checksum_changes_for_each_authoritative_field_family' (6374) panicked at crates/tracewake-core/src/checksum.rs:847:9:
assertion `left != right` failed
  left: AgentStateChecksum("twa1-1ec2b47405f5550d")
 right: AgentStateChecksum("twa1-1ec2b47405f5550d")

---- replay::rebuild::tests::agent_state_rebuild_is_deterministic_and_catches_need_delta_divergence stdout ----

thread 'replay::rebuild::tests::agent_state_rebuild_is_deterministic_and_catches_need_delta_divergence' (6535) panicked at crates/tracewake-core/src/replay/rebuild.rs:947:9:
assertion `left != right` failed
  left: AgentStateChecksum("twa1-0f6a7cebd8aae5bd")
 right: AgentStateChecksum("twa1-0f6a7cebd8aae5bd")

failures:
    checksum::tests::agent_checksum_changes_for_each_authoritative_field_family
    replay::rebuild::tests::agent_state_rebuild_is_deterministic_and_catches_need_delta_divergence

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
