*** crates/tracewake-core/src/checksum.rs:563:5: replace join_ids -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-core/src/checksum.rs
+++ replace join_ids -> String with "xyzzy".into()
@@ -555,17 +555,17 @@
     let hash = HolderKnownContextHash::from_canonical_lines(&lines);
     HolderKnownContextHashReport {
         hash,
         canonical_input: lines,
     }
 }
 
 fn join_ids<'a>(ids: impl Iterator<Item = &'a str>) -> String {
-    ids.collect::<Vec<_>>().join(",")
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 fn join_pairs(pairs: &[(String, String)]) -> String {
     pairs
         .iter()
         .map(|(key, value)| format!("{}:{}={}:{}", key.len(), key, value.len(), value))
         .collect::<Vec<_>>()
         .join(";")

---- checksum::tests::physical_checksum_changes_for_each_authoritative_field_family stdout ----

thread 'checksum::tests::physical_checksum_changes_for_each_authoritative_field_family' (5748) panicked at crates/tracewake-core/src/checksum.rs:839:9:
assertion `left != right` failed
  left: PhysicalChecksum("twc1-1660286e457c5ce8")
 right: PhysicalChecksum("twc1-1660286e457c5ce8")

failures:
    checksum::tests::physical_checksum_changes_for_each_authoritative_field_family

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
