*** crates/tracewake-core/src/checksum.rs:567:5: replace join_pairs -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-core/src/checksum.rs
+++ replace join_pairs -> String with "xyzzy".into()
@@ -559,21 +559,17 @@
     }
 }
 
 fn join_ids<'a>(ids: impl Iterator<Item = &'a str>) -> String {
     ids.collect::<Vec<_>>().join(",")
 }
 
 fn join_pairs(pairs: &[(String, String)]) -> String {
-    pairs
-        .iter()
-        .map(|(key, value)| format!("{}:{}={}:{}", key.len(), key, value.len(), value))
-        .collect::<Vec<_>>()
-        .join(";")
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 fn location_key(location: &Location) -> String {
     match location {
         Location::AtPlace(id) => format!("at_place:{}", id.as_str()),
         Location::InContainer(id) => format!("in_container:{}", id.as_str()),
         Location::CarriedBy(id) => format!("carried_by:{}", id.as_str()),
     }

---- continue_routine_tamper_reason_rewrite_poisons_replay stdout ----

thread 'continue_routine_tamper_reason_rewrite_poisons_replay' (14142) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2802:5:
assertion failed: !replay.matches_expected

---- episode_tamper_output_tag_poisons_replay stdout ----

thread 'episode_tamper_output_tag_poisons_replay' (14143) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2829:5:
assertion failed: !replay.matches_expected

---- episode_tamper_proration_poisons_replay stdout ----

thread 'episode_tamper_proration_poisons_replay' (14144) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2870:5:
assertion failed: !replay.matches_expected

failures:
    continue_routine_tamper_reason_rewrite_poisons_replay
    episode_tamper_output_tag_poisons_replay
    episode_tamper_proration_poisons_replay

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.68s

*** result: Failure(101)
