*** crates/tracewake-core/src/checksum.rs:575:5: replace location_key -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-core/src/checksum.rs
+++ replace location_key -> String with "xyzzy".into()
@@ -567,21 +567,17 @@
     pairs
         .iter()
         .map(|(key, value)| format!("{}:{}={}:{}", key.len(), key, value.len(), value))
         .collect::<Vec<_>>()
         .join(";")
 }
 
 fn location_key(location: &Location) -> String {
-    match location {
-        Location::AtPlace(id) => format!("at_place:{}", id.as_str()),
-        Location::InContainer(id) => format!("in_container:{}", id.as_str()),
-        Location::CarriedBy(id) => format!("carried_by:{}", id.as_str()),
-    }
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 fn routine_step_status_id(status: RoutineStepStatus) -> &'static str {
     match status {
         RoutineStepStatus::NotStarted => "not_started",
         RoutineStepStatus::InProgress => "in_progress",
         RoutineStepStatus::Waiting => "waiting",
         RoutineStepStatus::Completed => "completed",

---- checksum_identity_distinguishes_location_routine_status_and_replay_fingerprints stdout ----

thread 'checksum_identity_distinguishes_location_routine_status_and_replay_fingerprints' (23557) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:1240:5:
assertion `left != right` failed
  left: PhysicalChecksum("twc1-4cb67b193a6fa9f2")
 right: PhysicalChecksum("twc1-4cb67b193a6fa9f2")

failures:
    checksum_identity_distinguishes_location_routine_status_and_replay_fingerprints

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
