*** crates/tracewake-core/src/checksum.rs:583:5: replace routine_step_status_id -> &'static str with "xyzzy"

*** mutation diff:
--- crates/tracewake-core/src/checksum.rs
+++ replace routine_step_status_id -> &'static str with "xyzzy"
@@ -575,26 +575,17 @@
     match location {
         Location::AtPlace(id) => format!("at_place:{}", id.as_str()),
         Location::InContainer(id) => format!("in_container:{}", id.as_str()),
         Location::CarriedBy(id) => format!("carried_by:{}", id.as_str()),
     }
 }
 
 fn routine_step_status_id(status: RoutineStepStatus) -> &'static str {
-    match status {
-        RoutineStepStatus::NotStarted => "not_started",
-        RoutineStepStatus::InProgress => "in_progress",
-        RoutineStepStatus::Waiting => "waiting",
-        RoutineStepStatus::Completed => "completed",
-        RoutineStepStatus::Failed => "failed",
-        RoutineStepStatus::Interrupted => "interrupted",
-        RoutineStepStatus::Suspended => "suspended",
-        RoutineStepStatus::Abandoned => "abandoned",
-    }
+    "xyzzy" /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::agent::{
         BlockerCategory, DecisionOutcome, DecisionTraceRecord, HiddenTruthAudit, Intention,
         IntentionSource, NeedChangeCause, NeedKind, NeedState, RoutineExecution, RoutineFamily,

---- checksum_identity_distinguishes_location_routine_status_and_replay_fingerprints stdout ----

thread 'checksum_identity_distinguishes_location_routine_status_and_replay_fingerprints' (493) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:1278:5:
assertion `left != right` failed
  left: AgentStateChecksum("twa1-ab95e283fc1a3134")
 right: AgentStateChecksum("twa1-ab95e283fc1a3134")

failures:
    checksum_identity_distinguishes_location_routine_status_and_replay_fingerprints

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
