*** crates/tracewake-core/src/controller.rs:103:9: replace ControllerBindings::binding -> Option<&RuntimeControllerBinding> with None

*** mutation diff:
--- crates/tracewake-core/src/controller.rs
+++ replace ControllerBindings::binding -> Option<&RuntimeControllerBinding> with None
@@ -95,17 +95,17 @@
             sequence,
             tick,
             content_manifest_id,
         );
         log.append(event).expect("controller event is versioned")
     }
 
     pub fn binding(&self, controller_id: &ControllerId) -> Option<&RuntimeControllerBinding> {
-        self.bindings.get(controller_id)
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn debug_bindings(&self) -> Vec<&RuntimeControllerBinding> {
         self.bindings.values().collect()
     }
 
     pub fn authorize(
         &self,

---- controller::tests::binding_lifecycle_sequences_debug_view_and_authorization_are_observable stdout ----

thread 'controller::tests::binding_lifecycle_sequences_debug_view_and_authorization_are_observable' (22649) panicked at crates/tracewake-core/src/controller.rs:339:18:
called `Option::unwrap()` on a `None` value

failures:
    controller::tests::binding_lifecycle_sequences_debug_view_and_authorization_are_observable

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
