*** crates/tracewake-core/src/controller.rs:107:9: replace ControllerBindings::debug_bindings -> Vec<&RuntimeControllerBinding> with vec![]

*** mutation diff:
--- crates/tracewake-core/src/controller.rs
+++ replace ControllerBindings::debug_bindings -> Vec<&RuntimeControllerBinding> with vec![]
@@ -99,17 +99,17 @@
         log.append(event).expect("controller event is versioned")
     }
 
     pub fn binding(&self, controller_id: &ControllerId) -> Option<&RuntimeControllerBinding> {
         self.bindings.get(controller_id)
     }
 
     pub fn debug_bindings(&self) -> Vec<&RuntimeControllerBinding> {
-        self.bindings.values().collect()
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn authorize(
         &self,
         controller_id: &ControllerId,
         actor_id: &ActorId,
     ) -> Result<(), ControllerError> {
         let binding = self

---- controller::tests::binding_lifecycle_sequences_debug_view_and_authorization_are_observable stdout ----

thread 'controller::tests::binding_lifecycle_sequences_debug_view_and_authorization_are_observable' (27220) panicked at crates/tracewake-core/src/controller.rs:344:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    controller::tests::binding_lifecycle_sequences_debug_view_and_authorization_are_observable

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
