*** crates/tracewake-core/src/controller.rs:83:28: replace += with -= in ControllerBindings::detach

*** mutation diff:
--- crates/tracewake-core/src/controller.rs
+++ replace += with -= in ControllerBindings::detach
@@ -75,17 +75,17 @@
     pub fn detach(
         &mut self,
         controller_id: &ControllerId,
         tick: SimTick,
         log: &mut EventLog,
         content_manifest_id: ContentManifestId,
     ) -> EventEnvelope {
         let sequence = self.next_sequence;
-        self.next_sequence += 1;
+        self.next_sequence -= /* ~ changed by cargo-mutants ~ */ 1;
         self.bindings.insert(
             controller_id.clone(),
             RuntimeControllerBinding {
                 binding: ControllerBinding::detached(controller_id.clone(), sequence),
                 created_at_tick: tick,
             },
         );
         let event = controller_event(

---- controller::tests::binding_lifecycle_sequences_debug_view_and_authorization_are_observable stdout ----

thread 'controller::tests::binding_lifecycle_sequences_debug_view_and_authorization_are_observable' (13531) panicked at crates/tracewake-core/src/controller.rs:420:9:
assertion `left == right` failed
  left: Some("1")
 right: Some("3")

failures:
    controller::tests::binding_lifecycle_sequences_debug_view_and_authorization_are_observable

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
