*** crates/tracewake-core/src/debug_capability.rs:34:9: replace DebugCapability::debug_only -> bool with true

*** mutation diff:
--- crates/tracewake-core/src/debug_capability.rs
+++ replace DebugCapability::debug_only -> bool with true
@@ -26,17 +26,17 @@
 impl DebugCapability {
     pub(crate) const fn mint() -> Self {
         Self {
             marker: DEBUG_NON_DIEGETIC_MARKER,
         }
     }
 
     pub fn debug_only(&self) -> bool {
-        self.marker == DEBUG_NON_DIEGETIC_MARKER
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     pub const fn marker(&self) -> &'static str {
         self.marker
     }
 
     #[cfg(test)]
     pub(crate) const fn test_non_debug() -> Self {

---- debug_reports::tests::debug_report_channel_routing_rejects_forged_non_debug_capability stdout ----

thread 'debug_reports::tests::debug_report_channel_routing_rejects_forged_non_debug_capability' (8471) panicked at crates/tracewake-core/src/debug_reports.rs:856:13:
  left: Some("debug:item_location")
 right: None

---- view_models::tests::debug_view_channel_routing_rejects_forged_non_debug_capability stdout ----

thread 'view_models::tests::debug_view_channel_routing_rejects_forged_non_debug_capability' (8693) panicked at crates/tracewake-core/src/view_models.rs:975:13:
assertion `left == right` failed: forged non-debug view must not route: ControllerBinding(DebugControllerBindingView { debug_capability: DebugCapability { marker: "NOT DEBUG" }, current_binding: None, binding_history: [] })
  left: Some("debug:controller_binding")
 right: None

failures:
    debug_reports::tests::debug_report_channel_routing_rejects_forged_non_debug_capability
    view_models::tests::debug_view_channel_routing_rejects_forged_non_debug_capability

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
