*** crates/tracewake-core/src/debug_capability.rs:34:9: replace DebugCapability::debug_only -> bool with false

*** mutation diff:
--- crates/tracewake-core/src/debug_capability.rs
+++ replace DebugCapability::debug_only -> bool with false
@@ -26,17 +26,17 @@
 impl DebugCapability {
     pub(crate) const fn mint() -> Self {
         Self {
             marker: DEBUG_NON_DIEGETIC_MARKER,
         }
     }
 
     pub fn debug_only(&self) -> bool {
-        self.marker == DEBUG_NON_DIEGETIC_MARKER
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     pub const fn marker(&self) -> &'static str {
         self.marker
     }
 
     #[cfg(test)]
     pub(crate) const fn test_non_debug() -> Self {

---- debug_capability::tests::capability_is_debug_only_and_non_diegetic stdout ----

thread 'debug_capability::tests::capability_is_debug_only_and_non_diegetic' (13029) panicked at crates/tracewake-core/src/debug_capability.rs:57:9:
assertion failed: capability.debug_only()

---- debug_reports::tests::debug_reports_no_human_day_summary_is_debug_only_and_read_only stdout ----

thread 'debug_reports::tests::debug_reports_no_human_day_summary_is_debug_only_and_read_only' (13031) panicked at crates/tracewake-core/src/debug_reports.rs:1213:9:
assertion failed: report.debug_only()

---- debug_reports::tests::debug_report_channel_routing_rejects_forged_non_debug_capability stdout ----

thread 'debug_reports::tests::debug_report_channel_routing_rejects_forged_non_debug_capability' (13030) panicked at crates/tracewake-core/src/debug_reports.rs:842:9:
assertion `left == right` failed
  left: [None, None, None, None, None, None, None]
 right: [Some("debug:item_location"), Some("debug:action_rejection"), Some("debug:projection_rebuild"), Some("debug:replay"), Some("debug:controller_binding"), Some("debug:phase3a"), Some("debug:no_human_day")]

failures:
    debug_capability::tests::capability_is_debug_only_and_non_diegetic
    debug_reports::tests::debug_report_channel_routing_rejects_forged_non_debug_capability
    debug_reports::tests::debug_reports_no_human_day_summary_is_debug_only_and_read_only
    debug_reports::tests::debug_reports_phase3a_surfaces_are_deterministic_and_read_only
    debug_reports::tests::fixture_origin_item_report_is_debug_only_and_read_only
    debug_reports::tests::item_location_report_names_last_location_event
    debug_reports::tests::rejection_report_preserves_failed_stage_and_mutates_nothing
    epistemics::projection::tests::debug_context_can_inspect_all_beliefs_non_diegetically
    view_models::tests::debug_and_embodied_view_models_are_distinct_types
    view_models::tests::debug_epistemics_view_is_non_diegetic_and_lists_all_holders
    view_models::tests::debug_view_channel_routing_rejects_for

test result: FAILED. 442 passed; 13 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
