*** crates/tracewake-core/src/debug_capability.rs:38:9: replace DebugCapability::marker -> &'static str with ""

*** mutation diff:
--- crates/tracewake-core/src/debug_capability.rs
+++ replace DebugCapability::marker -> &'static str with ""
@@ -30,17 +30,17 @@
         }
     }
 
     pub fn debug_only(&self) -> bool {
         self.marker == DEBUG_NON_DIEGETIC_MARKER
     }
 
     pub const fn marker(&self) -> &'static str {
-        self.marker
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     #[cfg(test)]
     pub(crate) const fn test_non_debug() -> Self {
         Self {
             marker: "NOT DEBUG",
         }
     }

---- debug_capability::tests::capability_is_debug_only_and_non_diegetic stdout ----

thread 'debug_capability::tests::capability_is_debug_only_and_non_diegetic' (22147) panicked at crates/tracewake-core/src/debug_capability.rs:58:9:
assertion `left == right` failed
  left: ""
 right: "DEBUG NON-DIEGETIC"

failures:
    debug_capability::tests::capability_is_debug_only_and_non_diegetic

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
