*** crates/tracewake-core/src/debug_reports.rs:114:9: replace ProjectionRebuildDebugReport::debug_only -> bool with true

*** mutation diff:
--- crates/tracewake-core/src/debug_reports.rs
+++ replace ProjectionRebuildDebugReport::debug_only -> bool with true
@@ -106,17 +106,17 @@
 impl ActionRejectionDebugReport {
     pub fn debug_only(&self) -> bool {
         self.debug_capability.debug_only()
     }
 }
 
 impl ProjectionRebuildDebugReport {
     pub fn debug_only(&self) -> bool {
-        self.debug_capability.debug_only()
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl ReplayDebugReport {
     pub fn debug_only(&self) -> bool {
         self.debug_capability.debug_only()
     }
 }

---- debug_reports::tests::debug_report_channel_routing_rejects_forged_non_debug_capability stdout ----

thread 'debug_reports::tests::debug_report_channel_routing_rejects_forged_non_debug_capability' (17035) panicked at crates/tracewake-core/src/debug_reports.rs:856:13:
  left: Some("debug:projection_rebuild")
 right: None

failures:
    debug_reports::tests::debug_report_channel_routing_rejects_forged_non_debug_capability

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
