*** crates/tracewake-core/src/debug_reports.rs:217:38: replace == with != in item_location_report

*** mutation diff:
--- crates/tracewake-core/src/debug_reports.rs
+++ replace == with != in item_location_report
@@ -209,17 +209,17 @@
         .collect::<Vec<_>>();
     let last_location_event_id = location_event_chain
         .last()
         .cloned()
         .or_else(|| Some(EventId::new(format!("fixture_origin.{}", item_id.as_str())).unwrap()));
     let current_projection_position = log
         .events()
         .iter()
-        .filter(|event| event.stream == EventStream::World)
+        .filter(|event| event.stream != /* ~ changed by cargo-mutants ~ */ EventStream::World)
         .map(|event| event.stream_position)
         .max();
 
     ItemLocationDebugReport {
         report_id: DebugReportId::new(format!("debug.item_location.{}", item_id.as_str())).unwrap(),
         item_id: item_id.clone(),
         exists: item.is_some(),
         current_location,

---- debug_reports::tests::item_location_report_filters_exact_item_location_events stdout ----

thread 'debug_reports::tests::item_location_report_filters_exact_item_location_events' (30174) panicked at crates/tracewake-core/src/debug_reports.rs:897:9:
assertion `left == right` failed
  left: None
 right: Some(2)

failures:
    debug_reports::tests::item_location_report_filters_exact_item_location_events

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
