*** crates/tracewake-core/src/debug_reports.rs:421:52: replace == with != in phase3a_actor_report

*** mutation diff:
--- crates/tracewake-core/src/debug_reports.rs
+++ replace == with != in phase3a_actor_report
@@ -413,17 +413,17 @@
     rows.push(format!(
         "active_intention={}",
         active_intention_id.map(|id| id.as_str()).unwrap_or("none")
     ));
     rows.extend(
         agent_state
             .routine_executions
             .values()
-            .filter(|execution| execution.actor_id == *actor_id)
+            .filter(|execution| execution.actor_id != /* ~ changed by cargo-mutants ~ */ *actor_id)
             .map(|execution| {
                 format!(
                     "routine={} template={} status={:?}",
                     execution.execution_id.as_str(),
                     execution.template_id.as_str(),
                     execution.step_status
                 )
             }),

---- debug_reports::tests::debug_reports_phase3a_surfaces_are_deterministic_and_read_only stdout ----

thread 'debug_reports::tests::debug_reports_phase3a_surfaces_are_deterministic_and_read_only' (2347) panicked at crates/tracewake-core/src/debug_reports.rs:1163:9:
assertion failed: actor.rows.iter().any(|row|
        {
            row ==
                "routine=routine_exec_mara_eat template=routine_mara_food_unavailable status=NotStarted"
        })

failures:
    debug_reports::tests::debug_reports_phase3a_surfaces_are_deterministic_and_read_only

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
