*** crates/tracewake-core/src/debug_reports.rs:503:5: replace is_item_location_event -> bool with false

*** mutation diff:
--- crates/tracewake-core/src/debug_reports.rs
+++ replace is_item_location_event -> bool with false
@@ -495,26 +495,17 @@
         report_id: DebugReportId::new("debug.phase3a.no_human_day").unwrap(),
         metrics,
         canonical_summary,
         debug_capability: DebugCapability::mint(),
     }
 }
 
 fn is_item_location_event(event: &EventEnvelope, item_id: &ItemId) -> bool {
-    matches!(
-        event.event_type,
-        EventKind::ItemRemovedFromContainer
-            | EventKind::ItemTakenFromPlace
-            | EventKind::ItemPlacedInContainer
-            | EventKind::ItemPlacedInPlace
-    ) && event
-        .payload
-        .iter()
-        .any(|field| field.key == "item_id" && field.value == item_id.as_str())
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn phase3a_report(
     report_id: &str,
     title: &str,
     rows: Vec<String>,
     decision_traces: Vec<Phase3ADecisionTraceView>,
     stuck_diagnostics: Vec<Phase3AStuckDiagnosticView>,

---- debug_reports::tests::item_location_report_names_last_location_event stdout ----

thread 'debug_reports::tests::item_location_report_names_last_location_event' (11505) panicked at crates/tracewake-core/src/debug_reports.rs:932:9:
assertion `left == right` failed
  left: "fixture_origin.coin_stack_01"
 right: "event.item_removed_from_container.proposal_take"

---- debug_reports::tests::item_location_report_filters_exact_item_location_events stdout ----

thread 'debug_reports::tests::item_location_report_filters_exact_item_location_events' (11504) panicked at crates/tracewake-core/src/debug_reports.rs:880:9:
assertion `left == right` failed
  left: []
 right: ["item_event:event_right_item_take:ItemTakenFromPlace"]

failures:
    debug_reports::tests::item_location_report_filters_exact_item_location_events
    debug_reports::tests::item_location_report_names_last_location_event

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
