*** crates/tracewake-core/src/debug_reports.rs:512:45: replace && with || in is_item_location_event

*** mutation diff:
--- crates/tracewake-core/src/debug_reports.rs
+++ replace && with || in is_item_location_event
@@ -504,17 +504,17 @@
         event.event_type,
         EventKind::ItemRemovedFromContainer
             | EventKind::ItemTakenFromPlace
             | EventKind::ItemPlacedInContainer
             | EventKind::ItemPlacedInPlace
     ) && event
         .payload
         .iter()
-        .any(|field| field.key == "item_id" && field.value == item_id.as_str())
+        .any(|field| field.key == "item_id" || /* ~ changed by cargo-mutants ~ */ field.value == item_id.as_str())
 }
 
 fn phase3a_report(
     report_id: &str,
     title: &str,
     rows: Vec<String>,
     decision_traces: Vec<Phase3ADecisionTraceView>,
     stuck_diagnostics: Vec<Phase3AStuckDiagnosticView>,

---- debug_reports::tests::item_location_report_filters_exact_item_location_events stdout ----

thread 'debug_reports::tests::item_location_report_filters_exact_item_location_events' (20622) panicked at crates/tracewake-core/src/debug_reports.rs:889:9:
assertion `left == right` failed
  left: ["item_event:event_wrong_item_take:ItemTakenFromPlace", "item_event:event_right_item_take:ItemTakenFromPlace"]
 right: ["item_event:event_right_item_take:ItemTakenFromPlace"]

failures:
    debug_reports::tests::item_location_report_filters_exact_item_location_events

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
