*** crates/tracewake-core/src/debug_reports.rs:536:5: replace decision_trace_views_for_actor -> Vec<Phase3ADecisionTraceView> with vec![]

*** mutation diff:
--- crates/tracewake-core/src/debug_reports.rs
+++ replace decision_trace_views_for_actor -> Vec<Phase3ADecisionTraceView> with vec![]
@@ -528,22 +528,17 @@
         debug_capability: DebugCapability::mint(),
     }
 }
 
 fn decision_trace_views_for_actor(
     agent_state: &AgentState,
     actor_id: &ActorId,
 ) -> Vec<Phase3ADecisionTraceView> {
-    agent_state
-        .decision_traces
-        .values()
-        .filter(|trace| &trace.actor_id == actor_id)
-        .map(decision_trace_view)
-        .collect()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn decision_trace_view(trace: &crate::agent::DecisionTraceRecord) -> Phase3ADecisionTraceView {
     Phase3ADecisionTraceView {
         trace_id: trace.trace_id.as_str().to_string(),
         actor_id: trace.actor_id.clone(),
         window_start_tick: trace.window_start_tick,
         window_end_tick: trace.window_end_tick,

---- debug_reports::tests::debug_reports_phase3a_surfaces_are_deterministic_and_read_only stdout ----

thread 'debug_reports::tests::debug_reports_phase3a_surfaces_are_deterministic_and_read_only' (1841) panicked at crates/tracewake-core/src/debug_reports.rs:1121:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    debug_reports::tests::debug_reports_phase3a_surfaces_are_deterministic_and_read_only

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
