*** crates/tracewake-core/src/debug_reports.rs:558:5: replace stuck_views -> Vec<Phase3AStuckDiagnosticView> with vec![]

*** mutation diff:
--- crates/tracewake-core/src/debug_reports.rs
+++ replace stuck_views -> Vec<Phase3AStuckDiagnosticView> with vec![]
@@ -550,21 +550,17 @@
         outcome: trace.outcome.stable_id().to_string(),
         candidate_goal_count: trace.candidate_goal_count,
         hidden_truth_actor_known_only: trace.hidden_truth_audit_result.actor_known_only,
         hidden_truth_notes: trace.hidden_truth_audit_result.notes.clone(),
     }
 }
 
 fn stuck_views(agent_state: &AgentState) -> Vec<Phase3AStuckDiagnosticView> {
-    agent_state
-        .stuck_diagnostics
-        .values()
-        .map(stuck_view)
-        .collect()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn stuck_views_for_actor(
     agent_state: &AgentState,
     actor_id: &ActorId,
 ) -> Vec<Phase3AStuckDiagnosticView> {
     agent_state
         .stuck_diagnostics

---- debug_reports::tests::debug_reports_phase3a_surfaces_are_deterministic_and_read_only stdout ----

thread 'debug_reports::tests::debug_reports_phase3a_surfaces_are_deterministic_and_read_only' (10984) panicked at crates/tracewake-core/src/debug_reports.rs:1130:9:
assertion failed: stuck.rows.iter().any(|row| row.contains("blocker_category=resource"))

failures:
    debug_reports::tests::debug_reports_phase3a_surfaces_are_deterministic_and_read_only

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
