*** crates/tracewake-core/src/debug_reports.rs:569:5: replace stuck_views_for_actor -> Vec<Phase3AStuckDiagnosticView> with vec![]

*** mutation diff:
--- crates/tracewake-core/src/debug_reports.rs
+++ replace stuck_views_for_actor -> Vec<Phase3AStuckDiagnosticView> with vec![]
@@ -561,22 +561,17 @@
         .map(stuck_view)
         .collect()
 }
 
 fn stuck_views_for_actor(
     agent_state: &AgentState,
     actor_id: &ActorId,
 ) -> Vec<Phase3AStuckDiagnosticView> {
-    agent_state
-        .stuck_diagnostics
-        .values()
-        .filter(|diagnostic| &diagnostic.actor_id == actor_id)
-        .map(stuck_view)
-        .collect()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn stuck_view(diagnostic: &crate::agent::StuckDiagnosticRecord) -> Phase3AStuckDiagnosticView {
     Phase3AStuckDiagnosticView {
         diagnostic_id: diagnostic.diagnostic_id.as_str().to_string(),
         actor_id: diagnostic.actor_id.clone(),
         window_start_tick: diagnostic.window_start_tick,
         window_end_tick: diagnostic.window_end_tick,

---- debug_reports::tests::debug_reports_phase3a_surfaces_are_deterministic_and_read_only stdout ----

thread 'debug_reports::tests::debug_reports_phase3a_surfaces_are_deterministic_and_read_only' (15555) panicked at crates/tracewake-core/src/debug_reports.rs:1147:9:
assertion `left == right` failed
  left: ["row:actor=actor_mara", "trace:trace_mara_food:actor_mara:failed:2:true:candidate_goals=eat,find_food;selected_method=none;rejected_reasons=empty_pantry;hidden_truth_audit=actor_known_only"]

failures:
    debug_reports::tests::debug_reports_phase3a_surfaces_are_deterministic_and_read_only

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
