*** crates/tracewake-core/src/debug_reports.rs:620:5: replace render_decision_trace_row -> String with String::new()

*** mutation diff:
--- crates/tracewake-core/src/debug_reports.rs
+++ replace render_decision_trace_row -> String with String::new()
@@ -612,25 +612,17 @@
         actor_known_explanation: diagnostic.actor_known_explanation.clone(),
         debug_only_details: diagnostic.debug_only_details.clone(),
         retry_abandon_fallback_outcome: diagnostic.retry_abandon_fallback_outcome.clone(),
         resulting_status: diagnostic.resulting_status.stable_id().to_string(),
     }
 }
 
 fn render_decision_trace_row(trace: &Phase3ADecisionTraceView) -> String {
-    format!(
-        "trace={} actor={} outcome={} candidates={} actor_known_only={} hidden_truth_notes={}",
-        trace.trace_id,
-        trace.actor_id.as_str(),
-        trace.outcome,
-        trace.candidate_goal_count,
-        trace.hidden_truth_actor_known_only,
-        trace.hidden_truth_notes
-    )
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn render_stuck_row(diagnostic: &Phase3AStuckDiagnosticView) -> String {
     format!(
         "stuck={} actor={} blocker_category={} outcome={} concrete_blocker={} actor_known={} debug_detail={}",
         diagnostic.diagnostic_id,
         diagnostic.actor_id.as_str(),
         diagnostic.blocker_category,

---- debug_reports::tests::debug_reports_phase3a_surfaces_are_deterministic_and_read_only stdout ----

thread 'debug_reports::tests::debug_reports_phase3a_surfaces_are_deterministic_and_read_only' (24697) panicked at crates/tracewake-core/src/debug_reports.rs:1152:9:
assertion failed: actor.rows.iter().any(|row|
        {
            row ==
                "trace=trace_mara_food actor=actor_mara outcome=failed candidates=2 actor_known_only=true hidden_truth_notes=candidate_goals=eat,find_food;selected_method=none;rejected_reasons=empty_pantry;hidden_truth_audit=actor_known_only"
        })

failures:
    debug_reports::tests::debug_reports_phase3a_surfaces_are_deterministic_and_read_only

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
