*** crates/tracewake-core/src/debug_reports.rs:632:5: replace render_stuck_row -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-core/src/debug_reports.rs
+++ replace render_stuck_row -> String with "xyzzy".into()
@@ -624,26 +624,17 @@
         trace.outcome,
         trace.candidate_goal_count,
         trace.hidden_truth_actor_known_only,
         trace.hidden_truth_notes
     )
 }
 
 fn render_stuck_row(diagnostic: &Phase3AStuckDiagnosticView) -> String {
-    format!(
-        "stuck={} actor={} blocker_category={} outcome={} concrete_blocker={} actor_known={} debug_detail={}",
-        diagnostic.diagnostic_id,
-        diagnostic.actor_id.as_str(),
-        diagnostic.blocker_category,
-        diagnostic.resulting_status,
-        diagnostic.concrete_blocker,
-        diagnostic.actor_known_explanation,
-        diagnostic.debug_only_details
-    )
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 fn location_summary(state: &PhysicalState, location: &Location) -> String {
     location_chain(state, location).join(" -> ")
 }
 
 fn location_chain(state: &PhysicalState, location: &Location) -> Vec<String> {
     match location {

---- debug_reports::tests::debug_reports_phase3a_surfaces_are_deterministic_and_read_only stdout ----

thread 'debug_reports::tests::debug_reports_phase3a_surfaces_are_deterministic_and_read_only' (5907) panicked at crates/tracewake-core/src/debug_reports.rs:1125:9:
assertion failed: stuck.rows.iter().any(|row| row.contains("blocker_category=resource"))

failures:
    debug_reports::tests::debug_reports_phase3a_surfaces_are_deterministic_and_read_only

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
