*** crates/tracewake-core/src/debug_reports.rs:645:5: replace location_summary -> String with String::new()

*** mutation diff:
--- crates/tracewake-core/src/debug_reports.rs
+++ replace location_summary -> String with String::new()
@@ -637,17 +637,17 @@
         diagnostic.resulting_status,
         diagnostic.concrete_blocker,
         diagnostic.actor_known_explanation,
         diagnostic.debug_only_details
     )
 }
 
 fn location_summary(state: &PhysicalState, location: &Location) -> String {
-    location_chain(state, location).join(" -> ")
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn location_chain(state: &PhysicalState, location: &Location) -> Vec<String> {
     match location {
         Location::AtPlace(place_id) => vec![format!("place:{}", place_id.as_str())],
         Location::CarriedBy(actor_id) => {
             let mut chain = vec![format!("actor:{}", actor_id.as_str())];
             if let Some(actor) = state.actors.get(actor_id) {

---- debug_reports::tests::item_location_report_names_last_location_event stdout ----

thread 'debug_reports::tests::item_location_report_names_last_location_event' (10469) panicked at crates/tracewake-core/src/debug_reports.rs:937:9:
assertion `left == right` failed
  left: ""
 right: "actor:actor_tomas -> place:shop_front"

failures:
    debug_reports::tests::item_location_report_names_last_location_event

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
