*** crates/tracewake-core/src/debug_reports.rs:649:5: replace location_chain -> Vec<String> with vec!["xyzzy".into()]

*** mutation diff:
--- crates/tracewake-core/src/debug_reports.rs
+++ replace location_chain -> Vec<String> with vec!["xyzzy".into()]
@@ -641,33 +641,17 @@
     )
 }
 
 fn location_summary(state: &PhysicalState, location: &Location) -> String {
     location_chain(state, location).join(" -> ")
 }
 
 fn location_chain(state: &PhysicalState, location: &Location) -> Vec<String> {
-    match location {
-        Location::AtPlace(place_id) => vec![format!("place:{}", place_id.as_str())],
-        Location::CarriedBy(actor_id) => {
-            let mut chain = vec![format!("actor:{}", actor_id.as_str())];
-            if let Some(actor) = state.actors.get(actor_id) {
-                chain.push(format!("place:{}", actor.current_place_id.as_str()));
-            }
-            chain
-        }
-        Location::InContainer(container_id) => {
-            let mut chain = vec![format!("container:{}", container_id.as_str())];
-            if let Some(container) = state.containers.get(container_id) {
-                chain.extend(location_chain(state, &container.location));
-            }
-            chain
-        }
-    }
+    vec!["xyzzy".into()] /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::actions::pipeline::{run_pipeline, PipelineContext};
     use crate::actions::proposal::{Proposal, ProposalOrigin};
     use crate::actions::registry::ActionRegistry;

---- debug_reports::tests::item_location_report_names_last_location_event stdout ----

thread 'debug_reports::tests::item_location_report_names_last_location_event' (28705) panicked at crates/tracewake-core/src/debug_reports.rs:921:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "actor:actor_tomas -> place:shop_front"

failures:
    debug_reports::tests::item_location_report_names_last_location_event

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
