*** crates/tracewake-core/src/epistemics/belief.rs:143:9: replace Belief::channel -> Option<Channel> with None

*** mutation diff:
--- crates/tracewake-core/src/epistemics/belief.rs
+++ replace Belief::channel -> Option<Channel> with None
@@ -135,17 +135,17 @@
         self.confidence
     }
 
     pub fn source(&self) -> &SourceRef {
         &self.source
     }
 
     pub fn channel(&self) -> Option<Channel> {
-        self.channel
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn acquired_tick(&self) -> SimTick {
         self.acquired_tick
     }
 
     pub fn last_verified_tick(&self) -> Option<SimTick> {
         self.last_verified_tick

---- schema::tests::to_belief_uses_builder_preserving_provenance stdout ----

thread 'schema::tests::to_belief_uses_builder_preserving_provenance' (2403) panicked at crates/tracewake-content/src/schema.rs:907:9:
assertion `left == right` failed
  left: None
 right: Some(DirectSight)

failures:
    schema::tests::to_belief_uses_builder_preserving_provenance

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
