*** crates/tracewake-core/src/epistemics/belief.rs:147:9: replace Belief::acquired_tick -> SimTick with Default::default()

*** mutation diff:
--- crates/tracewake-core/src/epistemics/belief.rs
+++ replace Belief::acquired_tick -> SimTick with Default::default()
@@ -139,17 +139,17 @@
         &self.source
     }
 
     pub fn channel(&self) -> Option<Channel> {
         self.channel
     }
 
     pub fn acquired_tick(&self) -> SimTick {
-        self.acquired_tick
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn last_verified_tick(&self) -> Option<SimTick> {
         self.last_verified_tick
     }
 
     pub fn stale_after_tick(&self) -> Option<SimTick> {
         self.stale_after_tick

---- projections::tests::embodied_view_can_carry_actor_known_notebook stdout ----

thread 'projections::tests::embodied_view_can_carry_actor_known_notebook' (6905) panicked at crates/tracewake-core/src/projections.rs:2624:9:
assertion `left == right` failed
  left: 0
 right: 3

failures:
    projections::tests::embodied_view_can_carry_actor_known_notebook

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
