*** crates/tracewake-core/src/epistemics/belief.rs:151:9: replace Belief::last_verified_tick -> Option<SimTick> with Some(Default::default())

*** mutation diff:
--- crates/tracewake-core/src/epistemics/belief.rs
+++ replace Belief::last_verified_tick -> Option<SimTick> with Some(Default::default())
@@ -143,17 +143,17 @@
         self.channel
     }
 
     pub fn acquired_tick(&self) -> SimTick {
         self.acquired_tick
     }
 
     pub fn last_verified_tick(&self) -> Option<SimTick> {
-        self.last_verified_tick
+        Some(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn stale_after_tick(&self) -> Option<SimTick> {
         self.stale_after_tick
     }
 
     pub fn observation_ids(&self) -> &BTreeSet<ObservationId> {
         &self.observation_ids

---- schema::tests::to_belief_uses_builder_preserving_provenance stdout ----

thread 'schema::tests::to_belief_uses_builder_preserving_provenance' (14967) panicked at crates/tracewake-content/src/schema.rs:908:9:
assertion `left == right` failed
  left: Some(SimTick(0))
 right: Some(SimTick(3))

failures:
    schema::tests::to_belief_uses_builder_preserving_provenance

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
