*** crates/tracewake-core/src/epistemics/belief.rs:155:9: replace Belief::stale_after_tick -> Option<SimTick> with Some(Default::default())

*** mutation diff:
--- crates/tracewake-core/src/epistemics/belief.rs
+++ replace Belief::stale_after_tick -> Option<SimTick> with Some(Default::default())
@@ -147,17 +147,17 @@
         self.acquired_tick
     }
 
     pub fn last_verified_tick(&self) -> Option<SimTick> {
         self.last_verified_tick
     }
 
     pub fn stale_after_tick(&self) -> Option<SimTick> {
-        self.stale_after_tick
+        Some(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn observation_ids(&self) -> &BTreeSet<ObservationId> {
         &self.observation_ids
     }
 
     pub fn contradiction_ids(&self) -> &BTreeSet<ContradictionId> {
         &self.contradiction_ids

---- belief_stale_frontier_and_witness_links_survive_projection_debug_and_replay stdout ----

thread 'belief_stale_frontier_and_witness_links_survive_projection_debug_and_replay' (24372) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:2166:5:
assertion `left == right` failed
  left: Some(SimTick(0))
 right: Some(SimTick(17))

failures:
    belief_stale_frontier_and_witness_links_survive_projection_debug_and_replay

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
