*** crates/tracewake-core/src/epistemics/belief.rs:159:9: replace Belief::observation_ids -> &BTreeSet<ObservationId> with Box::leak(Box::new(BTreeSet::new()))

*** mutation diff:
--- crates/tracewake-core/src/epistemics/belief.rs
+++ replace Belief::observation_ids -> &BTreeSet<ObservationId> with Box::leak(Box::new(BTreeSet::new()))
@@ -151,17 +151,17 @@
         self.last_verified_tick
     }
 
     pub fn stale_after_tick(&self) -> Option<SimTick> {
         self.stale_after_tick
     }
 
     pub fn observation_ids(&self) -> &BTreeSet<ObservationId> {
-        &self.observation_ids
+        Box::leak(Box::new(BTreeSet::new())) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn contradiction_ids(&self) -> &BTreeSet<ContradictionId> {
         &self.contradiction_ids
     }
 
     pub fn schema_version(&self) -> &SchemaVersion {
         &self.schema_version

---- belief_stale_frontier_and_witness_links_survive_projection_debug_and_replay stdout ----

thread 'belief_stale_frontier_and_witness_links_survive_projection_debug_and_replay' (29074) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:2188:5:
assertion failed: belief_after.observation_ids().contains(&observation_id)

failures:
    belief_stale_frontier_and_witness_links_survive_projection_debug_and_replay

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
