*** crates/tracewake-core/src/epistemics/belief.rs:163:9: replace Belief::contradiction_ids -> &BTreeSet<ContradictionId> with Box::leak(Box::new(BTreeSet::new()))

*** mutation diff:
--- crates/tracewake-core/src/epistemics/belief.rs
+++ replace Belief::contradiction_ids -> &BTreeSet<ContradictionId> with Box::leak(Box::new(BTreeSet::new()))
@@ -155,17 +155,17 @@
         self.stale_after_tick
     }
 
     pub fn observation_ids(&self) -> &BTreeSet<ObservationId> {
         &self.observation_ids
     }
 
     pub fn contradiction_ids(&self) -> &BTreeSet<ContradictionId> {
-        &self.contradiction_ids
+        Box::leak(Box::new(BTreeSet::new())) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn schema_version(&self) -> &SchemaVersion {
         &self.schema_version
     }
 
     pub fn privacy_scope(&self) -> &PrivacyScope {
         &self.privacy_scope

---- belief_stale_frontier_and_witness_links_survive_projection_debug_and_replay stdout ----

thread 'belief_stale_frontier_and_witness_links_survive_projection_debug_and_replay' (1320) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:2189:5:
assertion failed: belief_after.contradiction_ids().contains(&contradiction_id)

failures:
    belief_stale_frontier_and_witness_links_survive_projection_debug_and_replay

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
