*** crates/tracewake-core/src/epistemics/belief.rs:197:9: replace BeliefDraft::with_holder -> Self with Default::default()

*** mutation diff:
--- crates/tracewake-core/src/epistemics/belief.rs
+++ replace BeliefDraft::with_holder -> Self with Default::default()
@@ -189,18 +189,17 @@
     }
 
     pub fn with_belief_id(mut self, belief_id: BeliefId) -> Self {
         self.belief_id = Some(belief_id);
         self
     }
 
     pub fn with_holder(mut self, holder: HolderKind) -> Self {
-        self.holder = Some(holder);
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn with_proposition(mut self, proposition: Proposition) -> Self {
         self.proposition = Some(proposition);
         self
     }
 
     pub fn with_stance(mut self, stance: Stance) -> Self {

---- epistemics::belief::tests::belief_draft_builder_preserves_required_provenance stdout ----

thread 'epistemics::belief::tests::belief_draft_builder_preserves_required_provenance' (10284) panicked at crates/tracewake-core/src/epistemics/belief.rs:344:14:
called `Result::unwrap()` on an `Err` value: MissingBeliefId

---- epistemics::belief::tests::holder_and_source_are_required_by_checked_constructor stdout ----

thread 'epistemics::belief::tests::holder_and_source_are_required_by_checked_constructor' (10287) panicked at crates/tracewake-core/src/epistemics/belief.rs:303:9:
assertion `left == right` failed
  left: Err(MissingBeliefId)
 right: Err(MissingSource)

failures:
    epistemics::belief::tests::belief_draft_builder_preserves_required_provenance
    epistemics::belief::tests::holder_and_source_are_required_by_checked_constructor

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
