*** crates/tracewake-core/src/epistemics/belief.rs:202:9: replace BeliefDraft::with_proposition -> Self with Default::default()

*** mutation diff:
--- crates/tracewake-core/src/epistemics/belief.rs
+++ replace BeliefDraft::with_proposition -> Self with Default::default()
@@ -194,18 +194,17 @@
     }
 
     pub fn with_holder(mut self, holder: HolderKind) -> Self {
         self.holder = Some(holder);
         self
     }
 
     pub fn with_proposition(mut self, proposition: Proposition) -> Self {
-        self.proposition = Some(proposition);
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn with_stance(mut self, stance: Stance) -> Self {
         self.stance = Some(stance);
         self
     }
 
     pub fn with_confidence(mut self, confidence: Confidence) -> Self {

---- epistemics::belief::tests::belief_draft_builder_preserves_required_provenance stdout ----

thread 'epistemics::belief::tests::belief_draft_builder_preserves_required_provenance' (14843) panicked at crates/tracewake-core/src/epistemics/belief.rs:344:14:
called `Result::unwrap()` on an `Err` value: MissingBeliefId

---- epistemics::belief::tests::holder_and_source_are_required_by_checked_constructor stdout ----

thread 'epistemics::belief::tests::holder_and_source_are_required_by_checked_constructor' (14846) panicked at crates/tracewake-core/src/epistemics/belief.rs:293:9:
assertion `left == right` failed
  left: Err(MissingBeliefId)
 right: Err(MissingHolder)

failures:
    epistemics::belief::tests::belief_draft_builder_preserves_required_provenance
    epistemics::belief::tests::holder_and_source_are_required_by_checked_constructor

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
