*** crates/tracewake-core/src/epistemics/belief.rs:217:9: replace BeliefDraft::with_source -> Self with Default::default()

*** mutation diff:
--- crates/tracewake-core/src/epistemics/belief.rs
+++ replace BeliefDraft::with_source -> Self with Default::default()
@@ -209,18 +209,17 @@
     }
 
     pub fn with_confidence(mut self, confidence: Confidence) -> Self {
         self.confidence = Some(confidence);
         self
     }
 
     pub fn with_source(mut self, source: SourceRef) -> Self {
-        self.source = Some(source);
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn with_acquired_tick(mut self, acquired_tick: SimTick) -> Self {
         self.acquired_tick = Some(acquired_tick);
         self
     }
 
     pub fn build(self) -> Result<Belief, BeliefBuildError> {

---- epistemics::belief::tests::belief_draft_builder_preserves_required_provenance stdout ----

thread 'epistemics::belief::tests::belief_draft_builder_preserves_required_provenance' (28520) panicked at crates/tracewake-core/src/epistemics/belief.rs:344:14:
called `Result::unwrap()` on an `Err` value: MissingBeliefId

failures:
    epistemics::belief::tests::belief_draft_builder_preserves_required_provenance

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
