*** crates/tracewake-core/src/epistemics/belief.rs:222:9: replace BeliefDraft::with_acquired_tick -> Self with Default::default()

*** mutation diff:
--- crates/tracewake-core/src/epistemics/belief.rs
+++ replace BeliefDraft::with_acquired_tick -> Self with Default::default()
@@ -214,18 +214,17 @@
     }
 
     pub fn with_source(mut self, source: SourceRef) -> Self {
         self.source = Some(source);
         self
     }
 
     pub fn with_acquired_tick(mut self, acquired_tick: SimTick) -> Self {
-        self.acquired_tick = Some(acquired_tick);
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn build(self) -> Result<Belief, BeliefBuildError> {
         Ok(Belief::new(
             self.belief_id.ok_or(BeliefBuildError::MissingBeliefId)?,
             self.holder.ok_or(BeliefBuildError::MissingHolder)?,
             self.proposition
                 .ok_or(BeliefBuildError::MissingProposition)?,

---- epistemics::belief::tests::belief_draft_builder_preserves_required_provenance stdout ----

thread 'epistemics::belief::tests::belief_draft_builder_preserves_required_provenance' (611) panicked at crates/tracewake-core/src/epistemics/belief.rs:344:14:
called `Result::unwrap()` on an `Err` value: MissingBeliefId

---- epistemics::belief::tests::holder_and_source_are_required_by_checked_constructor stdout ----

thread 'epistemics::belief::tests::holder_and_source_are_required_by_checked_constructor' (614) panicked at crates/tracewake-core/src/epistemics/belief.rs:293:9:
assertion `left == right` failed
  left: Err(MissingBeliefId)
 right: Err(MissingHolder)

failures:
    epistemics::belief::tests::belief_draft_builder_preserves_required_provenance
    epistemics::belief::tests::holder_and_source_are_required_by_checked_constructor

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
