*** crates/tracewake-core/src/epistemics/belief.rs:28:9: replace Stance::stable_id -> &'static str with "xyzzy"

*** mutation diff:
--- crates/tracewake-core/src/epistemics/belief.rs
+++ replace Stance::stable_id -> &'static str with "xyzzy"
@@ -20,24 +20,17 @@
     ExpectsTrue,
     Plausible,
     Doubts,
     UnknownOrUnresolved,
 }
 
 impl Stance {
     pub const fn stable_id(self) -> &'static str {
-        match self {
-            Stance::BelievesTrue => "believes_true",
-            Stance::BelievesFalse => "believes_false",
-            Stance::ExpectsTrue => "expects_true",
-            Stance::Plausible => "plausible",
-            Stance::Doubts => "doubts",
-            Stance::UnknownOrUnresolved => "unknown_or_unresolved",
-        }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
 pub struct Belief {
     belief_id: BeliefId,
     holder: HolderKind,
     proposition: Proposition,

---- validate::tests::fixture_serialization_golden_bytes_are_pinned_001 stdout ----

thread 'validate::tests::fixture_serialization_golden_bytes_are_pinned_001' (30758) panicked at crates/tracewake-content/src/validate.rs:3216:13:
assertion `left == right` failed: phase2a serialization golden changed

failures:
    validate::tests::fixture_serialization_golden_bytes_are_pinned_001

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
