*** crates/tracewake-core/src/epistemics/contradiction.rs:101:9: replace Contradiction::detected_tick -> SimTick with Default::default()

*** mutation diff:
--- crates/tracewake-core/src/epistemics/contradiction.rs
+++ replace Contradiction::detected_tick -> SimTick with Default::default()
@@ -93,17 +93,17 @@
         &self.expected_proposition
     }
 
     pub fn observed_proposition(&self) -> &Proposition {
         &self.observed_proposition
     }
 
     pub fn detected_tick(&self) -> SimTick {
-        self.detected_tick
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn schema_version(&self) -> &SchemaVersion {
         &self.schema_version
     }
 }
 
 #[allow(clippy::too_many_arguments)]

---- projections::tests::notebook_for_tomas_shows_missing_belief_without_culprit_leak stdout ----

thread 'projections::tests::notebook_for_tomas_shows_missing_belief_without_culprit_leak' (14513) panicked at crates/tracewake-core/src/projections.rs:2552:9:
assertion `left == right` failed
  left: "4 ticks old"
 right: "1 ticks old"

failures:
    projections::tests::notebook_for_tomas_shows_missing_belief_without_culprit_leak

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
