*** crates/tracewake-core/src/epistemics/contradiction.rs:120:5: replace detect_expected_absences -> Vec<ExpectedAbsenceDetection> with vec![]

*** mutation diff:
--- crates/tracewake-core/src/epistemics/contradiction.rs
+++ replace detect_expected_absences -> Vec<ExpectedAbsenceDetection> with vec![]
@@ -112,78 +112,17 @@
     checked_container_id: &ContainerId,
     observed_item_ids: &BTreeSet<ItemId>,
     expectation_beliefs: &[&Belief],
     observation_id: &ObservationId,
     source_event_id: &EventId,
     detected_tick: SimTick,
     confidence: Confidence,
 ) -> Vec<ExpectedAbsenceDetection> {
-    let mut detections = Vec::new();
-    for belief in expectation_beliefs {
-        if belief.holder() != &HolderKind::Actor(holder_actor_id.clone())
-            || belief.stance() != Stance::ExpectsTrue
-        {
-            continue;
-        }
-        let Proposition::ItemLocatedInContainer {
-            item_id,
-            container_id,
-        } = belief.proposition()
-        else {
-            continue;
-        };
-        if container_id != checked_container_id || observed_item_ids.contains(item_id) {
-            continue;
-        }
-
-        let observed_proposition = Proposition::ItemMissingFromExpectedLocation {
-            item_id: item_id.clone(),
-            expected_location: Location::InContainer(checked_container_id.clone()),
-        };
-        let contradiction_id = ContradictionId::new(format!(
-            "contradiction.{}.{}",
-            observation_id.as_str(),
-            item_id.as_str()
-        ))
-        .unwrap();
-        let missing_belief_id = BeliefId::new(format!(
-            "belief.missing.{}.{}",
-            observation_id.as_str(),
-            item_id.as_str()
-        ))
-        .unwrap();
-        let contradiction = Contradiction::new(
-            contradiction_id.clone(),
-            holder_actor_id.clone(),
-            ContradictionKind::ExpectedItemAbsentFromContainer,
-            belief.belief_id().clone(),
-            observation_id.clone(),
-            belief.proposition().clone(),
-            observed_proposition.clone(),
-            detected_tick,
-        );
-        let missing_belief = Belief::new(
-            missing_belief_id,
-            HolderKind::Actor(holder_actor_id.clone()),
-            observed_proposition,
-            Stance::BelievesTrue,
-            confidence,
-            SourceRef::Event(source_event_id.clone()),
-            detected_tick,
-        )
-        .with_channel(Channel::AbsenceMarker)
-        .with_observation(observation_id.clone())
-        .with_contradiction(contradiction_id);
-        detections.push(ExpectedAbsenceDetection {
-            contradiction,
-            missing_belief,
-        });
-    }
-    detections
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::epistemics::observation::Confidence;
     use crate::ids::{ContainerId, ItemId};

---- epistemics::contradiction::tests::detection_derives_missing_belief_for_absent_expected_item stdout ----

thread 'epistemics::contradiction::tests::detection_derives_missing_belief_for_absent_expected_item' (18961) panicked at crates/tracewake-core/src/epistemics/contradiction.rs:253:9:
assertion `left == right` failed
  left: 0
 right: 1

---- epistemics::contradiction::tests::detection_requires_matching_holder_and_expectation_stance stdout ----

thread 'epistemics::contradiction::tests::detection_requires_matching_holder_and_expectation_stance' (18962) panicked at crates/tracewake-core/src/epistemics/contradiction.rs:313:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    epistemics::contradiction::tests::detection_derives_missing_belief_for_absent_expected_item
    epistemics::contradiction::tests::detection_requires_matching_holder_and_expectation_stance

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
