*** crates/tracewake-core/src/epistemics/contradiction.rs:123:13: replace || with && in detect_expected_absences

*** mutation diff:
--- crates/tracewake-core/src/epistemics/contradiction.rs
+++ replace || with && in detect_expected_absences
@@ -115,17 +115,17 @@
     observation_id: &ObservationId,
     source_event_id: &EventId,
     detected_tick: SimTick,
     confidence: Confidence,
 ) -> Vec<ExpectedAbsenceDetection> {
     let mut detections = Vec::new();
     for belief in expectation_beliefs {
         if belief.holder() != &HolderKind::Actor(holder_actor_id.clone())
-            || belief.stance() != Stance::ExpectsTrue
+            && /* ~ changed by cargo-mutants ~ */ belief.stance() != Stance::ExpectsTrue
         {
             continue;
         }
         let Proposition::ItemLocatedInContainer {
             item_id,
             container_id,
         } = belief.proposition()
         else {

---- epistemics::contradiction::tests::detection_requires_matching_holder_and_expectation_stance stdout ----

thread 'epistemics::contradiction::tests::detection_requires_matching_holder_and_expectation_stance' (23533) panicked at crates/tracewake-core/src/epistemics/contradiction.rs:374:9:
assertion `left == right` failed
  left: 3
 right: 1

failures:
    epistemics::contradiction::tests::detection_requires_matching_holder_and_expectation_stance

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
