*** crates/tracewake-core/src/epistemics/contradiction.rs:123:32: replace != with == in detect_expected_absences

*** mutation diff:
--- crates/tracewake-core/src/epistemics/contradiction.rs
+++ replace != with == in detect_expected_absences
@@ -115,17 +115,17 @@
     observation_id: &ObservationId,
     source_event_id: &EventId,
     detected_tick: SimTick,
     confidence: Confidence,
 ) -> Vec<ExpectedAbsenceDetection> {
     let mut detections = Vec::new();
     for belief in expectation_beliefs {
         if belief.holder() != &HolderKind::Actor(holder_actor_id.clone())
-            || belief.stance() != Stance::ExpectsTrue
+            || belief.stance() == /* ~ changed by cargo-mutants ~ */ Stance::ExpectsTrue
         {
             continue;
         }
         let Proposition::ItemLocatedInContainer {
             item_id,
             container_id,
         } = belief.proposition()
         else {

---- epistemics::contradiction::tests::detection_derives_missing_belief_for_absent_expected_item stdout ----

thread 'epistemics::contradiction::tests::detection_derives_missing_belief_for_absent_expected_item' (32650) panicked at crates/tracewake-core/src/epistemics/contradiction.rs:314:9:
assertion `left == right` failed
  left: 0
 right: 1

---- epistemics::contradiction::tests::detection_requires_matching_holder_and_expectation_stance stdout ----

thread 'epistemics::contradiction::tests::detection_requires_matching_holder_and_expectation_stance' (32651) panicked at crates/tracewake-core/src/epistemics/contradiction.rs:375:9:
assertion `left == right` failed
  left: BeliefId(StableId("belief_tomas_doubts_coin"))
 right: BeliefId(StableId("belief_tomas_expected_coin"))

failures:
    epistemics::contradiction::tests::detection_derives_missing_belief_for_absent_expected_item
    epistemics::contradiction::tests::detection_requires_matching_holder_and_expectation_stance

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
