*** crates/tracewake-core/src/epistemics/contradiction.rs:134:25: replace != with == in detect_expected_absences

*** mutation diff:
--- crates/tracewake-core/src/epistemics/contradiction.rs
+++ replace != with == in detect_expected_absences
@@ -126,17 +126,17 @@
         }
         let Proposition::ItemLocatedInContainer {
             item_id,
             container_id,
         } = belief.proposition()
         else {
             continue;
         };
-        if container_id != checked_container_id || observed_item_ids.contains(item_id) {
+        if container_id == /* ~ changed by cargo-mutants ~ */ checked_container_id || observed_item_ids.contains(item_id) {
             continue;
         }
 
         let observed_proposition = Proposition::ItemMissingFromExpectedLocation {
             item_id: item_id.clone(),
             expected_location: Location::InContainer(checked_container_id.clone()),
         };
         let contradiction_id = ContradictionId::new(format!(

---- epistemics::contradiction::tests::detection_requires_matching_holder_and_expectation_stance stdout ----

thread 'epistemics::contradiction::tests::detection_requires_matching_holder_and_expectation_stance' (9302) panicked at crates/tracewake-core/src/epistemics/contradiction.rs:374:9:
assertion `left == right` failed
  left: 0
 right: 1

---- epistemics::contradiction::tests::detection_derives_missing_belief_for_absent_expected_item stdout ----

thread 'epistemics::contradiction::tests::detection_derives_missing_belief_for_absent_expected_item' (9301) panicked at crates/tracewake-core/src/epistemics/contradiction.rs:314:9:
assertion `left == right` failed
  left: 0
 right: 1

---- epistemics::contradiction::tests::detection_requires_relevant_expectation_and_absence stdout ----

thread 'epistemics::contradiction::tests::detection_requires_relevant_expectation_and_absence' (9303) panicked at crates/tracewake-core/src/epistemics/contradiction.rs:443:9:
assertion failed: different_location.is_empty()

failures:
    epistemics::contradiction::tests::detection_derives_missing_belief_for_absent_expected_item
    epistemics::contradiction::tests::detection_requires_matching_holder_and_expectation_stance
    epistemics::contradiction::tests::detection_requires_relevant_expectation_and_absence

test result: FAILED. 452 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
