*** crates/tracewake-core/src/epistemics/contradiction.rs:20:9: replace ContradictionKind::stable_id -> &'static str with ""

*** mutation diff:
--- crates/tracewake-core/src/epistemics/contradiction.rs
+++ replace ContradictionKind::stable_id -> &'static str with ""
@@ -12,21 +12,17 @@
 
 #[derive(Clone, Copy, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
 pub enum ContradictionKind {
     ExpectedItemAbsentFromContainer,
 }
 
 impl ContradictionKind {
     pub const fn stable_id(self) -> &'static str {
-        match self {
-            ContradictionKind::ExpectedItemAbsentFromContainer => {
-                "expected_item_absent_from_container"
-            }
-        }
+        "" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
 pub struct Contradiction {
     contradiction_id: ContradictionId,
     holder_actor_id: ActorId,
     kind: ContradictionKind,

---- epistemics::contradiction::tests::expected_item_absent_from_container_is_only_active_kind stdout ----

thread 'epistemics::contradiction::tests::expected_item_absent_from_container_is_only_active_kind' (5191) panicked at crates/tracewake-core/src/epistemics/contradiction.rs:255:9:
assertion `left == right` failed
  left: ""
 right: "expected_item_absent_from_container"

failures:
    epistemics::contradiction::tests::expected_item_absent_from_container_is_only_active_kind

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
