*** crates/tracewake-core/src/epistemics/knowledge_basis.rs:10:5: replace actor_has_source_backed_support -> bool with false

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_basis.rs
+++ replace actor_has_source_backed_support -> bool with false
@@ -2,28 +2,17 @@
 use crate::epistemics::projection::EpistemicProjection;
 use crate::epistemics::proposition::Proposition;
 
 pub fn actor_has_source_backed_support(
     context: &KnowledgeContext,
     projection: &EpistemicProjection,
     proposition: &Proposition,
 ) -> bool {
-    projection
-        .beliefs_for_context(context)
-        .into_iter()
-        .any(|belief| {
-            belief.proposition() == proposition
-                && matches!(
-                    belief.stance(),
-                    crate::epistemics::Stance::BelievesTrue
-                        | crate::epistemics::Stance::ExpectsTrue
-                        | crate::epistemics::Stance::Plausible
-                )
-        })
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::epistemics::{Belief, Confidence, HolderKind, SourceRef, Stance};
     use crate::ids::{ActorId, BeliefId, ContentManifestId, EventId, PlaceId};
     use crate::time::SimTick;

---- epistemics::knowledge_basis::tests::support_reads_only_context_visible_holder_beliefs stdout ----

thread 'epistemics::knowledge_basis::tests::support_reads_only_context_visible_holder_beliefs' (18421) panicked at crates/tracewake-core/src/epistemics/knowledge_basis.rs:54:9:
assertion failed: actor_has_source_backed_support(&elena_context, &projection, &proposition)

failures:
    epistemics::knowledge_basis::tests::support_reads_only_context_visible_holder_beliefs

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
