*** crates/tracewake-core/src/epistemics/knowledge_basis.rs:14:34: replace == with != in actor_has_source_backed_support

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_basis.rs
+++ replace == with != in actor_has_source_backed_support
@@ -6,17 +6,17 @@
     context: &KnowledgeContext,
     projection: &EpistemicProjection,
     proposition: &Proposition,
 ) -> bool {
     projection
         .beliefs_for_context(context)
         .into_iter()
         .any(|belief| {
-            belief.proposition() == proposition
+            belief.proposition() != /* ~ changed by cargo-mutants ~ */ proposition
                 && matches!(
                     belief.stance(),
                     crate::epistemics::Stance::BelievesTrue
                         | crate::epistemics::Stance::ExpectsTrue
                         | crate::epistemics::Stance::Plausible
                 )
         })
 }

---- epistemics::knowledge_basis::tests::support_reads_only_context_visible_holder_beliefs stdout ----

thread 'epistemics::knowledge_basis::tests::support_reads_only_context_visible_holder_beliefs' (27702) panicked at crates/tracewake-core/src/epistemics/knowledge_basis.rs:65:9:
assertion failed: actor_has_source_backed_support(&elena_context, &projection, &proposition)

failures:
    epistemics::knowledge_basis::tests::support_reads_only_context_visible_holder_beliefs

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
