*** crates/tracewake-core/src/epistemics/knowledge_basis.rs:15:17: replace && with || in actor_has_source_backed_support

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_basis.rs
+++ replace && with || in actor_has_source_backed_support
@@ -7,17 +7,17 @@
     projection: &EpistemicProjection,
     proposition: &Proposition,
 ) -> bool {
     projection
         .beliefs_for_context(context)
         .into_iter()
         .any(|belief| {
             belief.proposition() == proposition
-                && matches!(
+                || /* ~ changed by cargo-mutants ~ */ matches!(
                     belief.stance(),
                     crate::epistemics::Stance::BelievesTrue
                         | crate::epistemics::Stance::ExpectsTrue
                         | crate::epistemics::Stance::Plausible
                 )
         })
 }

---- missing_property_belief_does_not_support_truthful_accusation stdout ----

thread 'missing_property_belief_does_not_support_truthful_accusation' (23344) panicked at crates/tracewake-core/tests/golden_scenarios.rs:699:5:
assertion `left == right` failed
  left: Accepted
 right: Rejected

failures:
    missing_property_belief_does_not_support_truthful_accusation

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
