*** crates/tracewake-core/src/epistemics/knowledge_context.rs:1016:9: replace KnowledgeContext::permits_scope -> bool with true

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace KnowledgeContext::permits_scope -> bool with true
@@ -1008,24 +1008,17 @@
             Vec::new(),
             Vec::new(),
             Vec::new(),
             Vec::new(),
         )
     }
 
     pub fn permits_scope(&self, privacy_scope: &PrivacyScope) -> bool {
-        match (self.mode, privacy_scope) {
-            (ViewMode::Debug, _) => true,
-            (ViewMode::Embodied, PrivacyScope::ActorPrivate(actor_id)) => {
-                actor_id == &self.viewer_actor_id
-            }
-            (ViewMode::Embodied, PrivacyScope::PublicPlaceholder) => true,
-            (ViewMode::Embodied, PrivacyScope::InstitutionPlaceholder(_)) => false,
-        }
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn viewer_actor_id(&self) -> &ActorId {
         &self.viewer_actor_id
     }
 
     pub fn bound_actor_id(&self) -> &ActorId {
         &self.bound_actor_id

---- epistemics::knowledge_context::tests::embodied_context_cannot_be_mutated_into_debug_scope_after_seal stdout ----

thread 'epistemics::knowledge_context::tests::embodied_context_cannot_be_mutated_into_debug_scope_after_seal' (22067) panicked at crates/tracewake-core/src/epistemics/knowledge_context.rs:1492:9:
assertion failed: !context.permits_scope(&PrivacyScope::ActorPrivate(actor_id("actor_mara")))

---- epistemics::knowledge_context::tests::embodied_scope_permits_only_viewer_private_and_public_records stdout ----

thread 'epistemics::knowledge_context::tests::embodied_scope_permits_only_viewer_private_and_public_records' (22071) panicked at crates/tracewake-core/src/epistemics/knowledge_context.rs:1479:9:
assertion failed: !context.permits_scope(&PrivacyScope::ActorPrivate(actor_id("actor_mara")))

failures:
    epistemics::knowledge_context::tests::embodied_context_cannot_be_mutated_into_debug_scope_after_seal
    epistemics::knowledge_context::tests::embodied_scope_permits_only_viewer_private_and_public_records

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
