*** crates/tracewake-core/src/epistemics/knowledge_context.rs:1019:26: replace == with != in KnowledgeContext::permits_scope

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace == with != in KnowledgeContext::permits_scope
@@ -1011,17 +1011,17 @@
             Vec::new(),
         )
     }
 
     pub fn permits_scope(&self, privacy_scope: &PrivacyScope) -> bool {
         match (self.mode, privacy_scope) {
             (ViewMode::Debug, _) => true,
             (ViewMode::Embodied, PrivacyScope::ActorPrivate(actor_id)) => {
-                actor_id == &self.viewer_actor_id
+                actor_id != /* ~ changed by cargo-mutants ~ */ &self.viewer_actor_id
             }
             (ViewMode::Embodied, PrivacyScope::PublicPlaceholder) => true,
             (ViewMode::Embodied, PrivacyScope::InstitutionPlaceholder(_)) => false,
         }
     }
 
     pub fn viewer_actor_id(&self) -> &ActorId {
         &self.viewer_actor_id

---- fixture_initial_beliefs_construct_epistemic_projection stdout ----

thread 'fixture_initial_beliefs_construct_epistemic_projection' (30437) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:3149:5:
assertion `left == right` failed
  left: 0
 right: 1

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (30442) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (30443) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2714:5:
assertion failed: has_event(&log, EventKind::ActorMoved)

failures:
    fixture_initial_beliefs_construct_epistemic_projection
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.49s

*** result: Failure(101)
