*** crates/tracewake-core/src/epistemics/knowledge_context.rs:1039:9: replace KnowledgeContext::current_tick -> SimTick with Default::default()

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace KnowledgeContext::current_tick -> SimTick with Default::default()
@@ -1031,17 +1031,17 @@
         &self.bound_actor_id
     }
 
     pub fn mode(&self) -> ViewMode {
         self.mode
     }
 
     pub fn current_tick(&self) -> SimTick {
-        self.current_tick
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn event_frontier(&self) -> u64 {
         self.event_frontier
     }
 
     pub fn allowed_sources(&self) -> &BTreeSet<AllowedKnowledgeSource> {
         &self.allowed_sources

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (2109) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (2110) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2714:5:
assertion failed: has_event(&log, EventKind::ActorMoved)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection

test result: FAILED. 40 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
