*** crates/tracewake-core/src/epistemics/knowledge_context.rs:1043:9: replace KnowledgeContext::event_frontier -> u64 with 0

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace KnowledgeContext::event_frontier -> u64 with 0
@@ -1035,17 +1035,17 @@
         self.mode
     }
 
     pub fn current_tick(&self) -> SimTick {
         self.current_tick
     }
 
     pub fn event_frontier(&self) -> u64 {
-        self.event_frontier
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn allowed_sources(&self) -> &BTreeSet<AllowedKnowledgeSource> {
         &self.allowed_sources
     }
 
     pub fn forbidden_sources(&self) -> &BTreeSet<ForbiddenKnowledgeSource> {
         &self.forbidden_sources

---- epistemics::knowledge_context::tests::embodied_context_seals_id_hash_provenance_frontier_and_audit stdout ----

thread 'epistemics::knowledge_context::tests::embodied_context_seals_id_hash_provenance_frontier_and_audit' (6495) panicked at crates/tracewake-core/src/epistemics/knowledge_context.rs:1377:9:
assertion `left == right` failed
  left: 0
 right: 11

failures:
    epistemics::knowledge_context::tests::embodied_context_seals_id_hash_provenance_frontier_and_audit

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
