*** crates/tracewake-core/src/epistemics/knowledge_context.rs:1043:9: replace KnowledgeContext::event_frontier -> u64 with 1

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace KnowledgeContext::event_frontier -> u64 with 1
@@ -1035,17 +1035,17 @@
         self.mode
     }
 
     pub fn current_tick(&self) -> SimTick {
         self.current_tick
     }
 
     pub fn event_frontier(&self) -> u64 {
-        self.event_frontier
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn allowed_sources(&self) -> &BTreeSet<AllowedKnowledgeSource> {
         &self.allowed_sources
     }
 
     pub fn forbidden_sources(&self) -> &BTreeSet<ForbiddenKnowledgeSource> {
         &self.forbidden_sources

---- actions::defs::continue_routine::tests::human_and_scheduler_continue_share_pipeline_result stdout ----

thread 'actions::defs::continue_routine::tests::human_and_scheduler_continue_share_pipeline_result' (10814) panicked at crates/tracewake-core/src/actions/defs/continue_routine.rs:539:9:
assertion `left == right` failed
  left: Rejected
 right: Accepted

---- actions::pipeline::tests::human_source_context_fresh_view_passes_source_validation stdout ----

thread 'actions::pipeline::tests::human_source_context_fresh_view_passes_source_validation' (10878) panicked at crates/tracewake-core/src/actions/pipeline.rs:1571:9:
assertion `left == right` failed
  left: Rejected
 right: Accepted

---- actions::pipeline::tests::human_source_context_forged_action_token_rejects stdout ----

thread 'actions::pipeline::tests::human_source_context_forged_action_token_rejects' (10877) panicked at crates/tracewake-core/src/actions/pipeline.rs:1685:9:
assertion `left == right` failed
  left: [ProposalSourceStale]
 right: [ProposalSourceForged]

failures:
    actions::defs::continue_routine::tests::human_and_scheduler_continue_share_pipeline_result
    actions::pipeline::tests::human_source_context_forged_action_token_rejects
    actions::pipeline::tests::human_source_context_fresh_view_passes_source_validation
    actions::pipeline::tests::human_source_context_matches_exact_and_dotted_semantic_actions
    actions::pipeline::tests::human_source_context_stale_frontier_rejects_before_action_validation
    actions::pipeline::tests::same_proposal_validates_same_for_human_and_scheduler_origin
    controller::tests::human_after_authorization_matches_scheduler_validation
    epistemics::knowledge_context::tests::embodied_context_has_expected_allowed_and_forbidden_sources
    epistemics::knowledge_context::tests::embodied_context_seals_id_hash_provenance_frontier_and_audit

test result: FAILED. 446 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
