*** crates/tracewake-core/src/epistemics/knowledge_context.rs:1047:9: replace KnowledgeContext::allowed_sources -> &BTreeSet<AllowedKnowledgeSource> with Box::leak(Box::new(BTreeSet::new()))

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace KnowledgeContext::allowed_sources -> &BTreeSet<AllowedKnowledgeSource> with Box::leak(Box::new(BTreeSet::new()))
@@ -1039,17 +1039,17 @@
         self.current_tick
     }
 
     pub fn event_frontier(&self) -> u64 {
         self.event_frontier
     }
 
     pub fn allowed_sources(&self) -> &BTreeSet<AllowedKnowledgeSource> {
-        &self.allowed_sources
+        Box::leak(Box::new(BTreeSet::new())) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn forbidden_sources(&self) -> &BTreeSet<ForbiddenKnowledgeSource> {
         &self.forbidden_sources
     }
 
     pub fn perception_scope(&self) -> &ScopeFilter {
         &self.perception_scope

---- epistemics::knowledge_context::tests::embodied_context_has_expected_allowed_and_forbidden_sources stdout ----

thread 'epistemics::knowledge_context::tests::embodied_context_has_expected_allowed_and_forbidden_sources' (15611) panicked at crates/tracewake-core/src/epistemics/knowledge_context.rs:1329:9:
assertion failed: context.allowed_sources().contains(&AllowedKnowledgeSource::OwnDirectObservation)

failures:
    epistemics::knowledge_context::tests::embodied_context_has_expected_allowed_and_forbidden_sources

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
