*** crates/tracewake-core/src/epistemics/knowledge_context.rs:1051:9: replace KnowledgeContext::forbidden_sources -> &BTreeSet<ForbiddenKnowledgeSource> with Box::leak(Box::new(BTreeSet::new()))

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace KnowledgeContext::forbidden_sources -> &BTreeSet<ForbiddenKnowledgeSource> with Box::leak(Box::new(BTreeSet::new()))
@@ -1043,17 +1043,17 @@
         self.event_frontier
     }
 
     pub fn allowed_sources(&self) -> &BTreeSet<AllowedKnowledgeSource> {
         &self.allowed_sources
     }
 
     pub fn forbidden_sources(&self) -> &BTreeSet<ForbiddenKnowledgeSource> {
-        &self.forbidden_sources
+        Box::leak(Box::new(BTreeSet::new())) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn perception_scope(&self) -> &ScopeFilter {
         &self.perception_scope
     }
 
     pub fn belief_scope(&self) -> &ScopeFilter {
         &self.belief_scope

---- epistemics::knowledge_context::tests::embodied_context_has_expected_allowed_and_forbidden_sources stdout ----

thread 'epistemics::knowledge_context::tests::embodied_context_has_expected_allowed_and_forbidden_sources' (20182) panicked at crates/tracewake-core/src/epistemics/knowledge_context.rs:1345:9:
assertion failed: context.forbidden_sources().contains(&ForbiddenKnowledgeSource::UnobservedEventLogTruth)

failures:
    epistemics::knowledge_context::tests::embodied_context_has_expected_allowed_and_forbidden_sources

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
