*** crates/tracewake-core/src/epistemics/knowledge_context.rs:105:9: replace KnowledgeProvenanceKind::stable_id -> &'static str with ""

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace KnowledgeProvenanceKind::stable_id -> &'static str with ""
@@ -97,25 +97,17 @@
     Record,
     Belief,
     Reservation,
     ActionAffordanceFact,
 }
 
 impl KnowledgeProvenanceKind {
     pub const fn stable_id(&self) -> &'static str {
-        match self {
-            KnowledgeProvenanceKind::Perception => "perception",
-            KnowledgeProvenanceKind::Memory => "memory",
-            KnowledgeProvenanceKind::Observation => "observation",
-            KnowledgeProvenanceKind::Record => "record",
-            KnowledgeProvenanceKind::Belief => "belief",
-            KnowledgeProvenanceKind::Reservation => "reservation",
-            KnowledgeProvenanceKind::ActionAffordanceFact => "action_affordance_fact",
-        }
+        "" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
 pub struct KnowledgeProvenanceEntry {
     kind: KnowledgeProvenanceKind,
     source: AllowedKnowledgeSource,
     source_key: String,

---- agent::decision::tests::actor_known_input_source_class_stable_ids_cover_all_variants stdout ----

thread 'agent::decision::tests::actor_known_input_source_class_stable_ids_cover_all_variants' (4919) panicked at crates/tracewake-core/src/agent/decision.rs:446:9:
assertion `left == right` failed
  left: ["", "", "routine_assignment", "fixture_possibility", "pipeline_validation_truth", "debug_omniscience", "unproven_physical_truth"]
 right: ["observation", "memory", "routine_assignment", "fixture_possibility", "pipeline_validation_truth", "debug_omniscience", "unproven_physical_truth"]

failures:
    agent::decision::tests::actor_known_input_source_class_stable_ids_cover_all_variants

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
