*** crates/tracewake-core/src/epistemics/knowledge_context.rs:1071:9: replace KnowledgeContext::debug_non_diegetic -> bool with true

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace KnowledgeContext::debug_non_diegetic -> bool with true
@@ -1063,17 +1063,17 @@
         &self.observation_scope
     }
 
     pub fn projection_schema_version(&self) -> &SchemaVersion {
         &self.projection_schema_version
     }
 
     pub fn debug_non_diegetic(&self) -> bool {
-        self.debug_non_diegetic
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn holder_known_context_id(&self) -> &HolderKnownContextId {
         &self.holder_known_context_id
     }
 
     pub fn holder_known_context_hash(&self) -> &HolderKnownContextHash {
         &self.holder_known_context_hash

---- epistemics::knowledge_context::tests::embodied_context_cannot_be_mutated_into_debug_scope_after_seal stdout ----

thread 'epistemics::knowledge_context::tests::embodied_context_cannot_be_mutated_into_debug_scope_after_seal' (24800) panicked at crates/tracewake-core/src/epistemics/knowledge_context.rs:1500:9:
assertion failed: !context.debug_non_diegetic()

failures:
    epistemics::knowledge_context::tests::embodied_context_cannot_be_mutated_into_debug_scope_after_seal

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
