*** crates/tracewake-core/src/epistemics/knowledge_context.rs:1071:9: replace KnowledgeContext::debug_non_diegetic -> bool with false

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace KnowledgeContext::debug_non_diegetic -> bool with false
@@ -1063,17 +1063,17 @@
         &self.observation_scope
     }
 
     pub fn projection_schema_version(&self) -> &SchemaVersion {
         &self.projection_schema_version
     }
 
     pub fn debug_non_diegetic(&self) -> bool {
-        self.debug_non_diegetic
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn holder_known_context_id(&self) -> &HolderKnownContextId {
         &self.holder_known_context_id
     }
 
     pub fn holder_known_context_hash(&self) -> &HolderKnownContextHash {
         &self.holder_known_context_hash

---- epistemics::knowledge_context::tests::debug_context_is_non_diegetic_and_can_inspect_all_scopes stdout ----

thread 'epistemics::knowledge_context::tests::debug_context_is_non_diegetic_and_can_inspect_all_scopes' (29357) panicked at crates/tracewake-core/src/epistemics/knowledge_context.rs:1509:9:
assertion failed: context.debug_non_diegetic()

---- epistemics::projection::tests::debug_context_can_inspect_all_beliefs_non_diegetically stdout ----

thread 'epistemics::projection::tests::debug_context_can_inspect_all_beliefs_non_diegetically' (29378) panicked at crates/tracewake-core/src/epistemics/projection.rs:2822:9:
assertion failed: context.debug_non_diegetic()

failures:
    epistemics::knowledge_context::tests::debug_context_is_non_diegetic_and_can_inspect_all_scopes
    epistemics::projection::tests::debug_context_can_inspect_all_beliefs_non_diegetically

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
