*** crates/tracewake-core/src/epistemics/knowledge_context.rs:1083:9: replace KnowledgeContext::provenance_entries -> &[KnowledgeProvenanceEntry] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace KnowledgeContext::provenance_entries -> &[KnowledgeProvenanceEntry] with Vec::leak(Vec::new())
@@ -1075,17 +1075,17 @@
         &self.holder_known_context_id
     }
 
     pub fn holder_known_context_hash(&self) -> &HolderKnownContextHash {
         &self.holder_known_context_hash
     }
 
     pub fn provenance_entries(&self) -> &[KnowledgeProvenanceEntry] {
-        &self.provenance_entries
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn actor_known_workplaces(&self) -> &[ActorKnownWorkplaceFact] {
         &self.actor_known_workplaces
     }
 
     pub fn actor_known_current_places(&self) -> &[ActorKnownCurrentPlaceFact] {
         &self.actor_known_current_places

---- epistemics::knowledge_context::tests::embodied_context_seals_id_hash_provenance_frontier_and_audit stdout ----

thread 'epistemics::knowledge_context::tests::embodied_context_seals_id_hash_provenance_frontier_and_audit' (1477) panicked at crates/tracewake-core/src/epistemics/knowledge_context.rs:1379:9:
assertion failed: !context.provenance_entries().is_empty()

failures:
    epistemics::knowledge_context::tests::embodied_context_seals_id_hash_provenance_frontier_and_audit

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
