*** crates/tracewake-core/src/epistemics/knowledge_context.rs:1087:9: replace KnowledgeContext::actor_known_workplaces -> &[ActorKnownWorkplaceFact] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace KnowledgeContext::actor_known_workplaces -> &[ActorKnownWorkplaceFact] with Vec::leak(Vec::new())
@@ -1079,17 +1079,17 @@
         &self.holder_known_context_hash
     }
 
     pub fn provenance_entries(&self) -> &[KnowledgeProvenanceEntry] {
         &self.provenance_entries
     }
 
     pub fn actor_known_workplaces(&self) -> &[ActorKnownWorkplaceFact] {
-        &self.actor_known_workplaces
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn actor_known_current_places(&self) -> &[ActorKnownCurrentPlaceFact] {
         &self.actor_known_current_places
     }
 
     pub fn actor_known_carried_items(&self) -> &[ActorKnownCarriedItemFact] {
         &self.actor_known_carried_items

---- stale_workplace_notice_superseded_by_newer_001 stdout ----

thread 'stale_workplace_notice_superseded_by_newer_001' (5722) panicked at crates/tracewake-content/tests/fixtures_load.rs:1156:5:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    stale_workplace_notice_superseded_by_newer_001

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
