*** crates/tracewake-core/src/epistemics/knowledge_context.rs:1091:9: replace KnowledgeContext::actor_known_current_places -> &[ActorKnownCurrentPlaceFact] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace KnowledgeContext::actor_known_current_places -> &[ActorKnownCurrentPlaceFact] with Vec::leak(Vec::new())
@@ -1083,17 +1083,17 @@
         &self.provenance_entries
     }
 
     pub fn actor_known_workplaces(&self) -> &[ActorKnownWorkplaceFact] {
         &self.actor_known_workplaces
     }
 
     pub fn actor_known_current_places(&self) -> &[ActorKnownCurrentPlaceFact] {
-        &self.actor_known_current_places
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn actor_known_carried_items(&self) -> &[ActorKnownCarriedItemFact] {
         &self.actor_known_carried_items
     }
 
     pub fn actor_known_food_sources(&self) -> &[ActorKnownFoodSourceFact] {
         &self.actor_known_food_sources

---- controller::tests::human_binding_adds_no_extra_semantic_actions stdout ----

thread 'controller::tests::human_binding_adds_no_extra_semantic_actions' (10067) panicked at crates/tracewake-core/src/projections.rs:107:14:
sealed embodied source requires observed current-place label

---- epistemics::projection::tests::actor_known_projection_policy_table_drives_record_behavior stdout ----

thread 'epistemics::projection::tests::actor_known_projection_policy_table_drives_record_behavior' (10103) panicked at crates/tracewake-core/src/epistemics/projection.rs:2166:9:
policy table rows must drive emitted no-human and embodied surface behavior: ["current_place embodied expected true observed false"]

---- projections::tests::container_sourced_visible_item_uses_container_take_id stdout ----

thread 'projections::tests::container_sourced_visible_item_uses_container_take_id' (10182) panicked at crates/tracewake-core/src/projections.rs:107:14:
sealed embodied source requires observed current-place label

failures:
    controller::tests::human_binding_adds_no_extra_semantic_actions
    epistemics::projection::tests::actor_known_projection_policy_table_drives_record_behavior
    projections::tests::closed_blocking_door_move_is_disabled_with_validator_reason
    projections::tests::closed_opaque_container_check_is_disabled_with_validator_reason
    projections::tests::container_sourced_visible_item_uses_container_take_id
    projections::tests::disabled_embodied_availability_provenance_uses_actor_visible_facts_only
    projections::tests::embodied_exit_omits_unperceived_door_blocker_on_known_route
    projections::tests::embodied_exit_surfaces_perceived_closed_locked_door_blocker
    projections::tests::embodied_projection_excludes_hidden_and_debug_truth
    projections::tests::embodied_projection_renders_observed_carried_item_attributes_not_live_truth
    projections::tests::embodied_proje

test result: FAILED. 441 passed; 14 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
