*** crates/tracewake-core/src/epistemics/knowledge_context.rs:1095:9: replace KnowledgeContext::actor_known_carried_items -> &[ActorKnownCarriedItemFact] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace KnowledgeContext::actor_known_carried_items -> &[ActorKnownCarriedItemFact] with Vec::leak(Vec::new())
@@ -1087,17 +1087,17 @@
         &self.actor_known_workplaces
     }
 
     pub fn actor_known_current_places(&self) -> &[ActorKnownCurrentPlaceFact] {
         &self.actor_known_current_places
     }
 
     pub fn actor_known_carried_items(&self) -> &[ActorKnownCarriedItemFact] {
-        &self.actor_known_carried_items
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn actor_known_food_sources(&self) -> &[ActorKnownFoodSourceFact] {
         &self.actor_known_food_sources
     }
 
     pub fn actor_known_sleep_affordances(&self) -> &[ActorKnownSleepAffordanceFact] {
         &self.actor_known_sleep_affordances

---- epistemics::projection::tests::actor_known_projection_policy_table_drives_record_behavior stdout ----

thread 'epistemics::projection::tests::actor_known_projection_policy_table_drives_record_behavior' (14674) panicked at crates/tracewake-core/src/epistemics/projection.rs:2166:9:
policy table rows must drive emitted no-human and embodied surface behavior: ["carried_item embodied expected true observed false"]

---- projections::tests::embodied_projection_renders_observed_carried_item_attributes_not_live_truth stdout ----

thread 'projections::tests::embodied_projection_renders_observed_carried_item_attributes_not_live_truth' (14763) panicked at crates/tracewake-core/src/projections.rs:2247:14:
observed carried item renders from actor-known fact

---- projections::tests::embodied_projection_separates_carried_items_from_reachable_items stdout ----

thread 'projections::tests::embodied_projection_separates_carried_items_from_reachable_items' (14766) panicked at crates/tracewake-core/src/projections.rs:2082:9:
assertion failed: view.carried_items.iter().any(|item| item.item_id == item_id("coin_stack_01"))

failures:
    epistemics::projection::tests::actor_known_projection_policy_table_drives_record_behavior
    projections::tests::embodied_projection_renders_observed_carried_item_attributes_not_live_truth
    projections::tests::embodied_projection_separates_carried_items_from_reachable_items

test result: FAILED. 452 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
