*** crates/tracewake-core/src/epistemics/knowledge_context.rs:1099:9: replace KnowledgeContext::actor_known_food_sources -> &[ActorKnownFoodSourceFact] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace KnowledgeContext::actor_known_food_sources -> &[ActorKnownFoodSourceFact] with Vec::leak(Vec::new())
@@ -1091,17 +1091,17 @@
         &self.actor_known_current_places
     }
 
     pub fn actor_known_carried_items(&self) -> &[ActorKnownCarriedItemFact] {
         &self.actor_known_carried_items
     }
 
     pub fn actor_known_food_sources(&self) -> &[ActorKnownFoodSourceFact] {
-        &self.actor_known_food_sources
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn actor_known_sleep_affordances(&self) -> &[ActorKnownSleepAffordanceFact] {
         &self.actor_known_sleep_affordances
     }
 
     pub fn actor_known_routes(&self) -> &[ActorKnownRouteFact] {
         &self.actor_known_routes

---- agent::perception::tests::current_place_knowledge_context_uses_latest_projection_window_not_live_truth stdout ----

thread 'agent::perception::tests::current_place_knowledge_context_uses_latest_projection_window_not_live_truth' (19149) panicked at crates/tracewake-core/src/agent/perception.rs:1030:9:
assertion failed: stale_context.actor_known_food_sources().iter().any(|fact|
        fact.food_supply_id().as_str() == "food_breakfast_tomas")

---- epistemics::projection::tests::actor_known_projection_policy_table_drives_record_behavior stdout ----

thread 'epistemics::projection::tests::actor_known_projection_policy_table_drives_record_behavior' (19245) panicked at crates/tracewake-core/src/epistemics/projection.rs:2166:9:
policy table rows must drive emitted no-human and embodied surface behavior: ["food_source embodied expected true observed false"]

---- projections::tests::phase3a_semantic_actions_include_disabled_empty_food_and_known_sleep stdout ----

thread 'projections::tests::phase3a_semantic_actions_include_disabled_empty_food_and_known_sleep' (19348) panicked at crates/tracewake-core/src/projections.rs:1833:14:
called `Option::unwrap()` on a `None` value

failures:
    agent::perception::tests::current_place_knowledge_context_uses_latest_projection_window_not_live_truth
    epistemics::projection::tests::actor_known_projection_policy_table_drives_record_behavior
    projections::tests::phase3a_semantic_actions_include_disabled_empty_food_and_known_sleep
    projections::tests::view_models_embodied_phase3a_status_is_viewer_scoped_and_actor_known

test result: FAILED. 451 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
