*** crates/tracewake-core/src/epistemics/knowledge_context.rs:1103:9: replace KnowledgeContext::actor_known_sleep_affordances -> &[ActorKnownSleepAffordanceFact] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace KnowledgeContext::actor_known_sleep_affordances -> &[ActorKnownSleepAffordanceFact] with Vec::leak(Vec::new())
@@ -1095,17 +1095,17 @@
         &self.actor_known_carried_items
     }
 
     pub fn actor_known_food_sources(&self) -> &[ActorKnownFoodSourceFact] {
         &self.actor_known_food_sources
     }
 
     pub fn actor_known_sleep_affordances(&self) -> &[ActorKnownSleepAffordanceFact] {
-        &self.actor_known_sleep_affordances
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn actor_known_routes(&self) -> &[ActorKnownRouteFact] {
         &self.actor_known_routes
     }
 
     pub fn actor_known_doors(&self) -> &[ActorKnownDoorFact] {
         &self.actor_known_doors

---- agent::perception::tests::current_place_knowledge_context_uses_latest_projection_window_for_sleep_affordances stdout ----

thread 'agent::perception::tests::current_place_knowledge_context_uses_latest_projection_window_for_sleep_affordances' (23719) panicked at crates/tracewake-core/src/agent/perception.rs:1107:9:
assertion failed: stale_context.actor_known_sleep_affordances().iter().any(|fact|
        fact.sleep_affordance_id().as_str() == "bed_tomas")

---- epistemics::projection::tests::actor_known_projection_policy_table_drives_record_behavior stdout ----

thread 'epistemics::projection::tests::actor_known_projection_policy_table_drives_record_behavior' (23816) panicked at crates/tracewake-core/src/epistemics/projection.rs:2166:9:
policy table rows must drive emitted no-human and embodied surface behavior: ["sleep_place embodied expected true observed false"]

---- projections::tests::phase3a_semantic_actions_include_disabled_empty_food_and_known_sleep stdout ----

thread 'projections::tests::phase3a_semantic_actions_include_disabled_empty_food_and_known_sleep' (23919) panicked at crates/tracewake-core/src/projections.rs:1814:9:
assertion `left == right` failed
  left: []
 right: [SleepAffordanceId(StableId("bed_tomas"))]

failures:
    agent::perception::tests::current_place_knowledge_context_uses_latest_projection_window_for_sleep_affordances
    epistemics::projection::tests::actor_known_projection_policy_table_drives_record_behavior
    projections::tests::phase3a_semantic_actions_include_disabled_empty_food_and_known_sleep

test result: FAILED. 452 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
