*** crates/tracewake-core/src/epistemics/knowledge_context.rs:1107:9: replace KnowledgeContext::actor_known_routes -> &[ActorKnownRouteFact] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace KnowledgeContext::actor_known_routes -> &[ActorKnownRouteFact] with Vec::leak(Vec::new())
@@ -1099,17 +1099,17 @@
         &self.actor_known_food_sources
     }
 
     pub fn actor_known_sleep_affordances(&self) -> &[ActorKnownSleepAffordanceFact] {
         &self.actor_known_sleep_affordances
     }
 
     pub fn actor_known_routes(&self) -> &[ActorKnownRouteFact] {
-        &self.actor_known_routes
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn actor_known_doors(&self) -> &[ActorKnownDoorFact] {
         &self.actor_known_doors
     }
 
     pub fn actor_known_containers(&self) -> &[ActorKnownContainerFact] {
         &self.actor_known_containers

---- epistemics::projection::tests::actor_known_projection_policy_table_drives_record_behavior stdout ----

thread 'epistemics::projection::tests::actor_known_projection_policy_table_drives_record_behavior' (28387) panicked at crates/tracewake-core/src/epistemics/projection.rs:2166:9:
policy table rows must drive emitted no-human and embodied surface behavior: ["route embodied expected true observed false"]

---- projections::tests::closed_blocking_door_move_is_disabled_with_validator_reason stdout ----

thread 'projections::tests::closed_blocking_door_move_is_disabled_with_validator_reason' (28464) panicked at crates/tracewake-core/src/projections.rs:2322:14:
called `Option::unwrap()` on a `None` value

---- projections::tests::disabled_embodied_availability_provenance_uses_actor_visible_facts_only stdout ----

thread 'projections::tests::disabled_embodied_availability_provenance_uses_actor_visible_facts_only' (28469) panicked at crates/tracewake-core/src/projections.rs:2408:14:
called `Option::unwrap()` on a `None` value

failures:
    epistemics::projection::tests::actor_known_projection_policy_table_drives_record_behavior
    projections::tests::closed_blocking_door_move_is_disabled_with_validator_reason
    projections::tests::disabled_embodied_availability_provenance_uses_actor_visible_facts_only
    projections::tests::embodied_exit_omits_unperceived_door_blocker_on_known_route
    projections::tests::embodied_exit_surfaces_perceived_closed_locked_door_blocker
    projections::tests::semantic_actions_are_target_specific_and_deterministic

test result: FAILED. 449 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
