*** crates/tracewake-core/src/epistemics/knowledge_context.rs:1111:9: replace KnowledgeContext::actor_known_doors -> &[ActorKnownDoorFact] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace KnowledgeContext::actor_known_doors -> &[ActorKnownDoorFact] with Vec::leak(Vec::new())
@@ -1103,17 +1103,17 @@
         &self.actor_known_sleep_affordances
     }
 
     pub fn actor_known_routes(&self) -> &[ActorKnownRouteFact] {
         &self.actor_known_routes
     }
 
     pub fn actor_known_doors(&self) -> &[ActorKnownDoorFact] {
-        &self.actor_known_doors
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn actor_known_containers(&self) -> &[ActorKnownContainerFact] {
         &self.actor_known_containers
     }
 
     pub fn actor_known_items(&self) -> &[ActorKnownItemFact] {
         &self.actor_known_items

---- epistemics::projection::tests::actor_known_projection_policy_table_drives_record_behavior stdout ----

thread 'epistemics::projection::tests::actor_known_projection_policy_table_drives_record_behavior' (490) panicked at crates/tracewake-core/src/epistemics/projection.rs:2166:9:
policy table rows must drive emitted no-human and embodied surface behavior: ["local_door embodied expected true observed false"]

---- projections::tests::embodied_exit_surfaces_perceived_closed_locked_door_blocker stdout ----

thread 'projections::tests::embodied_exit_surfaces_perceived_closed_locked_door_blocker' (575) panicked at crates/tracewake-core/src/projections.rs:2023:9:
assertion `left == right` failed
  left: None
 right: Some("door door_shop_back is closed and locked")

failures:
    epistemics::projection::tests::actor_known_projection_policy_table_drives_record_behavior
    projections::tests::embodied_exit_surfaces_perceived_closed_locked_door_blocker

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
