*** crates/tracewake-core/src/epistemics/knowledge_context.rs:1115:9: replace KnowledgeContext::actor_known_containers -> &[ActorKnownContainerFact] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace KnowledgeContext::actor_known_containers -> &[ActorKnownContainerFact] with Vec::leak(Vec::new())
@@ -1107,17 +1107,17 @@
         &self.actor_known_routes
     }
 
     pub fn actor_known_doors(&self) -> &[ActorKnownDoorFact] {
         &self.actor_known_doors
     }
 
     pub fn actor_known_containers(&self) -> &[ActorKnownContainerFact] {
-        &self.actor_known_containers
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn actor_known_items(&self) -> &[ActorKnownItemFact] {
         &self.actor_known_items
     }
 
     pub fn actor_known_local_actors(&self) -> &[ActorKnownLocalActorFact] {
         &self.actor_known_local_actors

---- epistemics::projection::tests::actor_known_projection_policy_table_drives_record_behavior stdout ----

thread 'epistemics::projection::tests::actor_known_projection_policy_table_drives_record_behavior' (5061) panicked at crates/tracewake-core/src/epistemics/projection.rs:2166:9:
policy table rows must drive emitted no-human and embodied surface behavior: ["local_container embodied expected true observed false"]

---- projections::tests::closed_opaque_container_check_is_disabled_with_validator_reason stdout ----

thread 'projections::tests::closed_opaque_container_check_is_disabled_with_validator_reason' (5139) panicked at crates/tracewake-core/src/projections.rs:2290:14:
called `Option::unwrap()` on a `None` value

---- projections::tests::embodied_projection_excludes_hidden_and_debug_truth stdout ----

thread 'projections::tests::embodied_projection_excludes_hidden_and_debug_truth' (5148) panicked at crates/tracewake-core/src/projections.rs:1746:9:
assertion failed: view.visible_containers.iter().any(|container|
        container.container_id == container_id("strongbox_tomas"))

failures:
    epistemics::projection::tests::actor_known_projection_policy_table_drives_record_behavior
    projections::tests::closed_opaque_container_check_is_disabled_with_validator_reason
    projections::tests::embodied_projection_excludes_hidden_and_debug_truth
    projections::tests::locked_container_check_is_disabled_with_validator_reason

test result: FAILED. 451 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
