*** crates/tracewake-core/src/epistemics/knowledge_context.rs:1119:9: replace KnowledgeContext::actor_known_items -> &[ActorKnownItemFact] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace KnowledgeContext::actor_known_items -> &[ActorKnownItemFact] with Vec::leak(Vec::new())
@@ -1111,17 +1111,17 @@
         &self.actor_known_doors
     }
 
     pub fn actor_known_containers(&self) -> &[ActorKnownContainerFact] {
         &self.actor_known_containers
     }
 
     pub fn actor_known_items(&self) -> &[ActorKnownItemFact] {
-        &self.actor_known_items
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn actor_known_local_actors(&self) -> &[ActorKnownLocalActorFact] {
         &self.actor_known_local_actors
     }
 
     pub fn forbidden_truth_audit(&self) -> &ForbiddenTruthAudit {
         &self.forbidden_truth_audit

---- epistemics::projection::tests::actor_known_projection_policy_table_drives_record_behavior stdout ----

thread 'epistemics::projection::tests::actor_known_projection_policy_table_drives_record_behavior' (9633) panicked at crates/tracewake-core/src/epistemics/projection.rs:2166:9:
policy table rows must drive emitted no-human and embodied surface behavior: ["local_item embodied expected true observed false"]

---- projections::tests::container_sourced_visible_item_uses_container_take_id stdout ----

thread 'projections::tests::container_sourced_visible_item_uses_container_take_id' (9712) panicked at crates/tracewake-core/src/projections.rs:2263:9:
assertion failed: view.semantic_actions.iter().any(|entry|
        entry.semantic_action_id.as_str() ==
            "take.item.coin_stack_01.from.strongbox_tomas")

---- projections::tests::embodied_projection_excludes_hidden_and_debug_truth stdout ----

thread 'projections::tests::embodied_projection_excludes_hidden_and_debug_truth' (9720) panicked at crates/tracewake-core/src/projections.rs:1750:9:
assertion failed: view.visible_items.iter().any(|item| item.item_id == item_id("loose_coin_01"))

failures:
    epistemics::projection::tests::actor_known_projection_policy_table_drives_record_behavior
    projections::tests::container_sourced_visible_item_uses_container_take_id
    projections::tests::embodied_projection_excludes_hidden_and_debug_truth
    projections::tests::embodied_projection_renders_stale_projected_item_not_live_truth

test result: FAILED. 451 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
