*** crates/tracewake-core/src/epistemics/knowledge_context.rs:1123:9: replace KnowledgeContext::actor_known_local_actors -> &[ActorKnownLocalActorFact] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace KnowledgeContext::actor_known_local_actors -> &[ActorKnownLocalActorFact] with Vec::leak(Vec::new())
@@ -1115,17 +1115,17 @@
         &self.actor_known_containers
     }
 
     pub fn actor_known_items(&self) -> &[ActorKnownItemFact] {
         &self.actor_known_items
     }
 
     pub fn actor_known_local_actors(&self) -> &[ActorKnownLocalActorFact] {
-        &self.actor_known_local_actors
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn forbidden_truth_audit(&self) -> &ForbiddenTruthAudit {
         &self.forbidden_truth_audit
     }
 
     pub fn status(&self) -> KnowledgeContextStatus {
         self.status

---- epistemics::projection::tests::actor_known_projection_policy_table_drives_record_behavior stdout ----

thread 'epistemics::projection::tests::actor_known_projection_policy_table_drives_record_behavior' (14204) panicked at crates/tracewake-core/src/epistemics/projection.rs:2166:9:
policy table rows must drive emitted no-human and embodied surface behavior: ["local_actor embodied expected true observed false"]

failures:
    epistemics::projection::tests::actor_known_projection_policy_table_drives_record_behavior

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
