*** crates/tracewake-core/src/epistemics/knowledge_context.rs:1136:5: replace embodied_allowed_sources -> BTreeSet<AllowedKnowledgeSource> with BTreeSet::new()

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace embodied_allowed_sources -> BTreeSet<AllowedKnowledgeSource> with BTreeSet::new()
@@ -1128,23 +1128,17 @@
     }
 
     pub fn status(&self) -> KnowledgeContextStatus {
         self.status
     }
 }
 
 fn embodied_allowed_sources() -> BTreeSet<AllowedKnowledgeSource> {
-    BTreeSet::from([
-        AllowedKnowledgeSource::OwnDirectObservation,
-        AllowedKnowledgeSource::OwnSearchOrTouchObservation,
-        AllowedKnowledgeSource::OwnSoundObservation,
-        AllowedKnowledgeSource::OwnAbsenceMarker,
-        AllowedKnowledgeSource::OwnSourceBackedBelief,
-    ])
+    BTreeSet::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn forbidden_sources() -> BTreeSet<ForbiddenKnowledgeSource> {
     BTreeSet::from([
         ForbiddenKnowledgeSource::UnobservedEventLogTruth,
         ForbiddenKnowledgeSource::HiddenItemLocation,
         ForbiddenKnowledgeSource::OtherActorsPrivateBeliefs,
         ForbiddenKnowledgeSource::HumanDebugNotes,

---- epistemics::knowledge_context::tests::embodied_context_has_expected_allowed_and_forbidden_sources stdout ----

thread 'epistemics::knowledge_context::tests::embodied_context_has_expected_allowed_and_forbidden_sources' (18786) panicked at crates/tracewake-core/src/epistemics/knowledge_context.rs:1323:9:
assertion failed: context.allowed_sources().contains(&AllowedKnowledgeSource::OwnDirectObservation)

failures:
    epistemics::knowledge_context::tests::embodied_context_has_expected_allowed_and_forbidden_sources

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
