*** crates/tracewake-core/src/epistemics/knowledge_context.rs:1146:5: replace forbidden_sources -> BTreeSet<ForbiddenKnowledgeSource> with BTreeSet::new()

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace forbidden_sources -> BTreeSet<ForbiddenKnowledgeSource> with BTreeSet::new()
@@ -1138,23 +1138,17 @@
         AllowedKnowledgeSource::OwnSearchOrTouchObservation,
         AllowedKnowledgeSource::OwnSoundObservation,
         AllowedKnowledgeSource::OwnAbsenceMarker,
         AllowedKnowledgeSource::OwnSourceBackedBelief,
     ])
 }
 
 fn forbidden_sources() -> BTreeSet<ForbiddenKnowledgeSource> {
-    BTreeSet::from([
-        ForbiddenKnowledgeSource::UnobservedEventLogTruth,
-        ForbiddenKnowledgeSource::HiddenItemLocation,
-        ForbiddenKnowledgeSource::OtherActorsPrivateBeliefs,
-        ForbiddenKnowledgeSource::HumanDebugNotes,
-        ForbiddenKnowledgeSource::PreviousPossessedActorKnowledge,
-    ])
+    BTreeSet::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn baseline_embodied_provenance() -> Vec<KnowledgeProvenanceEntry> {
     vec![
         KnowledgeProvenanceEntry::actor_known_source(
             KnowledgeProvenanceKind::Perception,
             AllowedKnowledgeSource::OwnDirectObservation,
             "context_source_policy",

---- epistemics::knowledge_context::tests::embodied_context_has_expected_allowed_and_forbidden_sources stdout ----

thread 'epistemics::knowledge_context::tests::embodied_context_has_expected_allowed_and_forbidden_sources' (23357) panicked at crates/tracewake-core/src/epistemics/knowledge_context.rs:1339:9:
assertion failed: context.forbidden_sources().contains(&ForbiddenKnowledgeSource::UnobservedEventLogTruth)

failures:
    epistemics::knowledge_context::tests::embodied_context_has_expected_allowed_and_forbidden_sources

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
