*** crates/tracewake-core/src/epistemics/knowledge_context.rs:1214:5: replace canonical_hash_inputs -> Vec<String> with vec!["xyzzy".into()]

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace canonical_hash_inputs -> Vec<String> with vec!["xyzzy".into()]
@@ -1206,104 +1206,17 @@
     actor_known_routes: &[ActorKnownRouteFact],
     actor_known_doors: &[ActorKnownDoorFact],
     actor_known_containers: &[ActorKnownContainerFact],
     actor_known_items: &[ActorKnownItemFact],
     actor_known_local_actors: &[ActorKnownLocalActorFact],
     forbidden_truth_audit: &ForbiddenTruthAudit,
     status: KnowledgeContextStatus,
 ) -> Vec<String> {
-    let mut lines = vec![
-        format!("context_id={}", holder_known_context_id.as_str()),
-        format!("viewer_actor={}", viewer_actor_id.as_str()),
-        format!("bound_actor={}", bound_actor_id.as_str()),
-        format!("mode={}", mode.stable_id()),
-        format!("tick={}", current_tick.value()),
-        format!("event_frontier={event_frontier}"),
-        format!("perception_scope={}", perception_scope.canonical_key()),
-        format!("belief_scope={}", belief_scope.canonical_key()),
-        format!("observation_scope={}", observation_scope.canonical_key()),
-        format!("schema={}", projection_schema_version.as_str()),
-        format!("debug_non_diegetic={debug_non_diegetic}"),
-        format!("audit_passed={}", forbidden_truth_audit.passed()),
-        format!("status={}", status.stable_id()),
-    ];
-
-    lines.extend(
-        allowed_sources
-            .iter()
-            .map(|source| format!("allowed={}", source.stable_id())),
-    );
-    lines.extend(
-        forbidden_sources
-            .iter()
-            .map(|source| format!("forbidden={}", source.stable_id())),
-    );
-    lines.extend(
-        forbidden_truth_audit
-            .excluded_sources()
-            .iter()
-            .map(|source| format!("audit_excluded={}", source.stable_id())),
-    );
-    lines.extend(
-        provenance_entries
-            .iter()
-            .map(|entry| format!("provenance={}", entry.canonical_key())),
-    );
-    lines.extend(
-        actor_known_workplaces
-            .iter()
-            .map(|fact| format!("actor_known_workplace={}", fact.canonical_key())),
-    );
-    lines.extend(
-        actor_known_current_places
-            .iter()
-            .map(|fact| format!("actor_known_current_place={}", fact.canonical_key())),
-    );
-    lines.extend(
-        actor_known_carried_items
-            .iter()
-            .map(|fact| format!("actor_known_carried_item={}", fact.canonical_key())),
-    );
-    lines.extend(
-        actor_known_food_sources
-            .iter()
-            .map(|fact| format!("actor_known_food_source={}", fact.canonical_key())),
-    );
-    lines.extend(
-        actor_known_sleep_affordances
-            .iter()
-            .map(|fact| format!("actor_known_sleep_affordance={}", fact.canonical_key())),
-    );
-    lines.extend(
-        actor_known_routes
-            .iter()
-            .map(|fact| format!("actor_known_route={}", fact.canonical_key())),
-    );
-    lines.extend(
-        actor_known_doors
-            .iter()
-            .map(|fact| format!("actor_known_door={}", fact.canonical_key())),
-    );
-    lines.extend(
-        actor_known_containers
-            .iter()
-            .map(|fact| format!("actor_known_container={}", fact.canonical_key())),
-    );
-    lines.extend(
-        actor_known_items
-            .iter()
-            .map(|fact| format!("actor_known_item={}", fact.canonical_key())),
-    );
-    lines.extend(
-        actor_known_local_actors
-            .iter()
-            .map(|fact| format!("actor_known_local_actor={}", fact.canonical_key())),
-    );
-    lines
+    vec!["xyzzy".into()] /* ~ changed by cargo-mutants ~ */
 }
 
 fn location_key(location: &Location) -> String {
     match location {
         Location::AtPlace(place_id) => format!("place:{}", place_id.as_str()),
         Location::InContainer(container_id) => format!("container:{}", container_id.as_str()),
         Location::CarriedBy(actor_id) => format!("carried:{}", actor_id.as_str()),
     }

---- epistemics::knowledge_context::tests::embodied_context_hash_is_deterministic_and_input_sensitive stdout ----

thread 'epistemics::knowledge_context::tests::embodied_context_hash_is_deterministic_and_input_sensitive' (9154) panicked at crates/tracewake-core/src/epistemics/knowledge_context.rs:1383:9:
assertion `left != right` failed
  left: HolderKnownContextHash("hkc1-b1dfc92724b1622d")
 right: HolderKnownContextHash("hkc1-b1dfc92724b1622d")

failures:
    epistemics::knowledge_context::tests::embodied_context_hash_is_deterministic_and_input_sensitive

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
