*** crates/tracewake-core/src/epistemics/knowledge_context.rs:150:9: replace KnowledgeProvenanceEntry::canonical_key -> String with String::new()

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace KnowledgeProvenanceEntry::canonical_key -> String with String::new()
@@ -142,22 +142,17 @@
         self.source
     }
 
     pub fn source_key(&self) -> &str {
         &self.source_key
     }
 
     fn canonical_key(&self) -> String {
-        format!(
-            "{}:{}:{}",
-            self.kind.stable_id(),
-            self.source.stable_id(),
-            self.source_key
-        )
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
 pub struct ActorKnownCurrentPlaceFact {
     place_id: PlaceId,
     display_label: String,
     source_key: String,

---- holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit stdout ----

thread 'holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit' (24079) panicked at crates/tracewake-core/tests/hidden_truth_gates.rs:919:5:
assertion `left == right` failed
  left: "hkc1-bb0a7fbe71ff7327"
 right: "hkc1-f1a06ad6077dcb76"

failures:
    holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
