*** crates/tracewake-core/src/epistemics/knowledge_context.rs:184:9: replace ActorKnownCurrentPlaceFact::display_label -> &str with "xyzzy"

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace ActorKnownCurrentPlaceFact::display_label -> &str with "xyzzy"
@@ -176,17 +176,17 @@
         }
     }
 
     pub fn place_id(&self) -> &PlaceId {
         &self.place_id
     }
 
     pub fn display_label(&self) -> &str {
-        &self.display_label
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn source_key(&self) -> &str {
         &self.source_key
     }
 
     fn canonical_key(&self) -> String {
         format!(

---- projections::tests::embodied_projection_renders_observed_place_label_not_live_truth stdout ----

thread 'projections::tests::embodied_projection_renders_observed_place_label_not_live_truth' (5379) panicked at crates/tracewake-core/src/projections.rs:2200:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "Shop front"

failures:
    projections::tests::embodied_projection_renders_observed_place_label_not_live_truth

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
