*** crates/tracewake-core/src/epistemics/knowledge_context.rs:192:9: replace ActorKnownCurrentPlaceFact::canonical_key -> String with String::new()

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace ActorKnownCurrentPlaceFact::canonical_key -> String with String::new()
@@ -184,22 +184,17 @@
         &self.display_label
     }
 
     pub fn source_key(&self) -> &str {
         &self.source_key
     }
 
     fn canonical_key(&self) -> String {
-        format!(
-            "{}:label={}:{}",
-            self.place_id.as_str(),
-            self.display_label,
-            self.source_key
-        )
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
 pub struct ActorKnownCarriedItemFact {
     item_id: ItemId,
     source: Location,
     portable: bool,

---- holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit stdout ----

thread 'holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit' (19698) panicked at crates/tracewake-core/tests/hidden_truth_gates.rs:919:5:
assertion `left == right` failed
  left: "hkc1-abcf2d134eb574c3"
 right: "hkc1-f1a06ad6077dcb76"

failures:
    holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
