*** crates/tracewake-core/src/epistemics/knowledge_context.rs:22:9: replace ViewMode::stable_id -> &'static str with "xyzzy"

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace ViewMode::stable_id -> &'static str with "xyzzy"
@@ -14,20 +14,17 @@
 #[derive(Clone, Copy, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
 pub enum ViewMode {
     Embodied,
     Debug,
 }
 
 impl ViewMode {
     pub const fn stable_id(self) -> &'static str {
-        match self {
-            ViewMode::Embodied => "embodied",
-            ViewMode::Debug => "debug",
-        }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Copy, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
 pub enum AllowedKnowledgeSource {
     OwnDirectObservation,
     OwnSearchOrTouchObservation,
     OwnSoundObservation,

---- holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit stdout ----

thread 'holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit' (4920) panicked at crates/tracewake-core/tests/hidden_truth_gates.rs:919:5:
assertion `left == right` failed
  left: "hkc1-e27493f238ebb3d3"
 right: "hkc1-f1a06ad6077dcb76"

failures:
    holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
