*** crates/tracewake-core/src/epistemics/knowledge_context.rs:233:9: replace ActorKnownCarriedItemFact::portable -> bool with true

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace ActorKnownCarriedItemFact::portable -> bool with true
@@ -225,17 +225,17 @@
         &self.item_id
     }
 
     pub fn source(&self) -> &Location {
         &self.source
     }
 
     pub fn portable(&self) -> bool {
-        self.portable
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn source_key(&self) -> &str {
         &self.source_key
     }
 
     fn canonical_key(&self) -> String {
         format!(

---- holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit stdout ----

thread 'holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit' (29200) panicked at crates/tracewake-core/tests/hidden_truth_gates.rs:923:5:
assertion `left == right` failed
  left: "hkc1-170658bd4078102b"
 right: "hkc1-8ad1ae1b01750844"

failures:
    holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
