*** crates/tracewake-core/src/epistemics/knowledge_context.rs:241:9: replace ActorKnownCarriedItemFact::canonical_key -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace ActorKnownCarriedItemFact::canonical_key -> String with "xyzzy".into()
@@ -233,23 +233,17 @@
         self.portable
     }
 
     pub fn source_key(&self) -> &str {
         &self.source_key
     }
 
     fn canonical_key(&self) -> String {
-        format!(
-            "{}:{}:portable={}:{}",
-            self.item_id.as_str(),
-            location_key(&self.source),
-            self.portable,
-            self.source_key
-        )
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
 pub struct ActorKnownWorkplaceFact {
     workplace_id: WorkplaceId,
     place_id: PlaceId,
     believed_access_open: bool,

---- holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit stdout ----

thread 'holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit' (20248) panicked at crates/tracewake-core/tests/hidden_truth_gates.rs:919:5:
assertion `left == right` failed
  left: "hkc1-bc35fb3a024e48b4"
 right: "hkc1-f1a06ad6077dcb76"

failures:
    holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
