*** crates/tracewake-core/src/epistemics/knowledge_context.rs:290:9: replace ActorKnownWorkplaceFact::believed_access_open -> bool with true

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace ActorKnownWorkplaceFact::believed_access_open -> bool with true
@@ -282,17 +282,17 @@
         &self.workplace_id
     }
 
     pub fn place_id(&self) -> &PlaceId {
         &self.place_id
     }
 
     pub fn believed_access_open(&self) -> bool {
-        self.believed_access_open
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn source_key(&self) -> &str {
         &self.source_key
     }
 
     pub fn source_event_ids(&self) -> &SourceEventIds {
         &self.source_event_ids

---- projections::tests::phase3a_workplace_semantic_actions_require_place_access_and_provenance stdout ----

thread 'projections::tests::phase3a_workplace_semantic_actions_require_place_access_and_provenance' (24744) panicked at crates/tracewake-core/src/projections.rs:1923:9:
assertion failed: !closed.enabled

failures:
    projections::tests::phase3a_workplace_semantic_actions_require_place_access_and_provenance

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
