*** crates/tracewake-core/src/epistemics/knowledge_context.rs:290:9: replace ActorKnownWorkplaceFact::believed_access_open -> bool with false

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace ActorKnownWorkplaceFact::believed_access_open -> bool with false
@@ -282,17 +282,17 @@
         &self.workplace_id
     }
 
     pub fn place_id(&self) -> &PlaceId {
         &self.place_id
     }
 
     pub fn believed_access_open(&self) -> bool {
-        self.believed_access_open
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn source_key(&self) -> &str {
         &self.source_key
     }
 
     pub fn source_event_ids(&self) -> &SourceEventIds {
         &self.source_event_ids

---- stale_workplace_notice_superseded_by_newer_001 stdout ----

thread 'stale_workplace_notice_superseded_by_newer_001' (28862) panicked at crates/tracewake-content/tests/fixtures_load.rs:1159:5:
assertion failed: workplace.believed_access_open()

failures:
    stale_workplace_notice_superseded_by_newer_001

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
