*** crates/tracewake-core/src/epistemics/knowledge_context.rs:306:9: replace ActorKnownWorkplaceFact::canonical_key -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace ActorKnownWorkplaceFact::canonical_key -> String with "xyzzy".into()
@@ -298,32 +298,17 @@
         &self.source_event_ids
     }
 
     pub fn acquired_tick(&self) -> SimTick {
         self.acquired_tick
     }
 
     fn canonical_key(&self) -> String {
-        let source_events = self
-            .source_event_ids
-            .as_slice()
-            .iter()
-            .map(|event_id| event_id.as_str())
-            .collect::<Vec<_>>()
-            .join(",");
-        format!(
-            "{}@{}:access_open={}:{}:events={}:tick={}",
-            self.workplace_id.as_str(),
-            self.place_id.as_str(),
-            self.believed_access_open,
-            self.source_key,
-            source_events,
-            self.acquired_tick.value()
-        )
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
 pub struct ActorKnownFoodSourceFact {
     food_supply_id: FoodSupplyId,
     believed_servings: Option<u32>,
     source_key: String,

---- holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit stdout ----

thread 'holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit' (19394) panicked at crates/tracewake-core/tests/hidden_truth_gates.rs:919:5:
assertion `left == right` failed
  left: "hkc1-4c4463fd8ec37876"
 right: "hkc1-f1a06ad6077dcb76"

failures:
    holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
