*** crates/tracewake-core/src/epistemics/knowledge_context.rs:354:9: replace ActorKnownFoodSourceFact::believed_servings -> Option<u32> with None

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace ActorKnownFoodSourceFact::believed_servings -> Option<u32> with None
@@ -346,17 +346,17 @@
         }
     }
 
     pub fn food_supply_id(&self) -> &FoodSupplyId {
         &self.food_supply_id
     }
 
     pub fn believed_servings(&self) -> Option<u32> {
-        self.believed_servings
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn source_key(&self) -> &str {
         &self.source_key
     }
 
     fn canonical_key(&self) -> String {
         format!(

---- epistemics::knowledge_context::tests::food_source_fact_accessors_preserve_source_and_serving_identity stdout ----

thread 'epistemics::knowledge_context::tests::food_source_fact_accessors_preserve_source_and_serving_identity' (23777) panicked at crates/tracewake-core/src/epistemics/knowledge_context.rs:1416:9:
assertion `left == right` failed
  left: None
 right: Some(2)

---- projections::tests::phase3a_semantic_actions_include_disabled_empty_food_and_known_sleep stdout ----

thread 'projections::tests::phase3a_semantic_actions_include_disabled_empty_food_and_known_sleep' (23889) panicked at crates/tracewake-core/src/projections.rs:1834:9:
assertion failed: !eat_empty.enabled

failures:
    epistemics::knowledge_context::tests::food_source_fact_accessors_preserve_source_and_serving_identity
    projections::tests::phase3a_semantic_actions_include_disabled_empty_food_and_known_sleep

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
