*** crates/tracewake-core/src/epistemics/knowledge_context.rs:354:9: replace ActorKnownFoodSourceFact::believed_servings -> Option<u32> with Some(0)

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace ActorKnownFoodSourceFact::believed_servings -> Option<u32> with Some(0)
@@ -346,17 +346,17 @@
         }
     }
 
     pub fn food_supply_id(&self) -> &FoodSupplyId {
         &self.food_supply_id
     }
 
     pub fn believed_servings(&self) -> Option<u32> {
-        self.believed_servings
+        Some(0) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn source_key(&self) -> &str {
         &self.source_key
     }
 
     fn canonical_key(&self) -> String {
         format!(

---- epistemics::knowledge_context::tests::food_source_fact_accessors_preserve_source_and_serving_identity stdout ----

thread 'epistemics::knowledge_context::tests::food_source_fact_accessors_preserve_source_and_serving_identity' (28336) panicked at crates/tracewake-core/src/epistemics/knowledge_context.rs:1416:9:
assertion `left == right` failed
  left: Some(0)
 right: Some(2)

failures:
    epistemics::knowledge_context::tests::food_source_fact_accessors_preserve_source_and_serving_identity

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
