*** crates/tracewake-core/src/epistemics/knowledge_context.rs:362:9: replace ActorKnownFoodSourceFact::canonical_key -> String with String::new()

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace ActorKnownFoodSourceFact::canonical_key -> String with String::new()
@@ -354,24 +354,17 @@
         self.believed_servings
     }
 
     pub fn source_key(&self) -> &str {
         &self.source_key
     }
 
     fn canonical_key(&self) -> String {
-        format!(
-            "{}:servings={}:{}",
-            self.food_supply_id.as_str(),
-            self.believed_servings
-                .map(|servings| servings.to_string())
-                .unwrap_or_else(|| "-".to_string()),
-            self.source_key
-        )
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
 pub struct ActorKnownSleepAffordanceFact {
     sleep_affordance_id: SleepAffordanceId,
     place_id: PlaceId,
     source_key: String,

---- epistemics::knowledge_context::tests::food_source_fact_accessors_preserve_source_and_serving_identity stdout ----

thread 'epistemics::knowledge_context::tests::food_source_fact_accessors_preserve_source_and_serving_identity' (14105) panicked at crates/tracewake-core/src/epistemics/knowledge_context.rs:1411:9:
assertion `left == right` failed
  left: ""
 right: "bread_pantry:servings=2:evt.food_source.1"

failures:
    epistemics::knowledge_context::tests::food_source_fact_accessors_preserve_source_and_serving_identity

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
