*** crates/tracewake-core/src/epistemics/knowledge_context.rs:406:9: replace ActorKnownSleepAffordanceFact::canonical_key -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace ActorKnownSleepAffordanceFact::canonical_key -> String with "xyzzy".into()
@@ -398,22 +398,17 @@
         &self.place_id
     }
 
     pub fn source_key(&self) -> &str {
         &self.source_key
     }
 
     fn canonical_key(&self) -> String {
-        format!(
-            "{}@{}:{}",
-            self.sleep_affordance_id.as_str(),
-            self.place_id.as_str(),
-            self.source_key
-        )
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
 pub struct ActorKnownRouteFact {
     from_place_id: PlaceId,
     to_place_id: PlaceId,
     source_key: String,

---- holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit stdout ----

thread 'holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit' (5376) panicked at crates/tracewake-core/tests/hidden_truth_gates.rs:919:5:
assertion `left == right` failed
  left: "hkc1-ef7952fbd6422855"
 right: "hkc1-f1a06ad6077dcb76"

failures:
    holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
