*** crates/tracewake-core/src/epistemics/knowledge_context.rs:40:9: replace AllowedKnowledgeSource::stable_id -> &'static str with ""

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace AllowedKnowledgeSource::stable_id -> &'static str with ""
@@ -32,25 +32,17 @@
     OwnSearchOrTouchObservation,
     OwnSoundObservation,
     OwnAbsenceMarker,
     OwnSourceBackedBelief,
 }
 
 impl AllowedKnowledgeSource {
     pub const fn stable_id(self) -> &'static str {
-        match self {
-            AllowedKnowledgeSource::OwnDirectObservation => "own_direct_observation",
-            AllowedKnowledgeSource::OwnSearchOrTouchObservation => {
-                "own_search_or_touch_observation"
-            }
-            AllowedKnowledgeSource::OwnSoundObservation => "own_sound_observation",
-            AllowedKnowledgeSource::OwnAbsenceMarker => "own_absence_marker",
-            AllowedKnowledgeSource::OwnSourceBackedBelief => "own_source_backed_belief",
-        }
+        "" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Copy, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
 pub enum ForbiddenKnowledgeSource {
     UnobservedEventLogTruth,
     HiddenItemLocation,
     OtherActorsPrivateBeliefs,

---- holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit stdout ----

thread 'holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit' (9660) panicked at crates/tracewake-core/tests/hidden_truth_gates.rs:919:5:
assertion `left == right` failed
  left: "hkc1-74a82b0e979c0c84"
 right: "hkc1-f1a06ad6077dcb76"

failures:
    holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
