*** crates/tracewake-core/src/epistemics/knowledge_context.rs:467:9: replace ActorKnownDoorFact::is_open -> bool with false

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace ActorKnownDoorFact::is_open -> bool with false
@@ -459,17 +459,17 @@
         &self.endpoint_a
     }
 
     pub fn endpoint_b(&self) -> &PlaceId {
         &self.endpoint_b
     }
 
     pub fn is_open(&self) -> bool {
-        self.is_open
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn is_locked(&self) -> bool {
         self.is_locked
     }
 
     pub fn blocks_movement_when_closed(&self) -> bool {
         self.blocks_movement_when_closed

---- holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit stdout ----

thread 'holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit' (14711) panicked at crates/tracewake-core/tests/hidden_truth_gates.rs:923:5:
assertion `left == right` failed
  left: "hkc1-cb17cefe4bdcf5e6"
 right: "hkc1-8ad1ae1b01750844"

failures:
    holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
