*** crates/tracewake-core/src/epistemics/knowledge_context.rs:475:9: replace ActorKnownDoorFact::blocks_movement_when_closed -> bool with true

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace ActorKnownDoorFact::blocks_movement_when_closed -> bool with true
@@ -467,17 +467,17 @@
         self.is_open
     }
 
     pub fn is_locked(&self) -> bool {
         self.is_locked
     }
 
     pub fn blocks_movement_when_closed(&self) -> bool {
-        self.blocks_movement_when_closed
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn source_key(&self) -> &str {
         &self.source_key
     }
 
     fn canonical_key(&self) -> String {
         format!(

---- holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit stdout ----

thread 'holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit' (28748) panicked at crates/tracewake-core/tests/hidden_truth_gates.rs:923:5:
assertion `left == right` failed
  left: "hkc1-80d3df4ddf397f97"
 right: "hkc1-8ad1ae1b01750844"

failures:
    holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
