*** crates/tracewake-core/src/epistemics/knowledge_context.rs:483:9: replace ActorKnownDoorFact::canonical_key -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace ActorKnownDoorFact::canonical_key -> String with "xyzzy".into()
@@ -475,26 +475,17 @@
         self.blocks_movement_when_closed
     }
 
     pub fn source_key(&self) -> &str {
         &self.source_key
     }
 
     fn canonical_key(&self) -> String {
-        format!(
-            "{}:{}->{}:open={}:locked={}:blocks={}:{}",
-            self.door_id.as_str(),
-            self.endpoint_a.as_str(),
-            self.endpoint_b.as_str(),
-            self.is_open,
-            self.is_locked,
-            self.blocks_movement_when_closed,
-            self.source_key
-        )
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
 pub struct ActorKnownContainerFact {
     container_id: ContainerId,
     is_open: bool,
     is_locked: bool,

---- holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit stdout ----

thread 'holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit' (19976) panicked at crates/tracewake-core/tests/hidden_truth_gates.rs:919:5:
assertion `left == right` failed
  left: "hkc1-9ae4efbb833405b6"
 right: "hkc1-f1a06ad6077dcb76"

failures:
    holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
