*** crates/tracewake-core/src/epistemics/knowledge_context.rs:524:9: replace ActorKnownContainerFact::is_open -> bool with true

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace ActorKnownContainerFact::is_open -> bool with true
@@ -516,17 +516,17 @@
         }
     }
 
     pub fn container_id(&self) -> &ContainerId {
         &self.container_id
     }
 
     pub fn is_open(&self) -> bool {
-        self.is_open
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn is_locked(&self) -> bool {
         self.is_locked
     }
 
     pub fn source_key(&self) -> &str {
         &self.source_key

---- holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit stdout ----

thread 'holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit' (24727) panicked at crates/tracewake-core/tests/hidden_truth_gates.rs:923:5:
assertion `left == right` failed
  left: "hkc1-5ee2f49676e0e7bf"
 right: "hkc1-8ad1ae1b01750844"

failures:
    holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
