*** crates/tracewake-core/src/epistemics/knowledge_context.rs:528:9: replace ActorKnownContainerFact::is_locked -> bool with false

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace ActorKnownContainerFact::is_locked -> bool with false
@@ -520,17 +520,17 @@
         &self.container_id
     }
 
     pub fn is_open(&self) -> bool {
         self.is_open
     }
 
     pub fn is_locked(&self) -> bool {
-        self.is_locked
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn source_key(&self) -> &str {
         &self.source_key
     }
 
     fn canonical_key(&self) -> String {
         format!(

---- holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit stdout ----

thread 'holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit' (6477) panicked at crates/tracewake-core/tests/hidden_truth_gates.rs:923:5:
assertion `left == right` failed
  left: "hkc1-63170bde4adae81f"
 right: "hkc1-8ad1ae1b01750844"

failures:
    holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
