*** crates/tracewake-core/src/epistemics/knowledge_context.rs:532:9: replace ActorKnownContainerFact::source_key -> &str with "xyzzy"

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace ActorKnownContainerFact::source_key -> &str with "xyzzy"
@@ -524,17 +524,17 @@
         self.is_open
     }
 
     pub fn is_locked(&self) -> bool {
         self.is_locked
     }
 
     pub fn source_key(&self) -> &str {
-        &self.source_key
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     fn canonical_key(&self) -> String {
         format!(
             "{}:open={}:locked={}:{}",
             self.container_id.as_str(),
             self.is_open,
             self.is_locked,

---- holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit stdout ----

thread 'holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit' (15955) panicked at crates/tracewake-core/tests/hidden_truth_gates.rs:923:5:
assertion `left == right` failed
  left: "hkc1-72b720f38dd3b759"
 right: "hkc1-8ad1ae1b01750844"

failures:
    holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
