*** crates/tracewake-core/src/epistemics/knowledge_context.rs:578:9: replace ActorKnownItemFact::portable -> bool with false

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace ActorKnownItemFact::portable -> bool with false
@@ -570,17 +570,17 @@
         &self.item_id
     }
 
     pub fn source(&self) -> &Location {
         &self.source
     }
 
     pub fn portable(&self) -> bool {
-        self.portable
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn source_key(&self) -> &str {
         &self.source_key
     }
 
     fn canonical_key(&self) -> String {
         format!(

---- holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit stdout ----

thread 'holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit' (2467) panicked at crates/tracewake-core/tests/hidden_truth_gates.rs:923:5:
assertion `left == right` failed
  left: "hkc1-a834618d2a374f95"
 right: "hkc1-8ad1ae1b01750844"

failures:
    holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
