*** crates/tracewake-core/src/epistemics/knowledge_context.rs:619:9: replace ActorKnownLocalActorFact::canonical_key -> String with String::new()

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace ActorKnownLocalActorFact::canonical_key -> String with String::new()
@@ -611,17 +611,17 @@
         &self.actor_id
     }
 
     pub fn source_key(&self) -> &str {
         &self.source_key
     }
 
     fn canonical_key(&self) -> String {
-        format!("{}:{}", self.actor_id.as_str(), self.source_key)
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl ActorKnownRouteFact {
     pub fn new(
         from_place_id: PlaceId,
         to_place_id: PlaceId,
         source_key: impl Into<String>,

---- holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit stdout ----

thread 'holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit' (3185) panicked at crates/tracewake-core/tests/hidden_truth_gates.rs:919:5:
assertion `left == right` failed
  left: "hkc1-f0e42201727b0796"
 right: "hkc1-f1a06ad6077dcb76"

failures:
    holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
