*** crates/tracewake-core/src/epistemics/knowledge_context.rs:63:9: replace ForbiddenKnowledgeSource::stable_id -> &'static str with ""

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace ForbiddenKnowledgeSource::stable_id -> &'static str with ""
@@ -55,25 +55,17 @@
     HiddenItemLocation,
     OtherActorsPrivateBeliefs,
     HumanDebugNotes,
     PreviousPossessedActorKnowledge,
 }
 
 impl ForbiddenKnowledgeSource {
     pub const fn stable_id(self) -> &'static str {
-        match self {
-            ForbiddenKnowledgeSource::UnobservedEventLogTruth => "unobserved_event_log_truth",
-            ForbiddenKnowledgeSource::HiddenItemLocation => "hidden_item_location",
-            ForbiddenKnowledgeSource::OtherActorsPrivateBeliefs => "other_actors_private_beliefs",
-            ForbiddenKnowledgeSource::HumanDebugNotes => "human_debug_notes",
-            ForbiddenKnowledgeSource::PreviousPossessedActorKnowledge => {
-                "previous_possessed_actor_knowledge"
-            }
-        }
+        "" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
 pub enum ScopeFilter {
     ActorPrivate(ActorId),
     DebugAll,
 }

---- holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit stdout ----

thread 'holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit' (19138) panicked at crates/tracewake-core/tests/hidden_truth_gates.rs:919:5:
assertion `left == right` failed
  left: "hkc1-889d9a367c8b7dcc"
 right: "hkc1-f1a06ad6077dcb76"

failures:
    holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
