*** crates/tracewake-core/src/epistemics/knowledge_context.rs:690:9: replace KnowledgeContextStatus::stable_id -> &'static str with "xyzzy"

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace KnowledgeContextStatus::stable_id -> &'static str with "xyzzy"
@@ -682,21 +682,17 @@
 pub enum KnowledgeContextStatus {
     Current,
     Stale,
     Invalid,
 }
 
 impl KnowledgeContextStatus {
     pub const fn stable_id(self) -> &'static str {
-        match self {
-            KnowledgeContextStatus::Current => "current",
-            KnowledgeContextStatus::Stale => "stale",
-            KnowledgeContextStatus::Invalid => "invalid",
-        }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq)]
 pub struct KnowledgeContext {
     viewer_actor_id: ActorId,
     bound_actor_id: ActorId,
     mode: ViewMode,

---- holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit stdout ----

thread 'holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit' (17617) panicked at crates/tracewake-core/tests/hidden_truth_gates.rs:919:5:
assertion `left == right` failed
  left: "hkc1-b68953a9afc6c4d5"
 right: "hkc1-f1a06ad6077dcb76"

failures:
    holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
