*** crates/tracewake-core/src/epistemics/knowledge_context.rs:83:9: replace ScopeFilter::canonical_key -> String with String::new()

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace ScopeFilter::canonical_key -> String with String::new()
@@ -75,22 +75,17 @@
 #[derive(Clone, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
 pub enum ScopeFilter {
     ActorPrivate(ActorId),
     DebugAll,
 }
 
 impl ScopeFilter {
     fn canonical_key(&self) -> String {
-        match self {
-            ScopeFilter::ActorPrivate(actor_id) => {
-                format!("actor_private:{}", actor_id.as_str())
-            }
-            ScopeFilter::DebugAll => "debug_all".to_string(),
-        }
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
 pub enum KnowledgeProvenanceKind {
     Perception,
     Memory,
     Observation,

---- holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit stdout ----

thread 'holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit' (28616) panicked at crates/tracewake-core/tests/hidden_truth_gates.rs:919:5:
assertion `left == right` failed
  left: "hkc1-afede8a790c8e85a"
 right: "hkc1-f1a06ad6077dcb76"

failures:
    holder_known_fact_family_report_fingerprint_covers_keys_fields_and_audit

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
