*** crates/tracewake-core/src/epistemics/knowledge_context.rs:83:9: replace ScopeFilter::canonical_key -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-core/src/epistemics/knowledge_context.rs
+++ replace ScopeFilter::canonical_key -> String with "xyzzy".into()
@@ -75,22 +75,17 @@
 #[derive(Clone, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
 pub enum ScopeFilter {
     ActorPrivate(ActorId),
     DebugAll,
 }
 
 impl ScopeFilter {
     fn canonical_key(&self) -> String {
-        match self {
-            ScopeFilter::ActorPrivate(actor_id) => {
-                format!("actor_private:{}", actor_id.as_str())
-            }
-            ScopeFilter::DebugAll => "debug_all".to_string(),
-        }
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
 pub enum KnowledgeProvenanceKind {
     Perception,
     Memory,
     Observation,

---- projections::tests::view_models_embodied_phase3a_status_is_viewer_scoped_and_actor_known stdout ----

thread 'projections::tests::view_models_embodied_phase3a_status_is_viewer_scoped_and_actor_known' (626) panicked at crates/tracewake-core/src/projections.rs:2791:9:
assertion failed: !rendered.contains("900")

failures:
    projections::tests::view_models_embodied_phase3a_status_is_viewer_scoped_and_actor_known

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
