*** crates/tracewake-core/src/epistemics/observation.rs:179:9: replace Observation::observed_tick -> SimTick with Default::default()

*** mutation diff:
--- crates/tracewake-core/src/epistemics/observation.rs
+++ replace Observation::observed_tick -> SimTick with Default::default()
@@ -171,17 +171,17 @@
         &self.observer_actor_id
     }
 
     pub fn channel(&self) -> Channel {
         self.channel
     }
 
     pub fn observed_tick(&self) -> SimTick {
-        self.observed_tick
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn tick_window(&self) -> TickWindow {
         self.tick_window
     }
 
     pub fn observer_place_id(&self) -> &PlaceId {
         &self.observer_place_id

---- aged_food_record_surfaces_as_remembered_belief stdout ----

thread 'aged_food_record_surfaces_as_remembered_belief' (29778) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2659:5:
assertion `left == right` failed
  left: Some(SimTick(0))
 right: Some(SimTick(4))

failures:
    aged_food_record_surfaces_as_remembered_belief

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.59s

*** result: Failure(101)
