*** crates/tracewake-core/src/epistemics/observation.rs:199:9: replace Observation::raw_payload -> &[PayloadField] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/tracewake-core/src/epistemics/observation.rs
+++ replace Observation::raw_payload -> &[PayloadField] with Vec::leak(Vec::new())
@@ -191,17 +191,17 @@
         &self.subject
     }
 
     pub fn target(&self) -> &ObservationTarget {
         &self.target
     }
 
     pub fn raw_payload(&self) -> &[PayloadField] {
-        &self.raw_payload
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn confidence(&self) -> Confidence {
         self.confidence
     }
 
     pub fn source(&self) -> &SourceRef {
         &self.source

---- aged_food_record_surfaces_as_remembered_belief stdout ----

thread 'aged_food_record_surfaces_as_remembered_belief' (1457) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2648:5:
assertion failed: surface.context().known_food_sources().contains("food_stew_home_tomas")

---- severe_safety_with_known_exit_produces_move_and_replays stdout ----

thread 'severe_safety_with_known_exit_produces_move_and_replays' (1492) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1715:10:
severe safety should commit a move

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (1468) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

failures:
    aged_food_record_surfaces_as_remembered_belief
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    severe_safety_with_known_exit_produces_move_and_replays

test result: FAILED. 38 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.39s

*** result: Failure(101)
