*** crates/tracewake-core/src/epistemics/observation.rs:211:9: replace Observation::alternatives -> &BTreeSet<String> with Box::leak(Box::new(BTreeSet::new()))

*** mutation diff:
--- crates/tracewake-core/src/epistemics/observation.rs
+++ replace Observation::alternatives -> &BTreeSet<String> with Box::leak(Box::new(BTreeSet::new()))
@@ -203,17 +203,17 @@
         self.confidence
     }
 
     pub fn source(&self) -> &SourceRef {
         &self.source
     }
 
     pub fn alternatives(&self) -> &BTreeSet<String> {
-        &self.alternatives
+        Box::leak(Box::new(BTreeSet::new())) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn schema_version(&self) -> &SchemaVersion {
         &self.schema_version
     }
 
     pub fn privacy_scope(&self) -> &PrivacyScope {
         &self.privacy_scope

---- epistemics::observation::tests::sound_observation_carries_low_confidence_and_alternatives stdout ----

thread 'epistemics::observation::tests::sound_observation_carries_low_confidence_and_alternatives' (5897) panicked at crates/tracewake-core/src/epistemics/observation.rs:277:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    epistemics::observation::tests::sound_observation_carries_low_confidence_and_alternatives

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
