*** crates/tracewake-core/src/epistemics/observation.rs:211:9: replace Observation::alternatives -> &BTreeSet<String> with Box::leak(Box::new(BTreeSet::from_iter(["xyzzy".into()])))

*** mutation diff:
--- crates/tracewake-core/src/epistemics/observation.rs
+++ replace Observation::alternatives -> &BTreeSet<String> with Box::leak(Box::new(BTreeSet::from_iter(["xyzzy".into()])))
@@ -203,17 +203,17 @@
         self.confidence
     }
 
     pub fn source(&self) -> &SourceRef {
         &self.source
     }
 
     pub fn alternatives(&self) -> &BTreeSet<String> {
-        &self.alternatives
+        Box::leak(Box::new(BTreeSet::from_iter(["xyzzy".into()]))) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn schema_version(&self) -> &SchemaVersion {
         &self.schema_version
     }
 
     pub fn privacy_scope(&self) -> &PrivacyScope {
         &self.privacy_scope

---- epistemics::observation::tests::observation_is_not_a_belief stdout ----

thread 'epistemics::observation::tests::observation_is_not_a_belief' (15014) panicked at crates/tracewake-core/src/epistemics/observation.rs:336:9:
assertion failed: observation.alternatives().is_empty()

---- epistemics::observation::tests::sound_observation_carries_low_confidence_and_alternatives stdout ----

thread 'epistemics::observation::tests::sound_observation_carries_low_confidence_and_alternatives' (15015) panicked at crates/tracewake-core/src/epistemics/observation.rs:277:9:
assertion `left == right` failed
  left: 1
 right: 2

failures:
    epistemics::observation::tests::observation_is_not_a_belief
    epistemics::observation::tests::sound_observation_carries_low_confidence_and_alternatives

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
