*** crates/tracewake-core/src/epistemics/observation.rs:25:9: replace Confidence::parts_per_thousand -> u16 with 0

*** mutation diff:
--- crates/tracewake-core/src/epistemics/observation.rs
+++ replace Confidence::parts_per_thousand -> u16 with 0
@@ -17,17 +17,17 @@
         if parts_per_thousand <= Self::MAX.0 {
             Ok(Self(parts_per_thousand))
         } else {
             Err(ConfidenceError::OutOfRange { parts_per_thousand })
         }
     }
 
     pub const fn parts_per_thousand(self) -> u16 {
-        self.0
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     pub const fn is_low(self) -> bool {
         self.0 <= 350
     }
 
     pub fn serialize_canonical(self) -> String {
         format!("{:04}", self.0)

---- observation_confidence_debug_evidence_crosses_low_boundary_and_replays stdout ----

thread 'observation_confidence_debug_evidence_crosses_low_boundary_and_replays' (23528) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:2279:5:
assertion `left == right` failed
  left: [("observation_confidence_low_250", 0, "low"), ("observation_confidence_low_boundary_350", 0, "low"), ("observation_confidence_standard_875", 0, "standard"), ("observation_confidence_standard_boundary_351", 0, "standard")]
 right: [("observation_confidence_low_250", 250, "low"), ("observation_confidence_low_boundary_350", 350, "low"), ("observation_confidence_standard_875", 875, "standard"), ("observation_confidence_standard_boundary_351", 351, "standard")]

failures:
    observation_confidence_debug_evidence_crosses_low_boundary_and_replays

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
