*** crates/tracewake-core/src/epistemics/observation.rs:29:9: replace Confidence::is_low -> bool with true

*** mutation diff:
--- crates/tracewake-core/src/epistemics/observation.rs
+++ replace Confidence::is_low -> bool with true
@@ -21,17 +21,17 @@
         }
     }
 
     pub const fn parts_per_thousand(self) -> u16 {
         self.0
     }
 
     pub const fn is_low(self) -> bool {
-        self.0 <= 350
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn serialize_canonical(self) -> String {
         format!("{:04}", self.0)
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq)]

---- observation_confidence_debug_evidence_crosses_low_boundary_and_replays stdout ----

thread 'observation_confidence_debug_evidence_crosses_low_boundary_and_replays' (464) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:2279:5:
assertion `left == right` failed
  left: [("observation_confidence_low_250", 250, "low"), ("observation_confidence_low_boundary_350", 350, "low"), ("observation_confidence_standard_875", 875, "low"), ("observation_confidence_standard_boundary_351", 351, "low")]
 right: [("observation_confidence_low_250", 250, "low"), ("observation_confidence_low_boundary_350", 350, "low"), ("observation_confidence_standard_875", 875, "standard"), ("observation_confidence_standard_boundary_351", 351, "standard")]

failures:
    observation_confidence_debug_evidence_crosses_low_boundary_and_replays

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
