*** crates/tracewake-core/src/epistemics/observation.rs:29:9: replace Confidence::is_low -> bool with false

*** mutation diff:
--- crates/tracewake-core/src/epistemics/observation.rs
+++ replace Confidence::is_low -> bool with false
@@ -21,17 +21,17 @@
         }
     }
 
     pub const fn parts_per_thousand(self) -> u16 {
         self.0
     }
 
     pub const fn is_low(self) -> bool {
-        self.0 <= 350
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn serialize_canonical(self) -> String {
         format!("{:04}", self.0)
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq)]

---- epistemics::observation::tests::sound_observation_carries_low_confidence_and_alternatives stdout ----

thread 'epistemics::observation::tests::sound_observation_carries_low_confidence_and_alternatives' (4837) panicked at crates/tracewake-core/src/epistemics/observation.rs:275:9:
assertion failed: observation.confidence().is_low()

failures:
    epistemics::observation::tests::sound_observation_carries_low_confidence_and_alternatives

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
