*** crates/tracewake-core/src/epistemics/observation.rs:33:9: replace Confidence::serialize_canonical -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-core/src/epistemics/observation.rs
+++ replace Confidence::serialize_canonical -> String with "xyzzy".into()
@@ -25,17 +25,17 @@
         self.0
     }
 
     pub const fn is_low(self) -> bool {
         self.0 <= 350
     }
 
     pub fn serialize_canonical(self) -> String {
-        format!("{:04}", self.0)
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq)]
 pub enum ConfidenceError {
     OutOfRange { parts_per_thousand: u16 },
 }

---- validate::tests::fixture_serialization_golden_bytes_are_pinned_001 stdout ----

thread 'validate::tests::fixture_serialization_golden_bytes_are_pinned_001' (17571) panicked at crates/tracewake-content/src/validate.rs:3216:13:
assertion `left == right` failed: phase2a serialization golden changed

failures:
    validate::tests::fixture_serialization_golden_bytes_are_pinned_001

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
