*** crates/tracewake-core/src/epistemics/observation.rs:53:9: replace Channel::stable_id -> &'static str with ""

*** mutation diff:
--- crates/tracewake-core/src/epistemics/observation.rs
+++ replace Channel::stable_id -> &'static str with ""
@@ -45,23 +45,17 @@
     TouchOrSearch,
     SimpleSound,
     AbsenceMarker,
     ReadingPlaceholderSchemaOnly,
 }
 
 impl Channel {
     pub const fn stable_id(self) -> &'static str {
-        match self {
-            Channel::DirectSight => "direct_sight",
-            Channel::TouchOrSearch => "touch_or_search",
-            Channel::SimpleSound => "simple_sound",
-            Channel::AbsenceMarker => "absence_marker",
-            Channel::ReadingPlaceholderSchemaOnly => "reading_placeholder_schema_only",
-        }
+        "" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Copy, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
 pub struct TickWindow {
     pub start_tick: SimTick,
     pub end_tick: SimTick,
 }

---- phase2a_fixtures_are_registered_and_script_free stdout ----

thread 'phase2a_fixtures_are_registered_and_script_free' (21609) panicked at crates/tracewake-content/tests/fixtures_load.rs:1546:56:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Serialization, path: "fixture", code: "serialization_drift", message: "fixture serialization changed canonical content" }] } }

---- all_fixtures_load_deterministically_and_validate stdout ----

thread 'all_fixtures_load_deterministically_and_validate' (21585) panicked at crates/tracewake-content/tests/fixtures_load.rs:591:54:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Serialization, path: "fixture", code: "serialization_drift", message: "fixture serialization changed canonical content" }] } }

failures:
    all_fixtures_load_deterministically_and_validate
    phase2a_fixtures_are_registered_and_script_free

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
