*** crates/tracewake-core/src/epistemics/observation.rs:53:9: replace Channel::stable_id -> &'static str with "xyzzy"

*** mutation diff:
--- crates/tracewake-core/src/epistemics/observation.rs
+++ replace Channel::stable_id -> &'static str with "xyzzy"
@@ -45,23 +45,17 @@
     TouchOrSearch,
     SimpleSound,
     AbsenceMarker,
     ReadingPlaceholderSchemaOnly,
 }
 
 impl Channel {
     pub const fn stable_id(self) -> &'static str {
-        match self {
-            Channel::DirectSight => "direct_sight",
-            Channel::TouchOrSearch => "touch_or_search",
-            Channel::SimpleSound => "simple_sound",
-            Channel::AbsenceMarker => "absence_marker",
-            Channel::ReadingPlaceholderSchemaOnly => "reading_placeholder_schema_only",
-        }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Copy, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
 pub struct TickWindow {
     pub start_tick: SimTick,
     pub end_tick: SimTick,
 }

---- phase2a_fixtures_are_registered_and_script_free stdout ----

thread 'phase2a_fixtures_are_registered_and_script_free' (25640) panicked at crates/tracewake-content/tests/fixtures_load.rs:1546:56:

---- all_fixtures_load_deterministically_and_validate stdout ----

thread 'all_fixtures_load_deterministically_and_validate' (25616) panicked at crates/tracewake-content/tests/fixtures_load.rs:591:54:

failures:
    all_fixtures_load_deterministically_and_validate
    phase2a_fixtures_are_registered_and_script_free

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
