*** crates/tracewake-core/src/epistemics/projection.rs:1086:5: replace actor_known_projection_policy_kinds -> BTreeMap<&'static str, ActorKnownProjectionKindPolicy> with BTreeMap::new()

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace actor_known_projection_policy_kinds -> BTreeMap<&'static str, ActorKnownProjectionKindPolicy> with BTreeMap::new()
@@ -1078,98 +1078,17 @@
                 source_tick.value()
             ),
         }
     }
 }
 
 pub fn actor_known_projection_policy_kinds(
 ) -> BTreeMap<&'static str, ActorKnownProjectionKindPolicy> {
-    BTreeMap::from([
-        (
-            "current_place",
-            ActorKnownProjectionKindPolicy {
-                classification: ActorKnownProjectionPolicy::ReclassifyWhenStale,
-                embodied_scope: ActorKnownProjectionEmbodiedScope::LatestCurrentPlaceOnly,
-                accessibility_scope: ActorKnownProjectionAccessibilityScope::None,
-            },
-        ),
-        (
-            "carried_item",
-            ActorKnownProjectionKindPolicy {
-                classification: ActorKnownProjectionPolicy::ReclassifyWhenStale,
-                embodied_scope: ActorKnownProjectionEmbodiedScope::LatestCurrentPlaceOnly,
-                accessibility_scope: ActorKnownProjectionAccessibilityScope::None,
-            },
-        ),
-        (
-            "route",
-            ActorKnownProjectionKindPolicy {
-                classification: ActorKnownProjectionPolicy::ReclassifyWhenStale,
-                embodied_scope: ActorKnownProjectionEmbodiedScope::LatestCurrentPlaceOnly,
-                accessibility_scope: ActorKnownProjectionAccessibilityScope::None,
-            },
-        ),
-        (
-            "food_source",
-            ActorKnownProjectionKindPolicy {
-                classification: ActorKnownProjectionPolicy::ReclassifyWhenStale,
-                embodied_scope: ActorKnownProjectionEmbodiedScope::LatestCurrentPlaceOnly,
-                accessibility_scope: ActorKnownProjectionAccessibilityScope::FromAnyPlace,
-            },
-        ),
-        (
-            "local_actor",
-            ActorKnownProjectionKindPolicy {
-                classification: ActorKnownProjectionPolicy::ReclassifyWhenStale,
-                embodied_scope: ActorKnownProjectionEmbodiedScope::LatestCurrentPlaceOnly,
-                accessibility_scope: ActorKnownProjectionAccessibilityScope::None,
-            },
-        ),
-        (
-            "local_container",
-            ActorKnownProjectionKindPolicy {
-                classification: ActorKnownProjectionPolicy::ReclassifyWhenStale,
-                embodied_scope: ActorKnownProjectionEmbodiedScope::LatestCurrentPlaceOnly,
-                accessibility_scope: ActorKnownProjectionAccessibilityScope::None,
-            },
-        ),
-        (
-            "local_door",
-            ActorKnownProjectionKindPolicy {
-                classification: ActorKnownProjectionPolicy::ReclassifyWhenStale,
-                embodied_scope: ActorKnownProjectionEmbodiedScope::LatestCurrentPlaceOnly,
-                accessibility_scope: ActorKnownProjectionAccessibilityScope::None,
-            },
-        ),
-        (
-            "local_item",
-            ActorKnownProjectionKindPolicy {
-                classification: ActorKnownProjectionPolicy::ReclassifyWhenStale,
-                embodied_scope: ActorKnownProjectionEmbodiedScope::LatestCurrentPlaceOnly,
-                accessibility_scope: ActorKnownProjectionAccessibilityScope::None,
-            },
-        ),
-        (
-            "sleep_place",
-            ActorKnownProjectionKindPolicy {
-                classification: ActorKnownProjectionPolicy::ReclassifyWhenStale,
-                embodied_scope: ActorKnownProjectionEmbodiedScope::LatestCurrentPlaceOnly,
-                accessibility_scope: ActorKnownProjectionAccessibilityScope::FromAnyPlace,
-            },
-        ),
-        (
-            "workplace",
-            ActorKnownProjectionKindPolicy {
-                classification: ActorKnownProjectionPolicy::SupersedeNewestBySubject,
-                embodied_scope: ActorKnownProjectionEmbodiedScope::CurrentPlaceOnly,
-                accessibility_scope: ActorKnownProjectionAccessibilityScope::FromAnyPlace,
-            },
-        ),
-    ])
+    BTreeMap::new() /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn actor_known_projection_kind_policy(kind: &str) -> ActorKnownProjectionKindPolicy {
     let mut policies = actor_known_projection_policy_kinds();
     policies
         .remove(kind)
         .unwrap_or_else(|| panic!("unknown actor-known projection kind: {kind}"))
 }

---- stale_workplace_notice_superseded_by_newer_001 stdout ----

thread 'stale_workplace_notice_superseded_by_newer_001' (3630) panicked at crates/tracewake-core/src/epistemics/projection.rs:1093:28:
unknown actor-known projection kind: current_place

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (3628) panicked at crates/tracewake-core/src/epistemics/projection.rs:1093:28:
unknown actor-known projection kind: current_place

---- seed_event_log_order_and_projection_provenance_are_causal_and_stable stdout ----

thread 'seed_event_log_order_and_projection_provenance_are_causal_and_stable' (3627) panicked at crates/tracewake-core/src/epistemics/projection.rs:1093:28:
unknown actor-known projection kind: sleep_place

failures:
    seed_event_log_order_and_projection_provenance_are_causal_and_stable
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food
    stale_workplace_notice_superseded_by_newer_001

test result: FAILED. 31 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
