*** crates/tracewake-core/src/epistemics/projection.rs:1180:5: replace newest_workplace_records -> BTreeMap<WorkplaceId, &'a ActorKnownProjectionRecord> with BTreeMap::new()

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace newest_workplace_records -> BTreeMap<WorkplaceId, &'a ActorKnownProjectionRecord> with BTreeMap::new()
@@ -1172,29 +1172,17 @@
     policies
         .remove(kind)
         .unwrap_or_else(|| panic!("unknown actor-known projection kind: {kind}"))
 }
 
 fn newest_workplace_records<'a>(
     records: Option<&'a BTreeSet<ActorKnownProjectionRecord>>,
 ) -> BTreeMap<WorkplaceId, &'a ActorKnownProjectionRecord> {
-    let mut newest: BTreeMap<WorkplaceId, &'a ActorKnownProjectionRecord> = BTreeMap::new();
-    for record in records.into_iter().flat_map(|records| records.iter()) {
-        let ActorKnownProjectionRecord::Workplace { workplace_id, .. } = record else {
-            continue;
-        };
-        if newest
-            .get(workplace_id)
-            .is_none_or(|previous| workplace_record_is_newer(record, previous))
-        {
-            newest.insert(workplace_id.clone(), record);
-        }
-    }
-    newest
+    BTreeMap::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn workplace_record_is_newer(
     candidate: &ActorKnownProjectionRecord,
     previous: &ActorKnownProjectionRecord,
 ) -> bool {
     candidate.source_tick() > previous.source_tick()
         || (candidate.source_tick() == previous.source_tick()

---- stale_workplace_notice_superseded_by_newer_001 stdout ----

thread 'stale_workplace_notice_superseded_by_newer_001' (7698) panicked at crates/tracewake-content/tests/fixtures_load.rs:1156:5:
assertion `left == right` failed
  left: 0
 right: 1

---- seed_event_log_order_and_projection_provenance_are_causal_and_stable stdout ----

thread 'seed_event_log_order_and_projection_provenance_are_causal_and_stable' (7695) panicked at crates/tracewake-content/tests/fixtures_load.rs:1013:10:
role notice seed replays into projection with source event id

failures:
    seed_event_log_order_and_projection_provenance_are_causal_and_stable
    stale_workplace_notice_superseded_by_newer_001

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
