*** crates/tracewake-core/src/epistemics/projection.rs:1199:5: replace workplace_record_is_newer -> bool with true

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace workplace_record_is_newer -> bool with true
@@ -1191,19 +1191,17 @@
     }
     newest
 }
 
 fn workplace_record_is_newer(
     candidate: &ActorKnownProjectionRecord,
     previous: &ActorKnownProjectionRecord,
 ) -> bool {
-    candidate.source_tick() > previous.source_tick()
-        || (candidate.source_tick() == previous.source_tick()
-            && candidate.source_event_id() > previous.source_event_id())
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn reclassifying_record_freshness(
     record: &ActorKnownProjectionRecord,
     latest_current_place_record: bool,
     context_tick: SimTick,
 ) -> ActorKnownProjectionFreshness {
     if !matches!(

---- epistemics::projection::tests::actor_known_classification_helpers_preserve_freshness_keys_and_sources stdout ----

thread 'epistemics::projection::tests::actor_known_classification_helpers_preserve_freshness_keys_and_sources' (12075) panicked at crates/tracewake-core/src/epistemics/projection.rs:1917:9:
assertion failed: !workplace_record_is_newer(&previous, &later_event)

failures:
    epistemics::projection::tests::actor_known_classification_helpers_preserve_freshness_keys_and_sources

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
