*** crates/tracewake-core/src/epistemics/projection.rs:1199:5: replace workplace_record_is_newer -> bool with false

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace workplace_record_is_newer -> bool with false
@@ -1191,19 +1191,17 @@
     }
     newest
 }
 
 fn workplace_record_is_newer(
     candidate: &ActorKnownProjectionRecord,
     previous: &ActorKnownProjectionRecord,
 ) -> bool {
-    candidate.source_tick() > previous.source_tick()
-        || (candidate.source_tick() == previous.source_tick()
-            && candidate.source_event_id() > previous.source_event_id())
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn reclassifying_record_freshness(
     record: &ActorKnownProjectionRecord,
     latest_current_place_record: bool,
     context_tick: SimTick,
 ) -> ActorKnownProjectionFreshness {
     if !matches!(

---- stale_workplace_notice_superseded_by_newer_001 stdout ----

thread 'stale_workplace_notice_superseded_by_newer_001' (16300) panicked at crates/tracewake-content/tests/fixtures_load.rs:1159:5:
assertion failed: workplace.believed_access_open()

failures:
    stale_workplace_notice_superseded_by_newer_001

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
