*** crates/tracewake-core/src/epistemics/projection.rs:1201:44: replace > with >= in workplace_record_is_newer

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace > with >= in workplace_record_is_newer
@@ -1193,17 +1193,17 @@
 }
 
 fn workplace_record_is_newer(
     candidate: &ActorKnownProjectionRecord,
     previous: &ActorKnownProjectionRecord,
 ) -> bool {
     candidate.source_tick() > previous.source_tick()
         || (candidate.source_tick() == previous.source_tick()
-            && candidate.source_event_id() > previous.source_event_id())
+            && candidate.source_event_id() >= /* ~ changed by cargo-mutants ~ */ previous.source_event_id())
 }
 
 fn reclassifying_record_freshness(
     record: &ActorKnownProjectionRecord,
     latest_current_place_record: bool,
     context_tick: SimTick,
 ) -> ActorKnownProjectionFreshness {
     if !matches!(

---- epistemics::projection::tests::actor_known_classification_helpers_preserve_freshness_keys_and_sources stdout ----

thread 'epistemics::projection::tests::actor_known_classification_helpers_preserve_freshness_keys_and_sources' (23084) panicked at crates/tracewake-core/src/epistemics/projection.rs:1920:9:
assertion failed: !workplace_record_is_newer(&previous, &previous)

failures:
    epistemics::projection::tests::actor_known_classification_helpers_preserve_freshness_keys_and_sources

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
