*** crates/tracewake-core/src/epistemics/projection.rs:1221:37: replace || with && in reclassifying_record_freshness

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace || with && in reclassifying_record_freshness
@@ -1213,17 +1213,17 @@
             | ActorKnownProjectionSource::VisibleDoor
             | ActorKnownProjectionSource::VisibleContainer
             | ActorKnownProjectionSource::VisibleItem
             | ActorKnownProjectionSource::VisibleActor
             | ActorKnownProjectionSource::VisibleSleepAffordance
     ) {
         return ActorKnownProjectionFreshness::Remembered;
     }
-    if !latest_current_place_record || record.source_tick() != context_tick {
+    if !latest_current_place_record && /* ~ changed by cargo-mutants ~ */ record.source_tick() != context_tick {
         return ActorKnownProjectionFreshness::Remembered;
     }
     ActorKnownProjectionFreshness::CurrentlyPerceived
 }
 
 fn location_key(location: &Location) -> String {
     match location {
         Location::AtPlace(place_id) => format!("place:{}", place_id.as_str()),

---- aged_food_record_surfaces_as_remembered_belief stdout ----

thread 'aged_food_record_surfaces_as_remembered_belief' (31909) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2658:5:
assertion `left == right` failed
  left: "observed_now"
 right: "remembered_belief"

failures:
    aged_food_record_surfaces_as_remembered_belief

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.57s

*** result: Failure(101)
