*** crates/tracewake-core/src/epistemics/projection.rs:1221:8: delete ! in reclassifying_record_freshness

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ delete ! in reclassifying_record_freshness
@@ -1213,17 +1213,17 @@
             | ActorKnownProjectionSource::VisibleDoor
             | ActorKnownProjectionSource::VisibleContainer
             | ActorKnownProjectionSource::VisibleItem
             | ActorKnownProjectionSource::VisibleActor
             | ActorKnownProjectionSource::VisibleSleepAffordance
     ) {
         return ActorKnownProjectionFreshness::Remembered;
     }
-    if !latest_current_place_record || record.source_tick() != context_tick {
+    if  /* ~ changed by cargo-mutants ~ */latest_current_place_record || record.source_tick() != context_tick {
         return ActorKnownProjectionFreshness::Remembered;
     }
     ActorKnownProjectionFreshness::CurrentlyPerceived
 }
 
 fn location_key(location: &Location) -> String {
     match location {
         Location::AtPlace(place_id) => format!("place:{}", place_id.as_str()),

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (3551) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (3552) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2714:5:
assertion failed: has_event(&log, EventKind::ActorMoved)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection

test result: FAILED. 40 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.46s

*** result: Failure(101)
