*** crates/tracewake-core/src/epistemics/projection.rs:1228:5: replace location_key -> String with String::new()

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace location_key -> String with String::new()
@@ -1220,21 +1220,17 @@
     }
     if !latest_current_place_record || record.source_tick() != context_tick {
         return ActorKnownProjectionFreshness::Remembered;
     }
     ActorKnownProjectionFreshness::CurrentlyPerceived
 }
 
 fn location_key(location: &Location) -> String {
-    match location {
-        Location::AtPlace(place_id) => format!("place:{}", place_id.as_str()),
-        Location::InContainer(container_id) => format!("container:{}", container_id.as_str()),
-        Location::CarriedBy(actor_id) => format!("carried:{}", actor_id.as_str()),
-    }
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn is_latest_current_place_record(
     record: &ActorKnownProjectionRecord,
     current_place_id: &PlaceId,
     latest_current_place_tick: Option<SimTick>,
 ) -> bool {
     record.relevant_place_id() == current_place_id

---- epistemics::projection::tests::actor_known_classification_helpers_preserve_freshness_keys_and_sources stdout ----

thread 'epistemics::projection::tests::actor_known_classification_helpers_preserve_freshness_keys_and_sources' (12044) panicked at crates/tracewake-core/src/epistemics/projection.rs:1939:9:
assertion `left == right` failed
  left: ""
 right: "place:home_tomas"

---- epistemics::projection::tests::actor_known_sources_and_canonical_records_are_stable stdout ----

thread 'epistemics::projection::tests::actor_known_sources_and_canonical_records_are_stable' (12049) panicked at crates/tracewake-core/src/epistemics/projection.rs:1877:9:
assertion failed: canonical.iter().any(|line|
        line ==
            "carried_item|id=notebook_01|place=home_tomas|location=carried:actor_tomas|portable=true|source=carried_item|event=event_carried_item|tick=4")

failures:
    epistemics::projection::tests::actor_known_classification_helpers_preserve_freshness_keys_and_sources
    epistemics::projection::tests::actor_known_sources_and_canonical_records_are_stable

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
