*** crates/tracewake-core/src/epistemics/projection.rs:1240:32: replace == with != in is_latest_current_place_record

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace == with != in is_latest_current_place_record
@@ -1232,17 +1232,17 @@
     }
 }
 
 fn is_latest_current_place_record(
     record: &ActorKnownProjectionRecord,
     current_place_id: &PlaceId,
     latest_current_place_tick: Option<SimTick>,
 ) -> bool {
-    record.relevant_place_id() == current_place_id
+    record.relevant_place_id() != /* ~ changed by cargo-mutants ~ */ current_place_id
         && Some(record.source_tick()) == latest_current_place_tick
 }
 
 fn actor_known_records_from_observation(
     observation: &Observation,
 ) -> Vec<ActorKnownProjectionRecord> {
     let Some(source_event_id) = source_event_id(observation.source()) else {
         return Vec::new();

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (1617) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (1618) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2714:5:
assertion failed: has_event(&log, EventKind::ActorMoved)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection

test result: FAILED. 40 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.47s

*** result: Failure(101)
