*** crates/tracewake-core/src/epistemics/projection.rs:1240:5: replace is_latest_current_place_record -> bool with true

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace is_latest_current_place_record -> bool with true
@@ -1232,18 +1232,17 @@
     }
 }
 
 fn is_latest_current_place_record(
     record: &ActorKnownProjectionRecord,
     current_place_id: &PlaceId,
     latest_current_place_tick: Option<SimTick>,
 ) -> bool {
-    record.relevant_place_id() == current_place_id
-        && Some(record.source_tick()) == latest_current_place_tick
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn actor_known_records_from_observation(
     observation: &Observation,
 ) -> Vec<ActorKnownProjectionRecord> {
     let Some(source_event_id) = source_event_id(observation.source()) else {
         return Vec::new();
     };

---- agent::perception::tests::embodied_context_filters_reclassified_records_by_declared_scope_but_no_human_keeps_memory stdout ----

thread 'agent::perception::tests::embodied_context_filters_reclassified_records_by_declared_scope_but_no_human_keeps_memory' (21073) panicked at crates/tracewake-core/src/agent/perception.rs:1192:9:
assertion failed: !sleep_record.record().policy().includes_in_embodied_context(sleep_record.is_current_place_record(),
        sleep_record.is_latest_current_place_record())

---- agent::perception::tests::current_place_knowledge_context_uses_latest_projection_window_not_live_truth stdout ----

thread 'agent::perception::tests::current_place_knowledge_context_uses_latest_projection_window_not_live_truth' (21069) panicked at crates/tracewake-core/src/agent/perception.rs:1077:9:
assertion failed: !refreshed_context.actor_known_food_sources().iter().any(|fact|
            fact.food_supply_id().as_str() == "food_breakfast_tomas")

---- agent::perception::tests::current_place_knowledge_context_keeps_remembered_workplace_notice_after_newer_perception stdout ----

thread 'agent::perception::tests::current_place_knowledge_context_keeps_remembered_workplace_notice_after_newer_perception' (21067) panicked at crates/tracewake-core/src/agent/perception.rs:1311:9:
assertion failed: classified.iter().any(|record|
        {
            matches!(record.record(), ActorKnownProjectionRecord::Workplace
                        { workplace_id, .. } if workplace_id.as_str() ==
                        "workplace_tomas") &&
                    record.freshness() ==
                        ActorKnownProjectionFreshness::Remembered &&
                !record.is_latest_current_place_record()
        })

failures:
    agent::perception::tests::current_place_knowledge_context_keeps_remembered_workplace_notice_after_newer_perception
    agent::perception::tests::current_place_knowledge_context_uses_latest_projection_window_for_sleep_affordances
    agent::perception::tests::current_place_knowledge_context_uses_latest_projection_window_not_live_truth
    agent::perception::tests::embodied_context_filters_reclassified_records_by_declared_scope_but_no_human_keeps_memory

test result: FAILED. 451 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
