*** crates/tracewake-core/src/epistemics/projection.rs:1241:9: replace && with || in is_latest_current_place_record

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace && with || in is_latest_current_place_record
@@ -1233,17 +1233,17 @@
 }
 
 fn is_latest_current_place_record(
     record: &ActorKnownProjectionRecord,
     current_place_id: &PlaceId,
     latest_current_place_tick: Option<SimTick>,
 ) -> bool {
     record.relevant_place_id() == current_place_id
-        && Some(record.source_tick()) == latest_current_place_tick
+        || /* ~ changed by cargo-mutants ~ */ Some(record.source_tick()) == latest_current_place_tick
 }
 
 fn actor_known_records_from_observation(
     observation: &Observation,
 ) -> Vec<ActorKnownProjectionRecord> {
     let Some(source_event_id) = source_event_id(observation.source()) else {
         return Vec::new();
     };

---- agent::perception::tests::current_place_knowledge_context_keeps_remembered_workplace_notice_after_newer_perception stdout ----

thread 'agent::perception::tests::current_place_knowledge_context_keeps_remembered_workplace_notice_after_newer_perception' (29725) panicked at crates/tracewake-core/src/agent/perception.rs:1311:9:
assertion failed: classified.iter().any(|record|
        {
            matches!(record.record(), ActorKnownProjectionRecord::Workplace
                        { workplace_id, .. } if workplace_id.as_str() ==
                        "workplace_tomas") &&
                    record.freshness() ==
                        ActorKnownProjectionFreshness::Remembered &&
                !record.is_latest_current_place_record()
        })

---- agent::perception::tests::current_place_knowledge_context_uses_latest_projection_window_for_sleep_affordances stdout ----

thread 'agent::perception::tests::current_place_knowledge_context_uses_latest_projection_window_for_sleep_affordances' (29726) panicked at crates/tracewake-core/src/agent/perception.rs:1149:9:
assertion failed: !refreshed_context.actor_known_sleep_affordances().iter().any(|fact|
            fact.sleep_affordance_id().as_str() == "bed_tomas")

---- agent::perception::tests::current_place_knowledge_context_uses_latest_projection_window_not_live_truth stdout ----

thread 'agent::perception::tests::current_place_knowledge_context_uses_latest_projection_window_not_live_truth' (29727) panicked at crates/tracewake-core/src/agent/perception.rs:1077:9:
assertion failed: !refreshed_context.actor_known_food_sources().iter().any(|fact|
            fact.food_supply_id().as_str() == "food_breakfast_tomas")

failures:
    agent::perception::tests::current_place_knowledge_context_keeps_remembered_workplace_notice_after_newer_perception
    agent::perception::tests::current_place_knowledge_context_uses_latest_projection_window_for_sleep_affordances
    agent::perception::tests::current_place_knowledge_context_uses_latest_projection_window_not_live_truth

test result: FAILED. 452 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
