*** crates/tracewake-core/src/epistemics/projection.rs:1252:9: delete match arm Some("current_place") in actor_known_records_from_observation

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ delete match arm Some("current_place") in actor_known_records_from_observation
@@ -1244,35 +1244,17 @@
 fn actor_known_records_from_observation(
     observation: &Observation,
 ) -> Vec<ActorKnownProjectionRecord> {
     let Some(source_event_id) = source_event_id(observation.source()) else {
         return Vec::new();
     };
     let actor_id = observation.observer_actor_id().clone();
     match observation_payload_value(observation, "perceived_kind") {
-        Some("current_place") => {
-            let Some(place_id) = observation_payload_value(observation, "target_id")
-                .and_then(|value| PlaceId::new(value).ok())
-            else {
-                return Vec::new();
-            };
-            let Some(display_label) = observation_payload_value(observation, "display_label")
-            else {
-                return Vec::new();
-            };
-            vec![ActorKnownProjectionRecord::CurrentPlace {
-                actor_id,
-                place_id,
-                display_label: display_label.to_string(),
-                source: ActorKnownProjectionSource::CurrentPlace,
-                source_event_id,
-                source_tick: observation.observed_tick(),
-            }]
-        }
+         /* ~ changed by cargo-mutants ~ */
         Some("carried_item") => {
             let Some(item_id) = observation_payload_value(observation, "target_id")
                 .and_then(|value| ItemId::new(value).ok())
             else {
                 return Vec::new();
             };
             let Some(source_location) = observation_item_location(observation) else {
                 return Vec::new();

---- controller::tests::human_binding_adds_no_extra_semantic_actions stdout ----

thread 'controller::tests::human_binding_adds_no_extra_semantic_actions' (14188) panicked at crates/tracewake-core/src/projections.rs:107:14:
sealed embodied source requires observed current-place label

failures:
    controller::tests::human_binding_adds_no_extra_semantic_actions

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
