*** crates/tracewake-core/src/epistemics/projection.rs:1271:9: delete match arm Some("carried_item") in actor_known_records_from_observation

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ delete match arm Some("carried_item") in actor_known_records_from_observation
@@ -1263,39 +1263,17 @@
                 actor_id,
                 place_id,
                 display_label: display_label.to_string(),
                 source: ActorKnownProjectionSource::CurrentPlace,
                 source_event_id,
                 source_tick: observation.observed_tick(),
             }]
         }
-        Some("carried_item") => {
-            let Some(item_id) = observation_payload_value(observation, "target_id")
-                .and_then(|value| ItemId::new(value).ok())
-            else {
-                return Vec::new();
-            };
-            let Some(source_location) = observation_item_location(observation) else {
-                return Vec::new();
-            };
-            let Some(portable) = observation_payload_bool(observation, "portable") else {
-                return Vec::new();
-            };
-            vec![ActorKnownProjectionRecord::CarriedItem {
-                actor_id,
-                item_id,
-                place_id: observation.observer_place_id().clone(),
-                source_location,
-                portable,
-                source: ActorKnownProjectionSource::CarriedItem,
-                source_event_id,
-                source_tick: observation.observed_tick(),
-            }]
-        }
+         /* ~ changed by cargo-mutants ~ */
         Some("visible_exit") => {
             let Some(from_place_id) = observation_payload_value(observation, "subject_id")
                 .and_then(|value| PlaceId::new(value).ok())
             else {
                 return Vec::new();
             };
             let Some(to_place_id) = observation_payload_value(observation, "target_id")
                 .and_then(|value| PlaceId::new(value).ok())

---- epistemics::projection::tests::observations_materialize_actor_known_records_with_locations stdout ----

thread 'epistemics::projection::tests::observations_materialize_actor_known_records_with_locations' (18790) panicked at crates/tracewake-core/src/epistemics/projection.rs:1988:9:
assertion failed: matches!(carried_records.as_slice(),
    [ActorKnownProjectionRecord::CarriedItem
    {
        item_id, source_location: Location::CarriedBy(actor_id), portable:
        true, source: ActorKnownProjectionSource::CarriedItem, ..
    }] if item_id.as_str() == "notebook_01" && actor_id.as_str() ==
    "actor_tomas")

failures:
    epistemics::projection::tests::observations_materialize_actor_known_records_with_locations

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
