*** crates/tracewake-core/src/epistemics/projection.rs:1294:9: delete match arm Some("visible_exit") in actor_known_records_from_observation

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ delete match arm Some("visible_exit") in actor_known_records_from_observation
@@ -1286,36 +1286,17 @@
                 place_id: observation.observer_place_id().clone(),
                 source_location,
                 portable,
                 source: ActorKnownProjectionSource::CarriedItem,
                 source_event_id,
                 source_tick: observation.observed_tick(),
             }]
         }
-        Some("visible_exit") => {
-            let Some(from_place_id) = observation_payload_value(observation, "subject_id")
-                .and_then(|value| PlaceId::new(value).ok())
-            else {
-                return Vec::new();
-            };
-            let Some(to_place_id) = observation_payload_value(observation, "target_id")
-                .and_then(|value| PlaceId::new(value).ok())
-            else {
-                return Vec::new();
-            };
-            vec![ActorKnownProjectionRecord::Route {
-                actor_id,
-                from_place_id,
-                to_place_id,
-                source: ActorKnownProjectionSource::VisibleExit,
-                source_event_id,
-                source_tick: observation.observed_tick(),
-            }]
-        }
+         /* ~ changed by cargo-mutants ~ */
         Some("visible_food_supply") => {
             let Some(food_source_id) = observation_payload_value(observation, "target_id") else {
                 return Vec::new();
             };
             vec![ActorKnownProjectionRecord::FoodSource {
                 actor_id,
                 food_source_id: food_source_id.to_string(),
                 place_id: Some(observation.observer_place_id().clone()),

---- severe_safety_with_known_exit_produces_move_and_replays stdout ----

thread 'severe_safety_with_known_exit_produces_move_and_replays' (23069) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1715:10:
severe safety should commit a move

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (23045) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (23046) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2714:5:
assertion failed: has_event(&log, EventKind::ActorMoved)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    severe_safety_with_known_exit_produces_move_and_replays

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.44s

*** result: Failure(101)
