*** crates/tracewake-core/src/epistemics/projection.rs:1314:9: delete match arm Some("visible_food_supply") in actor_known_records_from_observation

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ delete match arm Some("visible_food_supply") in actor_known_records_from_observation
@@ -1306,31 +1306,17 @@
                 actor_id,
                 from_place_id,
                 to_place_id,
                 source: ActorKnownProjectionSource::VisibleExit,
                 source_event_id,
                 source_tick: observation.observed_tick(),
             }]
         }
-        Some("visible_food_supply") => {
-            let Some(food_source_id) = observation_payload_value(observation, "target_id") else {
-                return Vec::new();
-            };
-            vec![ActorKnownProjectionRecord::FoodSource {
-                actor_id,
-                food_source_id: food_source_id.to_string(),
-                place_id: Some(observation.observer_place_id().clone()),
-                believed_servings: observation_payload_value(observation, "servings")
-                    .and_then(|value| value.parse::<u32>().ok()),
-                source: ActorKnownProjectionSource::VisibleFoodSupply,
-                source_event_id,
-                source_tick: observation.observed_tick(),
-            }]
-        }
+         /* ~ changed by cargo-mutants ~ */
         Some("visible_door") => {
             let Some(door_id) = observation_payload_value(observation, "target_id")
                 .and_then(|value| DoorId::new(value).ok())
             else {
                 return Vec::new();
             };
             let Some(endpoint_a) = observation_payload_value(observation, "endpoint_a")
                 .and_then(|value| PlaceId::new(value).ok())

---- aged_food_record_surfaces_as_remembered_belief stdout ----

thread 'aged_food_record_surfaces_as_remembered_belief' (27133) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2648:5:
assertion failed: surface.context().known_food_sources().contains("food_stew_home_tomas")

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (27144) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (27145) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2714:5:
assertion failed: has_event(&log, EventKind::ActorMoved)

failures:
    aged_food_record_surfaces_as_remembered_belief
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.43s

*** result: Failure(101)
