*** crates/tracewake-core/src/epistemics/projection.rs:1329:9: delete match arm Some("visible_door") in actor_known_records_from_observation

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ delete match arm Some("visible_door") in actor_known_records_from_observation
@@ -1321,57 +1321,17 @@
                 place_id: Some(observation.observer_place_id().clone()),
                 believed_servings: observation_payload_value(observation, "servings")
                     .and_then(|value| value.parse::<u32>().ok()),
                 source: ActorKnownProjectionSource::VisibleFoodSupply,
                 source_event_id,
                 source_tick: observation.observed_tick(),
             }]
         }
-        Some("visible_door") => {
-            let Some(door_id) = observation_payload_value(observation, "target_id")
-                .and_then(|value| DoorId::new(value).ok())
-            else {
-                return Vec::new();
-            };
-            let Some(endpoint_a) = observation_payload_value(observation, "endpoint_a")
-                .and_then(|value| PlaceId::new(value).ok())
-            else {
-                return Vec::new();
-            };
-            let Some(endpoint_b) = observation_payload_value(observation, "endpoint_b")
-                .and_then(|value| PlaceId::new(value).ok())
-            else {
-                return Vec::new();
-            };
-            let Some(is_open) = observation_payload_bool(observation, "is_open") else {
-                return Vec::new();
-            };
-            let Some(is_locked) = observation_payload_bool(observation, "is_locked") else {
-                return Vec::new();
-            };
-            let Some(blocks_movement_when_closed) =
-                observation_payload_bool(observation, "blocks_movement_when_closed")
-            else {
-                return Vec::new();
-            };
-            vec![ActorKnownProjectionRecord::LocalDoor {
-                actor_id,
-                door_id,
-                place_id: observation.observer_place_id().clone(),
-                endpoint_a,
-                endpoint_b,
-                is_open,
-                is_locked,
-                blocks_movement_when_closed,
-                source: ActorKnownProjectionSource::VisibleDoor,
-                source_event_id,
-                source_tick: observation.observed_tick(),
-            }]
-        }
+         /* ~ changed by cargo-mutants ~ */
         Some("visible_container") => {
             let Some(container_id) = observation_payload_value(observation, "target_id")
                 .and_then(|value| ContainerId::new(value).ok())
             else {
                 return Vec::new();
             };
             let Some(is_open) = observation_payload_bool(observation, "is_open") else {
                 return Vec::new();

---- epistemics::projection::tests::observations_materialize_actor_known_records_with_locations stdout ----

thread 'epistemics::projection::tests::observations_materialize_actor_known_records_with_locations' (31547) panicked at crates/tracewake-core/src/epistemics/projection.rs:2012:9:
assertion failed: matches!(door_records.as_slice(),
    [ActorKnownProjectionRecord::LocalDoor
    {
        door_id, endpoint_a, endpoint_b, is_open: true, is_locked: false,
        blocks_movement_when_closed: true, source:
        ActorKnownProjectionSource::VisibleDoor, ..
    }] if door_id.as_str() == "door_home_market" && endpoint_a.as_str() ==
    "home_tomas" && endpoint_b.as_str() == "market")

failures:
    epistemics::projection::tests::observations_materialize_actor_known_records_with_locations

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
