*** crates/tracewake-core/src/epistemics/projection.rs:1370:9: delete match arm Some("visible_container") in actor_known_records_from_observation

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ delete match arm Some("visible_container") in actor_known_records_from_observation
@@ -1362,39 +1362,17 @@
                 is_open,
                 is_locked,
                 blocks_movement_when_closed,
                 source: ActorKnownProjectionSource::VisibleDoor,
                 source_event_id,
                 source_tick: observation.observed_tick(),
             }]
         }
-        Some("visible_container") => {
-            let Some(container_id) = observation_payload_value(observation, "target_id")
-                .and_then(|value| ContainerId::new(value).ok())
-            else {
-                return Vec::new();
-            };
-            let Some(is_open) = observation_payload_bool(observation, "is_open") else {
-                return Vec::new();
-            };
-            let Some(is_locked) = observation_payload_bool(observation, "is_locked") else {
-                return Vec::new();
-            };
-            vec![ActorKnownProjectionRecord::LocalContainer {
-                actor_id,
-                container_id,
-                place_id: observation.observer_place_id().clone(),
-                is_open,
-                is_locked,
-                source: ActorKnownProjectionSource::VisibleContainer,
-                source_event_id,
-                source_tick: observation.observed_tick(),
-            }]
-        }
+         /* ~ changed by cargo-mutants ~ */
         Some("visible_item") => {
             let Some(item_id) = observation_payload_value(observation, "target_id")
                 .and_then(|value| ItemId::new(value).ok())
             else {
                 return Vec::new();
             };
             let Some(source_location) = observation_item_location(observation) else {
                 return Vec::new();

---- epistemics::projection::tests::observations_materialize_actor_known_records_with_locations stdout ----

thread 'epistemics::projection::tests::observations_materialize_actor_known_records_with_locations' (3638) panicked at crates/tracewake-core/src/epistemics/projection.rs:2054:9:
assertion failed: matches!(container_records.as_slice(),
    [ActorKnownProjectionRecord::LocalContainer
    {
        container_id, is_open: false, is_locked: true, source:
        ActorKnownProjectionSource::VisibleContainer, ..
    }] if container_id.as_str() == "strongbox_tomas")

failures:
    epistemics::projection::tests::observations_materialize_actor_known_records_with_locations

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
