*** crates/tracewake-core/src/epistemics/projection.rs:1393:9: delete match arm Some("visible_item") in actor_known_records_from_observation

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ delete match arm Some("visible_item") in actor_known_records_from_observation
@@ -1385,39 +1385,17 @@
                 place_id: observation.observer_place_id().clone(),
                 is_open,
                 is_locked,
                 source: ActorKnownProjectionSource::VisibleContainer,
                 source_event_id,
                 source_tick: observation.observed_tick(),
             }]
         }
-        Some("visible_item") => {
-            let Some(item_id) = observation_payload_value(observation, "target_id")
-                .and_then(|value| ItemId::new(value).ok())
-            else {
-                return Vec::new();
-            };
-            let Some(source_location) = observation_item_location(observation) else {
-                return Vec::new();
-            };
-            let Some(portable) = observation_payload_bool(observation, "portable") else {
-                return Vec::new();
-            };
-            vec![ActorKnownProjectionRecord::LocalItem {
-                actor_id,
-                item_id,
-                place_id: observation.observer_place_id().clone(),
-                source_location,
-                portable,
-                source: ActorKnownProjectionSource::VisibleItem,
-                source_event_id,
-                source_tick: observation.observed_tick(),
-            }]
-        }
+         /* ~ changed by cargo-mutants ~ */
         Some("visible_actor") => {
             let Some(observed_actor_id) = observation_payload_value(observation, "target_id")
                 .and_then(|value| ActorId::new(value).ok())
             else {
                 return Vec::new();
             };
             vec![ActorKnownProjectionRecord::LocalActor {
                 actor_id,

---- epistemics::projection::tests::observations_materialize_actor_known_records_with_locations stdout ----

thread 'epistemics::projection::tests::observations_materialize_actor_known_records_with_locations' (8198) panicked at crates/tracewake-core/src/epistemics/projection.rs:1969:9:
assertion failed: matches!(item_records.as_slice(),
    [ActorKnownProjectionRecord::LocalItem
    {
        item_id, source_location: Location::AtPlace(place_id), source:
        ActorKnownProjectionSource::VisibleItem, ..
    }] if item_id.as_str() == "coin_stack_01" && place_id.as_str() ==
    "home_tomas")

failures:
    epistemics::projection::tests::observations_materialize_actor_known_records_with_locations

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
