*** crates/tracewake-core/src/epistemics/projection.rs:1416:9: delete match arm Some("visible_actor") in actor_known_records_from_observation

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ delete match arm Some("visible_actor") in actor_known_records_from_observation
@@ -1408,31 +1408,17 @@
                 place_id: observation.observer_place_id().clone(),
                 source_location,
                 portable,
                 source: ActorKnownProjectionSource::VisibleItem,
                 source_event_id,
                 source_tick: observation.observed_tick(),
             }]
         }
-        Some("visible_actor") => {
-            let Some(observed_actor_id) = observation_payload_value(observation, "target_id")
-                .and_then(|value| ActorId::new(value).ok())
-            else {
-                return Vec::new();
-            };
-            vec![ActorKnownProjectionRecord::LocalActor {
-                actor_id,
-                observed_actor_id,
-                place_id: observation.observer_place_id().clone(),
-                source: ActorKnownProjectionSource::VisibleActor,
-                source_event_id,
-                source_tick: observation.observed_tick(),
-            }]
-        }
+         /* ~ changed by cargo-mutants ~ */
         Some("visible_sleep_affordance") => {
             let Some(place_id) = observation_payload_value(observation, "place_id")
                 .and_then(|value| PlaceId::new(value).ok())
             else {
                 return Vec::new();
             };
             vec![ActorKnownProjectionRecord::SleepPlace {
                 actor_id,

---- epistemics::projection::tests::observations_materialize_actor_known_records_with_locations stdout ----

thread 'epistemics::projection::tests::observations_materialize_actor_known_records_with_locations' (12757) panicked at crates/tracewake-core/src/epistemics/projection.rs:1959:9:
assertion failed: matches!(actor_records.as_slice(),
    [ActorKnownProjectionRecord::LocalActor
    {
        observed_actor_id, source: ActorKnownProjectionSource::VisibleActor,
        ..
    }] if observed_actor_id.as_str() == "actor_mara")

failures:
    epistemics::projection::tests::observations_materialize_actor_known_records_with_locations

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
