*** crates/tracewake-core/src/epistemics/projection.rs:1431:9: delete match arm Some("visible_sleep_affordance") in actor_known_records_from_observation

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ delete match arm Some("visible_sleep_affordance") in actor_known_records_from_observation
@@ -1423,32 +1423,17 @@
                 actor_id,
                 observed_actor_id,
                 place_id: observation.observer_place_id().clone(),
                 source: ActorKnownProjectionSource::VisibleActor,
                 source_event_id,
                 source_tick: observation.observed_tick(),
             }]
         }
-        Some("visible_sleep_affordance") => {
-            let Some(place_id) = observation_payload_value(observation, "place_id")
-                .and_then(|value| PlaceId::new(value).ok())
-            else {
-                return Vec::new();
-            };
-            vec![ActorKnownProjectionRecord::SleepPlace {
-                actor_id,
-                place_id,
-                sleep_affordance_id: observation_payload_value(observation, "target_id")
-                    .map(ToString::to_string),
-                source: ActorKnownProjectionSource::VisibleSleepAffordance,
-                source_event_id,
-                source_tick: observation.observed_tick(),
-            }]
-        }
+         /* ~ changed by cargo-mutants ~ */
         _ => Vec::new(),
     }
 }
 
 fn actor_known_record_from_starting_belief(
     actor_id: ActorId,
     belief_kind: &str,
     subject_id: &str,

---- agent::no_human_surface::tests::sleep_record_from_other_place_surfaces_as_remembered_reachable_sleep_input stdout ----

thread 'agent::no_human_surface::tests::sleep_record_from_other_place_surfaces_as_remembered_reachable_sleep_input' (17204) panicked at crates/tracewake-core/src/agent/no_human_surface.rs:1292:14:
remembered sleep place should survive after actor moves

---- agent::perception::tests::current_place_knowledge_context_uses_latest_projection_window_for_sleep_affordances stdout ----

thread 'agent::perception::tests::current_place_knowledge_context_uses_latest_projection_window_for_sleep_affordances' (17212) panicked at crates/tracewake-core/src/agent/perception.rs:1107:9:
assertion failed: stale_context.actor_known_sleep_affordances().iter().any(|fact|
        fact.sleep_affordance_id().as_str() == "bed_tomas")

---- agent::perception::tests::embodied_context_filters_reclassified_records_by_declared_scope_but_no_human_keeps_memory stdout ----

thread 'agent::perception::tests::embodied_context_filters_reclassified_records_by_declared_scope_but_no_human_keeps_memory' (17217) panicked at crates/tracewake-core/src/agent/perception.rs:1191:14:
shared classifier keeps remembered sleep place

failures:
    agent::no_human_surface::tests::sleep_record_from_other_place_surfaces_as_remembered_reachable_sleep_input
    agent::perception::tests::current_place_knowledge_context_uses_latest_projection_window_for_sleep_affordances
    agent::perception::tests::embodied_context_filters_reclassified_records_by_declared_scope_but_no_human_keeps_memory
    scheduler::no_human::tests::no_human_day_counts_duration_completion_as_window_progress

test result: FAILED. 451 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
