*** crates/tracewake-core/src/epistemics/projection.rs:1459:5: replace actor_known_record_from_starting_belief -> Option<ActorKnownProjectionRecord> with None

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace actor_known_record_from_starting_belief -> Option<ActorKnownProjectionRecord> with None
@@ -1451,40 +1451,17 @@
 fn actor_known_record_from_starting_belief(
     actor_id: ActorId,
     belief_kind: &str,
     subject_id: &str,
     value: &str,
     source_event_id: EventId,
     source_tick: SimTick,
 ) -> Option<ActorKnownProjectionRecord> {
-    match belief_kind {
-        "sleep_place" => Some(ActorKnownProjectionRecord::SleepPlace {
-            actor_id,
-            place_id: PlaceId::new(value).ok()?,
-            sleep_affordance_id: Some(subject_id.to_string()),
-            source: ActorKnownProjectionSource::StartingBelief,
-            source_event_id,
-            source_tick,
-        }),
-        "household_food_source" => {
-            let place_value = value.strip_prefix("place:")?;
-            let place_id = PlaceId::new(place_value).ok()?;
-            Some(ActorKnownProjectionRecord::FoodSource {
-                actor_id,
-                food_source_id: subject_id.to_string(),
-                place_id: Some(place_id),
-                believed_servings: None,
-                source: ActorKnownProjectionSource::StartingBelief,
-                source_event_id,
-                source_tick,
-            })
-        }
-        _ => None,
-    }
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn source_event_id(source: &SourceRef) -> Option<EventId> {
     match source {
         SourceRef::Event(event_id) => Some(event_id.clone()),
         SourceRef::Action(_) | SourceRef::Cause(_) => None,
     }
 }

---- seed_event_log_order_and_projection_provenance_are_causal_and_stable stdout ----

thread 'seed_event_log_order_and_projection_provenance_are_causal_and_stable' (21528) panicked at crates/tracewake-content/tests/fixtures_load.rs:995:10:
sleep-place seed replays into projection with source event id

failures:
    seed_event_log_order_and_projection_provenance_are_causal_and_stable

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
