*** crates/tracewake-core/src/epistemics/projection.rs:1468:9: delete match arm "household_food_source" in actor_known_record_from_starting_belief

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ delete match arm "household_food_source" in actor_known_record_from_starting_belief
@@ -1460,29 +1460,17 @@
         "sleep_place" => Some(ActorKnownProjectionRecord::SleepPlace {
             actor_id,
             place_id: PlaceId::new(value).ok()?,
             sleep_affordance_id: Some(subject_id.to_string()),
             source: ActorKnownProjectionSource::StartingBelief,
             source_event_id,
             source_tick,
         }),
-        "household_food_source" => {
-            let place_value = value.strip_prefix("place:")?;
-            let place_id = PlaceId::new(place_value).ok()?;
-            Some(ActorKnownProjectionRecord::FoodSource {
-                actor_id,
-                food_source_id: subject_id.to_string(),
-                place_id: Some(place_id),
-                believed_servings: None,
-                source: ActorKnownProjectionSource::StartingBelief,
-                source_event_id,
-                source_tick,
-            })
-        }
+         /* ~ changed by cargo-mutants ~ */
         _ => None,
     }
 }
 
 fn source_event_id(source: &SourceRef) -> Option<EventId> {
     match source {
         SourceRef::Event(event_id) => Some(event_id.clone()),
         SourceRef::Action(_) | SourceRef::Cause(_) => None,

---- partial_food_source_knowledge_seeds_only_authored_actor_edge stdout ----

thread 'partial_food_source_knowledge_seeds_only_authored_actor_edge' (29653) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2073:5:
assertion failed: mara_known.known_food_sources().contains("food_shared_pantry")

---- planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit stdout ----

thread 'planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit' (29658) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1603:6:
called `Result::unwrap()` on an `Err` value: NoApplicableMethod { family: EatMeal, reason: "no actor-known method inputs for eat_meal" }

failures:
    partial_food_source_knowledge_seeds_only_authored_actor_edge
    planner_trace_fixture_exposes_selection_rejections_and_hidden_truth_audit

test result: FAILED. 40 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.51s

*** result: Failure(101)
