*** crates/tracewake-core/src/epistemics/projection.rs:1493:5: replace observation_payload_value -> Option<&'a str> with Some("xyzzy")

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace observation_payload_value -> Option<&'a str> with Some("xyzzy")
@@ -1485,21 +1485,17 @@
 fn source_event_id(source: &SourceRef) -> Option<EventId> {
     match source {
         SourceRef::Event(event_id) => Some(event_id.clone()),
         SourceRef::Action(_) | SourceRef::Cause(_) => None,
     }
 }
 
 fn observation_payload_value<'a>(observation: &'a Observation, key: &str) -> Option<&'a str> {
-    observation
-        .raw_payload()
-        .iter()
-        .find(|field| field.key == key)
-        .map(|field| field.value.as_str())
+    Some("xyzzy") /* ~ changed by cargo-mutants ~ */
 }
 
 fn observation_payload_bool(observation: &Observation, key: &str) -> Option<bool> {
     observation_payload_value(observation, key).and_then(|value| value.parse::<bool>().ok())
 }
 
 fn observation_item_location(observation: &Observation) -> Option<Location> {
     match observation_payload_value(observation, "item_source_kind")? {

---- aged_food_record_surfaces_as_remembered_belief stdout ----

thread 'aged_food_record_surfaces_as_remembered_belief' (13575) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2648:5:
assertion failed: surface.context().known_food_sources().contains("food_stew_home_tomas")

---- severe_safety_with_known_exit_produces_move_and_replays stdout ----

thread 'severe_safety_with_known_exit_produces_move_and_replays' (13610) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1715:10:
severe safety should commit a move

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (13586) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

failures:
    aged_food_record_surfaces_as_remembered_belief
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    severe_safety_with_known_exit_produces_move_and_replays

test result: FAILED. 38 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.36s

*** result: Failure(101)
