*** crates/tracewake-core/src/epistemics/projection.rs:1501:5: replace observation_payload_bool -> Option<bool> with Some(true)

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace observation_payload_bool -> Option<bool> with Some(true)
@@ -1493,17 +1493,17 @@
     observation
         .raw_payload()
         .iter()
         .find(|field| field.key == key)
         .map(|field| field.value.as_str())
 }
 
 fn observation_payload_bool(observation: &Observation, key: &str) -> Option<bool> {
-    observation_payload_value(observation, key).and_then(|value| value.parse::<bool>().ok())
+    Some(true) /* ~ changed by cargo-mutants ~ */
 }
 
 fn observation_item_location(observation: &Observation) -> Option<Location> {
     match observation_payload_value(observation, "item_source_kind")? {
         "place" => observation_payload_value(observation, "item_source_place_id")
             .and_then(|value| PlaceId::new(value).ok())
             .map(Location::AtPlace),
         "container" => observation_payload_value(observation, "item_source_container_id")

---- epistemics::projection::tests::observations_materialize_actor_known_records_with_locations stdout ----

thread 'epistemics::projection::tests::observations_materialize_actor_known_records_with_locations' (26647) panicked at crates/tracewake-core/src/epistemics/projection.rs:2030:9:
assertion failed: matches!(container_item_records.as_slice(),
    [ActorKnownProjectionRecord::LocalItem
    {
        item_id, source_location: Location::InContainer(container_id),
        portable: false, source: ActorKnownProjectionSource::VisibleItem, ..
    }] if item_id.as_str() == "coin_stack_02" && container_id.as_str() ==
    "strongbox_tomas")

failures:
    epistemics::projection::tests::observations_materialize_actor_known_records_with_locations

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
