*** crates/tracewake-core/src/epistemics/projection.rs:1505:5: replace observation_item_location -> Option<Location> with None

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace observation_item_location -> Option<Location> with None
@@ -1497,28 +1497,17 @@
         .map(|field| field.value.as_str())
 }
 
 fn observation_payload_bool(observation: &Observation, key: &str) -> Option<bool> {
     observation_payload_value(observation, key).and_then(|value| value.parse::<bool>().ok())
 }
 
 fn observation_item_location(observation: &Observation) -> Option<Location> {
-    match observation_payload_value(observation, "item_source_kind")? {
-        "place" => observation_payload_value(observation, "item_source_place_id")
-            .and_then(|value| PlaceId::new(value).ok())
-            .map(Location::AtPlace),
-        "container" => observation_payload_value(observation, "item_source_container_id")
-            .and_then(|value| ContainerId::new(value).ok())
-            .map(Location::InContainer),
-        "carried" => observation_payload_value(observation, "item_source_actor_id")
-            .and_then(|value| ActorId::new(value).ok())
-            .map(Location::CarriedBy),
-        _ => None,
-    }
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn holder_key(holder: &HolderKind) -> String {
     match holder {
         HolderKind::Actor(actor_id) => format!("actor:{}", actor_id.as_str()),
         HolderKind::InstitutionPlaceholder(id) => format!("institution_placeholder:{id}"),
     }
 }

---- epistemics::projection::tests::observations_materialize_actor_known_records_with_locations stdout ----

thread 'epistemics::projection::tests::observations_materialize_actor_known_records_with_locations' (3297) panicked at crates/tracewake-core/src/epistemics/projection.rs:1980:9:
assertion failed: matches!(item_records.as_slice(),
    [ActorKnownProjectionRecord::LocalItem
    {
        item_id, source_location: Location::AtPlace(place_id), source:
        ActorKnownProjectionSource::VisibleItem, ..
    }] if item_id.as_str() == "coin_stack_01" && place_id.as_str() ==
    "home_tomas")

failures:
    epistemics::projection::tests::observations_materialize_actor_known_records_with_locations

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
