*** crates/tracewake-core/src/epistemics/projection.rs:1512:9: delete match arm "carried" in observation_item_location

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ delete match arm "carried" in observation_item_location
@@ -1504,19 +1504,17 @@
 fn observation_item_location(observation: &Observation) -> Option<Location> {
     match observation_payload_value(observation, "item_source_kind")? {
         "place" => observation_payload_value(observation, "item_source_place_id")
             .and_then(|value| PlaceId::new(value).ok())
             .map(Location::AtPlace),
         "container" => observation_payload_value(observation, "item_source_container_id")
             .and_then(|value| ContainerId::new(value).ok())
             .map(Location::InContainer),
-        "carried" => observation_payload_value(observation, "item_source_actor_id")
-            .and_then(|value| ActorId::new(value).ok())
-            .map(Location::CarriedBy),
+         /* ~ changed by cargo-mutants ~ */
         _ => None,
     }
 }
 
 fn holder_key(holder: &HolderKind) -> String {
     match holder {
         HolderKind::Actor(actor_id) => format!("actor:{}", actor_id.as_str()),
         HolderKind::InstitutionPlaceholder(id) => format!("institution_placeholder:{id}"),

---- epistemics::projection::tests::observations_materialize_actor_known_records_with_locations stdout ----

thread 'epistemics::projection::tests::observations_materialize_actor_known_records_with_locations' (16987) panicked at crates/tracewake-core/src/epistemics/projection.rs:2008:9:
assertion failed: matches!(carried_records.as_slice(),
    [ActorKnownProjectionRecord::CarriedItem
    {
        item_id, source_location: Location::CarriedBy(actor_id), portable:
        true, source: ActorKnownProjectionSource::CarriedItem, ..
    }] if item_id.as_str() == "notebook_01" && actor_id.as_str() ==
    "actor_tomas")

failures:
    epistemics::projection::tests::observations_materialize_actor_known_records_with_locations

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
