*** crates/tracewake-core/src/epistemics/projection.rs:1520:5: replace holder_key -> String with String::new()

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace holder_key -> String with String::new()
@@ -1512,20 +1512,17 @@
         "carried" => observation_payload_value(observation, "item_source_actor_id")
             .and_then(|value| ActorId::new(value).ok())
             .map(Location::CarriedBy),
         _ => None,
     }
 }
 
 fn holder_key(holder: &HolderKind) -> String {
-    match holder {
-        HolderKind::Actor(actor_id) => format!("actor:{}", actor_id.as_str()),
-        HolderKind::InstitutionPlaceholder(id) => format!("institution_placeholder:{id}"),
-    }
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn observation_id_set_key(ids: &std::collections::BTreeSet<ObservationId>) -> String {
     ids.iter()
         .map(|id| id.as_str())
         .collect::<Vec<_>>()
         .join(",")
 }

---- epistemics::projection::tests::actor_known_classification_helpers_preserve_freshness_keys_and_sources stdout ----

thread 'epistemics::projection::tests::actor_known_classification_helpers_preserve_freshness_keys_and_sources' (21536) panicked at crates/tracewake-core/src/epistemics/projection.rs:1952:9:
assertion `left == right` failed
  left: ""
 right: "actor:actor_tomas"

failures:
    epistemics::projection::tests::actor_known_classification_helpers_preserve_freshness_keys_and_sources

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
