*** crates/tracewake-core/src/epistemics/projection.rs:1527:5: replace observation_id_set_key -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace observation_id_set_key -> String with "xyzzy".into()
@@ -1519,20 +1519,17 @@
 fn holder_key(holder: &HolderKind) -> String {
     match holder {
         HolderKind::Actor(actor_id) => format!("actor:{}", actor_id.as_str()),
         HolderKind::InstitutionPlaceholder(id) => format!("institution_placeholder:{id}"),
     }
 }
 
 fn observation_id_set_key(ids: &std::collections::BTreeSet<ObservationId>) -> String {
-    ids.iter()
-        .map(|id| id.as_str())
-        .collect::<Vec<_>>()
-        .join(",")
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 fn contradiction_id_set_key(ids: &std::collections::BTreeSet<ContradictionId>) -> String {
     ids.iter()
         .map(|id| id.as_str())
         .collect::<Vec<_>>()
         .join(",")
 }

---- belief_stale_frontier_and_witness_links_survive_projection_debug_and_replay stdout ----

thread 'belief_stale_frontier_and_witness_links_survive_projection_debug_and_replay' (3198) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:2198:5:
assertion failed: belief_line.contains("|observations=observation_belief_link|")

failures:
    belief_stale_frontier_and_witness_links_survive_projection_debug_and_replay

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
