*** crates/tracewake-core/src/epistemics/projection.rs:1534:5: replace contradiction_id_set_key -> String with String::new()

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace contradiction_id_set_key -> String with String::new()
@@ -1526,20 +1526,17 @@
 fn observation_id_set_key(ids: &std::collections::BTreeSet<ObservationId>) -> String {
     ids.iter()
         .map(|id| id.as_str())
         .collect::<Vec<_>>()
         .join(",")
 }
 
 fn contradiction_id_set_key(ids: &std::collections::BTreeSet<ContradictionId>) -> String {
-    ids.iter()
-        .map(|id| id.as_str())
-        .collect::<Vec<_>>()
-        .join(",")
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn debug_belief_entry(belief: &Belief) -> DebugBeliefEntry {
     DebugBeliefEntry {
         belief_id: belief.belief_id().as_str().to_string(),
         proposition: belief.proposition().render(),
         stance: belief.stance().stable_id().to_string(),
         confidence: belief.confidence().serialize_canonical(),

---- belief_stale_frontier_and_witness_links_survive_projection_debug_and_replay stdout ----

thread 'belief_stale_frontier_and_witness_links_survive_projection_debug_and_replay' (7901) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:2199:5:
assertion failed: belief_line.contains("|contradictions=contradiction_belief_link")

failures:
    belief_stale_frontier_and_witness_links_survive_projection_debug_and_replay

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
