*** crates/tracewake-core/src/epistemics/projection.rs:1599:5: replace source_summary -> String with String::new()

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace source_summary -> String with String::new()
@@ -1591,21 +1591,17 @@
             "{} -> {}",
             contradiction.expected_proposition().render(),
             contradiction.observed_proposition().render()
         ),
     }
 }
 
 fn source_summary(source: &SourceRef) -> String {
-    match source {
-        SourceRef::Event(event_id) => format!("event:{}", event_id.as_str()),
-        SourceRef::Action(action_id) => format!("action:{}", action_id.as_str()),
-        SourceRef::Cause(cause) => format!("cause:{cause:?}"),
-    }
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::agent::{
         current_place_knowledge_context, NoHumanActorKnownSurfaceBuilder,
         NoHumanActorKnownSurfaceRequest,

---- epistemics::projection::tests::actor_known_classification_helpers_preserve_freshness_keys_and_sources stdout ----

thread 'epistemics::projection::tests::actor_known_classification_helpers_preserve_freshness_keys_and_sources' (17031) panicked at crates/tracewake-core/src/epistemics/projection.rs:1952:9:
assertion `left == right` failed
  left: ""
 right: "event:event_source"

failures:
    epistemics::projection::tests::actor_known_classification_helpers_preserve_freshness_keys_and_sources

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
