*** crates/tracewake-core/src/epistemics/projection.rs:195:9: replace ActorKnownProjectionKindPolicy::includes_in_embodied_context -> bool with true

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace ActorKnownProjectionKindPolicy::includes_in_embodied_context -> bool with true
@@ -187,22 +187,17 @@
         self.accessibility_scope
     }
 
     pub fn includes_in_embodied_context(
         &self,
         current_place_record: bool,
         latest_current_place_record: bool,
     ) -> bool {
-        match self.embodied_scope {
-            ActorKnownProjectionEmbodiedScope::LatestCurrentPlaceOnly => {
-                latest_current_place_record
-            }
-            ActorKnownProjectionEmbodiedScope::CurrentPlaceOnly => current_place_record,
-        }
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     fn includes_classified_record(
         &self,
         record: &ActorKnownProjectionRecord,
         selected_workplaces: &BTreeMap<WorkplaceId, &ActorKnownProjectionRecord>,
     ) -> bool {
         match self.classification {

---- agent::perception::tests::current_place_knowledge_context_uses_latest_projection_window_for_sleep_affordances stdout ----

thread 'agent::perception::tests::current_place_knowledge_context_uses_latest_projection_window_for_sleep_affordances' (19541) panicked at crates/tracewake-core/src/agent/perception.rs:1149:9:
assertion failed: !refreshed_context.actor_known_sleep_affordances().iter().any(|fact|
            fact.sleep_affordance_id().as_str() == "bed_tomas")

---- agent::perception::tests::current_place_knowledge_context_uses_latest_projection_window_not_live_truth stdout ----

thread 'agent::perception::tests::current_place_knowledge_context_uses_latest_projection_window_not_live_truth' (19542) panicked at crates/tracewake-core/src/agent/perception.rs:1077:9:
assertion failed: !refreshed_context.actor_known_food_sources().iter().any(|fact|
            fact.food_supply_id().as_str() == "food_breakfast_tomas")

---- agent::perception::tests::embodied_context_filters_reclassified_records_by_declared_scope_but_no_human_keeps_memory stdout ----

thread 'agent::perception::tests::embodied_context_filters_reclassified_records_by_declared_scope_but_no_human_keeps_memory' (19546) panicked at crates/tracewake-core/src/agent/perception.rs:1192:9:
assertion failed: !sleep_record.record().policy().includes_in_embodied_context(sleep_record.is_current_place_record(),
        sleep_record.is_latest_current_place_record())

failures:
    agent::perception::tests::current_place_knowledge_context_uses_latest_projection_window_for_sleep_affordances
    agent::perception::tests::current_place_knowledge_context_uses_latest_projection_window_not_live_truth
    agent::perception::tests::embodied_context_filters_reclassified_records_by_declared_scope_but_no_human_keeps_memory
    epistemics::projection::tests::actor_known_projection_policy_table_detects_synthetic_row_mutations
    epistemics::projection::tests::workplace_current_place_scope_drops_other_place_from_embodied_context

test result: FAILED. 450 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
