*** crates/tracewake-core/src/epistemics/projection.rs:195:9: replace ActorKnownProjectionKindPolicy::includes_in_embodied_context -> bool with false

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace ActorKnownProjectionKindPolicy::includes_in_embodied_context -> bool with false
@@ -187,22 +187,17 @@
         self.accessibility_scope
     }
 
     pub fn includes_in_embodied_context(
         &self,
         current_place_record: bool,
         latest_current_place_record: bool,
     ) -> bool {
-        match self.embodied_scope {
-            ActorKnownProjectionEmbodiedScope::LatestCurrentPlaceOnly => {
-                latest_current_place_record
-            }
-            ActorKnownProjectionEmbodiedScope::CurrentPlaceOnly => current_place_record,
-        }
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     fn includes_classified_record(
         &self,
         record: &ActorKnownProjectionRecord,
         selected_workplaces: &BTreeMap<WorkplaceId, &ActorKnownProjectionRecord>,
     ) -> bool {
         match self.classification {

---- stale_workplace_notice_superseded_by_newer_001 stdout ----

thread 'stale_workplace_notice_superseded_by_newer_001' (23860) panicked at crates/tracewake-content/tests/fixtures_load.rs:1156:5:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    stale_workplace_notice_superseded_by_newer_001

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
