*** crates/tracewake-core/src/epistemics/projection.rs:208:9: replace ActorKnownProjectionKindPolicy::includes_classified_record -> bool with true

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace ActorKnownProjectionKindPolicy::includes_classified_record -> bool with true
@@ -200,30 +200,17 @@
         }
     }
 
     fn includes_classified_record(
         &self,
         record: &ActorKnownProjectionRecord,
         selected_workplaces: &BTreeMap<WorkplaceId, &ActorKnownProjectionRecord>,
     ) -> bool {
-        match self.classification {
-            ActorKnownProjectionPolicy::ReclassifyWhenStale => true,
-            ActorKnownProjectionPolicy::SupersedeNewestBySubject => {
-                let workplace_id = record.supersede_workplace_subject().unwrap_or_else(|| {
-                    panic!(
-                        "actor-known projection kind with SupersedeNewestBySubject lacks a subject extractor: {}",
-                        record.kind()
-                    )
-                });
-                selected_workplaces
-                    .get(workplace_id)
-                    .is_some_and(|selected| *selected == record)
-            }
-        }
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     fn freshness(
         &self,
         record: &ActorKnownProjectionRecord,
         latest_current_place_record: bool,
         context_tick: SimTick,
     ) -> ActorKnownProjectionFreshness {

---- stale_workplace_notice_superseded_by_newer_001 stdout ----

thread 'stale_workplace_notice_superseded_by_newer_001' (27892) panicked at crates/tracewake-content/tests/fixtures_load.rs:1156:5:
assertion `left == right` failed
  left: 2
 right: 1

failures:
    stale_workplace_notice_superseded_by_newer_001

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
