*** crates/tracewake-core/src/epistemics/projection.rs:219:55: replace == with != in ActorKnownProjectionKindPolicy::includes_classified_record

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace == with != in ActorKnownProjectionKindPolicy::includes_classified_record
@@ -211,17 +211,17 @@
                 let workplace_id = record.supersede_workplace_subject().unwrap_or_else(|| {
                     panic!(
                         "actor-known projection kind with SupersedeNewestBySubject lacks a subject extractor: {}",
                         record.kind()
                     )
                 });
                 selected_workplaces
                     .get(workplace_id)
-                    .is_some_and(|selected| *selected == record)
+                    .is_some_and(|selected| *selected != /* ~ changed by cargo-mutants ~ */ record)
             }
         }
     }
 
     fn freshness(
         &self,
         record: &ActorKnownProjectionRecord,
         latest_current_place_record: bool,

---- stale_workplace_notice_superseded_by_newer_001 stdout ----

thread 'stale_workplace_notice_superseded_by_newer_001' (3487) panicked at crates/tracewake-content/tests/fixtures_load.rs:1159:5:
assertion failed: workplace.believed_access_open()

---- seed_event_log_order_and_projection_provenance_are_causal_and_stable stdout ----

thread 'seed_event_log_order_and_projection_provenance_are_causal_and_stable' (3484) panicked at crates/tracewake-content/tests/fixtures_load.rs:1013:10:
role notice seed replays into projection with source event id

failures:
    seed_event_log_order_and_projection_provenance_are_causal_and_stable
    stale_workplace_notice_superseded_by_newer_001

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
