*** crates/tracewake-core/src/epistemics/projection.rs:259:9: replace ClassifiedActorKnownProjectionRecord<'a>::source_tick -> SimTick with Default::default()

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace ClassifiedActorKnownProjectionRecord<'a>::source_tick -> SimTick with Default::default()
@@ -251,17 +251,17 @@
         self.record
     }
 
     pub fn freshness(&self) -> ActorKnownProjectionFreshness {
         self.freshness
     }
 
     pub fn source_tick(&self) -> SimTick {
-        self.record.source_tick()
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn is_latest_current_place_record(&self) -> bool {
         self.latest_current_place_record
     }
 
     pub fn is_current_place_record(&self) -> bool {
         self.current_place_record

---- stale_workplace_notice_superseded_by_newer_001 stdout ----

thread 'stale_workplace_notice_superseded_by_newer_001' (7555) panicked at crates/tracewake-content/tests/fixtures_load.rs:1160:5:
assertion `left == right` failed
  left: SimTick(0)
 right: SimTick(3)

failures:
    stale_workplace_notice_superseded_by_newer_001

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
