*** crates/tracewake-core/src/epistemics/projection.rs:263:9: replace ClassifiedActorKnownProjectionRecord<'a>::is_latest_current_place_record -> bool with true

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace ClassifiedActorKnownProjectionRecord<'a>::is_latest_current_place_record -> bool with true
@@ -255,17 +255,17 @@
         self.freshness
     }
 
     pub fn source_tick(&self) -> SimTick {
         self.record.source_tick()
     }
 
     pub fn is_latest_current_place_record(&self) -> bool {
-        self.latest_current_place_record
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn is_current_place_record(&self) -> bool {
         self.current_place_record
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq)]

---- agent::perception::tests::current_place_knowledge_context_keeps_remembered_workplace_notice_after_newer_perception stdout ----

thread 'agent::perception::tests::current_place_knowledge_context_keeps_remembered_workplace_notice_after_newer_perception' (11825) panicked at crates/tracewake-core/src/agent/perception.rs:1311:9:
assertion failed: classified.iter().any(|record|
        {
            matches!(record.record(), ActorKnownProjectionRecord::Workplace
                        { workplace_id, .. } if workplace_id.as_str() ==
                        "workplace_tomas") &&
                    record.freshness() ==
                        ActorKnownProjectionFreshness::Remembered &&
                !record.is_latest_current_place_record()
        })

---- agent::perception::tests::current_place_knowledge_context_uses_latest_projection_window_for_sleep_affordances stdout ----

thread 'agent::perception::tests::current_place_knowledge_context_uses_latest_projection_window_for_sleep_affordances' (11826) panicked at crates/tracewake-core/src/agent/perception.rs:1149:9:
assertion failed: !refreshed_context.actor_known_sleep_affordances().iter().any(|fact|
            fact.sleep_affordance_id().as_str() == "bed_tomas")

---- agent::perception::tests::current_place_knowledge_context_uses_latest_projection_window_not_live_truth stdout ----

thread 'agent::perception::tests::current_place_knowledge_context_uses_latest_projection_window_not_live_truth' (11827) panicked at crates/tracewake-core/src/agent/perception.rs:1077:9:
assertion failed: !refreshed_context.actor_known_food_sources().iter().any(|fact|
            fact.food_supply_id().as_str() == "food_breakfast_tomas")

failures:
    agent::perception::tests::current_place_knowledge_context_keeps_remembered_workplace_notice_after_newer_perception
    agent::perception::tests::current_place_knowledge_context_uses_latest_projection_window_for_sleep_affordances
    agent::perception::tests::current_place_knowledge_context_uses_latest_projection_window_not_live_truth
    agent::perception::tests::embodied_context_filters_reclassified_records_by_declared_scope_but_no_human_keeps_memory

test result: FAILED. 451 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
