*** crates/tracewake-core/src/epistemics/projection.rs:263:9: replace ClassifiedActorKnownProjectionRecord<'a>::is_latest_current_place_record -> bool with false

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace ClassifiedActorKnownProjectionRecord<'a>::is_latest_current_place_record -> bool with false
@@ -255,17 +255,17 @@
         self.freshness
     }
 
     pub fn source_tick(&self) -> SimTick {
         self.record.source_tick()
     }
 
     pub fn is_latest_current_place_record(&self) -> bool {
-        self.latest_current_place_record
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn is_current_place_record(&self) -> bool {
         self.current_place_record
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq)]

---- agent::perception::tests::current_place_knowledge_context_uses_latest_projection_window_not_live_truth stdout ----

thread 'agent::perception::tests::current_place_knowledge_context_uses_latest_projection_window_not_live_truth' (16386) panicked at crates/tracewake-core/src/agent/perception.rs:1030:9:
assertion failed: stale_context.actor_known_food_sources().iter().any(|fact|
        fact.food_supply_id().as_str() == "food_breakfast_tomas")

---- agent::perception::tests::current_place_knowledge_context_uses_latest_projection_window_for_sleep_affordances stdout ----

thread 'agent::perception::tests::current_place_knowledge_context_uses_latest_projection_window_for_sleep_affordances' (16385) panicked at crates/tracewake-core/src/agent/perception.rs:1107:9:
assertion failed: stale_context.actor_known_sleep_affordances().iter().any(|fact|
        fact.sleep_affordance_id().as_str() == "bed_tomas")

---- controller::tests::human_binding_adds_no_extra_semantic_actions stdout ----

thread 'controller::tests::human_binding_adds_no_extra_semantic_actions' (16446) panicked at crates/tracewake-core/src/projections.rs:107:14:
sealed embodied source requires observed current-place label

failures:
    agent::perception::tests::current_place_knowledge_context_uses_latest_projection_window_for_sleep_affordances
    agent::perception::tests::current_place_knowledge_context_uses_latest_projection_window_not_live_truth
    controller::tests::human_binding_adds_no_extra_semantic_actions

test result: FAILED. 452 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
