*** crates/tracewake-core/src/epistemics/projection.rs:267:9: replace ClassifiedActorKnownProjectionRecord<'a>::is_current_place_record -> bool with true

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace ClassifiedActorKnownProjectionRecord<'a>::is_current_place_record -> bool with true
@@ -259,17 +259,17 @@
         self.record.source_tick()
     }
 
     pub fn is_latest_current_place_record(&self) -> bool {
         self.latest_current_place_record
     }
 
     pub fn is_current_place_record(&self) -> bool {
-        self.current_place_record
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq)]
 pub struct EpistemicProjection {
     observations_by_id: BTreeMap<ObservationId, Observation>,
     observations_by_actor: BTreeMap<ActorId, BTreeSet<ObservationId>>,
     beliefs_by_id: BTreeMap<BeliefId, Belief>,

---- epistemics::projection::tests::workplace_current_place_scope_drops_other_place_from_embodied_context stdout ----

thread 'epistemics::projection::tests::workplace_current_place_scope_drops_other_place_from_embodied_context' (21053) panicked at crates/tracewake-core/src/epistemics/projection.rs:2285:9:
assertion failed: !workplace_record.is_current_place_record()

failures:
    epistemics::projection::tests::workplace_current_place_scope_drops_other_place_from_embodied_context

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
