*** crates/tracewake-core/src/epistemics/projection.rs:267:9: replace ClassifiedActorKnownProjectionRecord<'a>::is_current_place_record -> bool with false

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace ClassifiedActorKnownProjectionRecord<'a>::is_current_place_record -> bool with false
@@ -259,17 +259,17 @@
         self.record.source_tick()
     }
 
     pub fn is_latest_current_place_record(&self) -> bool {
         self.latest_current_place_record
     }
 
     pub fn is_current_place_record(&self) -> bool {
-        self.current_place_record
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq)]
 pub struct EpistemicProjection {
     observations_by_id: BTreeMap<ObservationId, Observation>,
     observations_by_actor: BTreeMap<ActorId, BTreeSet<ObservationId>>,
     beliefs_by_id: BTreeMap<BeliefId, Belief>,

---- stale_workplace_notice_superseded_by_newer_001 stdout ----

thread 'stale_workplace_notice_superseded_by_newer_001' (25263) panicked at crates/tracewake-content/tests/fixtures_load.rs:1156:5:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    stale_workplace_notice_superseded_by_newer_001

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
