*** crates/tracewake-core/src/epistemics/projection.rs:299:22: replace ^= with &= in EpistemicProjectionChecksum::from_canonical_lines

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace ^= with &= in EpistemicProjectionChecksum::from_canonical_lines
@@ -291,17 +291,17 @@
     pub fn as_str(&self) -> &str {
         &self.0
     }
 
     pub fn from_canonical_lines(lines: &[String]) -> Self {
         let mut hash = 0xcbf2_9ce4_8422_2325_u64;
         for line in lines {
             for byte in line.as_bytes().iter().copied().chain([b'\n']) {
-                hash ^= u64::from(byte);
+                hash &= /* ~ changed by cargo-mutants ~ */ u64::from(byte);
                 hash = hash.wrapping_mul(0x0000_0100_0000_01b3);
             }
         }
         Self(format!("twe1-{hash:016x}"))
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq)]

---- epistemics::projection::tests::checksum_and_projection_bookkeeping_are_canonical stdout ----

thread 'epistemics::projection::tests::checksum_and_projection_bookkeeping_are_canonical' (10856) panicked at crates/tracewake-core/src/epistemics/projection.rs:1718:9:
assertion `left == right` failed
  left: "twe1-0000000000000000"
 right: "twe1-bbd23ea491ed9813"

failures:
    epistemics::projection::tests::checksum_and_projection_bookkeeping_are_canonical

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
