*** crates/tracewake-core/src/epistemics/projection.rs:343:38: replace += with -= in EpistemicProjection::record_applied_event

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace += with -= in EpistemicProjection::record_applied_event
@@ -335,17 +335,17 @@
         let mut projection = Self::new(content_manifest_id);
         for belief in beliefs {
             projection.insert_belief(belief);
         }
         projection
     }
 
     pub fn record_applied_event(&mut self, event_id: EventId) {
-        self.event_range.event_count += 1;
+        self.event_range.event_count -= /* ~ changed by cargo-mutants ~ */ 1;
         if self.event_range.first_event_id.is_none() {
             self.event_range.first_event_id = Some(event_id.clone());
         }
         self.event_range.last_event_id = Some(event_id);
     }
 
     pub(crate) fn insert_observation(&mut self, observation: Observation) {
         let observation_id = observation.observation_id().clone();

---- fixture_scope_raw_lines_drive_loader_registry_and_fail_closed stdout ----

thread 'fixture_scope_raw_lines_drive_loader_registry_and_fail_closed' (19620) panicked at crates/tracewake-core/src/epistemics/projection.rs:343:9:
attempt to subtract with overflow

---- fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture stdout ----

thread 'fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture' (19618) panicked at crates/tracewake-core/src/epistemics/projection.rs:343:9:
attempt to subtract with overflow

---- fixture_fingerprint_reprices_secondary_file_bytes stdout ----

thread 'fixture_fingerprint_reprices_secondary_file_bytes' (19619) panicked at crates/tracewake-core/src/epistemics/projection.rs:343:9:
attempt to subtract with overflow

failures:
    all_fixtures_load_deterministically_and_validate
    fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture
    fixture_fingerprint_reprices_secondary_file_bytes
    fixture_scope_raw_lines_drive_loader_registry_and_fail_closed
    fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering
    phase3a_load_emits_authored_prehistory_seed_events
    seed_event_log_order_and_projection_provenance_are_causal_and_stable
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food
    stale_workplace_notice_superseded_by_newer_001

test result: FAILED. 25 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
