*** crates/tracewake-core/src/epistemics/projection.rs:343:38: replace += with *= in EpistemicProjection::record_applied_event

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace += with *= in EpistemicProjection::record_applied_event
@@ -335,17 +335,17 @@
         let mut projection = Self::new(content_manifest_id);
         for belief in beliefs {
             projection.insert_belief(belief);
         }
         projection
     }
 
     pub fn record_applied_event(&mut self, event_id: EventId) {
-        self.event_range.event_count += 1;
+        self.event_range.event_count *= /* ~ changed by cargo-mutants ~ */ 1;
         if self.event_range.first_event_id.is_none() {
             self.event_range.first_event_id = Some(event_id.clone());
         }
         self.event_range.last_event_id = Some(event_id);
     }
 
     pub(crate) fn insert_observation(&mut self, observation: Observation) {
         let observation_id = observation.observation_id().clone();

---- epistemics::projection::tests::checksum_and_projection_bookkeeping_are_canonical stdout ----

thread 'epistemics::projection::tests::checksum_and_projection_bookkeeping_are_canonical' (24017) panicked at crates/tracewake-core/src/epistemics/projection.rs:1727:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    epistemics::projection::tests::checksum_and_projection_bookkeeping_are_canonical

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
