*** crates/tracewake-core/src/epistemics/projection.rs:343:9: replace EpistemicProjection::record_applied_event with ()

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace EpistemicProjection::record_applied_event with ()
@@ -335,21 +335,17 @@
         let mut projection = Self::new(content_manifest_id);
         for belief in beliefs {
             projection.insert_belief(belief);
         }
         projection
     }
 
     pub fn record_applied_event(&mut self, event_id: EventId) {
-        self.event_range.event_count += 1;
-        if self.event_range.first_event_id.is_none() {
-            self.event_range.first_event_id = Some(event_id.clone());
-        }
-        self.event_range.last_event_id = Some(event_id);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub(crate) fn insert_observation(&mut self, observation: Observation) {
         let observation_id = observation.observation_id().clone();
         let actor_id = observation.observer_actor_id().clone();
         for record in actor_known_records_from_observation(&observation) {
             self.actor_known_records_by_actor
                 .entry(actor_id.clone())

---- epistemics::projection::tests::checksum_and_projection_bookkeeping_are_canonical stdout ----

thread 'epistemics::projection::tests::checksum_and_projection_bookkeeping_are_canonical' (15427) panicked at crates/tracewake-core/src/epistemics/projection.rs:1723:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    epistemics::projection::tests::checksum_and_projection_bookkeeping_are_canonical

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
