*** crates/tracewake-core/src/epistemics/projection.rs:351:9: replace EpistemicProjection::insert_observation with ()

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace EpistemicProjection::insert_observation with ()
@@ -343,29 +343,17 @@
         self.event_range.event_count += 1;
         if self.event_range.first_event_id.is_none() {
             self.event_range.first_event_id = Some(event_id.clone());
         }
         self.event_range.last_event_id = Some(event_id);
     }
 
     pub(crate) fn insert_observation(&mut self, observation: Observation) {
-        let observation_id = observation.observation_id().clone();
-        let actor_id = observation.observer_actor_id().clone();
-        for record in actor_known_records_from_observation(&observation) {
-            self.actor_known_records_by_actor
-                .entry(actor_id.clone())
-                .or_default()
-                .insert(record);
-        }
-        self.observations_by_actor
-            .entry(actor_id)
-            .or_default()
-            .insert(observation_id.clone());
-        self.observations_by_id.insert(observation_id, observation);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub(crate) fn insert_belief(&mut self, belief: Belief) {
         let belief_id = belief.belief_id().clone();
         if let HolderKind::Actor(actor_id) = &belief.holder() {
             self.beliefs_by_holder
                 .entry(actor_id.clone())
                 .or_default()

---- aged_food_record_surfaces_as_remembered_belief stdout ----

thread 'aged_food_record_surfaces_as_remembered_belief' (28265) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2648:5:
assertion failed: surface.context().known_food_sources().contains("food_stew_home_tomas")

---- severe_safety_with_known_exit_produces_move_and_replays stdout ----

thread 'severe_safety_with_known_exit_produces_move_and_replays' (28300) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1715:10:
severe safety should commit a move

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (28276) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

failures:
    aged_food_record_surfaces_as_remembered_belief
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    severe_safety_with_known_exit_produces_move_and_replays

test result: FAILED. 38 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.38s

*** result: Failure(101)
