*** crates/tracewake-core/src/epistemics/projection.rs:367:9: replace EpistemicProjection::insert_belief with ()

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace EpistemicProjection::insert_belief with ()
@@ -359,24 +359,17 @@
         self.observations_by_actor
             .entry(actor_id)
             .or_default()
             .insert(observation_id.clone());
         self.observations_by_id.insert(observation_id, observation);
     }
 
     pub(crate) fn insert_belief(&mut self, belief: Belief) {
-        let belief_id = belief.belief_id().clone();
-        if let HolderKind::Actor(actor_id) = &belief.holder() {
-            self.beliefs_by_holder
-                .entry(actor_id.clone())
-                .or_default()
-                .insert(belief_id.clone());
-        }
-        self.beliefs_by_id.insert(belief_id, belief);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub(crate) fn insert_role_assignment_notice(
         &mut self,
         actor_id: ActorId,
         workplace_id: WorkplaceId,
         place_id: PlaceId,
         believed_access_open: bool,

---- fixture_initial_beliefs_construct_epistemic_projection stdout ----

thread 'fixture_initial_beliefs_construct_epistemic_projection' (32370) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:3143:5:
assertion failed: projection.has_belief(&"belief_tomas_expects_coin_stack_01_in_strongbox_tomas".parse().unwrap())

failures:
    fixture_initial_beliefs_construct_epistemic_projection

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.61s

*** result: Failure(101)
