*** crates/tracewake-core/src/epistemics/projection.rs:386:9: replace EpistemicProjection::insert_role_assignment_notice with ()

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace EpistemicProjection::insert_role_assignment_notice with ()
@@ -378,28 +378,17 @@
         &mut self,
         actor_id: ActorId,
         workplace_id: WorkplaceId,
         place_id: PlaceId,
         believed_access_open: bool,
         source_event_id: EventId,
         source_tick: SimTick,
     ) {
-        self.actor_known_records_by_actor
-            .entry(actor_id.clone())
-            .or_default()
-            .insert(ActorKnownProjectionRecord::Workplace {
-                actor_id,
-                workplace_id,
-                place_id,
-                believed_access_open,
-                source: ActorKnownProjectionSource::RoleAssignmentNotice,
-                source_event_id,
-                source_tick,
-            });
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub(crate) fn insert_starting_belief(
         &mut self,
         actor_id: ActorId,
         belief_kind: &str,
         subject_id: &str,
         value: &str,

---- stale_workplace_notice_superseded_by_newer_001 stdout ----

thread 'stale_workplace_notice_superseded_by_newer_001' (3966) panicked at crates/tracewake-content/tests/fixtures_load.rs:1156:5:
assertion `left == right` failed
  left: 0
 right: 1

---- seed_event_log_order_and_projection_provenance_are_causal_and_stable stdout ----

thread 'seed_event_log_order_and_projection_provenance_are_causal_and_stable' (3963) panicked at crates/tracewake-content/tests/fixtures_load.rs:1013:10:
role notice seed replays into projection with source event id

failures:
    seed_event_log_order_and_projection_provenance_are_causal_and_stable
    stale_workplace_notice_superseded_by_newer_001

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
