*** crates/tracewake-core/src/epistemics/projection.rs:409:9: replace EpistemicProjection::insert_starting_belief with ()

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace EpistemicProjection::insert_starting_belief with ()
@@ -401,31 +401,17 @@
         &mut self,
         actor_id: ActorId,
         belief_kind: &str,
         subject_id: &str,
         value: &str,
         source_event_id: EventId,
         source_tick: SimTick,
     ) {
-        let Some(record) = actor_known_record_from_starting_belief(
-            actor_id,
-            belief_kind,
-            subject_id,
-            value,
-            source_event_id,
-            source_tick,
-        ) else {
-            return;
-        };
-        let actor_id = record.actor_id().clone();
-        self.actor_known_records_by_actor
-            .entry(actor_id)
-            .or_default()
-            .insert(record);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub(crate) fn insert_contradiction(&mut self, contradiction: Contradiction) {
         let contradiction_id = contradiction.contradiction_id().clone();
         let holder_actor_id = contradiction.holder_actor_id().clone();
         self.contradictions_by_holder
             .entry(holder_actor_id)
             .or_default()

---- seed_event_log_order_and_projection_provenance_are_causal_and_stable stdout ----

thread 'seed_event_log_order_and_projection_provenance_are_causal_and_stable' (7995) panicked at crates/tracewake-content/tests/fixtures_load.rs:995:10:
sleep-place seed replays into projection with source event id

failures:
    seed_event_log_order_and_projection_provenance_are_causal_and_stable

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
