*** crates/tracewake-core/src/epistemics/projection.rs:427:9: replace EpistemicProjection::insert_contradiction with ()

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace EpistemicProjection::insert_contradiction with ()
@@ -419,24 +419,17 @@
         let actor_id = record.actor_id().clone();
         self.actor_known_records_by_actor
             .entry(actor_id)
             .or_default()
             .insert(record);
     }
 
     pub(crate) fn insert_contradiction(&mut self, contradiction: Contradiction) {
-        let contradiction_id = contradiction.contradiction_id().clone();
-        let holder_actor_id = contradiction.holder_actor_id().clone();
-        self.contradictions_by_holder
-            .entry(holder_actor_id)
-            .or_default()
-            .insert(contradiction_id.clone());
-        self.contradictions_by_id
-            .insert(contradiction_id, contradiction);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     pub(crate) fn observation(&self, observation_id: &ObservationId) -> Option<&Observation> {
         self.observations_by_id.get(observation_id)
     }
 
     pub fn has_belief(&self, belief_id: &BeliefId) -> bool {
         self.beliefs_by_id.contains_key(belief_id)

---- epistemics::projection::tests::projection_presence_and_notebook_filters_are_observable stdout ----

thread 'epistemics::projection::tests::projection_presence_and_notebook_filters_are_observable' (12375) panicked at crates/tracewake-core/src/epistemics/projection.rs:1794:13:
contradiction should make projection non-empty

---- epistemics::proposition::tests::at_place_missing_relation_creates_only_exact_typed_contradiction stdout ----

thread 'epistemics::proposition::tests::at_place_missing_relation_creates_only_exact_typed_contradiction' (12380) panicked at crates/tracewake-core/src/epistemics/proposition.rs:498:9:
assertion `left == right` failed
  left: 0
 right: 1

---- epistemics::proposition::tests::carried_by_missing_relation_creates_only_exact_holder_contradiction stdout ----

thread 'epistemics::proposition::tests::carried_by_missing_relation_creates_only_exact_holder_contradiction' (12382) panicked at crates/tracewake-core/src/epistemics/proposition.rs:498:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    epistemics::projection::tests::projection_presence_and_notebook_filters_are_observable
    epistemics::proposition::tests::at_place_missing_relation_creates_only_exact_typed_contradiction
    epistemics::proposition::tests::carried_by_missing_relation_creates_only_exact_holder_contradiction
    epistemics::proposition::tests::expected_location_parser_round_trips_into_typed_contradiction_linkage
    projections::tests::notebook_for_tomas_shows_missing_belief_without_culprit_leak
    projections::tests::notebook_leads_come_from_typed_contradictions_not_belief_wording

test result: FAILED. 449 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
