*** crates/tracewake-core/src/epistemics/projection.rs:438:9: replace EpistemicProjection::observation -> Option<&Observation> with None

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace EpistemicProjection::observation -> Option<&Observation> with None
@@ -430,17 +430,17 @@
             .entry(holder_actor_id)
             .or_default()
             .insert(contradiction_id.clone());
         self.contradictions_by_id
             .insert(contradiction_id, contradiction);
     }
 
     pub(crate) fn observation(&self, observation_id: &ObservationId) -> Option<&Observation> {
-        self.observations_by_id.get(observation_id)
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn has_belief(&self, belief_id: &BeliefId) -> bool {
         self.beliefs_by_id.contains_key(belief_id)
     }
 
     pub fn is_empty(&self) -> bool {
         self.observations_by_id.is_empty()

---- events::apply::tests::epistemic_application_updates_projection stdout ----

thread 'events::apply::tests::epistemic_application_updates_projection' (16957) panicked at crates/tracewake-core/src/events/apply.rs:2037:9:
assertion failed: projection.observation(&ObservationId::new("obs_tomas_checked_strongbox").unwrap()).is_some()

---- projections::tests::notebook_leads_come_from_typed_contradictions_not_belief_wording stdout ----

thread 'projections::tests::notebook_leads_come_from_typed_contradictions_not_belief_wording' (17027) panicked at crates/tracewake-core/src/projections.rs:2568:9:
assertion `left == right` failed
  left: 0
 right: 1

---- projections::tests::notebook_for_tomas_shows_missing_belief_without_culprit_leak stdout ----

thread 'projections::tests::notebook_for_tomas_shows_missing_belief_without_culprit_leak' (17026) panicked at crates/tracewake-core/src/projections.rs:2545:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    events::apply::tests::epistemic_application_updates_projection
    projections::tests::notebook_for_tomas_shows_missing_belief_without_culprit_leak
    projections::tests::notebook_leads_come_from_typed_contradictions_not_belief_wording

test result: FAILED. 452 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
