*** crates/tracewake-core/src/epistemics/projection.rs:442:9: replace EpistemicProjection::has_belief -> bool with true

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace EpistemicProjection::has_belief -> bool with true
@@ -434,17 +434,17 @@
             .insert(contradiction_id, contradiction);
     }
 
     pub(crate) fn observation(&self, observation_id: &ObservationId) -> Option<&Observation> {
         self.observations_by_id.get(observation_id)
     }
 
     pub fn has_belief(&self, belief_id: &BeliefId) -> bool {
-        self.beliefs_by_id.contains_key(belief_id)
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn is_empty(&self) -> bool {
         self.observations_by_id.is_empty()
             && self.beliefs_by_id.is_empty()
             && self.contradictions_by_id.is_empty()
             && self.notebook_entries_by_actor.is_empty()
             && self.actor_known_records_by_actor.is_empty()

---- epistemics::projection::tests::projection_presence_and_notebook_filters_are_observable stdout ----

thread 'epistemics::projection::tests::projection_presence_and_notebook_filters_are_observable' (21505) panicked at crates/tracewake-core/src/epistemics/projection.rs:1750:9:
assertion failed: !projection.has_belief(&belief_id("belief_tomas_missing_coin"))

failures:
    epistemics::projection::tests::projection_presence_and_notebook_filters_are_observable

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
