*** crates/tracewake-core/src/epistemics/projection.rs:442:9: replace EpistemicProjection::has_belief -> bool with false

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace EpistemicProjection::has_belief -> bool with false
@@ -434,17 +434,17 @@
             .insert(contradiction_id, contradiction);
     }
 
     pub(crate) fn observation(&self, observation_id: &ObservationId) -> Option<&Observation> {
         self.observations_by_id.get(observation_id)
     }
 
     pub fn has_belief(&self, belief_id: &BeliefId) -> bool {
-        self.beliefs_by_id.contains_key(belief_id)
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn is_empty(&self) -> bool {
         self.observations_by_id.is_empty()
             && self.beliefs_by_id.is_empty()
             && self.contradictions_by_id.is_empty()
             && self.notebook_entries_by_actor.is_empty()
             && self.actor_known_records_by_actor.is_empty()

---- fixture_initial_beliefs_construct_epistemic_projection stdout ----

thread 'fixture_initial_beliefs_construct_epistemic_projection' (25753) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:3143:5:
assertion failed: projection.has_belief(&"belief_tomas_expects_coin_stack_01_in_strongbox_tomas".parse().unwrap())

failures:
    fixture_initial_beliefs_construct_epistemic_projection

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.60s

*** result: Failure(101)
