*** crates/tracewake-core/src/epistemics/projection.rs:446:9: replace EpistemicProjection::is_empty -> bool with true

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace EpistemicProjection::is_empty -> bool with true
@@ -438,21 +438,17 @@
         self.observations_by_id.get(observation_id)
     }
 
     pub fn has_belief(&self, belief_id: &BeliefId) -> bool {
         self.beliefs_by_id.contains_key(belief_id)
     }
 
     pub fn is_empty(&self) -> bool {
-        self.observations_by_id.is_empty()
-            && self.beliefs_by_id.is_empty()
-            && self.contradictions_by_id.is_empty()
-            && self.notebook_entries_by_actor.is_empty()
-            && self.actor_known_records_by_actor.is_empty()
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn projection_version(&self) -> &EpistemicProjectionVersion {
         &self.projection_version
     }
 
     pub fn observations_for_context(&self, context: &KnowledgeContext) -> Vec<&Observation> {
         self.observations_by_actor

---- epistemics::projection::tests::projection_presence_and_notebook_filters_are_observable stdout ----

thread 'epistemics::projection::tests::projection_presence_and_notebook_filters_are_observable' (30163) panicked at crates/tracewake-core/src/epistemics/projection.rs:1754:9:
assertion failed: !projection.is_empty()

failures:
    epistemics::projection::tests::projection_presence_and_notebook_filters_are_observable

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
