*** crates/tracewake-core/src/epistemics/projection.rs:446:9: replace EpistemicProjection::is_empty -> bool with false

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace EpistemicProjection::is_empty -> bool with false
@@ -438,21 +438,17 @@
         self.observations_by_id.get(observation_id)
     }
 
     pub fn has_belief(&self, belief_id: &BeliefId) -> bool {
         self.beliefs_by_id.contains_key(belief_id)
     }
 
     pub fn is_empty(&self) -> bool {
-        self.observations_by_id.is_empty()
-            && self.beliefs_by_id.is_empty()
-            && self.contradictions_by_id.is_empty()
-            && self.notebook_entries_by_actor.is_empty()
-            && self.actor_known_records_by_actor.is_empty()
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn projection_version(&self) -> &EpistemicProjectionVersion {
         &self.projection_version
     }
 
     pub fn observations_for_context(&self, context: &KnowledgeContext) -> Vec<&Observation> {
         self.observations_by_actor

---- epistemics::projection::tests::projection_presence_and_notebook_filters_are_observable stdout ----

thread 'epistemics::projection::tests::projection_presence_and_notebook_filters_are_observable' (2254) panicked at crates/tracewake-core/src/epistemics/projection.rs:1745:9:
assertion failed: projection.is_empty()

---- events::apply::tests::unsupported_epistemic_payload_version_errors stdout ----

thread 'events::apply::tests::unsupported_epistemic_payload_version_errors' (2285) panicked at crates/tracewake-core/src/events/apply.rs:2057:9:
assertion failed: projection.is_empty()

---- replay::rebuild::tests::unsupported_epistemic_event_schema_reports_position_and_version stdout ----

thread 'replay::rebuild::tests::unsupported_epistemic_event_schema_reports_position_and_version' (2364) panicked at crates/tracewake-core/src/replay/rebuild.rs:841:9:
assertion failed: report.final_epistemic_projection.is_empty()

failures:
    epistemics::projection::tests::projection_presence_and_notebook_filters_are_observable
    events::apply::tests::unsupported_epistemic_payload_version_errors
    replay::rebuild::tests::unsupported_epistemic_event_schema_reports_position_and_version

test result: FAILED. 452 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
