*** crates/tracewake-core/src/epistemics/projection.rs:450:13: replace && with || in EpistemicProjection::is_empty

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace && with || in EpistemicProjection::is_empty
@@ -442,17 +442,17 @@
         self.beliefs_by_id.contains_key(belief_id)
     }
 
     pub fn is_empty(&self) -> bool {
         self.observations_by_id.is_empty()
             && self.beliefs_by_id.is_empty()
             && self.contradictions_by_id.is_empty()
             && self.notebook_entries_by_actor.is_empty()
-            && self.actor_known_records_by_actor.is_empty()
+            || /* ~ changed by cargo-mutants ~ */ self.actor_known_records_by_actor.is_empty()
     }
 
     pub fn projection_version(&self) -> &EpistemicProjectionVersion {
         &self.projection_version
     }
 
     pub fn observations_for_context(&self, context: &KnowledgeContext) -> Vec<&Observation> {
         self.observations_by_actor

---- epistemics::projection::tests::projection_presence_and_notebook_filters_are_observable stdout ----

thread 'epistemics::projection::tests::projection_presence_and_notebook_filters_are_observable' (6814) panicked at crates/tracewake-core/src/epistemics/projection.rs:1758:9:
assertion failed: !projection.is_empty()

failures:
    epistemics::projection::tests::projection_presence_and_notebook_filters_are_observable

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
