*** crates/tracewake-core/src/epistemics/projection.rs:458:9: replace EpistemicProjection::observations_for_context -> Vec<&Observation> with vec![]

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace EpistemicProjection::observations_for_context -> Vec<&Observation> with vec![]
@@ -450,23 +450,17 @@
             && self.actor_known_records_by_actor.is_empty()
     }
 
     pub fn projection_version(&self) -> &EpistemicProjectionVersion {
         &self.projection_version
     }
 
     pub fn observations_for_context(&self, context: &KnowledgeContext) -> Vec<&Observation> {
-        self.observations_by_actor
-            .get(context.viewer_actor_id())
-            .into_iter()
-            .flat_map(|ids| ids.iter())
-            .filter_map(|id| self.observations_by_id.get(id))
-            .filter(|observation| context.permits_scope(observation.privacy_scope()))
-            .collect()
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn beliefs_for_context(&self, context: &KnowledgeContext) -> Vec<&Belief> {
         match context.mode() {
             ViewMode::Debug => self
                 .beliefs_by_id
                 .values()
                 .filter(|belief| context.permits_scope(belief.privacy_scope()))

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (24756) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (24757) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2714:5:
assertion failed: has_event(&log, EventKind::ActorMoved)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection

test result: FAILED. 40 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.48s

*** result: Failure(101)
