*** crates/tracewake-core/src/epistemics/projection.rs:486:9: replace EpistemicProjection::contradictions_for_context -> Vec<&Contradiction> with vec![]

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace EpistemicProjection::contradictions_for_context -> Vec<&Contradiction> with vec![]
@@ -478,26 +478,17 @@
                 .flat_map(|ids| ids.iter())
                 .filter_map(|id| self.beliefs_by_id.get(id))
                 .filter(|belief| context.permits_scope(belief.privacy_scope()))
                 .collect(),
         }
     }
 
     pub fn contradictions_for_context(&self, context: &KnowledgeContext) -> Vec<&Contradiction> {
-        match context.mode() {
-            ViewMode::Debug => self.contradictions_by_id.values().collect(),
-            ViewMode::Embodied => self
-                .contradictions_by_holder
-                .get(context.viewer_actor_id())
-                .into_iter()
-                .flat_map(|ids| ids.iter())
-                .filter_map(|id| self.contradictions_by_id.get(id))
-                .collect(),
-        }
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn notebook_entries_for_context(&self, context: &KnowledgeContext) -> Vec<&NotebookEntry> {
         match context.mode() {
             ViewMode::Debug => self
                 .notebook_entries_by_actor
                 .values()
                 .flat_map(|entries| entries.iter())

---- projections::tests::notebook_for_tomas_shows_missing_belief_without_culprit_leak stdout ----

thread 'projections::tests::notebook_for_tomas_shows_missing_belief_without_culprit_leak' (909) panicked at crates/tracewake-core/src/projections.rs:2542:9:
assertion failed: rendered.contains("Contradicts your earlier expectation.")

---- projections::tests::notebook_leads_come_from_typed_contradictions_not_belief_wording stdout ----

thread 'projections::tests::notebook_leads_come_from_typed_contradictions_not_belief_wording' (910) panicked at crates/tracewake-core/src/projections.rs:2568:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    projections::tests::notebook_for_tomas_shows_missing_belief_without_culprit_leak
    projections::tests::notebook_leads_come_from_typed_contradictions_not_belief_wording

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
