*** crates/tracewake-core/src/epistemics/projection.rs:499:9: replace EpistemicProjection::notebook_entries_for_context -> Vec<&NotebookEntry> with vec![]

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace EpistemicProjection::notebook_entries_for_context -> Vec<&NotebookEntry> with vec![]
@@ -491,29 +491,17 @@
                 .into_iter()
                 .flat_map(|ids| ids.iter())
                 .filter_map(|id| self.contradictions_by_id.get(id))
                 .collect(),
         }
     }
 
     pub fn notebook_entries_for_context(&self, context: &KnowledgeContext) -> Vec<&NotebookEntry> {
-        match context.mode() {
-            ViewMode::Debug => self
-                .notebook_entries_by_actor
-                .values()
-                .flat_map(|entries| entries.iter())
-                .collect(),
-            ViewMode::Embodied => self
-                .notebook_entries_by_actor
-                .get(context.viewer_actor_id())
-                .into_iter()
-                .flat_map(|entries| entries.iter())
-                .collect(),
-        }
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn classified_actor_known_records_for_context(
         &self,
         context: &KnowledgeContext,
         current_place_id: &PlaceId,
     ) -> Vec<ClassifiedActorKnownProjectionRecord<'_>> {
         let latest_current_place_tick = self

---- epistemics::projection::tests::projection_presence_and_notebook_filters_are_observable stdout ----

thread 'epistemics::projection::tests::projection_presence_and_notebook_filters_are_observable' (5388) panicked at crates/tracewake-core/src/epistemics/projection.rs:1816:9:
assertion `left == right` failed
  left: []
 right: ["note for actor_tomas"]

failures:
    epistemics::projection::tests::projection_presence_and_notebook_filters_are_observable

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
