*** crates/tracewake-core/src/epistemics/projection.rs:522:67: replace == with != in EpistemicProjection::classified_actor_known_records_for_context

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace == with != in EpistemicProjection::classified_actor_known_records_for_context
@@ -514,17 +514,17 @@
     pub fn classified_actor_known_records_for_context(
         &self,
         context: &KnowledgeContext,
         current_place_id: &PlaceId,
     ) -> Vec<ClassifiedActorKnownProjectionRecord<'_>> {
         let latest_current_place_tick = self
             .observations_for_context(context)
             .into_iter()
-            .filter(|observation| observation.observer_place_id() == current_place_id)
+            .filter(|observation| observation.observer_place_id() != /* ~ changed by cargo-mutants ~ */ current_place_id)
             .filter(|observation| observation.observed_tick() <= context.current_tick())
             .map(|observation| observation.observed_tick())
             .max();
 
         let selected_workplaces = newest_workplace_records(
             self.actor_known_records_by_actor
                 .get(context.viewer_actor_id()),
         );

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (13698) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (13699) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2714:5:
assertion failed: has_event(&log, EventKind::ActorMoved)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection

test result: FAILED. 40 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.48s

*** result: Failure(101)
