*** crates/tracewake-core/src/epistemics/projection.rs:734:9: replace ActorKnownProjectionSource::source_label -> &'static str with "xyzzy"

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace ActorKnownProjectionSource::source_label -> &'static str with "xyzzy"
@@ -726,29 +726,17 @@
             checksum,
             canonical_input: lines,
         }
     }
 }
 
 impl ActorKnownProjectionSource {
     pub fn source_label(&self) -> &'static str {
-        match self {
-            Self::RoleAssignmentNotice => "evented_role_assignment_notice",
-            Self::StartingBelief => "evented_starting_belief",
-            Self::CurrentPlace => "evented_perception:current_place",
-            Self::CarriedItem => "evented_perception:carried_item",
-            Self::VisibleExit => "evented_perception:visible_exit",
-            Self::VisibleFoodSupply => "evented_perception:visible_food_supply",
-            Self::VisibleDoor => "evented_perception:visible_door",
-            Self::VisibleContainer => "evented_perception:visible_container",
-            Self::VisibleItem => "evented_perception:visible_item",
-            Self::VisibleActor => "evented_perception:visible_actor",
-            Self::VisibleSleepAffordance => "evented_perception:visible_sleep_affordance",
-        }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     fn stable_id(&self) -> &'static str {
         match self {
             Self::RoleAssignmentNotice => "role_assignment_notice",
             Self::StartingBelief => "starting_belief",
             Self::CurrentPlace => "current_place",
             Self::CarriedItem => "carried_item",

---- aged_food_record_surfaces_as_remembered_belief stdout ----

thread 'aged_food_record_surfaces_as_remembered_belief' (30063) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2660:5:
assertion failed: food_fact.proof_note().contains("remembered_belief:evented_perception:visible_food_supply")

failures:
    aged_food_record_surfaces_as_remembered_belief

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.56s

*** result: Failure(101)
