*** crates/tracewake-core/src/epistemics/projection.rs:750:9: replace ActorKnownProjectionSource::stable_id -> &'static str with ""

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace ActorKnownProjectionSource::stable_id -> &'static str with ""
@@ -742,29 +742,17 @@
             Self::VisibleContainer => "evented_perception:visible_container",
             Self::VisibleItem => "evented_perception:visible_item",
             Self::VisibleActor => "evented_perception:visible_actor",
             Self::VisibleSleepAffordance => "evented_perception:visible_sleep_affordance",
         }
     }
 
     fn stable_id(&self) -> &'static str {
-        match self {
-            Self::RoleAssignmentNotice => "role_assignment_notice",
-            Self::StartingBelief => "starting_belief",
-            Self::CurrentPlace => "current_place",
-            Self::CarriedItem => "carried_item",
-            Self::VisibleExit => "visible_exit",
-            Self::VisibleFoodSupply => "visible_food_supply",
-            Self::VisibleDoor => "visible_door",
-            Self::VisibleContainer => "visible_container",
-            Self::VisibleItem => "visible_item",
-            Self::VisibleActor => "visible_actor",
-            Self::VisibleSleepAffordance => "visible_sleep_affordance",
-        }
+        "" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl ActorKnownProjectionRecord {
     pub fn kind(&self) -> &'static str {
         match self {
             Self::CurrentPlace { .. } => "current_place",
             Self::CarriedItem { .. } => "carried_item",

---- epistemics::projection::tests::actor_known_sources_and_canonical_records_are_stable stdout ----

thread 'epistemics::projection::tests::actor_known_sources_and_canonical_records_are_stable' (2004) panicked at crates/tracewake-core/src/epistemics/projection.rs:1846:9:
assertion `left == right` failed
  left: ["", "", "", "", "", "", "", "", "", "", ""]
 right: ["role_assignment_notice", "starting_belief", "current_place", "carried_item", "visible_exit", "visible_food_supply", "visible_door", "visible_container", "visible_item", "visible_actor", "visible_sleep_affordance"]

---- epistemics::projection::tests::starting_beliefs_materialize_actor_known_records stdout ----

thread 'epistemics::projection::tests::starting_beliefs_materialize_actor_known_records' (2012) panicked at crates/tracewake-core/src/epistemics/projection.rs:2113:9:
assertion failed: records.iter().any(|record|
        record ==
            "food|id=food_pantry|place=kitchen|servings=-|source=starting_belief|event=event_starting_food|tick=2")

failures:
    epistemics::projection::tests::actor_known_sources_and_canonical_records_are_stable
    epistemics::projection::tests::starting_beliefs_materialize_actor_known_records

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
