*** crates/tracewake-core/src/epistemics/projection.rs:768:9: replace ActorKnownProjectionRecord::kind -> &'static str with "xyzzy"

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace ActorKnownProjectionRecord::kind -> &'static str with "xyzzy"
@@ -760,28 +760,17 @@
             Self::VisibleActor => "visible_actor",
             Self::VisibleSleepAffordance => "visible_sleep_affordance",
         }
     }
 }
 
 impl ActorKnownProjectionRecord {
     pub fn kind(&self) -> &'static str {
-        match self {
-            Self::CurrentPlace { .. } => "current_place",
-            Self::CarriedItem { .. } => "carried_item",
-            Self::Route { .. } => "route",
-            Self::FoodSource { .. } => "food_source",
-            Self::LocalActor { .. } => "local_actor",
-            Self::LocalContainer { .. } => "local_container",
-            Self::LocalDoor { .. } => "local_door",
-            Self::LocalItem { .. } => "local_item",
-            Self::SleepPlace { .. } => "sleep_place",
-            Self::Workplace { .. } => "workplace",
-        }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     fn supersede_workplace_subject(&self) -> Option<&WorkplaceId> {
         match self {
             Self::Workplace { workplace_id, .. } => Some(workplace_id),
             Self::Route { .. }
             | Self::CurrentPlace { .. }
             | Self::CarriedItem { .. }

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (14813) panicked at crates/tracewake-core/src/epistemics/projection.rs:1163:28:
unknown actor-known projection kind: xyzzy

---- stale_workplace_notice_superseded_by_newer_001 stdout ----

thread 'stale_workplace_notice_superseded_by_newer_001' (14815) panicked at crates/tracewake-core/src/epistemics/projection.rs:1163:28:
unknown actor-known projection kind: xyzzy

---- seed_event_log_order_and_projection_provenance_are_causal_and_stable stdout ----

thread 'seed_event_log_order_and_projection_provenance_are_causal_and_stable' (14812) panicked at crates/tracewake-core/src/epistemics/projection.rs:1163:28:
unknown actor-known projection kind: xyzzy

failures:
    seed_event_log_order_and_projection_provenance_are_causal_and_stable
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food
    stale_workplace_notice_superseded_by_newer_001

test result: FAILED. 31 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
