*** crates/tracewake-core/src/epistemics/projection.rs:783:9: replace ActorKnownProjectionRecord::supersede_workplace_subject -> Option<&WorkplaceId> with None

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace ActorKnownProjectionRecord::supersede_workplace_subject -> Option<&WorkplaceId> with None
@@ -775,28 +775,17 @@
             Self::LocalDoor { .. } => "local_door",
             Self::LocalItem { .. } => "local_item",
             Self::SleepPlace { .. } => "sleep_place",
             Self::Workplace { .. } => "workplace",
         }
     }
 
     fn supersede_workplace_subject(&self) -> Option<&WorkplaceId> {
-        match self {
-            Self::Workplace { workplace_id, .. } => Some(workplace_id),
-            Self::Route { .. }
-            | Self::CurrentPlace { .. }
-            | Self::CarriedItem { .. }
-            | Self::FoodSource { .. }
-            | Self::SleepPlace { .. }
-            | Self::LocalDoor { .. }
-            | Self::LocalContainer { .. }
-            | Self::LocalItem { .. }
-            | Self::LocalActor { .. } => None,
-        }
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn actor_id(&self) -> &ActorId {
         match self {
             Self::Route { actor_id, .. }
             | Self::CurrentPlace { actor_id, .. }
             | Self::CarriedItem { actor_id, .. }
             | Self::FoodSource { actor_id, .. }

---- stale_workplace_notice_superseded_by_newer_001 stdout ----

thread 'stale_workplace_notice_superseded_by_newer_001' (18846) panicked at crates/tracewake-core/src/epistemics/projection.rs:212:21:
actor-known projection kind with SupersedeNewestBySubject lacks a subject extractor: workplace

---- seed_event_log_order_and_projection_provenance_are_causal_and_stable stdout ----

thread 'seed_event_log_order_and_projection_provenance_are_causal_and_stable' (18843) panicked at crates/tracewake-core/src/epistemics/projection.rs:212:21:
actor-known projection kind with SupersedeNewestBySubject lacks a subject extractor: workplace

failures:
    seed_event_log_order_and_projection_provenance_are_causal_and_stable
    stale_workplace_notice_superseded_by_newer_001

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
