*** crates/tracewake-core/src/epistemics/projection.rs:863:9: replace ActorKnownProjectionRecord::source_tick -> SimTick with Default::default()

*** mutation diff:
--- crates/tracewake-core/src/epistemics/projection.rs
+++ replace ActorKnownProjectionRecord::source_tick -> SimTick with Default::default()
@@ -855,28 +855,17 @@
             }
             | Self::Workplace {
                 source_event_id, ..
             } => source_event_id,
         }
     }
 
     pub fn source_tick(&self) -> SimTick {
-        match self {
-            Self::Route { source_tick, .. }
-            | Self::CurrentPlace { source_tick, .. }
-            | Self::CarriedItem { source_tick, .. }
-            | Self::FoodSource { source_tick, .. }
-            | Self::LocalActor { source_tick, .. }
-            | Self::LocalContainer { source_tick, .. }
-            | Self::LocalDoor { source_tick, .. }
-            | Self::LocalItem { source_tick, .. }
-            | Self::SleepPlace { source_tick, .. }
-            | Self::Workplace { source_tick, .. } => *source_tick,
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn policy(&self) -> ActorKnownProjectionKindPolicy {
         actor_known_projection_kind_policy(self.kind())
     }
 
     fn relevant_place_id(&self) -> &PlaceId {
         match self {

---- stale_workplace_notice_superseded_by_newer_001 stdout ----

thread 'stale_workplace_notice_superseded_by_newer_001' (22925) panicked at crates/tracewake-content/tests/fixtures_load.rs:1159:5:
assertion failed: workplace.believed_access_open()

failures:
    stale_workplace_notice_superseded_by_newer_001

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
