*** crates/tracewake-core/src/epistemics/proposition.rs:106:9: replace Proposition::serialize_canonical -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-core/src/epistemics/proposition.rs
+++ replace Proposition::serialize_canonical -> String with "xyzzy".into()
@@ -98,60 +98,17 @@
 impl From<IdError> for PropositionParseError {
     fn from(value: IdError) -> Self {
         Self::InvalidId(value)
     }
 }
 
 impl Proposition {
     pub fn serialize_canonical(&self) -> String {
-        match self {
-            Proposition::ItemLocatedInContainer {
-                item_id,
-                container_id,
-            } => format!(
-                "item_located_in_container|{}|{}",
-                item_id.serialize_canonical(),
-                container_id.serialize_canonical()
-            ),
-            Proposition::ItemLocatedAtPlace { item_id, place_id } => format!(
-                "item_located_at_place|{}|{}",
-                item_id.serialize_canonical(),
-                place_id.serialize_canonical()
-            ),
-            Proposition::ItemCarriedByActor { item_id, actor_id } => format!(
-                "item_carried_by_actor|{}|{}",
-                item_id.serialize_canonical(),
-                actor_id.serialize_canonical()
-            ),
-            Proposition::ContainerContentsObserved { container_id } => format!(
-                "container_contents_observed|{}",
-                container_id.serialize_canonical()
-            ),
-            Proposition::ItemMissingFromExpectedLocation {
-                item_id,
-                expected_location,
-            } => format!(
-                "item_missing_from_expected_location|{}|{}",
-                item_id.serialize_canonical(),
-                serialize_location(expected_location)
-            ),
-            Proposition::SoundHeardNearPlace { place_id } => {
-                format!("sound_heard_near_place|{}", place_id.serialize_canonical())
-            }
-            Proposition::PossibleMovementNearPlace { place_id } => format!(
-                "possible_movement_near_place|{}",
-                place_id.serialize_canonical()
-            ),
-            Proposition::ActorWasNearPlace { actor_id, place_id } => format!(
-                "actor_was_near_place|{}|{}",
-                actor_id.serialize_canonical(),
-                place_id.serialize_canonical()
-            ),
-        }
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn serialize_canonical_bytes(&self) -> Vec<u8> {
         self.serialize_canonical().into_bytes()
     }
 
     pub fn deserialize_canonical(value: &[u8]) -> Result<Self, PropositionParseError> {
         let value = std::str::from_utf8(value).map_err(|_| PropositionParseError::InvalidUtf8)?;

---- validate::tests::fixture_serialization_golden_bytes_are_pinned_001 stdout ----

thread 'validate::tests::fixture_serialization_golden_bytes_are_pinned_001' (6426) panicked at crates/tracewake-content/src/validate.rs:3216:13:
assertion `left == right` failed: phase2a serialization golden changed

failures:
    validate::tests::fixture_serialization_golden_bytes_are_pinned_001

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
