*** crates/tracewake-core/src/epistemics/proposition.rs:153:9: replace Proposition::serialize_canonical_bytes -> Vec<u8> with vec![1]

*** mutation diff:
--- crates/tracewake-core/src/epistemics/proposition.rs
+++ replace Proposition::serialize_canonical_bytes -> Vec<u8> with vec![1]
@@ -145,17 +145,17 @@
                 "actor_was_near_place|{}|{}",
                 actor_id.serialize_canonical(),
                 place_id.serialize_canonical()
             ),
         }
     }
 
     pub fn serialize_canonical_bytes(&self) -> Vec<u8> {
-        self.serialize_canonical().into_bytes()
+        vec![1] /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn deserialize_canonical(value: &[u8]) -> Result<Self, PropositionParseError> {
         let value = std::str::from_utf8(value).map_err(|_| PropositionParseError::InvalidUtf8)?;
         Self::from_str(value)
     }
 
     pub fn contradicts(&self, other: &Self) -> bool {

---- epistemics::proposition::tests::proposition_round_trips_through_canonical_bytes stdout ----

thread 'epistemics::proposition::tests::proposition_round_trips_through_canonical_bytes' (19947) panicked at crates/tracewake-core/src/epistemics/proposition.rs:600:9:
assertion `left == right` failed
  left: "\u{1}"
 right: "item_missing_from_expected_location|coin_stack_01|in_container:strongbox_tomas"

failures:
    epistemics::proposition::tests::proposition_round_trips_through_canonical_bytes

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
