*** crates/tracewake-core/src/epistemics/proposition.rs:162:41: replace || with && in Proposition::contradicts

*** mutation diff:
--- crates/tracewake-core/src/epistemics/proposition.rs
+++ replace || with && in Proposition::contradicts
@@ -154,17 +154,17 @@
     }
 
     pub fn deserialize_canonical(value: &[u8]) -> Result<Self, PropositionParseError> {
         let value = std::str::from_utf8(value).map_err(|_| PropositionParseError::InvalidUtf8)?;
         Self::from_str(value)
     }
 
     pub fn contradicts(&self, other: &Self) -> bool {
-        self.contradicts_one_way(other) || other.contradicts_one_way(self)
+        self.contradicts_one_way(other) && /* ~ changed by cargo-mutants ~ */ other.contradicts_one_way(self)
     }
 
     pub fn render(&self) -> String {
         match self {
             Proposition::ItemLocatedInContainer {
                 item_id,
                 container_id,
             } => format!("{item_id} is in {container_id}"),

---- epistemics::proposition::tests::contradiction_detects_missing_expected_location stdout ----

thread 'epistemics::proposition::tests::contradiction_detects_missing_expected_location' (1163) panicked at crates/tracewake-core/src/epistemics/proposition.rs:862:9:
assertion failed: located.contradicts(&missing)

---- epistemics::proposition::tests::at_place_missing_relation_creates_only_exact_typed_contradiction stdout ----

thread 'epistemics::proposition::tests::at_place_missing_relation_creates_only_exact_typed_contradiction' (1160) panicked at crates/tracewake-core/src/epistemics/proposition.rs:902:13:
assertion `left == right` failed: at-place row item_and_place_match
  left: false
 right: true

---- epistemics::proposition::tests::carried_by_missing_relation_creates_only_exact_holder_contradiction stdout ----

thread 'epistemics::proposition::tests::carried_by_missing_relation_creates_only_exact_holder_contradiction' (1162) panicked at crates/tracewake-core/src/epistemics/proposition.rs:963:13:
assertion `left == right` failed: carried-by row item_and_actor_match
  left: false
 right: true

failures:
    epistemics::proposition::tests::at_place_missing_relation_creates_only_exact_typed_contradiction
    epistemics::proposition::tests::carried_by_missing_relation_creates_only_exact_holder_contradiction
    epistemics::proposition::tests::contradiction_detects_missing_expected_location
    epistemics::proposition::tests::expected_location_parser_round_trips_into_typed_contradiction_linkage

test result: FAILED. 451 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
