*** crates/tracewake-core/src/epistemics/proposition.rs:162:9: replace Proposition::contradicts -> bool with true

*** mutation diff:
--- crates/tracewake-core/src/epistemics/proposition.rs
+++ replace Proposition::contradicts -> bool with true
@@ -154,17 +154,17 @@
     }
 
     pub fn deserialize_canonical(value: &[u8]) -> Result<Self, PropositionParseError> {
         let value = std::str::from_utf8(value).map_err(|_| PropositionParseError::InvalidUtf8)?;
         Self::from_str(value)
     }
 
     pub fn contradicts(&self, other: &Self) -> bool {
-        self.contradicts_one_way(other) || other.contradicts_one_way(self)
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn render(&self) -> String {
         match self {
             Proposition::ItemLocatedInContainer {
                 item_id,
                 container_id,
             } => format!("{item_id} is in {container_id}"),

---- epistemics::proposition::tests::at_place_missing_relation_creates_only_exact_typed_contradiction stdout ----

thread 'epistemics::proposition::tests::at_place_missing_relation_creates_only_exact_typed_contradiction' (24510) panicked at crates/tracewake-core/src/epistemics/proposition.rs:902:13:
assertion `left == right` failed: at-place row item_differs
  left: true
 right: false

---- epistemics::proposition::tests::carried_by_missing_relation_creates_only_exact_holder_contradiction stdout ----

thread 'epistemics::proposition::tests::carried_by_missing_relation_creates_only_exact_holder_contradiction' (24512) panicked at crates/tracewake-core/src/epistemics/proposition.rs:963:13:
assertion `left == right` failed: carried-by row item_differs
  left: true
 right: false

---- epistemics::proposition::tests::contradiction_detects_missing_expected_location stdout ----

thread 'epistemics::proposition::tests::contradiction_detects_missing_expected_location' (24513) panicked at crates/tracewake-core/src/epistemics/proposition.rs:864:9:
assertion failed: !located.contradicts(&unrelated)

failures:
    epistemics::proposition::tests::at_place_missing_relation_creates_only_exact_typed_contradiction
    epistemics::proposition::tests::carried_by_missing_relation_creates_only_exact_holder_contradiction
    epistemics::proposition::tests::contradiction_detects_missing_expected_location

test result: FAILED. 452 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
