*** crates/tracewake-core/src/epistemics/proposition.rs:166:9: replace Proposition::render -> String with String::new()

*** mutation diff:
--- crates/tracewake-core/src/epistemics/proposition.rs
+++ replace Proposition::render -> String with String::new()
@@ -158,47 +158,17 @@
         Self::from_str(value)
     }
 
     pub fn contradicts(&self, other: &Self) -> bool {
         self.contradicts_one_way(other) || other.contradicts_one_way(self)
     }
 
     pub fn render(&self) -> String {
-        match self {
-            Proposition::ItemLocatedInContainer {
-                item_id,
-                container_id,
-            } => format!("{item_id} is in {container_id}"),
-            Proposition::ItemLocatedAtPlace { item_id, place_id } => {
-                format!("{item_id} is at {place_id}")
-            }
-            Proposition::ItemCarriedByActor { item_id, actor_id } => {
-                format!("{item_id} is carried by {actor_id}")
-            }
-            Proposition::ContainerContentsObserved { container_id } => {
-                format!("contents of {container_id} were observed")
-            }
-            Proposition::ItemMissingFromExpectedLocation {
-                item_id,
-                expected_location,
-            } => format!(
-                "{item_id} is missing from expected location {}",
-                render_location(expected_location)
-            ),
-            Proposition::SoundHeardNearPlace { place_id } => {
-                format!("sound was heard near {place_id}")
-            }
-            Proposition::PossibleMovementNearPlace { place_id } => {
-                format!("movement may have occurred near {place_id}")
-            }
-            Proposition::ActorWasNearPlace { actor_id, place_id } => {
-                format!("{actor_id} was near {place_id}")
-            }
-        }
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn validate_references(
         &self,
         known_actors: &BTreeSet<ActorId>,
         known_places: &BTreeSet<PlaceId>,
         known_containers: &BTreeSet<ContainerId>,
         known_items: &BTreeSet<ItemId>,

---- phase2a_initial_beliefs_are_holder_and_source_backed stdout ----

thread 'phase2a_initial_beliefs_are_holder_and_source_backed' (5418) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:3226:13:
assertion failed: !belief.proposition().render().is_empty()

failures:
    phase2a_initial_beliefs_are_holder_and_source_backed

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.59s

*** result: Failure(101)
