*** crates/tracewake-core/src/epistemics/proposition.rs:166:9: replace Proposition::render -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-core/src/epistemics/proposition.rs
+++ replace Proposition::render -> String with "xyzzy".into()
@@ -158,47 +158,17 @@
         Self::from_str(value)
     }
 
     pub fn contradicts(&self, other: &Self) -> bool {
         self.contradicts_one_way(other) || other.contradicts_one_way(self)
     }
 
     pub fn render(&self) -> String {
-        match self {
-            Proposition::ItemLocatedInContainer {
-                item_id,
-                container_id,
-            } => format!("{item_id} is in {container_id}"),
-            Proposition::ItemLocatedAtPlace { item_id, place_id } => {
-                format!("{item_id} is at {place_id}")
-            }
-            Proposition::ItemCarriedByActor { item_id, actor_id } => {
-                format!("{item_id} is carried by {actor_id}")
-            }
-            Proposition::ContainerContentsObserved { container_id } => {
-                format!("contents of {container_id} were observed")
-            }
-            Proposition::ItemMissingFromExpectedLocation {
-                item_id,
-                expected_location,
-            } => format!(
-                "{item_id} is missing from expected location {}",
-                render_location(expected_location)
-            ),
-            Proposition::SoundHeardNearPlace { place_id } => {
-                format!("sound was heard near {place_id}")
-            }
-            Proposition::PossibleMovementNearPlace { place_id } => {
-                format!("movement may have occurred near {place_id}")
-            }
-            Proposition::ActorWasNearPlace { actor_id, place_id } => {
-                format!("{actor_id} was near {place_id}")
-            }
-        }
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn validate_references(
         &self,
         known_actors: &BTreeSet<ActorId>,
         known_places: &BTreeSet<PlaceId>,
         known_containers: &BTreeSet<ContainerId>,
         known_items: &BTreeSet<ItemId>,

---- actions::defs::accuseprobe::tests::unsupported_probe_rejects_without_culprit_leak_in_embodied_summary stdout ----

thread 'actions::defs::accuseprobe::tests::unsupported_probe_rejects_without_culprit_leak_in_embodied_summary' (9544) panicked at crates/tracewake-core/src/actions/defs/accuseprobe.rs:155:9:
assertion failed: rejection.debug_summary.contains("actor_mara")

---- epistemics::proposition::tests::at_place_missing_relation_creates_only_exact_typed_contradiction stdout ----

thread 'epistemics::proposition::tests::at_place_missing_relation_creates_only_exact_typed_contradiction' (9819) panicked at crates/tracewake-core/src/epistemics/proposition.rs:481:9:
assertion `left == right` failed
  left: "xyzzy -> xyzzy"
 right: "coin_stack_01 is at back_room -> coin_stack_01 is missing from expected location place back_room"

---- epistemics::proposition::tests::carried_by_missing_relation_creates_only_exact_holder_contradiction stdout ----

thread 'epistemics::proposition::tests::carried_by_missing_relation_creates_only_exact_holder_contradiction' (9821) panicked at crates/tracewake-core/src/epistemics/proposition.rs:481:9:
assertion `left == right` failed
  left: "xyzzy -> xyzzy"
 right: "coin_stack_01 is carried by actor_tomas -> coin_stack_01 is missing from expected location actor actor_tomas"

failures:
    actions::defs::accuseprobe::tests::unsupported_probe_rejects_without_culprit_leak_in_embodied_summary
    epistemics::proposition::tests::at_place_missing_relation_creates_only_exact_typed_contradiction
    epistemics::proposition::tests::carried_by_missing_relation_creates_only_exact_holder_contradiction
    epistemics::proposition::tests::display_formats_all_variants_as_structured_explanations
    epistemics::proposition::tests::expected_location_parser_round_trips_into_typed_contradiction_linkage
    epistemics::proposition::tests::render_is_derived_from_structured_fields
    projections::tests::notebook_for_tomas_shows_missing_belief_without_culprit_leak

test result: FAILED. 448 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
