*** crates/tracewake-core/src/epistemics/proposition.rs:249:9: replace Proposition::contradicts_one_way -> bool with false

*** mutation diff:
--- crates/tracewake-core/src/epistemics/proposition.rs
+++ replace Proposition::contradicts_one_way -> bool with false
@@ -241,43 +241,17 @@
             Proposition::ActorWasNearPlace { actor_id, place_id } => {
                 require_actor(actor_id, known_actors)?;
                 require_place(place_id, known_places)
             }
         }
     }
 
     fn contradicts_one_way(&self, other: &Self) -> bool {
-        match (self, other) {
-            (
-                Proposition::ItemLocatedInContainer {
-                    item_id,
-                    container_id,
-                },
-                Proposition::ItemMissingFromExpectedLocation {
-                    item_id: missing_item_id,
-                    expected_location: Location::InContainer(expected_container_id),
-                },
-            ) => item_id == missing_item_id && container_id == expected_container_id,
-            (
-                Proposition::ItemLocatedAtPlace { item_id, place_id },
-                Proposition::ItemMissingFromExpectedLocation {
-                    item_id: missing_item_id,
-                    expected_location: Location::AtPlace(expected_place_id),
-                },
-            ) => item_id == missing_item_id && place_id == expected_place_id,
-            (
-                Proposition::ItemCarriedByActor { item_id, actor_id },
-                Proposition::ItemMissingFromExpectedLocation {
-                    item_id: missing_item_id,
-                    expected_location: Location::CarriedBy(expected_actor_id),
-                },
-            ) => item_id == missing_item_id && actor_id == expected_actor_id,
-            _ => false,
-        }
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl fmt::Display for Proposition {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
         f.write_str(&self.render())
     }
 }

---- epistemics::proposition::tests::carried_by_missing_relation_creates_only_exact_holder_contradiction stdout ----

thread 'epistemics::proposition::tests::carried_by_missing_relation_creates_only_exact_holder_contradiction' (22995) panicked at crates/tracewake-core/src/epistemics/proposition.rs:937:13:
assertion `left == right` failed: carried-by row item_and_actor_match
  left: false
 right: true

---- epistemics::proposition::tests::at_place_missing_relation_creates_only_exact_typed_contradiction stdout ----

thread 'epistemics::proposition::tests::at_place_missing_relation_creates_only_exact_typed_contradiction' (22993) panicked at crates/tracewake-core/src/epistemics/proposition.rs:876:13:
assertion `left == right` failed: at-place row item_and_place_match
  left: false
 right: true

---- epistemics::proposition::tests::contradiction_detects_missing_expected_location stdout ----

thread 'epistemics::proposition::tests::contradiction_detects_missing_expected_location' (22996) panicked at crates/tracewake-core/src/epistemics/proposition.rs:836:9:
assertion failed: located.contradicts(&missing)

failures:
    epistemics::proposition::tests::at_place_missing_relation_creates_only_exact_typed_contradiction
    epistemics::proposition::tests::carried_by_missing_relation_creates_only_exact_holder_contradiction
    epistemics::proposition::tests::contradiction_detects_missing_expected_location
    epistemics::proposition::tests::expected_location_parser_round_trips_into_typed_contradiction_linkage

test result: FAILED. 451 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
