*** crates/tracewake-core/src/epistemics/proposition.rs:250:13: delete match arm (Proposition::ItemLocatedInContainer{item_id, container_id,}, Proposition::ItemMissingFromExpectedLocation{item_id:missing_item_id, expected_location:Location::InContainer(expected_container_id),},) in Proposition::contradicts_one_way

*** mutation diff:
--- crates/tracewake-core/src/epistemics/proposition.rs
+++ delete match arm (Proposition::ItemLocatedInContainer{item_id, container_id,}, Proposition::ItemMissingFromExpectedLocation{item_id:missing_item_id, expected_location:Location::InContainer(expected_container_id),},) in Proposition::contradicts_one_way
@@ -242,26 +242,17 @@
                 require_actor(actor_id, known_actors)?;
                 require_place(place_id, known_places)
             }
         }
     }
 
     fn contradicts_one_way(&self, other: &Self) -> bool {
         match (self, other) {
-            (
-                Proposition::ItemLocatedInContainer {
-                    item_id,
-                    container_id,
-                },
-                Proposition::ItemMissingFromExpectedLocation {
-                    item_id: missing_item_id,
-                    expected_location: Location::InContainer(expected_container_id),
-                },
-            ) => item_id == missing_item_id && container_id == expected_container_id,
+             /* ~ changed by cargo-mutants ~ */
             (
                 Proposition::ItemLocatedAtPlace { item_id, place_id },
                 Proposition::ItemMissingFromExpectedLocation {
                     item_id: missing_item_id,
                     expected_location: Location::AtPlace(expected_place_id),
                 },
             ) => item_id == missing_item_id && place_id == expected_place_id,
             (

---- epistemics::proposition::tests::contradiction_detects_missing_expected_location stdout ----

thread 'epistemics::proposition::tests::contradiction_detects_missing_expected_location' (27555) panicked at crates/tracewake-core/src/epistemics/proposition.rs:853:9:
assertion failed: located.contradicts(&missing)

---- epistemics::proposition::tests::expected_location_parser_round_trips_into_typed_contradiction_linkage stdout ----

thread 'epistemics::proposition::tests::expected_location_parser_round_trips_into_typed_contradiction_linkage' (27557) panicked at crates/tracewake-core/src/epistemics/proposition.rs:717:14:
round-tripped location should create typed contradiction

failures:
    epistemics::proposition::tests::contradiction_detects_missing_expected_location
    epistemics::proposition::tests::expected_location_parser_round_trips_into_typed_contradiction_linkage

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
