*** crates/tracewake-core/src/epistemics/proposition.rs:259:45: replace && with || in Proposition::contradicts_one_way

*** mutation diff:
--- crates/tracewake-core/src/epistemics/proposition.rs
+++ replace && with || in Proposition::contradicts_one_way
@@ -251,17 +251,17 @@
                 Proposition::ItemLocatedInContainer {
                     item_id,
                     container_id,
                 },
                 Proposition::ItemMissingFromExpectedLocation {
                     item_id: missing_item_id,
                     expected_location: Location::InContainer(expected_container_id),
                 },
-            ) => item_id == missing_item_id && container_id == expected_container_id,
+            ) => item_id == missing_item_id || /* ~ changed by cargo-mutants ~ */ container_id == expected_container_id,
             (
                 Proposition::ItemLocatedAtPlace { item_id, place_id },
                 Proposition::ItemMissingFromExpectedLocation {
                     item_id: missing_item_id,
                     expected_location: Location::AtPlace(expected_place_id),
                 },
             ) => item_id == missing_item_id && place_id == expected_place_id,
             (

---- epistemics::proposition::tests::contradiction_detects_missing_expected_location stdout ----

thread 'epistemics::proposition::tests::contradiction_detects_missing_expected_location' (8765) panicked at crates/tracewake-core/src/epistemics/proposition.rs:864:9:
assertion failed: !located.contradicts(&unrelated)

failures:
    epistemics::proposition::tests::contradiction_detects_missing_expected_location

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
