*** crates/tracewake-core/src/epistemics/proposition.rs:260:13: delete match arm (Proposition::ItemLocatedAtPlace{item_id, place_id}, Proposition::ItemMissingFromExpectedLocation{item_id:missing_item_id, expected_location:Location::AtPlace(expected_place_id),},) in Proposition::contradicts_one_way

*** mutation diff:
--- crates/tracewake-core/src/epistemics/proposition.rs
+++ delete match arm (Proposition::ItemLocatedAtPlace{item_id, place_id}, Proposition::ItemMissingFromExpectedLocation{item_id:missing_item_id, expected_location:Location::AtPlace(expected_place_id),},) in Proposition::contradicts_one_way
@@ -252,23 +252,17 @@
                     item_id,
                     container_id,
                 },
                 Proposition::ItemMissingFromExpectedLocation {
                     item_id: missing_item_id,
                     expected_location: Location::InContainer(expected_container_id),
                 },
             ) => item_id == missing_item_id && container_id == expected_container_id,
-            (
-                Proposition::ItemLocatedAtPlace { item_id, place_id },
-                Proposition::ItemMissingFromExpectedLocation {
-                    item_id: missing_item_id,
-                    expected_location: Location::AtPlace(expected_place_id),
-                },
-            ) => item_id == missing_item_id && place_id == expected_place_id,
+             /* ~ changed by cargo-mutants ~ */
             (
                 Proposition::ItemCarriedByActor { item_id, actor_id },
                 Proposition::ItemMissingFromExpectedLocation {
                     item_id: missing_item_id,
                     expected_location: Location::CarriedBy(expected_actor_id),
                 },
             ) => item_id == missing_item_id && actor_id == expected_actor_id,
             _ => false,

---- epistemics::proposition::tests::at_place_missing_relation_creates_only_exact_typed_contradiction stdout ----

thread 'epistemics::proposition::tests::at_place_missing_relation_creates_only_exact_typed_contradiction' (32111) panicked at crates/tracewake-core/src/epistemics/proposition.rs:896:13:
assertion `left == right` failed: at-place row item_and_place_match
  left: false
 right: true

---- epistemics::proposition::tests::expected_location_parser_round_trips_into_typed_contradiction_linkage stdout ----

thread 'epistemics::proposition::tests::expected_location_parser_round_trips_into_typed_contradiction_linkage' (32116) panicked at crates/tracewake-core/src/epistemics/proposition.rs:720:14:
round-tripped location should create typed contradiction

failures:
    epistemics::proposition::tests::at_place_missing_relation_creates_only_exact_typed_contradiction
    epistemics::proposition::tests::expected_location_parser_round_trips_into_typed_contradiction_linkage

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
