*** crates/tracewake-core/src/epistemics/proposition.rs:273:45: replace && with || in Proposition::contradicts_one_way

*** mutation diff:
--- crates/tracewake-core/src/epistemics/proposition.rs
+++ replace && with || in Proposition::contradicts_one_way
@@ -265,17 +265,17 @@
                 },
             ) => item_id == missing_item_id && place_id == expected_place_id,
             (
                 Proposition::ItemCarriedByActor { item_id, actor_id },
                 Proposition::ItemMissingFromExpectedLocation {
                     item_id: missing_item_id,
                     expected_location: Location::CarriedBy(expected_actor_id),
                 },
-            ) => item_id == missing_item_id && actor_id == expected_actor_id,
+            ) => item_id == missing_item_id || /* ~ changed by cargo-mutants ~ */ actor_id == expected_actor_id,
             _ => false,
         }
     }
 }
 
 impl fmt::Display for Proposition {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
         f.write_str(&self.render())

---- epistemics::proposition::tests::carried_by_missing_relation_creates_only_exact_holder_contradiction stdout ----

thread 'epistemics::proposition::tests::carried_by_missing_relation_creates_only_exact_holder_contradiction' (3650) panicked at crates/tracewake-core/src/epistemics/proposition.rs:963:13:
assertion `left == right` failed: carried-by row item_differs
  left: true
 right: false

failures:
    epistemics::proposition::tests::carried_by_missing_relation_creates_only_exact_holder_contradiction

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
