*** crates/tracewake-core/src/epistemics/proposition.rs:273:57: replace == with != in Proposition::contradicts_one_way

*** mutation diff:
--- crates/tracewake-core/src/epistemics/proposition.rs
+++ replace == with != in Proposition::contradicts_one_way
@@ -265,17 +265,17 @@
                 },
             ) => item_id == missing_item_id && place_id == expected_place_id,
             (
                 Proposition::ItemCarriedByActor { item_id, actor_id },
                 Proposition::ItemMissingFromExpectedLocation {
                     item_id: missing_item_id,
                     expected_location: Location::CarriedBy(expected_actor_id),
                 },
-            ) => item_id == missing_item_id && actor_id == expected_actor_id,
+            ) => item_id == missing_item_id && actor_id != /* ~ changed by cargo-mutants ~ */ expected_actor_id,
             _ => false,
         }
     }
 }
 
 impl fmt::Display for Proposition {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
         f.write_str(&self.render())

---- epistemics::proposition::tests::carried_by_missing_relation_creates_only_exact_holder_contradiction stdout ----

thread 'epistemics::proposition::tests::carried_by_missing_relation_creates_only_exact_holder_contradiction' (12769) panicked at crates/tracewake-core/src/epistemics/proposition.rs:963:13:
assertion `left == right` failed: carried-by row item_and_actor_match
  left: false
 right: true

---- epistemics::proposition::tests::expected_location_parser_round_trips_into_typed_contradiction_linkage stdout ----

thread 'epistemics::proposition::tests::expected_location_parser_round_trips_into_typed_contradiction_linkage' (12772) panicked at crates/tracewake-core/src/epistemics/proposition.rs:726:14:
round-tripped location should create typed contradiction

failures:
    epistemics::proposition::tests::carried_by_missing_relation_creates_only_exact_holder_contradiction
    epistemics::proposition::tests::expected_location_parser_round_trips_into_typed_contradiction_linkage

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
