*** crates/tracewake-core/src/epistemics/proposition.rs:281:9: replace <impl fmt::Display for Proposition>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/tracewake-core/src/epistemics/proposition.rs
+++ replace <impl fmt::Display for Proposition>::fmt -> fmt::Result with Ok(Default::default())
@@ -273,17 +273,17 @@
             ) => item_id == missing_item_id && actor_id == expected_actor_id,
             _ => false,
         }
     }
 }
 
 impl fmt::Display for Proposition {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        f.write_str(&self.render())
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl FromStr for Proposition {
     type Err = PropositionParseError;
 
     fn from_str(value: &str) -> Result<Self, Self::Err> {
         let parts: Vec<_> = value.split('|').collect();

---- epistemics::proposition::tests::display_formats_all_variants_as_structured_explanations stdout ----

thread 'epistemics::proposition::tests::display_formats_all_variants_as_structured_explanations' (17330) panicked at crates/tracewake-core/src/epistemics/proposition.rs:837:13:
assertion `left == right` failed
  left: ""
 right: "coin_stack_01 is in strongbox_tomas"

failures:
    epistemics::proposition::tests::display_formats_all_variants_as_structured_explanations

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
