*** crates/tracewake-core/src/epistemics/proposition.rs:291:13: delete match arm ["item_located_in_container", item_id, container_id] in <impl FromStr for Proposition>::from_str

*** mutation diff:
--- crates/tracewake-core/src/epistemics/proposition.rs
+++ delete match arm ["item_located_in_container", item_id, container_id] in <impl FromStr for Proposition>::from_str
@@ -283,22 +283,17 @@
 }
 
 impl FromStr for Proposition {
     type Err = PropositionParseError;
 
     fn from_str(value: &str) -> Result<Self, Self::Err> {
         let parts: Vec<_> = value.split('|').collect();
         let proposition = match parts.as_slice() {
-            ["item_located_in_container", item_id, container_id] => {
-                Proposition::ItemLocatedInContainer {
-                    item_id: ItemId::new(*item_id)?,
-                    container_id: ContainerId::new(*container_id)?,
-                }
-            }
+             /* ~ changed by cargo-mutants ~ */
             ["item_located_at_place", item_id, place_id] => Proposition::ItemLocatedAtPlace {
                 item_id: ItemId::new(*item_id)?,
                 place_id: PlaceId::new(*place_id)?,
             },
             ["item_carried_by_actor", item_id, actor_id] => Proposition::ItemCarriedByActor {
                 item_id: ItemId::new(*item_id)?,
                 actor_id: ActorId::new(*actor_id)?,
             },

---- fixture_fingerprint_reprices_secondary_file_bytes stdout ----

thread 'fixture_fingerprint_reprices_secondary_file_bytes' (21519) panicked at crates/tracewake-content/tests/fixtures_load.rs:629:6:

---- fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture stdout ----

thread 'fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture' (21518) panicked at crates/tracewake-content/tests/fixtures_load.rs:661:6:

---- phase2a_fixtures_are_registered_and_script_free stdout ----

thread 'phase2a_fixtures_are_registered_and_script_free' (21540) panicked at crates/tracewake-content/tests/fixtures_load.rs:1546:56:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Serialization, path: "fixture", code: "serialization_error", message: "fixture serialization failed: Proposition(InvalidShape)" }] } }

failures:
    all_fixtures_load_deterministically_and_validate
    fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture
    fixture_fingerprint_reprices_secondary_file_bytes
    phase2a_fixtures_are_registered_and_script_free
    valid_epistemic_seed_validates_and_round_trips_canonically

test result: FAILED. 29 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
