*** crates/tracewake-core/src/epistemics/proposition.rs:297:13: delete match arm ["item_located_at_place", item_id, place_id] in <impl FromStr for Proposition>::from_str

*** mutation diff:
--- crates/tracewake-core/src/epistemics/proposition.rs
+++ delete match arm ["item_located_at_place", item_id, place_id] in <impl FromStr for Proposition>::from_str
@@ -289,20 +289,17 @@
         let parts: Vec<_> = value.split('|').collect();
         let proposition = match parts.as_slice() {
             ["item_located_in_container", item_id, container_id] => {
                 Proposition::ItemLocatedInContainer {
                     item_id: ItemId::new(*item_id)?,
                     container_id: ContainerId::new(*container_id)?,
                 }
             }
-            ["item_located_at_place", item_id, place_id] => Proposition::ItemLocatedAtPlace {
-                item_id: ItemId::new(*item_id)?,
-                place_id: PlaceId::new(*place_id)?,
-            },
+             /* ~ changed by cargo-mutants ~ */
             ["item_carried_by_actor", item_id, actor_id] => Proposition::ItemCarriedByActor {
                 item_id: ItemId::new(*item_id)?,
                 actor_id: ActorId::new(*actor_id)?,
             },
             ["container_contents_observed", container_id] => {
                 Proposition::ContainerContentsObserved {
                     container_id: ContainerId::new(*container_id)?,
                 }

---- serialization_round_trips_spine_variant_matrix stdout ----

thread 'serialization_round_trips_spine_variant_matrix' (25639) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:385:46:
called `Result::unwrap()` on an `Err` value: Proposition(InvalidShape)

failures:
    serialization_round_trips_spine_variant_matrix

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.59s

*** result: Failure(101)
