*** crates/tracewake-core/src/epistemics/proposition.rs:301:13: delete match arm ["item_carried_by_actor", item_id, actor_id] in <impl FromStr for Proposition>::from_str

*** mutation diff:
--- crates/tracewake-core/src/epistemics/proposition.rs
+++ delete match arm ["item_carried_by_actor", item_id, actor_id] in <impl FromStr for Proposition>::from_str
@@ -293,20 +293,17 @@
                     item_id: ItemId::new(*item_id)?,
                     container_id: ContainerId::new(*container_id)?,
                 }
             }
             ["item_located_at_place", item_id, place_id] => Proposition::ItemLocatedAtPlace {
                 item_id: ItemId::new(*item_id)?,
                 place_id: PlaceId::new(*place_id)?,
             },
-            ["item_carried_by_actor", item_id, actor_id] => Proposition::ItemCarriedByActor {
-                item_id: ItemId::new(*item_id)?,
-                actor_id: ActorId::new(*actor_id)?,
-            },
+             /* ~ changed by cargo-mutants ~ */
             ["container_contents_observed", container_id] => {
                 Proposition::ContainerContentsObserved {
                     container_id: ContainerId::new(*container_id)?,
                 }
             }
             ["item_missing_from_expected_location", item_id, expected_location] => {
                 Proposition::ItemMissingFromExpectedLocation {
                     item_id: ItemId::new(*item_id)?,

---- epistemics::proposition::tests::display_formats_all_variants_as_structured_explanations stdout ----

thread 'epistemics::proposition::tests::display_formats_all_variants_as_structured_explanations' (30031) panicked at crates/tracewake-core/src/epistemics/proposition.rs:838:22:
called `Result::unwrap()` on an `Err` value: InvalidShape

---- epistemics::proposition::tests::canonical_parser_round_trips_every_variant_through_projection_consumers stdout ----

thread 'epistemics::proposition::tests::canonical_parser_round_trips_every_variant_through_projection_consumers' (30028) panicked at crates/tracewake-core/src/epistemics/proposition.rs:546:79:
called `Result::unwrap()` on an `Err` value: InvalidShape

---- epistemics::proposition::tests::malformed_canonical_propositions_fail_closed_without_defaults stdout ----

thread 'epistemics::proposition::tests::malformed_canonical_propositions_fail_closed_without_defaults' (30033) panicked at crates/tracewake-core/src/epistemics/proposition.rs:756:9:
assertion `left == right` failed
  left: Err(InvalidShape)
 right: Err(InvalidId(InvalidCharacter { found: ':' }))

failures:
    epistemics::proposition::tests::canonical_parser_round_trips_every_variant_through_projection_consumers
    epistemics::proposition::tests::display_formats_all_variants_as_structured_explanations
    epistemics::proposition::tests::malformed_canonical_propositions_fail_closed_without_defaults

test result: FAILED. 452 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
