*** crates/tracewake-core/src/epistemics/proposition.rs:305:13: delete match arm ["container_contents_observed", container_id] in <impl FromStr for Proposition>::from_str

*** mutation diff:
--- crates/tracewake-core/src/epistemics/proposition.rs
+++ delete match arm ["container_contents_observed", container_id] in <impl FromStr for Proposition>::from_str
@@ -297,21 +297,17 @@
             ["item_located_at_place", item_id, place_id] => Proposition::ItemLocatedAtPlace {
                 item_id: ItemId::new(*item_id)?,
                 place_id: PlaceId::new(*place_id)?,
             },
             ["item_carried_by_actor", item_id, actor_id] => Proposition::ItemCarriedByActor {
                 item_id: ItemId::new(*item_id)?,
                 actor_id: ActorId::new(*actor_id)?,
             },
-            ["container_contents_observed", container_id] => {
-                Proposition::ContainerContentsObserved {
-                    container_id: ContainerId::new(*container_id)?,
-                }
-            }
+             /* ~ changed by cargo-mutants ~ */
             ["item_missing_from_expected_location", item_id, expected_location] => {
                 Proposition::ItemMissingFromExpectedLocation {
                     item_id: ItemId::new(*item_id)?,
                     expected_location: deserialize_location(expected_location)?,
                 }
             }
             ["sound_heard_near_place", place_id] => Proposition::SoundHeardNearPlace {
                 place_id: PlaceId::new(*place_id)?,

---- epistemics::proposition::tests::canonical_parser_round_trips_every_variant_through_projection_consumers stdout ----

thread 'epistemics::proposition::tests::canonical_parser_round_trips_every_variant_through_projection_consumers' (2119) panicked at crates/tracewake-core/src/epistemics/proposition.rs:545:79:
called `Result::unwrap()` on an `Err` value: InvalidShape

---- epistemics::proposition::tests::display_formats_all_variants_as_structured_explanations stdout ----

thread 'epistemics::proposition::tests::display_formats_all_variants_as_structured_explanations' (2122) panicked at crates/tracewake-core/src/epistemics/proposition.rs:837:22:
called `Result::unwrap()` on an `Err` value: InvalidShape

failures:
    epistemics::proposition::tests::canonical_parser_round_trips_every_variant_through_projection_consumers
    epistemics::proposition::tests::display_formats_all_variants_as_structured_explanations

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
