*** crates/tracewake-core/src/epistemics/proposition.rs:310:13: delete match arm ["item_missing_from_expected_location", item_id, expected_location] in <impl FromStr for Proposition>::from_str

*** mutation diff:
--- crates/tracewake-core/src/epistemics/proposition.rs
+++ delete match arm ["item_missing_from_expected_location", item_id, expected_location] in <impl FromStr for Proposition>::from_str
@@ -302,22 +302,17 @@
                 item_id: ItemId::new(*item_id)?,
                 actor_id: ActorId::new(*actor_id)?,
             },
             ["container_contents_observed", container_id] => {
                 Proposition::ContainerContentsObserved {
                     container_id: ContainerId::new(*container_id)?,
                 }
             }
-            ["item_missing_from_expected_location", item_id, expected_location] => {
-                Proposition::ItemMissingFromExpectedLocation {
-                    item_id: ItemId::new(*item_id)?,
-                    expected_location: deserialize_location(expected_location)?,
-                }
-            }
+             /* ~ changed by cargo-mutants ~ */
             ["sound_heard_near_place", place_id] => Proposition::SoundHeardNearPlace {
                 place_id: PlaceId::new(*place_id)?,
             },
             ["possible_movement_near_place", place_id] => Proposition::PossibleMovementNearPlace {
                 place_id: PlaceId::new(*place_id)?,
             },
             ["actor_was_near_place", actor_id, place_id] => Proposition::ActorWasNearPlace {
                 actor_id: ActorId::new(*actor_id)?,

---- epistemics::proposition::tests::expected_location_parser_round_trips_into_typed_contradiction_linkage stdout ----

thread 'epistemics::proposition::tests::expected_location_parser_round_trips_into_typed_contradiction_linkage' (6683) panicked at crates/tracewake-core/src/epistemics/proposition.rs:544:79:
called `Result::unwrap()` on an `Err` value: InvalidShape

---- epistemics::proposition::tests::display_formats_all_variants_as_structured_explanations stdout ----

thread 'epistemics::proposition::tests::display_formats_all_variants_as_structured_explanations' (6682) panicked at crates/tracewake-core/src/epistemics/proposition.rs:836:22:
called `Result::unwrap()` on an `Err` value: InvalidShape

---- epistemics::proposition::tests::proposition_round_trips_through_canonical_bytes stdout ----

thread 'epistemics::proposition::tests::proposition_round_trips_through_canonical_bytes' (6686) panicked at crates/tracewake-core/src/epistemics/proposition.rs:600:56:
called `Result::unwrap()` on an `Err` value: InvalidShape

failures:
    epistemics::proposition::tests::display_formats_all_variants_as_structured_explanations
    epistemics::proposition::tests::expected_location_parser_round_trips_into_typed_contradiction_linkage
    epistemics::proposition::tests::malformed_canonical_propositions_fail_closed_without_defaults
    epistemics::proposition::tests::proposition_round_trips_through_canonical_bytes
    events::apply::tests::epistemic_application_updates_projection
    replay::rebuild::tests::epistemic_rebuild_is_deterministic_across_repeated_runs

test result: FAILED. 449 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
