*** crates/tracewake-core/src/epistemics/proposition.rs:316:13: delete match arm ["sound_heard_near_place", place_id] in <impl FromStr for Proposition>::from_str

*** mutation diff:
--- crates/tracewake-core/src/epistemics/proposition.rs
+++ delete match arm ["sound_heard_near_place", place_id] in <impl FromStr for Proposition>::from_str
@@ -308,19 +308,17 @@
                 }
             }
             ["item_missing_from_expected_location", item_id, expected_location] => {
                 Proposition::ItemMissingFromExpectedLocation {
                     item_id: ItemId::new(*item_id)?,
                     expected_location: deserialize_location(expected_location)?,
                 }
             }
-            ["sound_heard_near_place", place_id] => Proposition::SoundHeardNearPlace {
-                place_id: PlaceId::new(*place_id)?,
-            },
+             /* ~ changed by cargo-mutants ~ */
             ["possible_movement_near_place", place_id] => Proposition::PossibleMovementNearPlace {
                 place_id: PlaceId::new(*place_id)?,
             },
             ["actor_was_near_place", actor_id, place_id] => Proposition::ActorWasNearPlace {
                 actor_id: ActorId::new(*actor_id)?,
                 place_id: PlaceId::new(*place_id)?,
             },
             _ => return Err(PropositionParseError::InvalidShape),

---- phase2a_fixtures_are_registered_and_script_free stdout ----

thread 'phase2a_fixtures_are_registered_and_script_free' (10880) panicked at crates/tracewake-content/tests/fixtures_load.rs:1546:56:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Serialization, path: "fixture", code: "serialization_error", message: "fixture serialization failed: Proposition(InvalidShape)" }] } }

---- all_fixtures_load_deterministically_and_validate stdout ----

thread 'all_fixtures_load_deterministically_and_validate' (10856) panicked at crates/tracewake-content/tests/fixtures_load.rs:591:54:
called `Result::unwrap()` on an `Err` value: ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: Serialization, path: "fixture", code: "serialization_error", message: "fixture serialization failed: Proposition(InvalidShape)" }] } }

failures:
    all_fixtures_load_deterministically_and_validate
    phase2a_fixtures_are_registered_and_script_free

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
