*** crates/tracewake-core/src/epistemics/proposition.rs:319:13: delete match arm ["possible_movement_near_place", place_id] in <impl FromStr for Proposition>::from_str

*** mutation diff:
--- crates/tracewake-core/src/epistemics/proposition.rs
+++ delete match arm ["possible_movement_near_place", place_id] in <impl FromStr for Proposition>::from_str
@@ -311,19 +311,17 @@
                 Proposition::ItemMissingFromExpectedLocation {
                     item_id: ItemId::new(*item_id)?,
                     expected_location: deserialize_location(expected_location)?,
                 }
             }
             ["sound_heard_near_place", place_id] => Proposition::SoundHeardNearPlace {
                 place_id: PlaceId::new(*place_id)?,
             },
-            ["possible_movement_near_place", place_id] => Proposition::PossibleMovementNearPlace {
-                place_id: PlaceId::new(*place_id)?,
-            },
+             /* ~ changed by cargo-mutants ~ */
             ["actor_was_near_place", actor_id, place_id] => Proposition::ActorWasNearPlace {
                 actor_id: ActorId::new(*actor_id)?,
                 place_id: PlaceId::new(*place_id)?,
             },
             _ => return Err(PropositionParseError::InvalidShape),
         };
 
         Ok(proposition)

---- epistemics::proposition::tests::display_formats_all_variants_as_structured_explanations stdout ----

thread 'epistemics::proposition::tests::display_formats_all_variants_as_structured_explanations' (15272) panicked at crates/tracewake-core/src/epistemics/proposition.rs:839:22:
called `Result::unwrap()` on an `Err` value: InvalidShape

---- epistemics::proposition::tests::canonical_parser_round_trips_every_variant_through_projection_consumers stdout ----

thread 'epistemics::proposition::tests::canonical_parser_round_trips_every_variant_through_projection_consumers' (15269) panicked at crates/tracewake-core/src/epistemics/proposition.rs:547:79:
called `Result::unwrap()` on an `Err` value: InvalidShape

failures:
    epistemics::proposition::tests::canonical_parser_round_trips_every_variant_through_projection_consumers
    epistemics::proposition::tests::display_formats_all_variants_as_structured_explanations

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
