*** crates/tracewake-core/src/epistemics/proposition.rs:322:13: delete match arm ["actor_was_near_place", actor_id, place_id] in <impl FromStr for Proposition>::from_str

*** mutation diff:
--- crates/tracewake-core/src/epistemics/proposition.rs
+++ delete match arm ["actor_was_near_place", actor_id, place_id] in <impl FromStr for Proposition>::from_str
@@ -314,20 +314,17 @@
                 }
             }
             ["sound_heard_near_place", place_id] => Proposition::SoundHeardNearPlace {
                 place_id: PlaceId::new(*place_id)?,
             },
             ["possible_movement_near_place", place_id] => Proposition::PossibleMovementNearPlace {
                 place_id: PlaceId::new(*place_id)?,
             },
-            ["actor_was_near_place", actor_id, place_id] => Proposition::ActorWasNearPlace {
-                actor_id: ActorId::new(*actor_id)?,
-                place_id: PlaceId::new(*place_id)?,
-            },
+             /* ~ changed by cargo-mutants ~ */
             _ => return Err(PropositionParseError::InvalidShape),
         };
 
         Ok(proposition)
     }
 }
 
 fn serialize_location(location: &Location) -> String {

---- seed_event_log_order_and_projection_provenance_are_causal_and_stable stdout ----

thread 'seed_event_log_order_and_projection_provenance_are_causal_and_stable' (19473) panicked at crates/tracewake-content/tests/fixtures_load.rs:920:74:

failures:
    seed_event_log_order_and_projection_provenance_are_causal_and_stable

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
