*** crates/tracewake-core/src/epistemics/proposition.rs:334:5: replace serialize_location -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-core/src/epistemics/proposition.rs
+++ replace serialize_location -> String with "xyzzy".into()
@@ -326,23 +326,17 @@
             _ => return Err(PropositionParseError::InvalidShape),
         };
 
         Ok(proposition)
     }
 }
 
 fn serialize_location(location: &Location) -> String {
-    match location {
-        Location::AtPlace(place_id) => format!("at_place:{}", place_id.serialize_canonical()),
-        Location::InContainer(container_id) => {
-            format!("in_container:{}", container_id.serialize_canonical())
-        }
-        Location::CarriedBy(actor_id) => format!("carried_by:{}", actor_id.serialize_canonical()),
-    }
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 fn deserialize_location(value: &str) -> Result<Location, PropositionParseError> {
     let Some((kind, id)) = value.split_once(':') else {
         return Err(PropositionParseError::InvalidLocationShape);
     };
 
     match kind {

---- epistemics::proposition::tests::display_formats_all_variants_as_structured_explanations stdout ----

thread 'epistemics::proposition::tests::display_formats_all_variants_as_structured_explanations' (28421) panicked at crates/tracewake-core/src/epistemics/proposition.rs:835:22:
called `Result::unwrap()` on an `Err` value: InvalidLocationShape

---- epistemics::proposition::tests::expected_location_parser_round_trips_into_typed_contradiction_linkage stdout ----

thread 'epistemics::proposition::tests::expected_location_parser_round_trips_into_typed_contradiction_linkage' (28422) panicked at crates/tracewake-core/src/epistemics/proposition.rs:543:79:
called `Result::unwrap()` on an `Err` value: InvalidLocationShape

---- epistemics::proposition::tests::proposition_round_trips_through_canonical_bytes stdout ----

thread 'epistemics::proposition::tests::proposition_round_trips_through_canonical_bytes' (28425) panicked at crates/tracewake-core/src/epistemics/proposition.rs:594:9:
assertion `left == right` failed
  left: "item_missing_from_expected_location|coin_stack_01|xyzzy"
 right: "item_missing_from_expected_location|coin_stack_01|in_container:strongbox_tomas"

failures:
    epistemics::proposition::tests::display_formats_all_variants_as_structured_explanations
    epistemics::proposition::tests::expected_location_parser_round_trips_into_typed_contradiction_linkage
    epistemics::proposition::tests::proposition_round_trips_through_canonical_bytes
    events::apply::tests::epistemic_application_updates_projection
    replay::rebuild::tests::epistemic_rebuild_is_deterministic_across_repeated_runs

test result: FAILED. 450 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
