*** crates/tracewake-core/src/epistemics/proposition.rs:349:9: delete match arm "at_place" in deserialize_location

*** mutation diff:
--- crates/tracewake-core/src/epistemics/proposition.rs
+++ delete match arm "at_place" in deserialize_location
@@ -341,17 +341,17 @@
 }
 
 fn deserialize_location(value: &str) -> Result<Location, PropositionParseError> {
     let Some((kind, id)) = value.split_once(':') else {
         return Err(PropositionParseError::InvalidLocationShape);
     };
 
     match kind {
-        "at_place" => Ok(Location::AtPlace(PlaceId::new(id)?)),
+         /* ~ changed by cargo-mutants ~ */
         "in_container" => Ok(Location::InContainer(ContainerId::new(id)?)),
         "carried_by" => Ok(Location::CarriedBy(ActorId::new(id)?)),
         _ => Err(PropositionParseError::InvalidLocationShape),
     }
 }
 
 fn render_location(location: &Location) -> String {
     match location {

---- epistemics::proposition::tests::expected_location_parser_round_trips_into_typed_contradiction_linkage stdout ----

thread 'epistemics::proposition::tests::expected_location_parser_round_trips_into_typed_contradiction_linkage' (525) panicked at crates/tracewake-core/src/epistemics/proposition.rs:549:79:
called `Result::unwrap()` on an `Err` value: InvalidLocationShape

---- epistemics::proposition::tests::display_formats_all_variants_as_structured_explanations stdout ----

thread 'epistemics::proposition::tests::display_formats_all_variants_as_structured_explanations' (524) panicked at crates/tracewake-core/src/epistemics/proposition.rs:841:22:
called `Result::unwrap()` on an `Err` value: InvalidLocationShape

failures:
    epistemics::proposition::tests::display_formats_all_variants_as_structured_explanations
    epistemics::proposition::tests::expected_location_parser_round_trips_into_typed_contradiction_linkage

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
