*** crates/tracewake-core/src/epistemics/proposition.rs:350:9: delete match arm "in_container" in deserialize_location

*** mutation diff:
--- crates/tracewake-core/src/epistemics/proposition.rs
+++ delete match arm "in_container" in deserialize_location
@@ -342,17 +342,17 @@
 
 fn deserialize_location(value: &str) -> Result<Location, PropositionParseError> {
     let Some((kind, id)) = value.split_once(':') else {
         return Err(PropositionParseError::InvalidLocationShape);
     };
 
     match kind {
         "at_place" => Ok(Location::AtPlace(PlaceId::new(id)?)),
-        "in_container" => Ok(Location::InContainer(ContainerId::new(id)?)),
+         /* ~ changed by cargo-mutants ~ */
         "carried_by" => Ok(Location::CarriedBy(ActorId::new(id)?)),
         _ => Err(PropositionParseError::InvalidLocationShape),
     }
 }
 
 fn render_location(location: &Location) -> String {
     match location {
         Location::AtPlace(place_id) => format!("place {place_id}"),

---- epistemics::proposition::tests::display_formats_all_variants_as_structured_explanations stdout ----

thread 'epistemics::proposition::tests::display_formats_all_variants_as_structured_explanations' (5083) panicked at crates/tracewake-core/src/epistemics/proposition.rs:841:22:
called `Result::unwrap()` on an `Err` value: InvalidLocationShape

---- epistemics::proposition::tests::expected_location_parser_round_trips_into_typed_contradiction_linkage stdout ----

thread 'epistemics::proposition::tests::expected_location_parser_round_trips_into_typed_contradiction_linkage' (5084) panicked at crates/tracewake-core/src/epistemics/proposition.rs:549:79:
called `Result::unwrap()` on an `Err` value: InvalidLocationShape

---- epistemics::proposition::tests::proposition_round_trips_through_canonical_bytes stdout ----

thread 'epistemics::proposition::tests::proposition_round_trips_through_canonical_bytes' (5087) panicked at crates/tracewake-core/src/epistemics/proposition.rs:605:56:
called `Result::unwrap()` on an `Err` value: InvalidLocationShape

failures:
    epistemics::proposition::tests::display_formats_all_variants_as_structured_explanations
    epistemics::proposition::tests::expected_location_parser_round_trips_into_typed_contradiction_linkage
    epistemics::proposition::tests::proposition_round_trips_through_canonical_bytes
    events::apply::tests::epistemic_application_updates_projection
    replay::rebuild::tests::epistemic_rebuild_is_deterministic_across_repeated_runs

test result: FAILED. 450 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
