*** crates/tracewake-core/src/epistemics/proposition.rs:351:9: delete match arm "carried_by" in deserialize_location

*** mutation diff:
--- crates/tracewake-core/src/epistemics/proposition.rs
+++ delete match arm "carried_by" in deserialize_location
@@ -343,17 +343,17 @@
 fn deserialize_location(value: &str) -> Result<Location, PropositionParseError> {
     let Some((kind, id)) = value.split_once(':') else {
         return Err(PropositionParseError::InvalidLocationShape);
     };
 
     match kind {
         "at_place" => Ok(Location::AtPlace(PlaceId::new(id)?)),
         "in_container" => Ok(Location::InContainer(ContainerId::new(id)?)),
-        "carried_by" => Ok(Location::CarriedBy(ActorId::new(id)?)),
+         /* ~ changed by cargo-mutants ~ */
         _ => Err(PropositionParseError::InvalidLocationShape),
     }
 }
 
 fn render_location(location: &Location) -> String {
     match location {
         Location::AtPlace(place_id) => format!("place {place_id}"),
         Location::InContainer(container_id) => format!("container {container_id}"),

---- epistemics::proposition::tests::display_formats_all_variants_as_structured_explanations stdout ----

thread 'epistemics::proposition::tests::display_formats_all_variants_as_structured_explanations' (9643) panicked at crates/tracewake-core/src/epistemics/proposition.rs:841:22:
called `Result::unwrap()` on an `Err` value: InvalidLocationShape

---- epistemics::proposition::tests::expected_location_parser_round_trips_into_typed_contradiction_linkage stdout ----

thread 'epistemics::proposition::tests::expected_location_parser_round_trips_into_typed_contradiction_linkage' (9644) panicked at crates/tracewake-core/src/epistemics/proposition.rs:549:79:
called `Result::unwrap()` on an `Err` value: InvalidLocationShape

failures:
    epistemics::proposition::tests::display_formats_all_variants_as_structured_explanations
    epistemics::proposition::tests::expected_location_parser_round_trips_into_typed_contradiction_linkage

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
