*** crates/tracewake-core/src/epistemics/proposition.rs:357:5: replace render_location -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-core/src/epistemics/proposition.rs
+++ replace render_location -> String with "xyzzy".into()
@@ -349,21 +349,17 @@
         "at_place" => Ok(Location::AtPlace(PlaceId::new(id)?)),
         "in_container" => Ok(Location::InContainer(ContainerId::new(id)?)),
         "carried_by" => Ok(Location::CarriedBy(ActorId::new(id)?)),
         _ => Err(PropositionParseError::InvalidLocationShape),
     }
 }
 
 fn render_location(location: &Location) -> String {
-    match location {
-        Location::AtPlace(place_id) => format!("place {place_id}"),
-        Location::InContainer(container_id) => format!("container {container_id}"),
-        Location::CarriedBy(actor_id) => format!("actor {actor_id}"),
-    }
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 fn validate_location(
     location: &Location,
     known_actors: &BTreeSet<ActorId>,
     known_places: &BTreeSet<PlaceId>,
     known_containers: &BTreeSet<ContainerId>,
 ) -> Result<(), PropositionReferenceError> {

---- epistemics::proposition::tests::at_place_missing_relation_creates_only_exact_typed_contradiction stdout ----

thread 'epistemics::proposition::tests::at_place_missing_relation_creates_only_exact_typed_contradiction' (18757) panicked at crates/tracewake-core/src/epistemics/proposition.rs:507:9:
assertion `left == right` failed
  left: "coin_stack_01 is at back_room -> coin_stack_01 is missing from expected location xyzzy"
 right: "coin_stack_01 is at back_room -> coin_stack_01 is missing from expected location place back_room"

---- epistemics::proposition::tests::carried_by_missing_relation_creates_only_exact_holder_contradiction stdout ----

thread 'epistemics::proposition::tests::carried_by_missing_relation_creates_only_exact_holder_contradiction' (18759) panicked at crates/tracewake-core/src/epistemics/proposition.rs:507:9:
assertion `left == right` failed
  left: "coin_stack_01 is carried by actor_tomas -> coin_stack_01 is missing from expected location xyzzy"
 right: "coin_stack_01 is carried by actor_tomas -> coin_stack_01 is missing from expected location actor actor_tomas"

---- epistemics::proposition::tests::display_formats_all_variants_as_structured_explanations stdout ----

thread 'epistemics::proposition::tests::display_formats_all_variants_as_structured_explanations' (18761) panicked at crates/tracewake-core/src/epistemics/proposition.rs:833:13:
assertion `left == right` failed
  left: "coin_stack_01 is missing from expected location xyzzy"
 right: "coin_stack_01 is missing from expected location place back_room"

failures:
    epistemics::proposition::tests::at_place_missing_relation_creates_only_exact_typed_contradiction
    epistemics::proposition::tests::carried_by_missing_relation_creates_only_exact_holder_contradiction
    epistemics::proposition::tests::display_formats_all_variants_as_structured_explanations
    epistemics::proposition::tests::expected_location_parser_round_trips_into_typed_contradiction_linkage

test result: FAILED. 451 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
