*** crates/tracewake-core/src/epistemics/proposition.rs:370:5: replace validate_location -> Result<(), PropositionReferenceError> with Ok(())

*** mutation diff:
--- crates/tracewake-core/src/epistemics/proposition.rs
+++ replace validate_location -> Result<(), PropositionReferenceError> with Ok(())
@@ -362,21 +362,17 @@
 }
 
 fn validate_location(
     location: &Location,
     known_actors: &BTreeSet<ActorId>,
     known_places: &BTreeSet<PlaceId>,
     known_containers: &BTreeSet<ContainerId>,
 ) -> Result<(), PropositionReferenceError> {
-    match location {
-        Location::AtPlace(place_id) => require_place(place_id, known_places),
-        Location::InContainer(container_id) => require_container(container_id, known_containers),
-        Location::CarriedBy(actor_id) => require_actor(actor_id, known_actors),
-    }
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn require_actor(
     actor_id: &ActorId,
     known_actors: &BTreeSet<ActorId>,
 ) -> Result<(), PropositionReferenceError> {
     if known_actors.contains(actor_id) {
         Ok(())

---- epistemics::proposition::tests::reference_validation_matrix_rejects_unknown_secondary_references stdout ----

thread 'epistemics::proposition::tests::reference_validation_matrix_rejects_unknown_secondary_references' (23325) panicked at crates/tracewake-core/src/epistemics/proposition.rs:1083:13:
assertion `left == right` failed
  left: Ok(())
 right: Err(UnknownPlace(PlaceId(StableId("hidden_room"))))

failures:
    epistemics::proposition::tests::reference_validation_matrix_rejects_unknown_secondary_references

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
