*** crates/tracewake-core/src/epistemics/proposition.rs:381:5: replace require_actor -> Result<(), PropositionReferenceError> with Ok(())

*** mutation diff:
--- crates/tracewake-core/src/epistemics/proposition.rs
+++ replace require_actor -> Result<(), PropositionReferenceError> with Ok(())
@@ -373,21 +373,17 @@
         Location::CarriedBy(actor_id) => require_actor(actor_id, known_actors),
     }
 }
 
 fn require_actor(
     actor_id: &ActorId,
     known_actors: &BTreeSet<ActorId>,
 ) -> Result<(), PropositionReferenceError> {
-    if known_actors.contains(actor_id) {
-        Ok(())
-    } else {
-        Err(PropositionReferenceError::UnknownActor(actor_id.clone()))
-    }
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn require_place(
     place_id: &PlaceId,
     known_places: &BTreeSet<PlaceId>,
 ) -> Result<(), PropositionReferenceError> {
     if known_places.contains(place_id) {
         Ok(())

---- epistemics::proposition::tests::reference_validation_rejects_unknown_ids stdout ----

thread 'epistemics::proposition::tests::reference_validation_rejects_unknown_ids' (27885) panicked at crates/tracewake-core/src/epistemics/proposition.rs:1007:9:
assertion `left == right` failed
  left: Ok(())
 right: Err(UnknownActor(ActorId(StableId("actor_mara"))))

failures:
    epistemics::proposition::tests::reference_validation_rejects_unknown_ids

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
