*** crates/tracewake-core/src/epistemics/proposition.rs:392:5: replace require_place -> Result<(), PropositionReferenceError> with Ok(())

*** mutation diff:
--- crates/tracewake-core/src/epistemics/proposition.rs
+++ replace require_place -> Result<(), PropositionReferenceError> with Ok(())
@@ -384,21 +384,17 @@
         Err(PropositionReferenceError::UnknownActor(actor_id.clone()))
     }
 }
 
 fn require_place(
     place_id: &PlaceId,
     known_places: &BTreeSet<PlaceId>,
 ) -> Result<(), PropositionReferenceError> {
-    if known_places.contains(place_id) {
-        Ok(())
-    } else {
-        Err(PropositionReferenceError::UnknownPlace(place_id.clone()))
-    }
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn require_container(
     container_id: &ContainerId,
     known_containers: &BTreeSet<ContainerId>,
 ) -> Result<(), PropositionReferenceError> {
     if known_containers.contains(container_id) {
         Ok(())

---- epistemics::proposition::tests::reference_validation_matrix_rejects_unknown_secondary_references stdout ----

thread 'epistemics::proposition::tests::reference_validation_matrix_rejects_unknown_secondary_references' (32443) panicked at crates/tracewake-core/src/epistemics/proposition.rs:1083:13:
assertion `left == right` failed
  left: Ok(())
 right: Err(UnknownPlace(PlaceId(StableId("hidden_room"))))

failures:
    epistemics::proposition::tests::reference_validation_matrix_rejects_unknown_secondary_references

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
