*** crates/tracewake-core/src/epistemics/proposition.rs:403:5: replace require_container -> Result<(), PropositionReferenceError> with Ok(())

*** mutation diff:
--- crates/tracewake-core/src/epistemics/proposition.rs
+++ replace require_container -> Result<(), PropositionReferenceError> with Ok(())
@@ -395,23 +395,17 @@
         Err(PropositionReferenceError::UnknownPlace(place_id.clone()))
     }
 }
 
 fn require_container(
     container_id: &ContainerId,
     known_containers: &BTreeSet<ContainerId>,
 ) -> Result<(), PropositionReferenceError> {
-    if known_containers.contains(container_id) {
-        Ok(())
-    } else {
-        Err(PropositionReferenceError::UnknownContainer(
-            container_id.clone(),
-        ))
-    }
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn require_item(
     item_id: &ItemId,
     known_items: &BTreeSet<ItemId>,
 ) -> Result<(), PropositionReferenceError> {
     if known_items.contains(item_id) {
         Ok(())

---- epistemics::proposition::tests::reference_validation_matrix_rejects_unknown_secondary_references stdout ----

thread 'epistemics::proposition::tests::reference_validation_matrix_rejects_unknown_secondary_references' (4534) panicked at crates/tracewake-core/src/epistemics/proposition.rs:1081:13:
assertion `left == right` failed
  left: Ok(())
 right: Err(UnknownContainer(ContainerId(StableId("hidden_strongbox"))))

failures:
    epistemics::proposition::tests::reference_validation_matrix_rejects_unknown_secondary_references

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
