*** crates/tracewake-core/src/epistemics/proposition.rs:416:5: replace require_item -> Result<(), PropositionReferenceError> with Ok(())

*** mutation diff:
--- crates/tracewake-core/src/epistemics/proposition.rs
+++ replace require_item -> Result<(), PropositionReferenceError> with Ok(())
@@ -408,21 +408,17 @@
         ))
     }
 }
 
 fn require_item(
     item_id: &ItemId,
     known_items: &BTreeSet<ItemId>,
 ) -> Result<(), PropositionReferenceError> {
-    if known_items.contains(item_id) {
-        Ok(())
-    } else {
-        Err(PropositionReferenceError::UnknownItem(item_id.clone()))
-    }
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::epistemics::{
         Belief, Channel, Confidence, Contradiction, ContradictionKind, EpistemicProjection,
         HolderKind, SourceRef, Stance,

---- forbidden_content_epistemic_seed_reference_duplicate_and_version_failures_are_blocking stdout ----

thread 'forbidden_content_epistemic_seed_reference_duplicate_and_version_failures_are_blocking' (8743) panicked at crates/tracewake-content/tests/forbidden_content.rs:537:5:
assertion failed: reference.errors.iter().any(|error| error.code == "bad_reference")

failures:
    forbidden_content_epistemic_seed_reference_duplicate_and_version_failures_are_blocking

test result: FAILED. 23 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
