*** crates/tracewake-core/src/epistemics/proposition.rs:51:9: replace <impl fmt::Display for PropositionReferenceError>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/tracewake-core/src/epistemics/proposition.rs
+++ replace <impl fmt::Display for PropositionReferenceError>::fmt -> fmt::Result with Ok(Default::default())
@@ -43,33 +43,17 @@
     UnknownActor(ActorId),
     UnknownContainer(ContainerId),
     UnknownItem(ItemId),
     UnknownPlace(PlaceId),
 }
 
 impl fmt::Display for PropositionReferenceError {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        match self {
-            PropositionReferenceError::UnknownActor(actor_id) => {
-                write!(f, "unknown actor referenced by proposition: {actor_id}")
-            }
-            PropositionReferenceError::UnknownContainer(container_id) => {
-                write!(
-                    f,
-                    "unknown container referenced by proposition: {container_id}"
-                )
-            }
-            PropositionReferenceError::UnknownItem(item_id) => {
-                write!(f, "unknown item referenced by proposition: {item_id}")
-            }
-            PropositionReferenceError::UnknownPlace(place_id) => {
-                write!(f, "unknown place referenced by proposition: {place_id}")
-            }
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl std::error::Error for PropositionReferenceError {}
 
 #[derive(Clone, Debug, PartialEq, Eq)]
 pub enum PropositionParseError {
     InvalidUtf8,

---- epistemics::proposition::tests::parse_and_reference_diagnostics_are_actionable stdout ----

thread 'epistemics::proposition::tests::parse_and_reference_diagnostics_are_actionable' (26173) panicked at crates/tracewake-core/src/epistemics/proposition.rs:1087:9:
assertion `left == right` failed
  left: ""
 right: "unknown container referenced by proposition: hidden_strongbox"

failures:
    epistemics::proposition::tests::parse_and_reference_diagnostics_are_actionable

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
