*** crates/tracewake-core/src/epistemics/proposition.rs:83:9: replace <impl fmt::Display for PropositionParseError>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/tracewake-core/src/epistemics/proposition.rs
+++ replace <impl fmt::Display for PropositionParseError>::fmt -> fmt::Result with Ok(Default::default())
@@ -75,26 +75,17 @@
     InvalidUtf8,
     InvalidShape,
     InvalidLocationShape,
     InvalidId(IdError),
 }
 
 impl fmt::Display for PropositionParseError {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        match self {
-            PropositionParseError::InvalidUtf8 => {
-                write!(f, "canonical proposition bytes must be UTF-8")
-            }
-            PropositionParseError::InvalidShape => write!(f, "invalid canonical proposition shape"),
-            PropositionParseError::InvalidLocationShape => {
-                write!(f, "invalid canonical proposition location shape")
-            }
-            PropositionParseError::InvalidId(err) => write!(f, "{err}"),
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl std::error::Error for PropositionParseError {}
 
 impl From<IdError> for PropositionParseError {
     fn from(value: IdError) -> Self {
         Self::InvalidId(value)

---- epistemics::proposition::tests::parse_and_reference_diagnostics_are_actionable stdout ----

thread 'epistemics::proposition::tests::parse_and_reference_diagnostics_are_actionable' (30732) panicked at crates/tracewake-core/src/epistemics/proposition.rs:1100:9:
assertion `left == right` failed
  left: ""
 right: "invalid canonical proposition location shape"

failures:
    epistemics::proposition::tests::parse_and_reference_diagnostics_are_actionable

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
