*** crates/tracewake-core/src/events/apply.rs:1039:9: delete match arm "fatigue" in parse_need_kind

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete match arm "fatigue" in parse_need_kind
@@ -1031,17 +1031,17 @@
         value: value.to_string(),
     })
 }
 
 fn parse_need_kind(payload: &BTreeMap<&str, &str>) -> Result<NeedKind, ApplyError> {
     let value = required(payload, "need_kind")?;
     match value {
         "hunger" => Ok(NeedKind::Hunger),
-        "fatigue" => Ok(NeedKind::Fatigue),
+         /* ~ changed by cargo-mutants ~ */
         "safety" => Ok(NeedKind::Safety),
         _ => Err(ApplyError::BadPayload {
             key: "need_kind",
             value: value.to_string(),
         }),
     }
 }

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (12397) panicked at crates/tracewake-content/tests/fixtures_load.rs:1217:5:
assertion failed: report.ordinary_pipeline_events > 0

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
