*** crates/tracewake-core/src/events/apply.rs:1040:9: delete match arm "safety" in parse_need_kind

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete match arm "safety" in parse_need_kind
@@ -1032,17 +1032,17 @@
     })
 }
 
 fn parse_need_kind(payload: &BTreeMap<&str, &str>) -> Result<NeedKind, ApplyError> {
     let value = required(payload, "need_kind")?;
     match value {
         "hunger" => Ok(NeedKind::Hunger),
         "fatigue" => Ok(NeedKind::Fatigue),
-        "safety" => Ok(NeedKind::Safety),
+         /* ~ changed by cargo-mutants ~ */
         _ => Err(ApplyError::BadPayload {
             key: "need_kind",
             value: value.to_string(),
         }),
     }
 }
 
 fn parse_i32(payload: &BTreeMap<&str, &str>, key: &'static str) -> Result<i32, ApplyError> {

---- agent_apply_matrix_observes_parser_arms_transitions_and_causality stdout ----

thread 'agent_apply_matrix_observes_parser_arms_transitions_and_causality' (17072) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:2352:5:
assertion `left == right` failed
  left: Err(BadPayload { key: "need_kind", value: "safety" })
 right: Ok(Applied)

failures:
    agent_apply_matrix_observes_parser_arms_transitions_and_causality

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
