*** crates/tracewake-core/src/events/apply.rs:1049:5: replace parse_i32 -> Result<i32, ApplyError> with Ok(-1)

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace parse_i32 -> Result<i32, ApplyError> with Ok(-1)
@@ -1041,21 +1041,17 @@
         _ => Err(ApplyError::BadPayload {
             key: "need_kind",
             value: value.to_string(),
         }),
     }
 }
 
 fn parse_i32(payload: &BTreeMap<&str, &str>, key: &'static str) -> Result<i32, ApplyError> {
-    let value = required(payload, key)?;
-    value.parse::<i32>().map_err(|_| ApplyError::BadPayload {
-        key,
-        value: value.to_string(),
-    })
+    Ok(-1) /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_u32(payload: &BTreeMap<&str, &str>, key: &'static str) -> Result<u32, ApplyError> {
     let value = required(payload, key)?;
     value.parse::<u32>().map_err(|_| ApplyError::BadPayload {
         key,
         value: value.to_string(),
     })

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (29370) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (29371) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2714:5:
assertion failed: has_event(&log, EventKind::ActorMoved)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection

test result: FAILED. 40 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.47s

*** result: Failure(101)
