*** crates/tracewake-core/src/events/apply.rs:1057:5: replace parse_u32 -> Result<u32, ApplyError> with Ok(1)

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace parse_u32 -> Result<u32, ApplyError> with Ok(1)
@@ -1049,21 +1049,17 @@
     let value = required(payload, key)?;
     value.parse::<i32>().map_err(|_| ApplyError::BadPayload {
         key,
         value: value.to_string(),
     })
 }
 
 fn parse_u32(payload: &BTreeMap<&str, &str>, key: &'static str) -> Result<u32, ApplyError> {
-    let value = required(payload, key)?;
-    value.parse::<u32>().map_err(|_| ApplyError::BadPayload {
-        key,
-        value: value.to_string(),
-    })
+    Ok(1) /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_action_id_for_agent(
     payload: &BTreeMap<&str, &str>,
     key: &'static str,
 ) -> Result<ActionId, ApplyError> {
     let value = required(payload, key)?;
     ActionId::new(value).map_err(|_| ApplyError::BadPayload {

---- sleep_eat_work_fixture_logs_need_effects_and_replays stdout ----

thread 'sleep_eat_work_fixture_logs_need_effects_and_replays' (5126) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1270:5:
assertion failed: has_event(&log, EventKind::FoodConsumed)

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (5100) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2172:5:
assertion `left == right` failed
  left: {ActorId(StableId("actor_anna")), ActorId(StableId("actor_elena")), ActorId(StableId("actor_mara"))}
 right: {ActorId(StableId("actor_anna")), ActorId(StableId("actor_elena")), ActorId(StableId("actor_mara")), ActorId(StableId("actor_tomas"))}

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (5101) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2714:5:
assertion failed: has_event(&log, EventKind::ActorMoved)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    sleep_eat_work_fixture_logs_need_effects_and_replays

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.47s

*** result: Failure(101)
