*** crates/tracewake-core/src/events/apply.rs:1078:9: delete match arm "fixture_initial" in parse_need_change_cause

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete match arm "fixture_initial" in parse_need_change_cause
@@ -1070,17 +1070,17 @@
         key,
         value: value.to_string(),
     })
 }
 
 fn parse_need_change_cause(payload: &BTreeMap<&str, &str>) -> Result<NeedChangeCause, ApplyError> {
     let cause_kind = required(payload, "cause_kind")?;
     match cause_kind {
-        "fixture_initial" => Ok(NeedChangeCause::FixtureInitial),
+         /* ~ changed by cargo-mutants ~ */
         "tick_delta" => Ok(NeedChangeCause::TickDelta),
         "action_effect" => Ok(NeedChangeCause::ActionEffect(parse_action_id_for_agent(
             payload,
             "cause_action_id",
         )?)),
         "routine_effect" => Ok(NeedChangeCause::RoutineEffect(parse_routine_execution_id(
             payload,
         )?)),

---- replay::rebuild::tests::agent_state_rebuild_is_deterministic_and_catches_need_delta_divergence stdout ----

thread 'replay::rebuild::tests::agent_state_rebuild_is_deterministic_and_catches_need_delta_divergence' (9634) panicked at crates/tracewake-core/src/replay/rebuild.rs:947:9:
assertion `left != right` failed
  left: AgentStateChecksum("twa1-3fe0d13a961de227")
 right: AgentStateChecksum("twa1-3fe0d13a961de227")

failures:
    replay::rebuild::tests::agent_state_rebuild_is_deterministic_and_catches_need_delta_divergence

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
