*** crates/tracewake-core/src/events/apply.rs:1079:9: delete match arm "tick_delta" in parse_need_change_cause

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete match arm "tick_delta" in parse_need_change_cause
@@ -1071,17 +1071,17 @@
         value: value.to_string(),
     })
 }
 
 fn parse_need_change_cause(payload: &BTreeMap<&str, &str>) -> Result<NeedChangeCause, ApplyError> {
     let cause_kind = required(payload, "cause_kind")?;
     match cause_kind {
         "fixture_initial" => Ok(NeedChangeCause::FixtureInitial),
-        "tick_delta" => Ok(NeedChangeCause::TickDelta),
+         /* ~ changed by cargo-mutants ~ */
         "action_effect" => Ok(NeedChangeCause::ActionEffect(parse_action_id_for_agent(
             payload,
             "cause_action_id",
         )?)),
         "routine_effect" => Ok(NeedChangeCause::RoutineEffect(parse_routine_execution_id(
             payload,
         )?)),
         _ => Err(ApplyError::BadPayload {

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (13741) panicked at crates/tracewake-content/tests/fixtures_load.rs:1217:5:
assertion failed: report.ordinary_pipeline_events > 0

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
