*** crates/tracewake-core/src/events/apply.rs:1080:9: delete match arm "action_effect" in parse_need_change_cause

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete match arm "action_effect" in parse_need_change_cause
@@ -1072,20 +1072,17 @@
     })
 }
 
 fn parse_need_change_cause(payload: &BTreeMap<&str, &str>) -> Result<NeedChangeCause, ApplyError> {
     let cause_kind = required(payload, "cause_kind")?;
     match cause_kind {
         "fixture_initial" => Ok(NeedChangeCause::FixtureInitial),
         "tick_delta" => Ok(NeedChangeCause::TickDelta),
-        "action_effect" => Ok(NeedChangeCause::ActionEffect(parse_action_id_for_agent(
-            payload,
-            "cause_action_id",
-        )?)),
+         /* ~ changed by cargo-mutants ~ */
         "routine_effect" => Ok(NeedChangeCause::RoutineEffect(parse_routine_execution_id(
             payload,
         )?)),
         _ => Err(ApplyError::BadPayload {
             key: "cause_kind",
             value: cause_kind.to_string(),
         }),
     }

---- episode_tamper_output_tag_poisons_replay stdout ----

thread 'episode_tamper_output_tag_poisons_replay' (17806) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:598:65:
called `Result::unwrap()` on an `Err` value: Agent(BadPayload { key: "cause_kind", value: "action_effect" })

---- no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash stdout ----

thread 'no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash' (17816) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2907:5:

---- ordinary_workday_fixture_moves_before_work_completion stdout ----

thread 'ordinary_workday_fixture_moves_before_work_completion' (17821) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:598:65:
called `Result::unwrap()` on an `Err` value: Agent(BadPayload { key: "cause_kind", value: "action_effect" })

failures:
    episode_tamper_output_tag_poisons_replay
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash
    ordinary_workday_fixture_moves_before_work_completion
    serialized_event_log_replays_to_identical_state
    sleep_eat_work_fixture_logs_need_effects_and_replays
    work_block_failed_then_sleep_succeeds_fixture_closes_reservation

test result: FAILED. 34 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.34s

*** result: Failure(101)
