*** crates/tracewake-core/src/events/apply.rs:1084:9: delete match arm "routine_effect" in parse_need_change_cause

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete match arm "routine_effect" in parse_need_change_cause
@@ -1076,19 +1076,17 @@
     let cause_kind = required(payload, "cause_kind")?;
     match cause_kind {
         "fixture_initial" => Ok(NeedChangeCause::FixtureInitial),
         "tick_delta" => Ok(NeedChangeCause::TickDelta),
         "action_effect" => Ok(NeedChangeCause::ActionEffect(parse_action_id_for_agent(
             payload,
             "cause_action_id",
         )?)),
-        "routine_effect" => Ok(NeedChangeCause::RoutineEffect(parse_routine_execution_id(
-            payload,
-        )?)),
+         /* ~ changed by cargo-mutants ~ */
         _ => Err(ApplyError::BadPayload {
             key: "cause_kind",
             value: cause_kind.to_string(),
         }),
     }
 }
 
 fn parse_intention_status(payload: &BTreeMap<&str, &str>) -> Result<IntentionStatus, ApplyError> {

---- agent_apply_matrix_observes_parser_arms_transitions_and_causality stdout ----

thread 'agent_apply_matrix_observes_parser_arms_transitions_and_causality' (22515) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:2352:5:
assertion `left == right` failed
  left: Err(BadPayload { key: "cause_kind", value: "routine_effect" })
 right: Ok(Applied)

failures:
    agent_apply_matrix_observes_parser_arms_transitions_and_causality

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
