*** crates/tracewake-core/src/events/apply.rs:1097:9: delete match arm "active" in parse_intention_status

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete match arm "active" in parse_intention_status
@@ -1089,17 +1089,17 @@
             value: cause_kind.to_string(),
         }),
     }
 }
 
 fn parse_intention_status(payload: &BTreeMap<&str, &str>) -> Result<IntentionStatus, ApplyError> {
     let value = required(payload, "status")?;
     match value {
-        "active" => Ok(IntentionStatus::Active),
+         /* ~ changed by cargo-mutants ~ */
         "suspended" => Ok(IntentionStatus::Suspended),
         "completed" => Ok(IntentionStatus::Completed),
         "failed" => Ok(IntentionStatus::Failed),
         "abandoned" => Ok(IntentionStatus::Abandoned),
         "interrupted" => Ok(IntentionStatus::Interrupted),
         _ => Err(ApplyError::BadPayload {
             key: "status",
             value: value.to_string(),

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (26585) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:
agent event applies to live state: BadPayload { key: "status", value: "active" }

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
