*** crates/tracewake-core/src/events/apply.rs:1098:9: delete match arm "suspended" in parse_intention_status

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete match arm "suspended" in parse_intention_status
@@ -1090,17 +1090,17 @@
         }),
     }
 }
 
 fn parse_intention_status(payload: &BTreeMap<&str, &str>) -> Result<IntentionStatus, ApplyError> {
     let value = required(payload, "status")?;
     match value {
         "active" => Ok(IntentionStatus::Active),
-        "suspended" => Ok(IntentionStatus::Suspended),
+         /* ~ changed by cargo-mutants ~ */
         "completed" => Ok(IntentionStatus::Completed),
         "failed" => Ok(IntentionStatus::Failed),
         "abandoned" => Ok(IntentionStatus::Abandoned),
         "interrupted" => Ok(IntentionStatus::Interrupted),
         _ => Err(ApplyError::BadPayload {
             key: "status",
             value: value.to_string(),
         }),

---- events::apply::tests::agent_intention_transition_event_records_status_and_reason stdout ----

thread 'events::apply::tests::agent_intention_transition_event_records_status_and_reason' (30981) panicked at crates/tracewake-core/src/events/apply.rs:2148:9:
assertion `left == right` failed
  left: Err(BadPayload { key: "status", value: "suspended" })
 right: Ok(Applied)

failures:
    events::apply::tests::agent_intention_transition_event_records_status_and_reason

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
