*** crates/tracewake-core/src/events/apply.rs:1101:9: delete match arm "abandoned" in parse_intention_status

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete match arm "abandoned" in parse_intention_status
@@ -1093,17 +1093,17 @@
 
 fn parse_intention_status(payload: &BTreeMap<&str, &str>) -> Result<IntentionStatus, ApplyError> {
     let value = required(payload, "status")?;
     match value {
         "active" => Ok(IntentionStatus::Active),
         "suspended" => Ok(IntentionStatus::Suspended),
         "completed" => Ok(IntentionStatus::Completed),
         "failed" => Ok(IntentionStatus::Failed),
-        "abandoned" => Ok(IntentionStatus::Abandoned),
+         /* ~ changed by cargo-mutants ~ */
         "interrupted" => Ok(IntentionStatus::Interrupted),
         _ => Err(ApplyError::BadPayload {
             key: "status",
             value: value.to_string(),
         }),
     }
 }

---- agent_apply_matrix_observes_parser_arms_transitions_and_causality stdout ----

thread 'agent_apply_matrix_observes_parser_arms_transitions_and_causality' (12756) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:2466:9:
assertion `left == right` failed
  left: Err(BadPayload { key: "status", value: "abandoned" })
 right: Ok(Applied)

failures:
    agent_apply_matrix_observes_parser_arms_transitions_and_causality

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
