*** crates/tracewake-core/src/events/apply.rs:1115:9: delete match arm "candidate_goal_selection" in parse_intention_source

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete match arm "candidate_goal_selection" in parse_intention_source
@@ -1107,17 +1107,17 @@
     }
 }
 
 fn parse_intention_source(payload: &BTreeMap<&str, &str>) -> Result<IntentionSource, ApplyError> {
     let value = required(payload, "source")?;
     match value {
         "need_pressure" => Ok(IntentionSource::NeedPressure),
         "routine_duty" => Ok(IntentionSource::RoutineDuty),
-        "candidate_goal_selection" => Ok(IntentionSource::CandidateGoalSelection),
+         /* ~ changed by cargo-mutants ~ */
         "safety_interruption" => Ok(IntentionSource::SafetyInterruption),
         "fixture_routine_assignment" => Ok(IntentionSource::FixtureRoutineAssignment),
         "fallback" => Ok(IntentionSource::Fallback),
         _ => Err(ApplyError::BadPayload {
             key: "source",
             value: value.to_string(),
         }),
     }

---- episode_tamper_proration_poisons_replay stdout ----

thread 'episode_tamper_proration_poisons_replay' (30967) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:
agent event applies to live state: BadPayload { key: "source", value: "candidate_goal_selection" }

---- severe_safety_with_known_exit_produces_move_and_replays stdout ----

thread 'severe_safety_with_known_exit_produces_move_and_replays' (30998) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:
agent event applies to live state: BadPayload { key: "source", value: "candidate_goal_selection" }

---- wait_then_window_passive_charges_each_tick_once stdout ----

thread 'wait_then_window_passive_charges_each_tick_once' (31003) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:
agent event applies to live state: BadPayload { key: "source", value: "candidate_goal_selection" }

failures:
    episode_tamper_proration_poisons_replay
    severe_safety_with_known_exit_produces_move_and_replays
    wait_then_window_passive_charges_each_tick_once

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.57s

*** result: Failure(101)
