*** crates/tracewake-core/src/events/apply.rs:1117:9: delete match arm "fixture_routine_assignment" in parse_intention_source

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete match arm "fixture_routine_assignment" in parse_intention_source
@@ -1109,17 +1109,17 @@
 
 fn parse_intention_source(payload: &BTreeMap<&str, &str>) -> Result<IntentionSource, ApplyError> {
     let value = required(payload, "source")?;
     match value {
         "need_pressure" => Ok(IntentionSource::NeedPressure),
         "routine_duty" => Ok(IntentionSource::RoutineDuty),
         "candidate_goal_selection" => Ok(IntentionSource::CandidateGoalSelection),
         "safety_interruption" => Ok(IntentionSource::SafetyInterruption),
-        "fixture_routine_assignment" => Ok(IntentionSource::FixtureRoutineAssignment),
+         /* ~ changed by cargo-mutants ~ */
         "fallback" => Ok(IntentionSource::Fallback),
         _ => Err(ApplyError::BadPayload {
             key: "source",
             value: value.to_string(),
         }),
     }
 }

---- agent_apply_matrix_observes_parser_arms_transitions_and_causality stdout ----

thread 'agent_apply_matrix_observes_parser_arms_transitions_and_causality' (7910) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:2393:9:
assertion `left == right` failed
  left: Err(BadPayload { key: "source", value: "fixture_routine_assignment" })
 right: Ok(Applied)

failures:
    agent_apply_matrix_observes_parser_arms_transitions_and_causality

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
