*** crates/tracewake-core/src/events/apply.rs:1149:5: replace parse_optional_routine_template_id -> Result<Option<crate::ids::RoutineTemplateId>, ApplyError> with Ok(None)

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace parse_optional_routine_template_id -> Result<Option<crate::ids::RoutineTemplateId>, ApplyError> with Ok(None)
@@ -1141,28 +1141,17 @@
         key: "trace_id",
         value: value.to_string(),
     })
 }
 
 fn parse_optional_routine_template_id(
     payload: &BTreeMap<&str, &str>,
 ) -> Result<Option<crate::ids::RoutineTemplateId>, ApplyError> {
-    let Some(value) = payload.get("selected_routine_method").copied() else {
-        return Ok(None);
-    };
-    if value.is_empty() {
-        return Ok(None);
-    }
-    crate::ids::RoutineTemplateId::new(value)
-        .map(Some)
-        .map_err(|_| ApplyError::BadPayload {
-            key: "selected_routine_method",
-            value: value.to_string(),
-        })
+    Ok(None) /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_u8(payload: &BTreeMap<&str, &str>, key: &'static str) -> Result<u8, ApplyError> {
     let value = required(payload, key)?;
     value.parse::<u8>().map_err(|_| ApplyError::BadPayload {
         key,
         value: value.to_string(),
     })

---- agent_apply_matrix_observes_parser_arms_transitions_and_causality stdout ----

thread 'agent_apply_matrix_observes_parser_arms_transitions_and_causality' (17338) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:2409:9:
assertion `left == right` failed
  left: None
 right: Some("routine_need_pressure")

failures:
    agent_apply_matrix_observes_parser_arms_transitions_and_causality

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
