*** crates/tracewake-core/src/events/apply.rs:1164:5: replace parse_u8 -> Result<u8, ApplyError> with Ok(1)

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace parse_u8 -> Result<u8, ApplyError> with Ok(1)
@@ -1156,21 +1156,17 @@
         .map(Some)
         .map_err(|_| ApplyError::BadPayload {
             key: "selected_routine_method",
             value: value.to_string(),
         })
 }
 
 fn parse_u8(payload: &BTreeMap<&str, &str>, key: &'static str) -> Result<u8, ApplyError> {
-    let value = required(payload, key)?;
-    value.parse::<u8>().map_err(|_| ApplyError::BadPayload {
-        key,
-        value: value.to_string(),
-    })
+    Ok(1) /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_u64_agent(payload: &BTreeMap<&str, &str>, key: &'static str) -> Result<u64, ApplyError> {
     let value = required(payload, key)?;
     value.parse::<u64>().map_err(|_| ApplyError::BadPayload {
         key,
         value: value.to_string(),
     })

---- agent_apply_matrix_observes_parser_arms_transitions_and_causality stdout ----

thread 'agent_apply_matrix_observes_parser_arms_transitions_and_causality' (26754) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:2399:9:
assertion `left == right` failed
  left: 1
 right: 5

failures:
    agent_apply_matrix_observes_parser_arms_transitions_and_causality

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
