*** crates/tracewake-core/src/events/apply.rs:1172:5: replace parse_u64_agent -> Result<u64, ApplyError> with Ok(0)

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace parse_u64_agent -> Result<u64, ApplyError> with Ok(0)
@@ -1164,21 +1164,17 @@
     let value = required(payload, key)?;
     value.parse::<u8>().map_err(|_| ApplyError::BadPayload {
         key,
         value: value.to_string(),
     })
 }
 
 fn parse_u64_agent(payload: &BTreeMap<&str, &str>, key: &'static str) -> Result<u64, ApplyError> {
-    let value = required(payload, key)?;
-    value.parse::<u64>().map_err(|_| ApplyError::BadPayload {
-        key,
-        value: value.to_string(),
-    })
+    Ok(0) /* ~ changed by cargo-mutants ~ */
 }
 
 fn apply_need_delta(
     state: &mut AgentState,
     event: &EventEnvelope,
     payload: &BTreeMap<&str, &str>,
 ) -> Result<(), ApplyError> {
     let actor_id = parse_actor_id(payload)?;

---- agent_apply_matrix_observes_parser_arms_transitions_and_causality stdout ----

thread 'agent_apply_matrix_observes_parser_arms_transitions_and_causality' (31456) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:2400:9:
assertion `left == right` failed
  left: SimTick(0)
 right: SimTick(20)

failures:
    agent_apply_matrix_observes_parser_arms_transitions_and_causality

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
