*** crates/tracewake-core/src/events/apply.rs:1184:5: replace apply_need_delta -> Result<(), ApplyError> with Ok(())

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace apply_need_delta -> Result<(), ApplyError> with Ok(())
@@ -1176,39 +1176,17 @@
     })
 }
 
 fn apply_need_delta(
     state: &mut AgentState,
     event: &EventEnvelope,
     payload: &BTreeMap<&str, &str>,
 ) -> Result<(), ApplyError> {
-    let actor_id = parse_actor_id(payload)?;
-    let need_kind = parse_need_kind(payload)?;
-    let delta = parse_i32(payload, "delta")?;
-    let cause = parse_need_change_cause(payload)?;
-    assert_single_tick_delta_charge(state, event, payload, &actor_id, need_kind)?;
-    if matches!(cause, NeedChangeCause::FixtureInitial) {
-        let needs = state.needs_by_actor.entry(actor_id.clone()).or_default();
-        needs
-            .entry(need_kind)
-            .or_insert_with(|| crate::agent::NeedState::initial(need_kind, 0, cause.clone()));
-    }
-
-    let need_state = state
-        .needs_by_actor
-        .get_mut(&actor_id)
-        .and_then(|needs| needs.get_mut(&need_kind))
-        .ok_or_else(|| ApplyError::MissingNeedState {
-            actor_id: actor_id.clone(),
-            need_kind,
-        })?;
-
-    need_state.apply_delta(delta, cause);
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn assert_single_tick_delta_charge(
     state: &mut AgentState,
     event: &EventEnvelope,
     payload: &BTreeMap<&str, &str>,
     actor_id: &ActorId,
     need_kind: NeedKind,

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (7791) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (7792) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2714:5:
assertion failed: has_event(&log, EventKind::ActorMoved)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection

test result: FAILED. 40 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.47s

*** result: Failure(101)
