*** crates/tracewake-core/src/events/apply.rs:1216:5: replace assert_single_tick_delta_charge -> Result<(), ApplyError> with Ok(())

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace assert_single_tick_delta_charge -> Result<(), ApplyError> with Ok(())
@@ -1208,49 +1208,17 @@
 
 fn assert_single_tick_delta_charge(
     state: &mut AgentState,
     event: &EventEnvelope,
     payload: &BTreeMap<&str, &str>,
     actor_id: &ActorId,
     need_kind: NeedKind,
 ) -> Result<(), ApplyError> {
-    let Some(elapsed_tick_value) = payload.get("elapsed_ticks") else {
-        return Ok(());
-    };
-    let elapsed_ticks = elapsed_tick_value
-        .parse::<u64>()
-        .map_err(|_| ApplyError::MalformedElapsedTicks((*elapsed_tick_value).to_string()))?;
-    if elapsed_ticks == 0 {
-        return Ok(());
-    }
-    let Some(cause_kind) = payload.get("cause_kind") else {
-        return Ok(());
-    };
-    if !matches!(*cause_kind, "tick_delta" | "action_effect") {
-        return Ok(());
-    }
-    let first_tick = event
-        .sim_tick
-        .value()
-        .saturating_sub(elapsed_ticks)
-        .saturating_add(1);
-    for tick in first_tick..=event.sim_tick.value() {
-        let inserted = state
-            .need_tick_charges
-            .insert((actor_id.clone(), need_kind, tick));
-        if !inserted {
-            return Err(ApplyError::DuplicateNeedTickCharge {
-                actor_id: actor_id.clone(),
-                need_kind,
-                tick,
-            });
-        }
-    }
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn apply_intention_started(
     state: &mut AgentState,
     payload: &BTreeMap<&str, &str>,
 ) -> Result<(), ApplyError> {
     let intention_id = parse_intention_id(payload, "intention_id")?;
     let actor_id = parse_actor_id(payload)?;

---- events::apply::tests::malformed_elapsed_ticks_rejects_without_mutating_need_state stdout ----

thread 'events::apply::tests::malformed_elapsed_ticks_rejects_without_mutating_need_state' (12221) panicked at crates/tracewake-core/src/events/apply.rs:2097:9:
assertion `left == right` failed
  left: Ok(Applied)
 right: Err(MalformedElapsedTicks("two"))

---- events::apply::tests::single_tick_delta_charge_rejects_overlapping_action_effect_duration stdout ----

thread 'events::apply::tests::single_tick_delta_charge_rejects_overlapping_action_effect_duration' (12224) panicked at crates/tracewake-core/src/events/apply.rs:2071:9:
assertion failed: matches!(apply_agent_event(&mut state, &event),
    Err(ApplyError::DuplicateNeedTickCharge
    { actor_id: duplicate_actor_id, need_kind: NeedKind::Hunger, tick: 4, })
    if duplicate_actor_id == actor_id("actor_tomas"))

failures:
    events::apply::tests::malformed_elapsed_ticks_rejects_without_mutating_need_state
    events::apply::tests::single_tick_delta_charge_rejects_overlapping_action_effect_duration

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
