*** crates/tracewake-core/src/events/apply.rs:1222:22: replace == with != in assert_single_tick_delta_charge

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace == with != in assert_single_tick_delta_charge
@@ -1214,17 +1214,17 @@
     need_kind: NeedKind,
 ) -> Result<(), ApplyError> {
     let Some(elapsed_tick_value) = payload.get("elapsed_ticks") else {
         return Ok(());
     };
     let elapsed_ticks = elapsed_tick_value
         .parse::<u64>()
         .map_err(|_| ApplyError::MalformedElapsedTicks((*elapsed_tick_value).to_string()))?;
-    if elapsed_ticks == 0 {
+    if elapsed_ticks != /* ~ changed by cargo-mutants ~ */ 0 {
         return Ok(());
     }
     let Some(cause_kind) = payload.get("cause_kind") else {
         return Ok(());
     };
     if !matches!(*cause_kind, "tick_delta" | "action_effect") {
         return Ok(());
     }

---- events::apply::tests::single_tick_delta_charge_rejects_overlapping_action_effect_duration stdout ----

thread 'events::apply::tests::single_tick_delta_charge_rejects_overlapping_action_effect_duration' (16783) panicked at crates/tracewake-core/src/events/apply.rs:2103:9:
assertion failed: matches!(apply_agent_event(&mut state, &event),
    Err(ApplyError::DuplicateNeedTickCharge
    { actor_id: duplicate_actor_id, need_kind: NeedKind::Hunger, tick: 4, })
    if duplicate_actor_id == actor_id("actor_tomas"))

failures:
    events::apply::tests::single_tick_delta_charge_rejects_overlapping_action_effect_duration

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
