*** crates/tracewake-core/src/events/apply.rs:1240:12: delete ! in assert_single_tick_delta_charge

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete ! in assert_single_tick_delta_charge
@@ -1232,17 +1232,17 @@
         .sim_tick
         .value()
         .saturating_sub(elapsed_ticks)
         .saturating_add(1);
     for tick in first_tick..=event.sim_tick.value() {
         let inserted = state
             .need_tick_charges
             .insert((actor_id.clone(), need_kind, tick));
-        if !inserted {
+        if  /* ~ changed by cargo-mutants ~ */inserted {
             return Err(ApplyError::DuplicateNeedTickCharge {
                 actor_id: actor_id.clone(),
                 need_kind,
                 tick,
             });
         }
     }
     Ok(())

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (25525) panicked at crates/tracewake-content/tests/fixtures_load.rs:1217:5:
assertion failed: report.ordinary_pipeline_events > 0

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
