*** crates/tracewake-core/src/events/apply.rs:1255:5: replace apply_intention_started -> Result<(), ApplyError> with Ok(())

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace apply_intention_started -> Result<(), ApplyError> with Ok(())
@@ -1247,44 +1247,17 @@
     }
     Ok(())
 }
 
 fn apply_intention_started(
     state: &mut AgentState,
     payload: &BTreeMap<&str, &str>,
 ) -> Result<(), ApplyError> {
-    let intention_id = parse_intention_id(payload, "intention_id")?;
-    let actor_id = parse_actor_id(payload)?;
-    let status = parse_intention_status(payload)?;
-    if status != IntentionStatus::Active {
-        return Err(ApplyError::PreconditionMismatch {
-            field: "status",
-            expected: IntentionStatus::Active.stable_id().to_string(),
-            actual: status.stable_id().to_string(),
-        });
-    }
-    let intention = Intention::adopt(
-        intention_id.clone(),
-        actor_id.clone(),
-        parse_intention_source(payload)?,
-        parse_candidate_goal_id(payload)?,
-        parse_optional_routine_template_id(payload)?,
-        payload
-            .get("current_step")
-            .map(|value| (*value).to_string()),
-        parse_u8(payload, "durability_level")?,
-        SimTick::new(parse_u64_agent(payload, "start_tick")?),
-        parse_decision_trace_id(payload)?,
-    );
-    state
-        .active_intention_by_actor
-        .insert(actor_id, intention_id.clone());
-    state.intentions.insert(intention_id, intention);
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn apply_intention_transition(
     state: &mut AgentState,
     event_type: EventKind,
     payload: &BTreeMap<&str, &str>,
 ) -> Result<(), ApplyError> {
     let intention_id = parse_intention_id(payload, "intention_id")?;

---- scheduler::no_human::tests::no_human_day_starts_continues_and_replays_active_intention stdout ----

thread 'scheduler::no_human::tests::no_human_day_starts_continues_and_replays_active_intention' (30045) panicked at crates/tracewake-core/src/scheduler.rs:4726:18:
later no-human action continues intention

failures:
    scheduler::no_human::tests::no_human_day_starts_continues_and_replays_active_intention

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
