*** crates/tracewake-core/src/events/apply.rs:1258:15: replace != with == in apply_intention_started

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace != with == in apply_intention_started
@@ -1250,17 +1250,17 @@
 
 fn apply_intention_started(
     state: &mut AgentState,
     payload: &BTreeMap<&str, &str>,
 ) -> Result<(), ApplyError> {
     let intention_id = parse_intention_id(payload, "intention_id")?;
     let actor_id = parse_actor_id(payload)?;
     let status = parse_intention_status(payload)?;
-    if status != IntentionStatus::Active {
+    if status == /* ~ changed by cargo-mutants ~ */ IntentionStatus::Active {
         return Err(ApplyError::PreconditionMismatch {
             field: "status",
             expected: IntentionStatus::Active.stable_id().to_string(),
             actual: status.stable_id().to_string(),
         });
     }
     let intention = Intention::adopt(
         intention_id.clone(),

---- episode_tamper_proration_poisons_replay stdout ----

thread 'episode_tamper_proration_poisons_replay' (1682) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:
agent event applies to live state: PreconditionMismatch { field: "status", expected: "active", actual: "active" }

---- severe_safety_with_known_exit_produces_move_and_replays stdout ----

thread 'severe_safety_with_known_exit_produces_move_and_replays' (1713) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:
agent event applies to live state: PreconditionMismatch { field: "status", expected: "active", actual: "active" }

---- wait_then_window_passive_charges_each_tick_once stdout ----

thread 'wait_then_window_passive_charges_each_tick_once' (1718) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:
agent event applies to live state: PreconditionMismatch { field: "status", expected: "active", actual: "active" }

failures:
    episode_tamper_proration_poisons_replay
    severe_safety_with_known_exit_produces_move_and_replays
    wait_then_window_passive_charges_each_tick_once

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.59s

*** result: Failure(101)
