*** crates/tracewake-core/src/events/apply.rs:1290:5: replace apply_intention_transition -> Result<(), ApplyError> with Ok(())

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace apply_intention_transition -> Result<(), ApplyError> with Ok(())
@@ -1282,107 +1282,17 @@
     Ok(())
 }
 
 fn apply_intention_transition(
     state: &mut AgentState,
     event_type: EventKind,
     payload: &BTreeMap<&str, &str>,
 ) -> Result<(), ApplyError> {
-    let intention_id = parse_intention_id(payload, "intention_id")?;
-    let status = parse_intention_status(payload)?;
-    let reason = required(payload, "reason")?.to_string();
-    let intention = state
-        .intentions
-        .get_mut(&intention_id)
-        .ok_or_else(|| ApplyError::MissingIntention(intention_id.clone()))?;
-
-    let expected_status = match event_type {
-        EventKind::IntentionContinued | EventKind::IntentionResumed => IntentionStatus::Active,
-        EventKind::IntentionSuspended => IntentionStatus::Suspended,
-        EventKind::IntentionCompleted => IntentionStatus::Completed,
-        EventKind::IntentionFailed => IntentionStatus::Failed,
-        EventKind::IntentionAbandoned => IntentionStatus::Abandoned,
-        EventKind::IntentionInterrupted => IntentionStatus::Interrupted,
-        _ => status,
-    };
-    if status != expected_status {
-        return Err(ApplyError::PreconditionMismatch {
-            field: "status",
-            expected: expected_status.stable_id().to_string(),
-            actual: status.stable_id().to_string(),
-        });
-    }
-
-    match event_type {
-        EventKind::IntentionContinued => {
-            intention.status = IntentionStatus::Active;
-            intention.status_reason = Some(reason);
-            if let Some(progress_tick) = payload.get("progress_tick") {
-                let tick = progress_tick
-                    .parse::<u64>()
-                    .map_err(|_| ApplyError::BadPayload {
-                        key: "progress_tick",
-                        value: (*progress_tick).to_string(),
-                    })?;
-                let step = required(payload, "current_step")?;
-                intention.record_progress(SimTick::new(tick), step);
-            }
-        }
-        EventKind::IntentionResumed => {
-            intention
-                .reactivate(reason)
-                .map_err(|err| ApplyError::BadPayload {
-                    key: "status",
-                    value: format!("{err:?}"),
-                })?
-        }
-        EventKind::IntentionSuspended => {
-            intention
-                .suspend(reason)
-                .map_err(|err| ApplyError::BadPayload {
-                    key: "status",
-                    value: format!("{err:?}"),
-                })?
-        }
-        EventKind::IntentionCompleted => {
-            intention
-                .complete(reason)
-                .map_err(|err| ApplyError::BadPayload {
-                    key: "status",
-                    value: format!("{err:?}"),
-                })?
-        }
-        EventKind::IntentionFailed => {
-            intention
-                .fail(reason)
-                .map_err(|err| ApplyError::BadPayload {
-                    key: "status",
-                    value: format!("{err:?}"),
-                })?
-        }
-        EventKind::IntentionAbandoned => {
-            intention
-                .abandon(reason)
-                .map_err(|err| ApplyError::BadPayload {
-                    key: "status",
-                    value: format!("{err:?}"),
-                })?
-        }
-        EventKind::IntentionInterrupted => {
-            intention
-                .interrupt(reason)
-                .map_err(|err| ApplyError::BadPayload {
-                    key: "status",
-                    value: format!("{err:?}"),
-                })?
-        }
-        _ => {}
-    }
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn apply_routine_step_transition(
     state: &mut AgentState,
     event_type: EventKind,
     payload: &BTreeMap<&str, &str>,
 ) -> Result<(), ApplyError> {
     let routine_execution_id = parse_routine_execution_id(payload)?;

---- events::apply::tests::agent_intention_transition_event_records_status_and_reason stdout ----

thread 'events::apply::tests::agent_intention_transition_event_records_status_and_reason' (6112) panicked at crates/tracewake-core/src/events/apply.rs:2064:9:
assertion `left == right` failed
  left: Active
 right: Suspended

---- scheduler::no_human::tests::no_human_day_starts_continues_and_replays_active_intention stdout ----

thread 'scheduler::no_human::tests::no_human_day_starts_continues_and_replays_active_intention' (6236) panicked at crates/tracewake-core/src/scheduler.rs:4745:13:
assertion `left == right` failed
  left: None
 right: Some("ordinary_follow_on_action_committed")

failures:
    events::apply::tests::agent_intention_transition_event_records_status_and_reason
    scheduler::no_human::tests::no_human_day_starts_continues_and_replays_active_intention

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
