*** crates/tracewake-core/src/events/apply.rs:1299:9: delete match arm EventKind::IntentionContinued | EventKind::IntentionResumed in apply_intention_transition

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete match arm EventKind::IntentionContinued | EventKind::IntentionResumed in apply_intention_transition
@@ -1291,17 +1291,17 @@
     let status = parse_intention_status(payload)?;
     let reason = required(payload, "reason")?.to_string();
     let intention = state
         .intentions
         .get_mut(&intention_id)
         .ok_or_else(|| ApplyError::MissingIntention(intention_id.clone()))?;
 
     let expected_status = match event_type {
-        EventKind::IntentionContinued | EventKind::IntentionResumed => IntentionStatus::Active,
+         /* ~ changed by cargo-mutants ~ */
         EventKind::IntentionSuspended => IntentionStatus::Suspended,
         EventKind::IntentionCompleted => IntentionStatus::Completed,
         EventKind::IntentionFailed => IntentionStatus::Failed,
         EventKind::IntentionAbandoned => IntentionStatus::Abandoned,
         EventKind::IntentionInterrupted => IntentionStatus::Interrupted,
         _ => status,
     };
     if status != expected_status {

---- intention_transition_wrong_status_rejects_before_state_change stdout ----

thread 'intention_transition_wrong_status_rejects_before_state_change' (10962) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:2733:9:
assertion failed: matches!(apply_agent_event(&mut state, &event),
    Err(ApplyError::PreconditionMismatch { field: "status", .. }))

failures:
    intention_transition_wrong_status_rejects_before_state_change

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
