*** crates/tracewake-core/src/events/apply.rs:1301:9: delete match arm EventKind::IntentionCompleted in apply_intention_transition

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete match arm EventKind::IntentionCompleted in apply_intention_transition
@@ -1293,17 +1293,17 @@
     let intention = state
         .intentions
         .get_mut(&intention_id)
         .ok_or_else(|| ApplyError::MissingIntention(intention_id.clone()))?;
 
     let expected_status = match event_type {
         EventKind::IntentionContinued | EventKind::IntentionResumed => IntentionStatus::Active,
         EventKind::IntentionSuspended => IntentionStatus::Suspended,
-        EventKind::IntentionCompleted => IntentionStatus::Completed,
+         /* ~ changed by cargo-mutants ~ */
         EventKind::IntentionFailed => IntentionStatus::Failed,
         EventKind::IntentionAbandoned => IntentionStatus::Abandoned,
         EventKind::IntentionInterrupted => IntentionStatus::Interrupted,
         _ => status,
     };
     if status != expected_status {
         return Err(ApplyError::PreconditionMismatch {
             field: "status",

---- intention_transition_wrong_status_rejects_before_state_change stdout ----

thread 'intention_transition_wrong_status_rejects_before_state_change' (20366) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:2733:9:
assertion failed: matches!(apply_agent_event(&mut state, &event),
    Err(ApplyError::PreconditionMismatch { field: "status", .. }))

failures:
    intention_transition_wrong_status_rejects_before_state_change

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
