*** crates/tracewake-core/src/events/apply.rs:1307:15: replace != with == in apply_intention_transition

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace != with == in apply_intention_transition
@@ -1299,17 +1299,17 @@
         EventKind::IntentionContinued | EventKind::IntentionResumed => IntentionStatus::Active,
         EventKind::IntentionSuspended => IntentionStatus::Suspended,
         EventKind::IntentionCompleted => IntentionStatus::Completed,
         EventKind::IntentionFailed => IntentionStatus::Failed,
         EventKind::IntentionAbandoned => IntentionStatus::Abandoned,
         EventKind::IntentionInterrupted => IntentionStatus::Interrupted,
         _ => status,
     };
-    if status != expected_status {
+    if status == /* ~ changed by cargo-mutants ~ */ expected_status {
         return Err(ApplyError::PreconditionMismatch {
             field: "status",
             expected: expected_status.stable_id().to_string(),
             actual: status.stable_id().to_string(),
         });
     }
 
     match event_type {

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (6051) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:
agent event applies to live state: PreconditionMismatch { field: "status", expected: "active", actual: "active" }

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
