*** crates/tracewake-core/src/events/apply.rs:1316:9: delete match arm EventKind::IntentionContinued in apply_intention_transition

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete match arm EventKind::IntentionContinued in apply_intention_transition
@@ -1308,30 +1308,17 @@
         return Err(ApplyError::PreconditionMismatch {
             field: "status",
             expected: expected_status.stable_id().to_string(),
             actual: status.stable_id().to_string(),
         });
     }
 
     match event_type {
-        EventKind::IntentionContinued => {
-            intention.status = IntentionStatus::Active;
-            intention.status_reason = Some(reason);
-            if let Some(progress_tick) = payload.get("progress_tick") {
-                let tick = progress_tick
-                    .parse::<u64>()
-                    .map_err(|_| ApplyError::BadPayload {
-                        key: "progress_tick",
-                        value: (*progress_tick).to_string(),
-                    })?;
-                let step = required(payload, "current_step")?;
-                intention.record_progress(SimTick::new(tick), step);
-            }
-        }
+         /* ~ changed by cargo-mutants ~ */
         EventKind::IntentionResumed => {
             intention
                 .reactivate(reason)
                 .map_err(|err| ApplyError::BadPayload {
                     key: "status",
                     value: format!("{err:?}"),
                 })?
         }

---- scheduler::no_human::tests::no_human_day_starts_continues_and_replays_active_intention stdout ----

thread 'scheduler::no_human::tests::no_human_day_starts_continues_and_replays_active_intention' (10571) panicked at crates/tracewake-core/src/scheduler.rs:4745:13:
assertion `left == right` failed
  left: None
 right: Some("ordinary_follow_on_action_committed")

failures:
    scheduler::no_human::tests::no_human_day_starts_continues_and_replays_active_intention

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
