*** crates/tracewake-core/src/events/apply.rs:1330:9: delete match arm EventKind::IntentionResumed in apply_intention_transition

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete match arm EventKind::IntentionResumed in apply_intention_transition
@@ -1322,24 +1322,17 @@
                     .map_err(|_| ApplyError::BadPayload {
                         key: "progress_tick",
                         value: (*progress_tick).to_string(),
                     })?;
                 let step = required(payload, "current_step")?;
                 intention.record_progress(SimTick::new(tick), step);
             }
         }
-        EventKind::IntentionResumed => {
-            intention
-                .reactivate(reason)
-                .map_err(|err| ApplyError::BadPayload {
-                    key: "status",
-                    value: format!("{err:?}"),
-                })?
-        }
+         /* ~ changed by cargo-mutants ~ */
         EventKind::IntentionSuspended => {
             intention
                 .suspend(reason)
                 .map_err(|err| ApplyError::BadPayload {
                     key: "status",
                     value: format!("{err:?}"),
                 })?
         }

---- agent_apply_matrix_observes_parser_arms_transitions_and_causality stdout ----

thread 'agent_apply_matrix_observes_parser_arms_transitions_and_causality' (15285) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:2499:5:
assertion `left == right` failed
  left: Suspended
 right: Active

failures:
    agent_apply_matrix_observes_parser_arms_transitions_and_causality

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
