*** crates/tracewake-core/src/events/apply.rs:1338:9: delete match arm EventKind::IntentionSuspended in apply_intention_transition

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete match arm EventKind::IntentionSuspended in apply_intention_transition
@@ -1330,24 +1330,17 @@
         EventKind::IntentionResumed => {
             intention
                 .reactivate(reason)
                 .map_err(|err| ApplyError::BadPayload {
                     key: "status",
                     value: format!("{err:?}"),
                 })?
         }
-        EventKind::IntentionSuspended => {
-            intention
-                .suspend(reason)
-                .map_err(|err| ApplyError::BadPayload {
-                    key: "status",
-                    value: format!("{err:?}"),
-                })?
-        }
+         /* ~ changed by cargo-mutants ~ */
         EventKind::IntentionCompleted => {
             intention
                 .complete(reason)
                 .map_err(|err| ApplyError::BadPayload {
                     key: "status",
                     value: format!("{err:?}"),
                 })?
         }

---- events::apply::tests::agent_intention_transition_event_records_status_and_reason stdout ----

thread 'events::apply::tests::agent_intention_transition_event_records_status_and_reason' (19708) panicked at crates/tracewake-core/src/events/apply.rs:2147:9:
assertion `left == right` failed
  left: Active
 right: Suspended

failures:
    events::apply::tests::agent_intention_transition_event_records_status_and_reason

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
