*** crates/tracewake-core/src/events/apply.rs:1354:9: delete match arm EventKind::IntentionFailed in apply_intention_transition

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete match arm EventKind::IntentionFailed in apply_intention_transition
@@ -1346,24 +1346,17 @@
         EventKind::IntentionCompleted => {
             intention
                 .complete(reason)
                 .map_err(|err| ApplyError::BadPayload {
                     key: "status",
                     value: format!("{err:?}"),
                 })?
         }
-        EventKind::IntentionFailed => {
-            intention
-                .fail(reason)
-                .map_err(|err| ApplyError::BadPayload {
-                    key: "status",
-                    value: format!("{err:?}"),
-                })?
-        }
+         /* ~ changed by cargo-mutants ~ */
         EventKind::IntentionAbandoned => {
             intention
                 .abandon(reason)
                 .map_err(|err| ApplyError::BadPayload {
                     key: "status",
                     value: format!("{err:?}"),
                 })?
         }

---- agent_apply_matrix_observes_parser_arms_transitions_and_causality stdout ----

thread 'agent_apply_matrix_observes_parser_arms_transitions_and_causality' (29248) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:2471:9:
assertion `left == right` failed
  left: Active
 right: Failed

failures:
    agent_apply_matrix_observes_parser_arms_transitions_and_causality

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
