*** crates/tracewake-core/src/events/apply.rs:1370:9: delete match arm EventKind::IntentionInterrupted in apply_intention_transition

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete match arm EventKind::IntentionInterrupted in apply_intention_transition
@@ -1362,24 +1362,17 @@
         EventKind::IntentionAbandoned => {
             intention
                 .abandon(reason)
                 .map_err(|err| ApplyError::BadPayload {
                     key: "status",
                     value: format!("{err:?}"),
                 })?
         }
-        EventKind::IntentionInterrupted => {
-            intention
-                .interrupt(reason)
-                .map_err(|err| ApplyError::BadPayload {
-                    key: "status",
-                    value: format!("{err:?}"),
-                })?
-        }
+         /* ~ changed by cargo-mutants ~ */
         _ => {}
     }
     Ok(())
 }
 
 fn apply_routine_step_transition(
     state: &mut AgentState,
     event_type: EventKind,

---- agent_apply_matrix_observes_parser_arms_transitions_and_causality stdout ----

thread 'agent_apply_matrix_observes_parser_arms_transitions_and_causality' (6185) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:2471:9:
assertion `left == right` failed
  left: Active
 right: Interrupted

failures:
    agent_apply_matrix_observes_parser_arms_transitions_and_causality

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
