*** crates/tracewake-core/src/events/apply.rs:1388:5: replace apply_routine_step_transition -> Result<(), ApplyError> with Ok(())

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace apply_routine_step_transition -> Result<(), ApplyError> with Ok(())
@@ -1380,59 +1380,17 @@
     Ok(())
 }
 
 fn apply_routine_step_transition(
     state: &mut AgentState,
     event_type: EventKind,
     payload: &BTreeMap<&str, &str>,
 ) -> Result<(), ApplyError> {
-    let routine_execution_id = parse_routine_execution_id(payload)?;
-    let tick_value = required(payload, "progress_tick")?;
-    let tick = tick_value
-        .parse::<u64>()
-        .map_err(|_| ApplyError::BadPayload {
-            key: "progress_tick",
-            value: tick_value.to_string(),
-        })?;
-    let execution = state
-        .routine_executions
-        .get_mut(&routine_execution_id)
-        .ok_or_else(|| ApplyError::MissingRoutineExecution(routine_execution_id.clone()))?;
-
-    match event_type {
-        EventKind::RoutineStepStarted => {
-            let action_id = crate::ids::SemanticActionId::new(required(payload, "action_id")?)
-                .map_err(|_| ApplyError::BadPayload {
-                    key: "action_id",
-                    value: required(payload, "action_id")
-                        .unwrap_or_default()
-                        .to_string(),
-                })?;
-            execution.start_step(SimTick::new(tick), action_id);
-        }
-        EventKind::RoutineStepCompleted => execution.complete_step(SimTick::new(tick)),
-        EventKind::RoutineStepFailed => {
-            execution.fail(SimTick::new(tick), required(payload, "reason")?)
-        }
-        _ => {}
-    }
-    if let Some(fallback_attempts) = payload.get("fallback_attempts") {
-        let attempts = fallback_attempts
-            .parse::<u32>()
-            .map_err(|_| ApplyError::BadPayload {
-                key: "fallback_attempts",
-                value: (*fallback_attempts).to_string(),
-            })?;
-        execution.fallback_attempts = attempts;
-    }
-    if event_type == EventKind::RoutineStepStarted {
-        execution.step_status = RoutineStepStatus::InProgress;
-    }
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn expect_bool(
     payload: &BTreeMap<&str, &str>,
     key: &'static str,
     expected: bool,
 ) -> Result<(), ApplyError> {
     let value = required(payload, key)?;

---- events::apply::tests::agent_routine_step_event_records_progress_and_fallbacks stdout ----

thread 'events::apply::tests::agent_routine_step_event_records_progress_and_fallbacks' (10610) panicked at crates/tracewake-core/src/events/apply.rs:2139:9:
assertion `left == right` failed
  left: NotStarted
 right: InProgress

---- scheduler::no_human::tests::duration_completion_appends_exact_matching_routine_step_once stdout ----

thread 'scheduler::no_human::tests::duration_completion_appends_exact_matching_routine_step_once' (10719) panicked at crates/tracewake-core/src/scheduler.rs:2903:17:
assertion `left == right` failed: sleep
  left: InProgress
 right: Completed

---- scheduler::no_human::tests::no_human_day_records_blocked_routine_failure_reason stdout ----

thread 'scheduler::no_human::tests::no_human_day_records_blocked_routine_failure_reason' (10725) panicked at crates/tracewake-core/src/scheduler.rs:4953:13:
assertion `left == right` failed
  left: NotStarted
 right: Failed

failures:
    events::apply::tests::agent_routine_step_event_records_progress_and_fallbacks
    scheduler::no_human::tests::duration_completion_appends_exact_matching_routine_step_once
    scheduler::no_human::tests::no_human_day_records_blocked_routine_failure_reason
    scheduler::no_human::tests::no_human_day_records_routine_step_ancestry_and_replays_it
    scheduler::no_human::tests::work_move_starts_but_non_move_progress_completes_routine_step

test result: FAILED. 450 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
