*** crates/tracewake-core/src/events/apply.rs:1402:9: delete match arm EventKind::RoutineStepStarted in apply_routine_step_transition

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete match arm EventKind::RoutineStepStarted in apply_routine_step_transition
@@ -1394,26 +1394,17 @@
             value: tick_value.to_string(),
         })?;
     let execution = state
         .routine_executions
         .get_mut(&routine_execution_id)
         .ok_or_else(|| ApplyError::MissingRoutineExecution(routine_execution_id.clone()))?;
 
     match event_type {
-        EventKind::RoutineStepStarted => {
-            let action_id = crate::ids::SemanticActionId::new(required(payload, "action_id")?)
-                .map_err(|_| ApplyError::BadPayload {
-                    key: "action_id",
-                    value: required(payload, "action_id")
-                        .unwrap_or_default()
-                        .to_string(),
-                })?;
-            execution.start_step(SimTick::new(tick), action_id);
-        }
+         /* ~ changed by cargo-mutants ~ */
         EventKind::RoutineStepCompleted => execution.complete_step(SimTick::new(tick)),
         EventKind::RoutineStepFailed => {
             execution.fail(SimTick::new(tick), required(payload, "reason")?)
         }
         _ => {}
     }
     if let Some(fallback_attempts) = payload.get("fallback_attempts") {
         let attempts = fallback_attempts

---- events::apply::tests::agent_routine_step_event_records_progress_and_fallbacks stdout ----

thread 'events::apply::tests::agent_routine_step_event_records_progress_and_fallbacks' (15169) panicked at crates/tracewake-core/src/events/apply.rs:2173:9:
assertion `left == right` failed
  left: SimTick(0)
 right: SimTick(3)

---- scheduler::no_human::tests::no_human_day_records_routine_step_ancestry_and_replays_it stdout ----

thread 'scheduler::no_human::tests::no_human_day_records_routine_step_ancestry_and_replays_it' (15286) panicked at crates/tracewake-core/src/scheduler.rs:4828:13:
assertion `left == right` failed
  left: []
 right: [SemanticActionId(StableId("wait"))]

failures:
    events::apply::tests::agent_routine_step_event_records_progress_and_fallbacks
    scheduler::no_human::tests::no_human_day_records_routine_step_ancestry_and_replays_it

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
