*** crates/tracewake-core/src/events/apply.rs:1412:9: delete match arm EventKind::RoutineStepCompleted in apply_routine_step_transition

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete match arm EventKind::RoutineStepCompleted in apply_routine_step_transition
@@ -1404,17 +1404,17 @@
                 .map_err(|_| ApplyError::BadPayload {
                     key: "action_id",
                     value: required(payload, "action_id")
                         .unwrap_or_default()
                         .to_string(),
                 })?;
             execution.start_step(SimTick::new(tick), action_id);
         }
-        EventKind::RoutineStepCompleted => execution.complete_step(SimTick::new(tick)),
+         /* ~ changed by cargo-mutants ~ */
         EventKind::RoutineStepFailed => {
             execution.fail(SimTick::new(tick), required(payload, "reason")?)
         }
         _ => {}
     }
     if let Some(fallback_attempts) = payload.get("fallback_attempts") {
         let attempts = fallback_attempts
             .parse::<u32>()

---- scheduler::no_human::tests::duration_completion_appends_exact_matching_routine_step_once stdout ----

thread 'scheduler::no_human::tests::duration_completion_appends_exact_matching_routine_step_once' (19837) panicked at crates/tracewake-core/src/scheduler.rs:2903:17:
assertion `left == right` failed: sleep
  left: InProgress
 right: Completed

---- scheduler::no_human::tests::no_human_day_records_routine_step_ancestry_and_replays_it stdout ----

thread 'scheduler::no_human::tests::no_human_day_records_routine_step_ancestry_and_replays_it' (19845) panicked at crates/tracewake-core/src/scheduler.rs:4824:13:
assertion `left == right` failed
  left: InProgress
 right: Completed

---- scheduler::no_human::tests::work_move_starts_but_non_move_progress_completes_routine_step stdout ----

thread 'scheduler::no_human::tests::work_move_starts_but_non_move_progress_completes_routine_step' (19863) panicked at crates/tracewake-core/src/scheduler.rs:3049:13:
assertion `left == right` failed
  left: InProgress
 right: Completed

failures:
    scheduler::no_human::tests::duration_completion_appends_exact_matching_routine_step_once
    scheduler::no_human::tests::no_human_day_records_routine_step_ancestry_and_replays_it
    scheduler::no_human::tests::work_move_starts_but_non_move_progress_completes_routine_step

test result: FAILED. 452 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
