*** crates/tracewake-core/src/events/apply.rs:1413:9: delete match arm EventKind::RoutineStepFailed in apply_routine_step_transition

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete match arm EventKind::RoutineStepFailed in apply_routine_step_transition
@@ -1405,19 +1405,17 @@
                     key: "action_id",
                     value: required(payload, "action_id")
                         .unwrap_or_default()
                         .to_string(),
                 })?;
             execution.start_step(SimTick::new(tick), action_id);
         }
         EventKind::RoutineStepCompleted => execution.complete_step(SimTick::new(tick)),
-        EventKind::RoutineStepFailed => {
-            execution.fail(SimTick::new(tick), required(payload, "reason")?)
-        }
+         /* ~ changed by cargo-mutants ~ */
         _ => {}
     }
     if let Some(fallback_attempts) = payload.get("fallback_attempts") {
         let attempts = fallback_attempts
             .parse::<u32>()
             .map_err(|_| ApplyError::BadPayload {
                 key: "fallback_attempts",
                 value: (*fallback_attempts).to_string(),

---- scheduler::no_human::tests::no_human_day_records_blocked_routine_failure_reason stdout ----

thread 'scheduler::no_human::tests::no_human_day_records_blocked_routine_failure_reason' (24402) panicked at crates/tracewake-core/src/scheduler.rs:4953:13:
assertion `left == right` failed
  left: NotStarted
 right: Failed

failures:
    scheduler::no_human::tests::no_human_day_records_blocked_routine_failure_reason

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
