*** crates/tracewake-core/src/events/apply.rs:1427:19: replace == with != in apply_routine_step_transition

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace == with != in apply_routine_step_transition
@@ -1419,17 +1419,17 @@
         let attempts = fallback_attempts
             .parse::<u32>()
             .map_err(|_| ApplyError::BadPayload {
                 key: "fallback_attempts",
                 value: (*fallback_attempts).to_string(),
             })?;
         execution.fallback_attempts = attempts;
     }
-    if event_type == EventKind::RoutineStepStarted {
+    if event_type != /* ~ changed by cargo-mutants ~ */ EventKind::RoutineStepStarted {
         execution.step_status = RoutineStepStatus::InProgress;
     }
     Ok(())
 }
 
 fn expect_bool(
     payload: &BTreeMap<&str, &str>,
     key: &'static str,

---- scheduler::no_human::tests::duration_completion_appends_exact_matching_routine_step_once stdout ----

thread 'scheduler::no_human::tests::duration_completion_appends_exact_matching_routine_step_once' (28955) panicked at crates/tracewake-core/src/scheduler.rs:2903:17:
assertion `left == right` failed: sleep
  left: InProgress
 right: Completed

---- scheduler::no_human::tests::no_human_day_records_routine_step_ancestry_and_replays_it stdout ----

thread 'scheduler::no_human::tests::no_human_day_records_routine_step_ancestry_and_replays_it' (28963) panicked at crates/tracewake-core/src/scheduler.rs:4824:13:
assertion `left == right` failed
  left: InProgress
 right: Completed

---- scheduler::no_human::tests::no_human_day_records_blocked_routine_failure_reason stdout ----

thread 'scheduler::no_human::tests::no_human_day_records_blocked_routine_failure_reason' (28961) panicked at crates/tracewake-core/src/scheduler.rs:4953:13:
assertion `left == right` failed
  left: InProgress
 right: Failed

failures:
    scheduler::no_human::tests::duration_completion_appends_exact_matching_routine_step_once
    scheduler::no_human::tests::no_human_day_records_blocked_routine_failure_reason
    scheduler::no_human::tests::no_human_day_records_routine_step_ancestry_and_replays_it
    scheduler::no_human::tests::work_move_starts_but_non_move_progress_completes_routine_step

test result: FAILED. 451 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
