*** crates/tracewake-core/src/events/apply.rs:1438:5: replace expect_bool -> Result<(), ApplyError> with Ok(())

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace expect_bool -> Result<(), ApplyError> with Ok(())
@@ -1430,36 +1430,17 @@
     Ok(())
 }
 
 fn expect_bool(
     payload: &BTreeMap<&str, &str>,
     key: &'static str,
     expected: bool,
 ) -> Result<(), ApplyError> {
-    let value = required(payload, key)?;
-    let actual = match value {
-        "true" => true,
-        "false" => false,
-        _ => {
-            return Err(ApplyError::BadPayload {
-                key,
-                value: value.to_string(),
-            })
-        }
-    };
-    if actual == expected {
-        Ok(())
-    } else {
-        Err(ApplyError::PreconditionMismatch {
-            field: key,
-            expected: expected.to_string(),
-            actual: actual.to_string(),
-        })
-    }
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn apply_actor_moved(
     state: &mut PhysicalState,
     payload: &BTreeMap<&str, &str>,
 ) -> Result<(), ApplyError> {
     let actor_id = parse_actor_id(payload)?;
     let from_place_id = parse_place_id(payload, "from_place_id")?;

---- world_boolean_preconditions_reject_payload_lies_before_state_change stdout ----

thread 'world_boolean_preconditions_reject_payload_lies_before_state_change' (1244) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:2889:5:
assertion failed: matches!(apply_event(&mut world, &bad_door_close),
    Err(ApplyError::PreconditionMismatch { field: "was_open", .. }))

failures:
    world_boolean_preconditions_reject_payload_lies_before_state_change

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
