*** crates/tracewake-core/src/events/apply.rs:1449:15: replace == with != in expect_bool

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace == with != in expect_bool
@@ -1441,17 +1441,17 @@
         "false" => false,
         _ => {
             return Err(ApplyError::BadPayload {
                 key,
                 value: value.to_string(),
             })
         }
     };
-    if actual == expected {
+    if actual != /* ~ changed by cargo-mutants ~ */ expected {
         Ok(())
     } else {
         Err(ApplyError::PreconditionMismatch {
             field: key,
             expected: expected.to_string(),
             actual: actual.to_string(),
         })
     }

---- actions::pipeline::tests::open_then_move_log_replays_to_same_state stdout ----

thread 'actions::pipeline::tests::open_then_move_log_replays_to_same_state' (14549) panicked at crates/tracewake-core/src/actions/pipeline.rs:2418:9:
assertion `left == right` failed
  left: Rejected
 right: Accepted

---- replay::rebuild::tests::rebuild_from_fixture_and_events_equals_live_run stdout ----

thread 'replay::rebuild::tests::rebuild_from_fixture_and_events_equals_live_run' (14846) panicked at crates/tracewake-core/src/replay/rebuild.rs:722:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    actions::pipeline::tests::open_then_move_log_replays_to_same_state
    replay::rebuild::tests::rebuild_from_fixture_and_events_equals_live_run

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
