*** crates/tracewake-core/src/events/apply.rs:1464:5: replace apply_actor_moved -> Result<(), ApplyError> with Ok(())

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace apply_actor_moved -> Result<(), ApplyError> with Ok(())
@@ -1456,47 +1456,17 @@
         })
     }
 }
 
 fn apply_actor_moved(
     state: &mut PhysicalState,
     payload: &BTreeMap<&str, &str>,
 ) -> Result<(), ApplyError> {
-    let actor_id = parse_actor_id(payload)?;
-    let from_place_id = parse_place_id(payload, "from_place_id")?;
-    let to_place_id = parse_place_id(payload, "to_place_id")?;
-
-    if !state.places.contains_key(&from_place_id) {
-        return Err(ApplyError::MissingPlace(from_place_id));
-    }
-    if !state.places.contains_key(&to_place_id) {
-        return Err(ApplyError::MissingPlace(to_place_id));
-    }
-
-    let actor = state
-        .actors
-        .get_mut(&actor_id)
-        .ok_or_else(|| ApplyError::MissingActor(actor_id.clone()))?;
-    if actor.current_place_id != from_place_id {
-        return Err(ApplyError::PreconditionMismatch {
-            field: "actor.current_place_id",
-            expected: from_place_id.to_string(),
-            actual: actor.current_place_id.to_string(),
-        });
-    }
-
-    actor.current_place_id = to_place_id.clone();
-    if let Some(from_place) = state.places.get_mut(&from_place_id) {
-        from_place.local_actor_ids.remove(&actor_id);
-    }
-    if let Some(to_place) = state.places.get_mut(&to_place_id) {
-        to_place.local_actor_ids.insert(actor_id);
-    }
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn apply_door_open_state(
     state: &mut PhysicalState,
     payload: &BTreeMap<&str, &str>,
     expected_old: bool,
     new_value: bool,
 ) -> Result<(), ApplyError> {

---- episode_tamper_output_tag_poisons_replay stdout ----

thread 'episode_tamper_output_tag_poisons_replay' (18984) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1055:10:
work starts

---- ordinary_workday_fixture_moves_before_work_completion stdout ----

thread 'ordinary_workday_fixture_moves_before_work_completion' (18999) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1142:10:
work starts after movement ancestry

---- serialized_event_log_replays_to_identical_state stdout ----

thread 'serialized_event_log_replays_to_identical_state' (19015) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1055:10:
work starts

failures:
    episode_tamper_output_tag_poisons_replay
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    ordinary_workday_fixture_moves_before_work_completion
    serialized_event_log_replays_to_identical_state
    sleep_eat_work_fixture_logs_need_effects_and_replays
    work_block_failed_then_sleep_succeeds_fixture_closes_reservation

test result: FAILED. 36 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.60s

*** result: Failure(101)
