*** crates/tracewake-core/src/events/apply.rs:1468:8: delete ! in apply_actor_moved

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete ! in apply_actor_moved
@@ -1460,17 +1460,17 @@
 fn apply_actor_moved(
     state: &mut PhysicalState,
     payload: &BTreeMap<&str, &str>,
 ) -> Result<(), ApplyError> {
     let actor_id = parse_actor_id(payload)?;
     let from_place_id = parse_place_id(payload, "from_place_id")?;
     let to_place_id = parse_place_id(payload, "to_place_id")?;
 
-    if !state.places.contains_key(&from_place_id) {
+    if  /* ~ changed by cargo-mutants ~ */state.places.contains_key(&from_place_id) {
         return Err(ApplyError::MissingPlace(from_place_id));
     }
     if !state.places.contains_key(&to_place_id) {
         return Err(ApplyError::MissingPlace(to_place_id));
     }
 
     let actor = state
         .actors

---- episode_tamper_output_tag_poisons_replay stdout ----

thread 'episode_tamper_output_tag_poisons_replay' (23083) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1055:10:
work starts

---- serialized_event_log_replays_to_identical_state stdout ----

thread 'serialized_event_log_replays_to_identical_state' (23114) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1055:10:
work starts

---- ordinary_workday_fixture_moves_before_work_completion stdout ----

thread 'ordinary_workday_fixture_moves_before_work_completion' (23098) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1142:10:
work starts after movement ancestry

failures:
    episode_tamper_output_tag_poisons_replay
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    ordinary_workday_fixture_moves_before_work_completion
    serialized_event_log_replays_to_identical_state
    severe_safety_with_known_exit_produces_move_and_replays
    sleep_eat_work_fixture_logs_need_effects_and_replays
    work_block_failed_then_sleep_succeeds_fixture_closes_reservation

test result: FAILED. 34 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.50s

*** result: Failure(101)
