*** crates/tracewake-core/src/events/apply.rs:146:8: delete ! in apply_event_with_capability

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete ! in apply_event_with_capability
@@ -138,17 +138,17 @@
     apply_event_with_capability(state, event, capability)
 }
 
 fn apply_event_with_capability(
     state: &mut PhysicalState,
     event: &EventEnvelope,
     _capability: WorldMutationCapability,
 ) -> Result<ApplyOutcome, ApplyError> {
-    if !event.has_supported_schema_version() {
+    if  /* ~ changed by cargo-mutants ~ */event.has_supported_schema_version() {
         return Err(ApplyError::UnsupportedSchemaVersion(
             event.event_schema_version.as_str().to_string(),
         ));
     }
 
     if event.stream != event.event_type.stream() {
         return Err(ApplyError::EventKindStreamMismatch);
     }

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (16855) panicked at crates/tracewake-content/tests/fixtures_load.rs:1217:5:
assertion failed: report.ordinary_pipeline_events > 0

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
