*** crates/tracewake-core/src/events/apply.rs:1503:5: replace apply_door_open_state -> Result<(), ApplyError> with Ok(())

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace apply_door_open_state -> Result<(), ApplyError> with Ok(())
@@ -1495,32 +1495,17 @@
 }
 
 fn apply_door_open_state(
     state: &mut PhysicalState,
     payload: &BTreeMap<&str, &str>,
     expected_old: bool,
     new_value: bool,
 ) -> Result<(), ApplyError> {
-    let door_id = parse_door_id(payload)?;
-    expect_bool(payload, "was_open", expected_old)?;
-    expect_bool(payload, "now_open", new_value)?;
-    let door = state
-        .doors
-        .get_mut(&door_id)
-        .ok_or_else(|| ApplyError::MissingDoor(door_id.clone()))?;
-    if door.is_open != expected_old {
-        return Err(ApplyError::PreconditionMismatch {
-            field: "door.is_open",
-            expected: expected_old.to_string(),
-            actual: door.is_open.to_string(),
-        });
-    }
-    door.is_open = new_value;
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn apply_container_open_state(
     state: &mut PhysicalState,
     payload: &BTreeMap<&str, &str>,
     expected_old: bool,
     new_value: bool,
 ) -> Result<(), ApplyError> {

---- actions::pipeline::tests::open_then_move_log_replays_to_same_state stdout ----

thread 'actions::pipeline::tests::open_then_move_log_replays_to_same_state' (3036) panicked at crates/tracewake-core/src/actions/pipeline.rs:2443:9:
assertion `left == right` failed
  left: Rejected
 right: Accepted

---- replay::rebuild::tests::rebuild_from_fixture_and_events_equals_live_run stdout ----

thread 'replay::rebuild::tests::rebuild_from_fixture_and_events_equals_live_run' (3333) panicked at crates/tracewake-core/src/replay/rebuild.rs:722:9:
assertion `left == right` failed
  left: 1
 right: 2

failures:
    actions::pipeline::tests::open_then_move_log_replays_to_same_state
    replay::rebuild::tests::rebuild_from_fixture_and_events_equals_live_run

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
