*** crates/tracewake-core/src/events/apply.rs:1510:21: replace != with == in apply_door_open_state

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace != with == in apply_door_open_state
@@ -1502,17 +1502,17 @@
 ) -> Result<(), ApplyError> {
     let door_id = parse_door_id(payload)?;
     expect_bool(payload, "was_open", expected_old)?;
     expect_bool(payload, "now_open", new_value)?;
     let door = state
         .doors
         .get_mut(&door_id)
         .ok_or_else(|| ApplyError::MissingDoor(door_id.clone()))?;
-    if door.is_open != expected_old {
+    if door.is_open == /* ~ changed by cargo-mutants ~ */ expected_old {
         return Err(ApplyError::PreconditionMismatch {
             field: "door.is_open",
             expected: expected_old.to_string(),
             actual: door.is_open.to_string(),
         });
     }
     door.is_open = new_value;
     Ok(())

---- actions::pipeline::tests::open_then_move_log_replays_to_same_state stdout ----

thread 'actions::pipeline::tests::open_then_move_log_replays_to_same_state' (7596) panicked at crates/tracewake-core/src/actions/pipeline.rs:2418:9:
assertion `left == right` failed
  left: Rejected
 right: Accepted

---- replay::rebuild::tests::rebuild_from_fixture_and_events_equals_live_run stdout ----

thread 'replay::rebuild::tests::rebuild_from_fixture_and_events_equals_live_run' (7893) panicked at crates/tracewake-core/src/replay/rebuild.rs:722:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    actions::pipeline::tests::open_then_move_log_replays_to_same_state
    replay::rebuild::tests::rebuild_from_fixture_and_events_equals_live_run

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
