*** crates/tracewake-core/src/events/apply.rs:1527:5: replace apply_container_open_state -> Result<(), ApplyError> with Ok(())

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace apply_container_open_state -> Result<(), ApplyError> with Ok(())
@@ -1519,32 +1519,17 @@
 }
 
 fn apply_container_open_state(
     state: &mut PhysicalState,
     payload: &BTreeMap<&str, &str>,
     expected_old: bool,
     new_value: bool,
 ) -> Result<(), ApplyError> {
-    let container_id = parse_container_id(payload)?;
-    expect_bool(payload, "was_open", expected_old)?;
-    expect_bool(payload, "now_open", new_value)?;
-    let container = state
-        .containers
-        .get_mut(&container_id)
-        .ok_or_else(|| ApplyError::MissingContainer(container_id.clone()))?;
-    if container.is_open != expected_old {
-        return Err(ApplyError::PreconditionMismatch {
-            field: "container.is_open",
-            expected: expected_old.to_string(),
-            actual: container.is_open.to_string(),
-        });
-    }
-    container.is_open = new_value;
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn apply_item_taken_from_place(
     state: &mut PhysicalState,
     payload: &BTreeMap<&str, &str>,
 ) -> Result<(), ApplyError> {
     let item_id = parse_item_id(payload)?;
     let actor_id = parse_actor_id(payload)?;

---- accepted_action_appends_before_authoritative_apply stdout ----

thread 'accepted_action_appends_before_authoritative_apply' (12556) panicked at crates/tracewake-core/tests/anti_regression_guards.rs:6357:5:
assertion `left != right` failed
  left: PhysicalChecksum("twc1-5ec7c44b288a9d13")
 right: PhysicalChecksum("twc1-5ec7c44b288a9d13")

---- event_apply_remains_only_post_seed_mutation_path stdout ----

thread 'event_apply_remains_only_post_seed_mutation_path' (12566) panicked at crates/tracewake-core/tests/anti_regression_guards.rs:6357:5:
assertion `left != right` failed
  left: PhysicalChecksum("twc1-5ec7c44b288a9d13")
 right: PhysicalChecksum("twc1-5ec7c44b288a9d13")

failures:
    accepted_action_appends_before_authoritative_apply
    event_apply_remains_only_post_seed_mutation_path

test result: FAILED. 78 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.36s

*** result: Failure(101)
