*** crates/tracewake-core/src/events/apply.rs:1534:26: replace != with == in apply_container_open_state

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace != with == in apply_container_open_state
@@ -1526,17 +1526,17 @@
 ) -> Result<(), ApplyError> {
     let container_id = parse_container_id(payload)?;
     expect_bool(payload, "was_open", expected_old)?;
     expect_bool(payload, "now_open", new_value)?;
     let container = state
         .containers
         .get_mut(&container_id)
         .ok_or_else(|| ApplyError::MissingContainer(container_id.clone()))?;
-    if container.is_open != expected_old {
+    if container.is_open == /* ~ changed by cargo-mutants ~ */ expected_old {
         return Err(ApplyError::PreconditionMismatch {
             field: "container.is_open",
             expected: expected_old.to_string(),
             actual: container.is_open.to_string(),
         });
     }
     container.is_open = new_value;
     Ok(())

---- accepted_action_appends_before_authoritative_apply stdout ----

thread 'accepted_action_appends_before_authoritative_apply' (17216) panicked at crates/tracewake-core/tests/anti_regression_guards.rs:6354:5:
assertion `left == right` failed
  left: Rejected
 right: Accepted

---- event_apply_remains_only_post_seed_mutation_path stdout ----

thread 'event_apply_remains_only_post_seed_mutation_path' (17226) panicked at crates/tracewake-core/tests/anti_regression_guards.rs:6354:5:
assertion `left == right` failed
  left: Rejected
 right: Accepted

failures:
    accepted_action_appends_before_authoritative_apply
    event_apply_remains_only_post_seed_mutation_path

test result: FAILED. 78 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.38s

*** result: Failure(101)
