*** crates/tracewake-core/src/events/apply.rs:1549:5: replace apply_item_taken_from_place -> Result<(), ApplyError> with Ok(())

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace apply_item_taken_from_place -> Result<(), ApplyError> with Ok(())
@@ -1541,37 +1541,17 @@
     container.is_open = new_value;
     Ok(())
 }
 
 fn apply_item_taken_from_place(
     state: &mut PhysicalState,
     payload: &BTreeMap<&str, &str>,
 ) -> Result<(), ApplyError> {
-    let item_id = parse_item_id(payload)?;
-    let actor_id = parse_actor_id(payload)?;
-    let place_id = parse_place_id(payload, "place_id")?;
-
-    require_item_location(state, &item_id, Location::AtPlace(place_id.clone()))?;
-    require_actor(state, &actor_id)?;
-    let item = state
-        .items
-        .get_mut(&item_id)
-        .ok_or_else(|| ApplyError::MissingItem(item_id.clone()))?;
-    item.location = Location::CarriedBy(actor_id.clone());
-    state
-        .actors
-        .get_mut(&actor_id)
-        .expect("actor checked")
-        .carried_item_ids
-        .insert(item_id.clone());
-    if let Some(place) = state.places.get_mut(&place_id) {
-        place.local_item_ids.remove(&item_id);
-    }
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn apply_item_removed_from_container(
     state: &mut PhysicalState,
     payload: &BTreeMap<&str, &str>,
 ) -> Result<(), ApplyError> {
     let item_id = parse_item_id(payload)?;
     let actor_id = parse_actor_id(payload)?;

---- world_item_apply_matrix_observes_state_and_precondition_failures stdout ----

thread 'world_item_apply_matrix_observes_state_and_precondition_failures' (21992) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:2785:5:
assertion `left == right` failed
  left: AtPlace(PlaceId(StableId("shop_front")))
 right: CarriedBy(ActorId(StableId("actor_tomas")))

failures:
    world_item_apply_matrix_observes_state_and_precondition_failures

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
