*** crates/tracewake-core/src/events/apply.rs:156:21: replace != with == in apply_event_with_capability

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace != with == in apply_event_with_capability
@@ -148,17 +148,17 @@
             event.event_schema_version.as_str().to_string(),
         ));
     }
 
     if event.stream != event.event_type.stream() {
         return Err(ApplyError::EventKindStreamMismatch);
     }
 
-    if event.stream != EventStream::World {
+    if event.stream == /* ~ changed by cargo-mutants ~ */ EventStream::World {
         return Ok(ApplyOutcome::NonWorldNoOp);
     }
 
     if event.event_type.requires_cause() && event.causes.is_empty() {
         return Err(ApplyError::MissingCause);
     }
 
     let payload = payload_map(&event.payload);

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (24917) panicked at crates/tracewake-content/tests/fixtures_load.rs:1217:5:
assertion failed: report.ordinary_pipeline_events > 0

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
