*** crates/tracewake-core/src/events/apply.rs:1576:5: replace apply_item_removed_from_container -> Result<(), ApplyError> with Ok(())

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace apply_item_removed_from_container -> Result<(), ApplyError> with Ok(())
@@ -1568,45 +1568,17 @@
     }
     Ok(())
 }
 
 fn apply_item_removed_from_container(
     state: &mut PhysicalState,
     payload: &BTreeMap<&str, &str>,
 ) -> Result<(), ApplyError> {
-    let item_id = parse_item_id(payload)?;
-    let actor_id = parse_actor_id(payload)?;
-    let container_id = parse_container_id(payload)?;
-
-    require_item_location(state, &item_id, Location::InContainer(container_id.clone()))?;
-    require_actor(state, &actor_id)?;
-    let container = state
-        .containers
-        .get_mut(&container_id)
-        .ok_or_else(|| ApplyError::MissingContainer(container_id.clone()))?;
-    if !container.contents.remove(&item_id) {
-        return Err(ApplyError::PreconditionMismatch {
-            field: "container.contents",
-            expected: item_id.to_string(),
-            actual: "missing".to_string(),
-        });
-    }
-    state
-        .items
-        .get_mut(&item_id)
-        .expect("item location checked")
-        .location = Location::CarriedBy(actor_id.clone());
-    state
-        .actors
-        .get_mut(&actor_id)
-        .expect("actor checked")
-        .carried_item_ids
-        .insert(item_id);
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn apply_item_placed_in_place(
     state: &mut PhysicalState,
     payload: &BTreeMap<&str, &str>,
 ) -> Result<(), ApplyError> {
     let item_id = parse_item_id(payload)?;
     let actor_id = parse_actor_id(payload)?;

---- actions::defs::takeplace::tests::take_from_open_container_moves_item_to_actor stdout ----

thread 'actions::defs::takeplace::tests::take_from_open_container_moves_item_to_actor' (26142) panicked at crates/tracewake-core/src/actions/defs/takeplace.rs:605:9:
assertion `left == right` failed
  left: InContainer(ContainerId(StableId("strongbox_tomas")))
 right: CarriedBy(ActorId(StableId("actor_tomas")))

---- debug_reports::tests::item_location_report_names_last_location_event stdout ----

thread 'debug_reports::tests::item_location_report_names_last_location_event' (26329) panicked at crates/tracewake-core/src/debug_reports.rs:937:9:
assertion `left == right` failed
  left: "container:strongbox_tomas -> place:shop_front"
 right: "actor:actor_tomas -> place:shop_front"

---- replay::report::tests::missing_item_event_is_drift_not_warning stdout ----

thread 'replay::report::tests::missing_item_event_is_drift_not_warning' (26480) panicked at crates/tracewake-core/src/replay/report.rs:320:9:
assertion failed: !report.matches_expected

failures:
    actions::defs::takeplace::tests::take_from_open_container_moves_item_to_actor
    debug_reports::tests::item_location_report_names_last_location_event
    replay::report::tests::missing_item_event_is_drift_not_warning

test result: FAILED. 452 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
