*** crates/tracewake-core/src/events/apply.rs:1586:8: delete ! in apply_item_removed_from_container

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete ! in apply_item_removed_from_container
@@ -1578,17 +1578,17 @@
     let container_id = parse_container_id(payload)?;
 
     require_item_location(state, &item_id, Location::InContainer(container_id.clone()))?;
     require_actor(state, &actor_id)?;
     let container = state
         .containers
         .get_mut(&container_id)
         .ok_or_else(|| ApplyError::MissingContainer(container_id.clone()))?;
-    if !container.contents.remove(&item_id) {
+    if  /* ~ changed by cargo-mutants ~ */container.contents.remove(&item_id) {
         return Err(ApplyError::PreconditionMismatch {
             field: "container.contents",
             expected: item_id.to_string(),
             actual: "missing".to_string(),
         });
     }
     state
         .items

---- actions::defs::takeplace::tests::take_does_not_change_ownership_custody stdout ----

thread 'actions::defs::takeplace::tests::take_does_not_change_ownership_custody' (30699) panicked at crates/tracewake-core/src/actions/defs/takeplace.rs:685:41:
called `Result::unwrap()` on an `Err` value: PreconditionMismatch { field: "container.contents", expected: "coin_stack_01", actual: "missing" }

---- actions::defs::takeplace::tests::take_from_open_container_moves_item_to_actor stdout ----

thread 'actions::defs::takeplace::tests::take_from_open_container_moves_item_to_actor' (30701) panicked at crates/tracewake-core/src/actions/defs/takeplace.rs:604:41:
called `Result::unwrap()` on an `Err` value: PreconditionMismatch { field: "container.contents", expected: "coin_stack_01", actual: "missing" }

---- debug_reports::tests::item_location_report_names_last_location_event stdout ----

thread 'debug_reports::tests::item_location_report_names_last_location_event' (30888) panicked at crates/tracewake-core/src/debug_reports.rs:937:9:
assertion `left == right` failed
  left: "container:strongbox_tomas -> place:shop_front"
 right: "actor:actor_tomas -> place:shop_front"

failures:
    actions::defs::takeplace::tests::take_does_not_change_ownership_custody
    actions::defs::takeplace::tests::take_from_open_container_moves_item_to_actor
    debug_reports::tests::item_location_report_names_last_location_event
    replay::report::tests::missing_item_event_is_drift_not_warning
    replay::report::tests::replay_clean_log_matches_expected
    replay::report::tests::replay_divergence_reports_first_event_and_field_family
    replay::report::tests::unsupported_version_is_reported_and_not_applied

test result: FAILED. 448 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
