*** crates/tracewake-core/src/events/apply.rs:1611:5: replace apply_item_placed_in_place -> Result<(), ApplyError> with Ok(())

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace apply_item_placed_in_place -> Result<(), ApplyError> with Ok(())
@@ -1603,39 +1603,17 @@
         .insert(item_id);
     Ok(())
 }
 
 fn apply_item_placed_in_place(
     state: &mut PhysicalState,
     payload: &BTreeMap<&str, &str>,
 ) -> Result<(), ApplyError> {
-    let item_id = parse_item_id(payload)?;
-    let actor_id = parse_actor_id(payload)?;
-    let place_id = parse_place_id(payload, "place_id")?;
-
-    require_item_location(state, &item_id, Location::CarriedBy(actor_id.clone()))?;
-    if !state.places.contains_key(&place_id) {
-        return Err(ApplyError::MissingPlace(place_id));
-    }
-    state
-        .items
-        .get_mut(&item_id)
-        .expect("item location checked")
-        .location = Location::AtPlace(place_id.clone());
-    if let Some(actor) = state.actors.get_mut(&actor_id) {
-        actor.carried_item_ids.remove(&item_id);
-    }
-    state
-        .places
-        .get_mut(&place_id)
-        .expect("place checked")
-        .local_item_ids
-        .insert(item_id);
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn apply_item_placed_in_container(
     state: &mut PhysicalState,
     payload: &BTreeMap<&str, &str>,
 ) -> Result<(), ApplyError> {
     let item_id = parse_item_id(payload)?;
     let actor_id = parse_actor_id(payload)?;

---- world_item_apply_matrix_observes_state_and_precondition_failures stdout ----

thread 'world_item_apply_matrix_observes_state_and_precondition_failures' (3344) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:2817:5:
assertion `left == right` failed
  left: CarriedBy(ActorId(StableId("actor_tomas")))
 right: AtPlace(PlaceId(StableId("back_room")))

failures:
    world_item_apply_matrix_observes_state_and_precondition_failures

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
