*** crates/tracewake-core/src/events/apply.rs:1616:8: delete ! in apply_item_placed_in_place

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete ! in apply_item_placed_in_place
@@ -1608,17 +1608,17 @@
     state: &mut PhysicalState,
     payload: &BTreeMap<&str, &str>,
 ) -> Result<(), ApplyError> {
     let item_id = parse_item_id(payload)?;
     let actor_id = parse_actor_id(payload)?;
     let place_id = parse_place_id(payload, "place_id")?;
 
     require_item_location(state, &item_id, Location::CarriedBy(actor_id.clone()))?;
-    if !state.places.contains_key(&place_id) {
+    if  /* ~ changed by cargo-mutants ~ */state.places.contains_key(&place_id) {
         return Err(ApplyError::MissingPlace(place_id));
     }
     state
         .items
         .get_mut(&item_id)
         .expect("item location checked")
         .location = Location::AtPlace(place_id.clone());
     if let Some(actor) = state.actors.get_mut(&actor_id) {

---- world_item_apply_matrix_observes_state_and_precondition_failures stdout ----

thread 'world_item_apply_matrix_observes_state_and_precondition_failures' (8047) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:2816:5:
assertion `left == right` failed
  left: Err(MissingPlace(PlaceId(StableId("back_room"))))
 right: Ok(Applied)

failures:
    world_item_apply_matrix_observes_state_and_precondition_failures

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
