*** crates/tracewake-core/src/events/apply.rs:1640:5: replace apply_item_placed_in_container -> Result<(), ApplyError> with Ok(())

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace apply_item_placed_in_container -> Result<(), ApplyError> with Ok(())
@@ -1632,39 +1632,17 @@
         .insert(item_id);
     Ok(())
 }
 
 fn apply_item_placed_in_container(
     state: &mut PhysicalState,
     payload: &BTreeMap<&str, &str>,
 ) -> Result<(), ApplyError> {
-    let item_id = parse_item_id(payload)?;
-    let actor_id = parse_actor_id(payload)?;
-    let container_id = parse_container_id(payload)?;
-
-    require_item_location(state, &item_id, Location::CarriedBy(actor_id.clone()))?;
-    if !state.containers.contains_key(&container_id) {
-        return Err(ApplyError::MissingContainer(container_id));
-    }
-    state
-        .items
-        .get_mut(&item_id)
-        .expect("item location checked")
-        .location = Location::InContainer(container_id.clone());
-    if let Some(actor) = state.actors.get_mut(&actor_id) {
-        actor.carried_item_ids.remove(&item_id);
-    }
-    state
-        .containers
-        .get_mut(&container_id)
-        .expect("container checked")
-        .contents
-        .insert(item_id);
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn apply_food_consumed(
     state: &mut PhysicalState,
     payload: &BTreeMap<&str, &str>,
 ) -> Result<(), ApplyError> {
     let food_supply_id = parse_food_supply_id(payload)?;
     let servings_consumed = parse_u32(payload, "servings_consumed")?;

---- actions::defs::takeplace::tests::place_into_open_container_emits_and_applies_event stdout ----

thread 'actions::defs::takeplace::tests::place_into_open_container_emits_and_applies_event' (12194) panicked at crates/tracewake-core/src/actions/defs/takeplace.rs:662:9:
assertion `left == right` failed
  left: CarriedBy(ActorId(StableId("actor_tomas")))
 right: InContainer(ContainerId(StableId("strongbox_tomas")))

failures:
    actions::defs::takeplace::tests::place_into_open_container_emits_and_applies_event

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
