*** crates/tracewake-core/src/events/apply.rs:1645:8: delete ! in apply_item_placed_in_container

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete ! in apply_item_placed_in_container
@@ -1637,17 +1637,17 @@
     state: &mut PhysicalState,
     payload: &BTreeMap<&str, &str>,
 ) -> Result<(), ApplyError> {
     let item_id = parse_item_id(payload)?;
     let actor_id = parse_actor_id(payload)?;
     let container_id = parse_container_id(payload)?;
 
     require_item_location(state, &item_id, Location::CarriedBy(actor_id.clone()))?;
-    if !state.containers.contains_key(&container_id) {
+    if  /* ~ changed by cargo-mutants ~ */state.containers.contains_key(&container_id) {
         return Err(ApplyError::MissingContainer(container_id));
     }
     state
         .items
         .get_mut(&item_id)
         .expect("item location checked")
         .location = Location::InContainer(container_id.clone());
     if let Some(actor) = state.actors.get_mut(&actor_id) {

---- actions::defs::takeplace::tests::place_into_open_container_emits_and_applies_event stdout ----

thread 'actions::defs::takeplace::tests::place_into_open_container_emits_and_applies_event' (16753) panicked at crates/tracewake-core/src/actions/defs/takeplace.rs:661:41:
called `Result::unwrap()` on an `Err` value: MissingContainer(ContainerId(StableId("strongbox_tomas")))

failures:
    actions::defs::takeplace::tests::place_into_open_container_emits_and_applies_event

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
