*** crates/tracewake-core/src/events/apply.rs:1669:5: replace apply_food_consumed -> Result<(), ApplyError> with Ok(())

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace apply_food_consumed -> Result<(), ApplyError> with Ok(())
@@ -1661,43 +1661,17 @@
         .insert(item_id);
     Ok(())
 }
 
 fn apply_food_consumed(
     state: &mut PhysicalState,
     payload: &BTreeMap<&str, &str>,
 ) -> Result<(), ApplyError> {
-    let food_supply_id = parse_food_supply_id(payload)?;
-    let servings_consumed = parse_u32(payload, "servings_consumed")?;
-    let servings_before = parse_u32(payload, "servings_before")?;
-    let servings_after = parse_u32(payload, "servings_after")?;
-    if servings_before.saturating_sub(servings_consumed) != servings_after {
-        return Err(ApplyError::PreconditionMismatch {
-            field: "food_supply.servings_after",
-            expected: servings_before
-                .saturating_sub(servings_consumed)
-                .to_string(),
-            actual: servings_after.to_string(),
-        });
-    }
-
-    let food = state
-        .food_supplies
-        .get_mut(&food_supply_id)
-        .ok_or_else(|| ApplyError::MissingFoodSupply(food_supply_id.clone()))?;
-    if food.servings != servings_before {
-        return Err(ApplyError::PreconditionMismatch {
-            field: "food_supply.servings",
-            expected: servings_before.to_string(),
-            actual: food.servings.to_string(),
-        });
-    }
-    food.servings = servings_after;
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn require_actor(state: &PhysicalState, actor_id: &ActorId) -> Result<(), ApplyError> {
     if state.actors.contains_key(actor_id) {
         Ok(())
     } else {
         Err(ApplyError::MissingActor(actor_id.clone()))
     }

---- actions::defs::eat::tests::eat_runs_through_shared_pipeline_and_decrements_servings stdout ----

thread 'actions::defs::eat::tests::eat_runs_through_shared_pipeline_and_decrements_servings' (21291) panicked at crates/tracewake-core/src/actions/defs/eat.rs:727:9:
assertion `left == right` failed
  left: 2
 right: 1

---- actions::defs::eat::tests::eat_consumes_one_serving_and_emits_non_crossing_hunger_delta stdout ----

thread 'actions::defs::eat::tests::eat_consumes_one_serving_and_emits_non_crossing_hunger_delta' (21282) panicked at crates/tracewake-core/src/actions/defs/eat.rs:447:9:
assertion `left == right` failed
  left: 2
 right: 1

failures:
    actions::defs::eat::tests::eat_consumes_one_serving_and_emits_non_crossing_hunger_delta
    actions::defs::eat::tests::eat_runs_through_shared_pipeline_and_decrements_servings

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
