*** crates/tracewake-core/src/events/apply.rs:1673:58: replace != with == in apply_food_consumed

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace != with == in apply_food_consumed
@@ -1665,17 +1665,17 @@
 fn apply_food_consumed(
     state: &mut PhysicalState,
     payload: &BTreeMap<&str, &str>,
 ) -> Result<(), ApplyError> {
     let food_supply_id = parse_food_supply_id(payload)?;
     let servings_consumed = parse_u32(payload, "servings_consumed")?;
     let servings_before = parse_u32(payload, "servings_before")?;
     let servings_after = parse_u32(payload, "servings_after")?;
-    if servings_before.saturating_sub(servings_consumed) != servings_after {
+    if servings_before.saturating_sub(servings_consumed) == /* ~ changed by cargo-mutants ~ */ servings_after {
         return Err(ApplyError::PreconditionMismatch {
             field: "food_supply.servings_after",
             expected: servings_before
                 .saturating_sub(servings_consumed)
                 .to_string(),
             actual: servings_after.to_string(),
         });
     }

---- sleep_eat_work_fixture_logs_need_effects_and_replays stdout ----

thread 'sleep_eat_work_fixture_logs_need_effects_and_replays' (25819) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1270:5:
assertion failed: has_event(&log, EventKind::FoodConsumed)

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (25793) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2172:5:
assertion `left == right` failed
  left: {ActorId(StableId("actor_anna")), ActorId(StableId("actor_elena")), ActorId(StableId("actor_mara"))}
 right: {ActorId(StableId("actor_anna")), ActorId(StableId("actor_elena")), ActorId(StableId("actor_mara")), ActorId(StableId("actor_tomas"))}

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (25794) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2714:5:
assertion failed: has_event(&log, EventKind::ActorMoved)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    sleep_eat_work_fixture_logs_need_effects_and_replays

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.48s

*** result: Failure(101)
