*** crates/tracewake-core/src/events/apply.rs:1687:22: replace != with == in apply_food_consumed

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace != with == in apply_food_consumed
@@ -1679,17 +1679,17 @@
             actual: servings_after.to_string(),
         });
     }
 
     let food = state
         .food_supplies
         .get_mut(&food_supply_id)
         .ok_or_else(|| ApplyError::MissingFoodSupply(food_supply_id.clone()))?;
-    if food.servings != servings_before {
+    if food.servings == /* ~ changed by cargo-mutants ~ */ servings_before {
         return Err(ApplyError::PreconditionMismatch {
             field: "food_supply.servings",
             expected: servings_before.to_string(),
             actual: food.servings.to_string(),
         });
     }
     food.servings = servings_after;
     Ok(())

---- sleep_eat_work_fixture_logs_need_effects_and_replays stdout ----

thread 'sleep_eat_work_fixture_logs_need_effects_and_replays' (29918) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1270:5:
assertion failed: has_event(&log, EventKind::FoodConsumed)

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (29892) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2172:5:
assertion `left == right` failed
  left: {ActorId(StableId("actor_anna")), ActorId(StableId("actor_elena")), ActorId(StableId("actor_mara"))}
 right: {ActorId(StableId("actor_anna")), ActorId(StableId("actor_elena")), ActorId(StableId("actor_mara")), ActorId(StableId("actor_tomas"))}

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (29893) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2714:5:
assertion failed: has_event(&log, EventKind::ActorMoved)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    sleep_eat_work_fixture_logs_need_effects_and_replays

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.48s

*** result: Failure(101)
