*** crates/tracewake-core/src/events/apply.rs:1699:5: replace require_actor -> Result<(), ApplyError> with Ok(())

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace require_actor -> Result<(), ApplyError> with Ok(())
@@ -1691,21 +1691,17 @@
             actual: food.servings.to_string(),
         });
     }
     food.servings = servings_after;
     Ok(())
 }
 
 fn require_actor(state: &PhysicalState, actor_id: &ActorId) -> Result<(), ApplyError> {
-    if state.actors.contains_key(actor_id) {
-        Ok(())
-    } else {
-        Err(ApplyError::MissingActor(actor_id.clone()))
-    }
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn require_item_location(
     state: &PhysicalState,
     item_id: &ItemId,
     expected: Location,
 ) -> Result<(), ApplyError> {
     let item = state

---- world_item_apply_matrix_observes_state_and_precondition_failures stdout ----

thread 'world_item_apply_matrix_observes_state_and_precondition_failures' (2156) panicked at crates/tracewake-core/src/events/apply.rs:1563:10:
actor checked

failures:
    world_item_apply_matrix_observes_state_and_precondition_failures

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
