*** crates/tracewake-core/src/events/apply.rs:1711:5: replace require_item_location -> Result<(), ApplyError> with Ok(())

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace require_item_location -> Result<(), ApplyError> with Ok(())
@@ -1703,29 +1703,17 @@
     }
 }
 
 fn require_item_location(
     state: &PhysicalState,
     item_id: &ItemId,
     expected: Location,
 ) -> Result<(), ApplyError> {
-    let item = state
-        .items
-        .get(item_id)
-        .ok_or_else(|| ApplyError::MissingItem(item_id.clone()))?;
-    if item.location == expected {
-        Ok(())
-    } else {
-        Err(ApplyError::PreconditionMismatch {
-            field: "item.location",
-            expected: format!("{expected:?}"),
-            actual: format!("{:?}", item.location),
-        })
-    }
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::agent::{
         Intention, IntentionSource, NeedChangeCause, NeedKind, NeedState, RoutineExecution,
         RoutineFamily,

---- world_item_apply_matrix_observes_state_and_precondition_failures stdout ----

thread 'world_item_apply_matrix_observes_state_and_precondition_failures' (6859) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:2865:5:
assertion failed: matches!(apply_event(&mut world, &bad_place),
    Err(ApplyError::PreconditionMismatch { field: "item.location", .. }))

failures:
    world_item_apply_matrix_observes_state_and_precondition_failures

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
