*** crates/tracewake-core/src/events/apply.rs:1715:22: replace == with != in require_item_location

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace == with != in require_item_location
@@ -1707,17 +1707,17 @@
     state: &PhysicalState,
     item_id: &ItemId,
     expected: Location,
 ) -> Result<(), ApplyError> {
     let item = state
         .items
         .get(item_id)
         .ok_or_else(|| ApplyError::MissingItem(item_id.clone()))?;
-    if item.location == expected {
+    if item.location != /* ~ changed by cargo-mutants ~ */ expected {
         Ok(())
     } else {
         Err(ApplyError::PreconditionMismatch {
             field: "item.location",
             expected: format!("{expected:?}"),
             actual: format!("{:?}", item.location),
         })
     }

---- actions::defs::takeplace::tests::take_from_open_container_moves_item_to_actor stdout ----

thread 'actions::defs::takeplace::tests::take_from_open_container_moves_item_to_actor' (11009) panicked at crates/tracewake-core/src/actions/defs/takeplace.rs:604:41:
called `Result::unwrap()` on an `Err` value: PreconditionMismatch { field: "item.location", expected: "InContainer(ContainerId(StableId(\"strongbox_tomas\")))", actual: "InContainer(ContainerId(StableId(\"strongbox_tomas\")))" }

---- actions::defs::takeplace::tests::take_does_not_change_ownership_custody stdout ----

thread 'actions::defs::takeplace::tests::take_does_not_change_ownership_custody' (11007) panicked at crates/tracewake-core/src/actions/defs/takeplace.rs:685:41:
called `Result::unwrap()` on an `Err` value: PreconditionMismatch { field: "item.location", expected: "InContainer(ContainerId(StableId(\"strongbox_tomas\")))", actual: "InContainer(ContainerId(StableId(\"strongbox_tomas\")))" }

---- actions::defs::takeplace::tests::place_into_open_container_emits_and_applies_event stdout ----

thread 'actions::defs::takeplace::tests::place_into_open_container_emits_and_applies_event' (11006) panicked at crates/tracewake-core/src/actions/defs/takeplace.rs:661:41:
called `Result::unwrap()` on an `Err` value: PreconditionMismatch { field: "item.location", expected: "CarriedBy(ActorId(StableId(\"actor_tomas\")))", actual: "CarriedBy(ActorId(StableId(\"actor_tomas\")))" }

failures:
    actions::defs::takeplace::tests::place_into_open_container_emits_and_applies_event
    actions::defs::takeplace::tests::take_does_not_change_ownership_custody
    actions::defs::takeplace::tests::take_from_open_container_moves_item_to_actor
    debug_reports::tests::item_location_report_names_last_location_event
    replay::report::tests::missing_item_event_is_drift_not_warning
    replay::report::tests::replay_clean_log_matches_expected
    replay::report::tests::replay_divergence_reports_first_event_and_field_family
    replay::report::tests::unsupported_version_is_reported_and_not_applied

test result: FAILED. 447 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
