*** crates/tracewake-core/src/events/apply.rs:213:21: replace != with == in apply_epistemic_event

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace != with == in apply_epistemic_event
@@ -205,17 +205,17 @@
             event.event_schema_version.as_str().to_string(),
         ));
     }
 
     if event.stream != event.event_type.stream() {
         return Err(EpistemicApplyError::EventKindStreamMismatch);
     }
 
-    if event.stream != EventStream::Epistemic {
+    if event.stream == /* ~ changed by cargo-mutants ~ */ EventStream::Epistemic {
         return Ok(ApplyOutcome::NonWorldNoOp);
     }
 
     if event.event_type.requires_cause() && event.causes.is_empty() {
         return Err(EpistemicApplyError::MissingCause);
     }
 
     let payload = payload_map(&event.payload);

---- stale_workplace_notice_superseded_by_newer_001 stdout ----

thread 'stale_workplace_notice_superseded_by_newer_001' (8588) panicked at crates/tracewake-content/tests/fixtures_load.rs:1156:5:
assertion `left == right` failed
  left: 0
 right: 1

---- seed_event_log_order_and_projection_provenance_are_causal_and_stable stdout ----

thread 'seed_event_log_order_and_projection_provenance_are_causal_and_stable' (8585) panicked at crates/tracewake-content/tests/fixtures_load.rs:995:10:
sleep-place seed replays into projection with source event id

failures:
    seed_event_log_order_and_projection_provenance_are_causal_and_stable
    stale_workplace_notice_superseded_by_newer_001

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
