*** crates/tracewake-core/src/events/apply.rs:223:31: replace != with == in apply_epistemic_event

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace != with == in apply_epistemic_event
@@ -215,17 +215,17 @@
     }
 
     if event.event_type.requires_cause() && event.causes.is_empty() {
         return Err(EpistemicApplyError::MissingCause);
     }
 
     let payload = payload_map(&event.payload);
     let payload_schema_version = required_epistemic(&payload, "schema_version")?;
-    if payload_schema_version != EVENT_SCHEMA_V1 {
+    if payload_schema_version == /* ~ changed by cargo-mutants ~ */ EVENT_SCHEMA_V1 {
         return Err(EpistemicApplyError::UnsupportedPayloadSchemaVersion(
             payload_schema_version.to_string(),
         ));
     }
 
     match event.event_type {
         EventKind::InitialBeliefSeeded | EventKind::BeliefUpdated => {
             let belief = parse_belief_payload(&payload)?;

---- fixture_fingerprint_reprices_secondary_file_bytes stdout ----

thread 'fixture_fingerprint_reprices_secondary_file_bytes' (16623) panicked at crates/tracewake-content/tests/fixtures_load.rs:629:6:
called `Result::unwrap()` on an `Err` value: EpistemicSeedEvent("fixture seed epistemic event event_seed_initial_belief_belief_tomas_expects_coin_stack_01_in_strongbox_tomas failed: UnsupportedPayloadSchemaVersion(\"event_schema_v1\")")

---- fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture stdout ----

thread 'fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture' (16622) panicked at crates/tracewake-content/tests/fixtures_load.rs:661:6:
called `Result::unwrap()` on an `Err` value: EpistemicSeedEvent("fixture seed epistemic event event_seed_initial_belief_belief_tomas_expects_coin_stack_01_in_strongbox_tomas failed: UnsupportedPayloadSchemaVersion(\"event_schema_v1\")")

---- fixture_scope_raw_lines_drive_loader_registry_and_fail_closed stdout ----

thread 'fixture_scope_raw_lines_drive_loader_registry_and_fail_closed' (16624) panicked at crates/tracewake-content/tests/fixtures_load.rs:846:6:
called `Result::unwrap()` on an `Err` value: EpistemicSeedEvent("fixture seed epistemic event event_seed_starting_belief_actor_tomas_sleep_place_bed_tomas failed: UnsupportedPayloadSchemaVersion(\"event_schema_v1\")")

failures:
    all_fixtures_load_deterministically_and_validate
    fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture
    fixture_fingerprint_reprices_secondary_file_bytes
    fixture_scope_raw_lines_drive_loader_registry_and_fail_closed
    fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering
    phase3a_load_emits_authored_prehistory_seed_events
    seed_event_log_order_and_projection_provenance_are_causal_and_stable
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food
    stale_workplace_notice_superseded_by_newer_001

test result: FAILED. 25 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
