*** crates/tracewake-core/src/events/apply.rs:230:9: delete match arm EventKind::InitialBeliefSeeded | EventKind::BeliefUpdated in apply_epistemic_event

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete match arm EventKind::InitialBeliefSeeded | EventKind::BeliefUpdated in apply_epistemic_event
@@ -222,21 +222,17 @@
     let payload_schema_version = required_epistemic(&payload, "schema_version")?;
     if payload_schema_version != EVENT_SCHEMA_V1 {
         return Err(EpistemicApplyError::UnsupportedPayloadSchemaVersion(
             payload_schema_version.to_string(),
         ));
     }
 
     match event.event_type {
-        EventKind::InitialBeliefSeeded | EventKind::BeliefUpdated => {
-            let belief = parse_belief_payload(&payload)?;
-            projection.insert_belief(belief);
-            Ok(ApplyOutcome::Applied)
-        }
+         /* ~ changed by cargo-mutants ~ */
         EventKind::ObservationRecorded => {
             let observation =
                 parse_observation_payload(&payload)?.with_raw_payload(event.payload.clone());
             projection.insert_observation(observation);
             Ok(ApplyOutcome::Applied)
         }
         EventKind::RoleAssignmentNoticeRecorded => {
             let actor_id = parse_actor_id_epistemic(&payload, "actor_id")?;

---- fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture stdout ----

thread 'fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture' (20653) panicked at crates/tracewake-content/tests/fixtures_load.rs:661:6:
called `Result::unwrap()` on an `Err` value: EpistemicSeedEvent("fixture seed epistemic event event_seed_initial_belief_belief_tomas_expects_coin_stack_01_in_strongbox_tomas failed: NonEpistemicEvent")

---- fixture_fingerprint_reprices_secondary_file_bytes stdout ----

thread 'fixture_fingerprint_reprices_secondary_file_bytes' (20654) panicked at crates/tracewake-content/tests/fixtures_load.rs:629:6:
called `Result::unwrap()` on an `Err` value: EpistemicSeedEvent("fixture seed epistemic event event_seed_initial_belief_belief_tomas_expects_coin_stack_01_in_strongbox_tomas failed: NonEpistemicEvent")

---- all_fixtures_load_deterministically_and_validate stdout ----

thread 'all_fixtures_load_deterministically_and_validate' (20651) panicked at crates/tracewake-content/tests/fixtures_load.rs:598:10:
called `Result::unwrap()` on an `Err` value: EpistemicSeedEvent("fixture seed epistemic event event_seed_initial_belief_belief_tomas_expects_coin_stack_01_in_strongbox_tomas failed: NonEpistemicEvent")

failures:
    all_fixtures_load_deterministically_and_validate
    fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture
    fixture_fingerprint_reprices_secondary_file_bytes
    seed_event_log_order_and_projection_provenance_are_causal_and_stable

test result: FAILED. 30 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
