*** crates/tracewake-core/src/events/apply.rs:235:9: delete match arm EventKind::ObservationRecorded in apply_epistemic_event

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete match arm EventKind::ObservationRecorded in apply_epistemic_event
@@ -227,22 +227,17 @@
     }
 
     match event.event_type {
         EventKind::InitialBeliefSeeded | EventKind::BeliefUpdated => {
             let belief = parse_belief_payload(&payload)?;
             projection.insert_belief(belief);
             Ok(ApplyOutcome::Applied)
         }
-        EventKind::ObservationRecorded => {
-            let observation =
-                parse_observation_payload(&payload)?.with_raw_payload(event.payload.clone());
-            projection.insert_observation(observation);
-            Ok(ApplyOutcome::Applied)
-        }
+         /* ~ changed by cargo-mutants ~ */
         EventKind::RoleAssignmentNoticeRecorded => {
             let actor_id = parse_actor_id_epistemic(&payload, "actor_id")?;
             let workplace_id = required_epistemic(&payload, "workplace_id").and_then(|value| {
                 crate::ids::WorkplaceId::new(value).map_err(|_| EpistemicApplyError::BadPayload {
                     key: "workplace_id",
                     value: value.to_string(),
                 })
             })?;

---- no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash stdout ----

thread 'no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash' (24759) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2907:5:
[Phase3AReplayFailure { event_position: 11, event_kind: DecisionTraceRecorded, schema_version: "event_schema_v1", issue: "prefix_apply_error:Epistemic(NonEpistemicEvent)", actor_id: Some("actor_bruno"), routine_id: None, trace_id: Some("trace_decision_actor_bruno_0_goal_actor_bruno_0_eat") }]

---- severe_safety_with_known_exit_produces_move_and_replays stdout ----

thread 'severe_safety_with_known_exit_produces_move_and_replays' (24781) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1715:10:
severe safety should commit a move

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (24757) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash
    no_human_decision_context_hash_gate_fails_when_source_evidence_tampered
    severe_safety_with_known_exit_produces_move_and_replays

test result: FAILED. 37 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.22s

*** result: Failure(101)
