*** crates/tracewake-core/src/events/apply.rs:241:9: delete match arm EventKind::RoleAssignmentNoticeRecorded in apply_epistemic_event

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete match arm EventKind::RoleAssignmentNoticeRecorded in apply_epistemic_event
@@ -233,45 +233,17 @@
             Ok(ApplyOutcome::Applied)
         }
         EventKind::ObservationRecorded => {
             let observation =
                 parse_observation_payload(&payload)?.with_raw_payload(event.payload.clone());
             projection.insert_observation(observation);
             Ok(ApplyOutcome::Applied)
         }
-        EventKind::RoleAssignmentNoticeRecorded => {
-            let actor_id = parse_actor_id_epistemic(&payload, "actor_id")?;
-            let workplace_id = required_epistemic(&payload, "workplace_id").and_then(|value| {
-                crate::ids::WorkplaceId::new(value).map_err(|_| EpistemicApplyError::BadPayload {
-                    key: "workplace_id",
-                    value: value.to_string(),
-                })
-            })?;
-            let place_id = parse_place_id_epistemic(&payload, "place_id")?;
-            let access_open = match required_epistemic(&payload, "access_open")? {
-                "true" => true,
-                "false" => false,
-                value => {
-                    return Err(EpistemicApplyError::BadPayload {
-                        key: "access_open",
-                        value: value.to_string(),
-                    })
-                }
-            };
-            projection.insert_role_assignment_notice(
-                actor_id,
-                workplace_id,
-                place_id,
-                access_open,
-                event.event_id.clone(),
-                event.sim_tick,
-            );
-            Ok(ApplyOutcome::Applied)
-        }
+         /* ~ changed by cargo-mutants ~ */
         EventKind::StartingBeliefRecorded => {
             let actor_id = parse_actor_id_epistemic(&payload, "actor_id")?;
             let belief_kind = required_epistemic(&payload, "belief_kind")?;
             let subject_id = required_epistemic(&payload, "subject_id")?;
             let value = required_epistemic(&payload, "value")?;
             projection.insert_starting_belief(
                 actor_id,
                 belief_kind,

---- fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering stdout ----

thread 'fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering' (28798) panicked at crates/tracewake-content/tests/fixtures_load.rs:1238:6:
called `Result::unwrap()` on an `Err` value: EpistemicSeedEvent("fixture seed epistemic event event_seed_role_assignment_notice_actor_tomas_workplace_shop failed: NonEpistemicEvent")

---- stale_workplace_notice_superseded_by_newer_001 stdout ----

thread 'stale_workplace_notice_superseded_by_newer_001' (28816) panicked at crates/tracewake-content/tests/fixtures_load.rs:1096:6:
called `Result::unwrap()` on an `Err` value: EpistemicSeedEvent("fixture seed epistemic event event_seed_role_assignment_notice_actor_tomas_workplace_tomas failed: NonEpistemicEvent")

---- seed_event_log_order_and_projection_provenance_are_causal_and_stable stdout ----

thread 'seed_event_log_order_and_projection_provenance_are_causal_and_stable' (28813) panicked at crates/tracewake-content/tests/fixtures_load.rs:920:74:
called `Result::unwrap()` on an `Err` value: EpistemicSeedEvent("fixture seed epistemic event event_seed_role_assignment_notice_actor_elena_workplace_shop failed: NonEpistemicEvent")

failures:
    all_fixtures_load_deterministically_and_validate
    fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering
    phase3a_load_emits_authored_prehistory_seed_events
    seed_event_log_order_and_projection_provenance_are_causal_and_stable
    stale_workplace_notice_superseded_by_newer_001

test result: FAILED. 29 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
