*** crates/tracewake-core/src/events/apply.rs:270:9: delete match arm EventKind::StartingBeliefRecorded in apply_epistemic_event

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete match arm EventKind::StartingBeliefRecorded in apply_epistemic_event
@@ -262,31 +262,17 @@
                 workplace_id,
                 place_id,
                 access_open,
                 event.event_id.clone(),
                 event.sim_tick,
             );
             Ok(ApplyOutcome::Applied)
         }
-        EventKind::StartingBeliefRecorded => {
-            let actor_id = parse_actor_id_epistemic(&payload, "actor_id")?;
-            let belief_kind = required_epistemic(&payload, "belief_kind")?;
-            let subject_id = required_epistemic(&payload, "subject_id")?;
-            let value = required_epistemic(&payload, "value")?;
-            projection.insert_starting_belief(
-                actor_id,
-                belief_kind,
-                subject_id,
-                value,
-                event.event_id.clone(),
-                event.sim_tick,
-            );
-            Ok(ApplyOutcome::Applied)
-        }
+         /* ~ changed by cargo-mutants ~ */
         EventKind::ExpectationContradicted => {
             let contradiction = parse_contradiction_payload(&payload)?;
             projection.insert_contradiction(contradiction);
             Ok(ApplyOutcome::Applied)
         }
         EventKind::ContainerChecked => Ok(ApplyOutcome::WorldNoOp),
         _ => Err(EpistemicApplyError::NonEpistemicEvent),
     }

---- fixture_scope_raw_lines_drive_loader_registry_and_fail_closed stdout ----

thread 'fixture_scope_raw_lines_drive_loader_registry_and_fail_closed' (353) panicked at crates/tracewake-content/tests/fixtures_load.rs:846:6:
called `Result::unwrap()` on an `Err` value: EpistemicSeedEvent("fixture seed epistemic event event_seed_starting_belief_actor_tomas_sleep_place_bed_tomas failed: NonEpistemicEvent")

---- fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering stdout ----

thread 'fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering' (361) panicked at crates/tracewake-content/tests/fixtures_load.rs:1238:6:
called `Result::unwrap()` on an `Err` value: EpistemicSeedEvent("fixture seed epistemic event event_seed_starting_belief_actor_tomas_home_place_home_tomas failed: NonEpistemicEvent")

---- seed_event_log_order_and_projection_provenance_are_causal_and_stable stdout ----

thread 'seed_event_log_order_and_projection_provenance_are_causal_and_stable' (376) panicked at crates/tracewake-content/tests/fixtures_load.rs:920:74:
called `Result::unwrap()` on an `Err` value: EpistemicSeedEvent("fixture seed epistemic event event_seed_starting_belief_actor_tomas_home_place_home_tomas failed: NonEpistemicEvent")

failures:
    all_fixtures_load_deterministically_and_validate
    fixture_scope_raw_lines_drive_loader_registry_and_fail_closed
    fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering
    phase3a_load_emits_authored_prehistory_seed_events
    seed_event_log_order_and_projection_provenance_are_causal_and_stable
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food
    stale_workplace_notice_superseded_by_newer_001

test result: FAILED. 27 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
