*** crates/tracewake-core/src/events/apply.rs:285:9: delete match arm EventKind::ExpectationContradicted in apply_epistemic_event

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete match arm EventKind::ExpectationContradicted in apply_epistemic_event
@@ -277,21 +277,17 @@
                 belief_kind,
                 subject_id,
                 value,
                 event.event_id.clone(),
                 event.sim_tick,
             );
             Ok(ApplyOutcome::Applied)
         }
-        EventKind::ExpectationContradicted => {
-            let contradiction = parse_contradiction_payload(&payload)?;
-            projection.insert_contradiction(contradiction);
-            Ok(ApplyOutcome::Applied)
-        }
+         /* ~ changed by cargo-mutants ~ */
         EventKind::ContainerChecked => Ok(ApplyOutcome::WorldNoOp),
         _ => Err(EpistemicApplyError::NonEpistemicEvent),
     }
 }
 
 pub fn apply_agent_event(
     state: &mut AgentState,
     event: &EventEnvelope,

---- belief_stale_frontier_and_witness_links_survive_projection_debug_and_replay stdout ----

thread 'belief_stale_frontier_and_witness_links_survive_projection_debug_and_replay' (5054) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:2154:9:
assertion `left == right` failed
  left: Err(NonEpistemicEvent)
 right: Ok(Applied)

---- starting_observation_and_contradiction_events_survive_replay_with_sources stdout ----

thread 'starting_observation_and_contradiction_events_survive_replay_with_sources' (5076) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:2056:9:
assertion `left == right` failed
  left: Err(NonEpistemicEvent)
 right: Ok(Applied)

failures:
    belief_stale_frontier_and_witness_links_survive_projection_debug_and_replay
    starting_observation_and_contradiction_events_survive_replay_with_sources

test result: FAILED. 30 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
