*** crates/tracewake-core/src/events/apply.rs:290:9: delete match arm EventKind::ContainerChecked in apply_epistemic_event

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete match arm EventKind::ContainerChecked in apply_epistemic_event
@@ -282,17 +282,17 @@
             );
             Ok(ApplyOutcome::Applied)
         }
         EventKind::ExpectationContradicted => {
             let contradiction = parse_contradiction_payload(&payload)?;
             projection.insert_contradiction(contradiction);
             Ok(ApplyOutcome::Applied)
         }
-        EventKind::ContainerChecked => Ok(ApplyOutcome::WorldNoOp),
+         /* ~ changed by cargo-mutants ~ */
         _ => Err(EpistemicApplyError::NonEpistemicEvent),
     }
 }
 
 pub fn apply_agent_event(
     state: &mut AgentState,
     event: &EventEnvelope,
 ) -> Result<ApplyOutcome, ApplyError> {

---- expected_absence_check_creates_contradiction_and_missing_belief stdout ----

thread 'expected_absence_check_creates_contradiction_and_missing_belief' (9796) panicked at crates/tracewake-core/tests/golden_scenarios.rs:601:5:
assertion `left == right` failed
  left: Rejected
 right: Accepted

---- missing_property_belief_does_not_support_truthful_accusation stdout ----

thread 'missing_property_belief_does_not_support_truthful_accusation' (9797) panicked at crates/tracewake-core/tests/golden_scenarios.rs:693:5:
assertion `left == right` failed
  left: Rejected
 right: Accepted

---- no_human_epistemic_check_records_evidence_without_controller stdout ----

thread 'no_human_epistemic_check_records_evidence_without_controller' (9799) panicked at crates/tracewake-core/tests/golden_scenarios.rs:648:5:
assertion `left == right` failed
  left: Rejected
 right: Accepted

failures:
    expected_absence_check_creates_contradiction_and_missing_belief
    missing_property_belief_does_not_support_truthful_accusation
    no_human_epistemic_check_records_evidence_without_controller

test result: FAILED. 13 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
