*** crates/tracewake-core/src/events/apply.rs:318:21: replace != with == in apply_agent_event_with_capability

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace != with == in apply_agent_event_with_capability
@@ -310,17 +310,17 @@
             event.event_schema_version.as_str().to_string(),
         ));
     }
 
     if event.stream != event.event_type.stream() {
         return Err(ApplyError::EventKindStreamMismatch);
     }
 
-    if event.stream != EventStream::Agent {
+    if event.stream == /* ~ changed by cargo-mutants ~ */ EventStream::Agent {
         return Ok(ApplyOutcome::NonWorldNoOp);
     }
 
     if event.event_type.requires_cause() && event.causes.is_empty() {
         return Err(ApplyError::MissingCause);
     }
 
     let payload = payload_map(&event.payload);

---- continue_routine_tamper_kind_flip_poisons_replay stdout ----

thread 'continue_routine_tamper_kind_flip_poisons_replay' (21951) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2780:5:
assertion failed: !replay.matches_expected

---- continue_routine_tamper_reason_rewrite_poisons_replay stdout ----

thread 'continue_routine_tamper_reason_rewrite_poisons_replay' (21952) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2802:5:
assertion failed: !replay.matches_expected

---- episode_tamper_output_tag_poisons_replay stdout ----

thread 'episode_tamper_output_tag_poisons_replay' (21953) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2829:5:
assertion failed: !replay.matches_expected

failures:
    continue_routine_tamper_kind_flip_poisons_replay
    continue_routine_tamper_reason_rewrite_poisons_replay
    episode_tamper_output_tag_poisons_replay
    episode_tamper_proration_poisons_replay
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    possession_fixture_preserves_intention_needs_and_can_continue

test result: FAILED. 35 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.31s

*** result: Failure(101)
