*** crates/tracewake-core/src/events/apply.rs:328:9: delete match arm EventKind::NeedDeltaApplied in apply_agent_event_with_capability

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete match arm EventKind::NeedDeltaApplied in apply_agent_event_with_capability
@@ -320,19 +320,17 @@
     }
 
     if event.event_type.requires_cause() && event.causes.is_empty() {
         return Err(ApplyError::MissingCause);
     }
 
     let payload = payload_map(&event.payload);
     match event.event_type {
-        EventKind::NeedDeltaApplied => {
-            apply_need_delta(state, event, &payload).map(|_| ApplyOutcome::Applied)
-        }
+         /* ~ changed by cargo-mutants ~ */
         EventKind::IntentionStarted => {
             apply_intention_started(state, &payload).map(|_| ApplyOutcome::Applied)
         }
         EventKind::IntentionSuspended
         | EventKind::IntentionResumed
         | EventKind::IntentionCompleted
         | EventKind::IntentionFailed
         | EventKind::IntentionAbandoned

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (30049) panicked at crates/tracewake-content/tests/fixtures_load.rs:1217:5:
assertion failed: report.ordinary_pipeline_events > 0

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
