*** crates/tracewake-core/src/events/apply.rs:331:9: delete match arm EventKind::IntentionStarted in apply_agent_event_with_capability

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete match arm EventKind::IntentionStarted in apply_agent_event_with_capability
@@ -323,19 +323,17 @@
         return Err(ApplyError::MissingCause);
     }
 
     let payload = payload_map(&event.payload);
     match event.event_type {
         EventKind::NeedDeltaApplied => {
             apply_need_delta(state, event, &payload).map(|_| ApplyOutcome::Applied)
         }
-        EventKind::IntentionStarted => {
-            apply_intention_started(state, &payload).map(|_| ApplyOutcome::Applied)
-        }
+         /* ~ changed by cargo-mutants ~ */
         EventKind::IntentionSuspended
         | EventKind::IntentionResumed
         | EventKind::IntentionCompleted
         | EventKind::IntentionFailed
         | EventKind::IntentionAbandoned
         | EventKind::IntentionInterrupted
         | EventKind::IntentionContinued => {
             apply_intention_transition(state, event.event_type, &payload)

---- episode_tamper_proration_poisons_replay stdout ----

thread 'episode_tamper_proration_poisons_replay' (1647) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:
agent event applies to live state: NonAgentEvent

---- severe_safety_with_known_exit_produces_move_and_replays stdout ----

thread 'severe_safety_with_known_exit_produces_move_and_replays' (1678) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:
agent event applies to live state: NonAgentEvent

---- wait_then_window_passive_charges_each_tick_once stdout ----

thread 'wait_then_window_passive_charges_each_tick_once' (1683) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:
agent event applies to live state: NonAgentEvent

failures:
    episode_tamper_proration_poisons_replay
    severe_safety_with_known_exit_produces_move_and_replays
    wait_then_window_passive_charges_each_tick_once

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.58s

*** result: Failure(101)
