*** crates/tracewake-core/src/events/apply.rs:334:9: delete match arm EventKind::IntentionSuspended | EventKind::IntentionResumed | EventKind::IntentionCompleted | EventKind::IntentionFailed | EventKind::IntentionAbandoned | EventKind::IntentionInterrupted | EventKind::IntentionContinued in apply_agent_event_with_capability

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete match arm EventKind::IntentionSuspended | EventKind::IntentionResumed | EventKind::IntentionCompleted | EventKind::IntentionFailed | EventKind::IntentionAbandoned | EventKind::IntentionInterrupted | EventKind::IntentionContinued in apply_agent_event_with_capability
@@ -326,26 +326,17 @@
     let payload = payload_map(&event.payload);
     match event.event_type {
         EventKind::NeedDeltaApplied => {
             apply_need_delta(state, event, &payload).map(|_| ApplyOutcome::Applied)
         }
         EventKind::IntentionStarted => {
             apply_intention_started(state, &payload).map(|_| ApplyOutcome::Applied)
         }
-        EventKind::IntentionSuspended
-        | EventKind::IntentionResumed
-        | EventKind::IntentionCompleted
-        | EventKind::IntentionFailed
-        | EventKind::IntentionAbandoned
-        | EventKind::IntentionInterrupted
-        | EventKind::IntentionContinued => {
-            apply_intention_transition(state, event.event_type, &payload)
-                .map(|_| ApplyOutcome::Applied)
-        }
+         /* ~ changed by cargo-mutants ~ */
         EventKind::RoutineStepStarted
         | EventKind::RoutineStepCompleted
         | EventKind::RoutineStepFailed => {
             apply_routine_step_transition(state, event.event_type, &payload)
                 .map(|_| ApplyOutcome::Applied)
         }
         EventKind::DecisionTraceRecorded => {
             require_payload_version(&payload, "trace_schema_version", "1")?;

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (5711) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:
agent event applies to live state: NonAgentEvent

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
