*** crates/tracewake-core/src/events/apply.rs:344:9: delete match arm EventKind::RoutineStepStarted | EventKind::RoutineStepCompleted | EventKind::RoutineStepFailed in apply_agent_event_with_capability

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete match arm EventKind::RoutineStepStarted | EventKind::RoutineStepCompleted | EventKind::RoutineStepFailed in apply_agent_event_with_capability
@@ -336,22 +336,17 @@
         | EventKind::IntentionCompleted
         | EventKind::IntentionFailed
         | EventKind::IntentionAbandoned
         | EventKind::IntentionInterrupted
         | EventKind::IntentionContinued => {
             apply_intention_transition(state, event.event_type, &payload)
                 .map(|_| ApplyOutcome::Applied)
         }
-        EventKind::RoutineStepStarted
-        | EventKind::RoutineStepCompleted
-        | EventKind::RoutineStepFailed => {
-            apply_routine_step_transition(state, event.event_type, &payload)
-                .map(|_| ApplyOutcome::Applied)
-        }
+         /* ~ changed by cargo-mutants ~ */
         EventKind::DecisionTraceRecorded => {
             require_payload_version(&payload, "trace_schema_version", "1")?;
             let trace_id = crate::ids::DecisionTraceId::new(required(&payload, "trace_id")?)
                 .map_err(|_| ApplyError::BadPayload {
                     key: "trace_id",
                     value: required(&payload, "trace_id")
                         .unwrap_or_default()
                         .to_string(),

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (9743) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:
agent event applies to live state: NonAgentEvent

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
