*** crates/tracewake-core/src/events/apply.rs:350:9: delete match arm EventKind::DecisionTraceRecorded in apply_agent_event_with_capability

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete match arm EventKind::DecisionTraceRecorded in apply_agent_event_with_capability
@@ -342,44 +342,17 @@
                 .map(|_| ApplyOutcome::Applied)
         }
         EventKind::RoutineStepStarted
         | EventKind::RoutineStepCompleted
         | EventKind::RoutineStepFailed => {
             apply_routine_step_transition(state, event.event_type, &payload)
                 .map(|_| ApplyOutcome::Applied)
         }
-        EventKind::DecisionTraceRecorded => {
-            require_payload_version(&payload, "trace_schema_version", "1")?;
-            let trace_id = crate::ids::DecisionTraceId::new(required(&payload, "trace_id")?)
-                .map_err(|_| ApplyError::BadPayload {
-                    key: "trace_id",
-                    value: required(&payload, "trace_id")
-                        .unwrap_or_default()
-                        .to_string(),
-                })?;
-            let record = crate::agent::DecisionTraceRecord::deserialize_canonical(
-                required(&payload, "trace_canonical")?.as_bytes(),
-            )
-            .map_err(|_| ApplyError::BadPayload {
-                key: "trace_canonical",
-                value: required(&payload, "trace_canonical")
-                    .unwrap_or_default()
-                    .to_string(),
-            })?;
-            if record.trace_id != trace_id {
-                return Err(ApplyError::BadPayload {
-                    key: "trace_id",
-                    value: trace_id.to_string(),
-                });
-            }
-            validate_typed_diagnostic_payload(&payload, &record.typed_diagnostic)?;
-            state.decision_traces.insert(trace_id, record);
-            Ok(ApplyOutcome::Applied)
-        }
+         /* ~ changed by cargo-mutants ~ */
         EventKind::StuckDiagnosticRecorded => {
             require_payload_version(&payload, "diagnostic_schema_version", "1")?;
             let diagnostic_id =
                 crate::ids::StuckDiagnosticId::new(required(&payload, "diagnostic_id")?).map_err(
                     |_| ApplyError::BadPayload {
                         key: "diagnostic_id",
                         value: required(&payload, "diagnostic_id")
                             .unwrap_or_default()

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (13774) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:
agent event applies to live state: NonAgentEvent

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
