*** crates/tracewake-core/src/events/apply.rs:368:32: replace != with == in apply_agent_event_with_capability

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace != with == in apply_agent_event_with_capability
@@ -360,17 +360,17 @@
                 required(&payload, "trace_canonical")?.as_bytes(),
             )
             .map_err(|_| ApplyError::BadPayload {
                 key: "trace_canonical",
                 value: required(&payload, "trace_canonical")
                     .unwrap_or_default()
                     .to_string(),
             })?;
-            if record.trace_id != trace_id {
+            if record.trace_id == /* ~ changed by cargo-mutants ~ */ trace_id {
                 return Err(ApplyError::BadPayload {
                     key: "trace_id",
                     value: trace_id.to_string(),
                 });
             }
             validate_typed_diagnostic_payload(&payload, &record.typed_diagnostic)?;
             state.decision_traces.insert(trace_id, record);
             Ok(ApplyOutcome::Applied)

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (15195) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:
agent event applies to live state: BadPayload { key: "trace_id", value: "trace_decision_actor_mara_0_goal_actor_mara_0_continue_current_intention" }

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
