*** crates/tracewake-core/src/events/apply.rs:378:9: delete match arm EventKind::StuckDiagnosticRecorded in apply_agent_event_with_capability

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete match arm EventKind::StuckDiagnosticRecorded in apply_agent_event_with_capability
@@ -370,46 +370,17 @@
                     key: "trace_id",
                     value: trace_id.to_string(),
                 });
             }
             validate_typed_diagnostic_payload(&payload, &record.typed_diagnostic)?;
             state.decision_traces.insert(trace_id, record);
             Ok(ApplyOutcome::Applied)
         }
-        EventKind::StuckDiagnosticRecorded => {
-            require_payload_version(&payload, "diagnostic_schema_version", "1")?;
-            let diagnostic_id =
-                crate::ids::StuckDiagnosticId::new(required(&payload, "diagnostic_id")?).map_err(
-                    |_| ApplyError::BadPayload {
-                        key: "diagnostic_id",
-                        value: required(&payload, "diagnostic_id")
-                            .unwrap_or_default()
-                            .to_string(),
-                    },
-                )?;
-            let record = crate::agent::StuckDiagnostic::deserialize_canonical(
-                required(&payload, "diagnostic_canonical")?.as_bytes(),
-            )
-            .map_err(|_| ApplyError::BadPayload {
-                key: "diagnostic_canonical",
-                value: required(&payload, "diagnostic_canonical")
-                    .unwrap_or_default()
-                    .to_string(),
-            })?;
-            if record.diagnostic_id != diagnostic_id {
-                return Err(ApplyError::BadPayload {
-                    key: "diagnostic_id",
-                    value: diagnostic_id.to_string(),
-                });
-            }
-            validate_typed_diagnostic_payload(&payload, &record.typed_diagnostic)?;
-            state.stuck_diagnostics.insert(diagnostic_id, record);
-            Ok(ApplyOutcome::Applied)
-        }
+         /* ~ changed by cargo-mutants ~ */
         EventKind::NeedThresholdCrossed => {
             require_payload_version(&payload, "payload_schema_version", "1")?;
             let actor_id = ActorId::new(required(&payload, "actor_id")?).map_err(|_| {
                 ApplyError::BadPayload {
                     key: "actor_id",
                     value: required(&payload, "actor_id")
                         .unwrap_or_default()
                         .to_string(),

---- no_human_sleep_knowledge_requires_observation_or_record_channel stdout ----

thread 'no_human_sleep_knowledge_requires_observation_or_record_channel' (17852) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:3036:5:
assertion failed: !report.stuck_diagnostic_event_ids.is_empty()

---- no_human_workplace_knowledge_requires_notice_channel stdout ----

thread 'no_human_workplace_knowledge_requires_notice_channel' (17853) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:3001:5:
assertion failed: !report.stuck_diagnostic_event_ids.is_empty()

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (17848) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2715:5:
assertion `left == right` failed
  left: PhysicalChecksum("twc1-301be54dfb7dfb00")
 right: PhysicalChecksum("twc1-68ee74360d03d456")

failures:
    no_human_day_real_run_replays_metrics_and_trace_projection
    no_human_sleep_knowledge_requires_observation_or_record_channel
    no_human_workplace_knowledge_requires_notice_channel

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.41s

*** result: Failure(101)
