*** crates/tracewake-core/src/events/apply.rs:398:37: replace != with == in apply_agent_event_with_capability

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace != with == in apply_agent_event_with_capability
@@ -390,17 +390,17 @@
                 required(&payload, "diagnostic_canonical")?.as_bytes(),
             )
             .map_err(|_| ApplyError::BadPayload {
                 key: "diagnostic_canonical",
                 value: required(&payload, "diagnostic_canonical")
                     .unwrap_or_default()
                     .to_string(),
             })?;
-            if record.diagnostic_id != diagnostic_id {
+            if record.diagnostic_id == /* ~ changed by cargo-mutants ~ */ diagnostic_id {
                 return Err(ApplyError::BadPayload {
                     key: "diagnostic_id",
                     value: diagnostic_id.to_string(),
                 });
             }
             validate_typed_diagnostic_payload(&payload, &record.typed_diagnostic)?;
             state.stuck_diagnostics.insert(diagnostic_id, record);
             Ok(ApplyOutcome::Applied)

---- no_human_workplace_knowledge_requires_notice_channel stdout ----

thread 'no_human_workplace_knowledge_requires_notice_channel' (19274) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:3001:5:
assertion failed: !report.stuck_diagnostic_event_ids.is_empty()

---- no_human_sleep_knowledge_requires_observation_or_record_channel stdout ----

thread 'no_human_sleep_knowledge_requires_observation_or_record_channel' (19273) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:3036:5:
assertion failed: !report.stuck_diagnostic_event_ids.is_empty()

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (19269) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2715:5:
assertion `left == right` failed
  left: PhysicalChecksum("twc1-301be54dfb7dfb00")
 right: PhysicalChecksum("twc1-68ee74360d03d456")

failures:
    no_human_day_real_run_replays_metrics_and_trace_projection
    no_human_sleep_knowledge_requires_observation_or_record_channel
    no_human_workplace_knowledge_requires_notice_channel

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.40s

*** result: Failure(101)
