*** crates/tracewake-core/src/events/apply.rs:408:9: delete match arm EventKind::NeedThresholdCrossed in apply_agent_event_with_capability

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete match arm EventKind::NeedThresholdCrossed in apply_agent_event_with_capability
@@ -400,68 +400,17 @@
                     key: "diagnostic_id",
                     value: diagnostic_id.to_string(),
                 });
             }
             validate_typed_diagnostic_payload(&payload, &record.typed_diagnostic)?;
             state.stuck_diagnostics.insert(diagnostic_id, record);
             Ok(ApplyOutcome::Applied)
         }
-        EventKind::NeedThresholdCrossed => {
-            require_payload_version(&payload, "payload_schema_version", "1")?;
-            let actor_id = ActorId::new(required(&payload, "actor_id")?).map_err(|_| {
-                ApplyError::BadPayload {
-                    key: "actor_id",
-                    value: required(&payload, "actor_id")
-                        .unwrap_or_default()
-                        .to_string(),
-                }
-            })?;
-            let need_kind = match required(&payload, "need_kind")? {
-                "hunger" => NeedKind::Hunger,
-                "fatigue" => NeedKind::Fatigue,
-                "safety" => NeedKind::Safety,
-                value => {
-                    return Err(ApplyError::BadPayload {
-                        key: "need_kind",
-                        value: value.to_string(),
-                    });
-                }
-            };
-            let from_value = required(&payload, "from_value")?
-                .parse::<u16>()
-                .map_err(|_| ApplyError::BadPayload {
-                    key: "from_value",
-                    value: required(&payload, "from_value")
-                        .unwrap_or_default()
-                        .to_string(),
-                })?;
-            let to_value = required(&payload, "to_value")?
-                .parse::<u16>()
-                .map_err(|_| ApplyError::BadPayload {
-                    key: "to_value",
-                    value: required(&payload, "to_value")
-                        .unwrap_or_default()
-                        .to_string(),
-                })?;
-            state.need_threshold_crossings.insert(
-                event.event_id.clone(),
-                crate::state::NeedThresholdCrossingRecord {
-                    event_id: event.event_id.clone(),
-                    actor_id,
-                    need_kind,
-                    from_value,
-                    to_value,
-                    from_band: required(&payload, "from_band")?.to_string(),
-                    to_band: required(&payload, "to_band")?.to_string(),
-                    payload_fields: payload_fields(event),
-                },
-            );
-            Ok(ApplyOutcome::Applied)
-        }
+         /* ~ changed by cargo-mutants ~ */
         EventKind::SleepStarted
         | EventKind::SleepCompleted
         | EventKind::SleepInterrupted
         | EventKind::FoodServiceUsed
         | EventKind::EatFailed
         | EventKind::WorkBlockStarted
         | EventKind::WorkBlockCompleted
         | EventKind::WorkBlockFailed => {

---- episode_tamper_output_tag_poisons_replay stdout ----

thread 'episode_tamper_output_tag_poisons_replay' (21938) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:598:65:
called `Result::unwrap()` on an `Err` value: Agent(NonAgentEvent)

---- no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash stdout ----

thread 'no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash' (21948) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2907:5:
[Phase3AReplayFailure { event_position: 11, event_kind: DecisionTraceRecorded, schema_version: "event_schema_v1", issue: "prefix_apply_error:Agent(NonAgentEvent)", actor_id: Some("actor_bruno"), routine_id: None, trace_id: Some("trace_decision_actor_bruno_0_goal_actor_bruno_0_eat") }]

---- serialized_event_log_replays_to_identical_state stdout ----

thread 'serialized_event_log_replays_to_identical_state' (21969) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:598:65:
called `Result::unwrap()` on an `Err` value: Agent(NonAgentEvent)

failures:
    episode_tamper_output_tag_poisons_replay
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash
    no_human_decision_context_hash_gate_fails_when_source_evidence_tampered
    no_human_need_ledger_has_no_duplicate_regime_charges
    serialized_event_log_replays_to_identical_state
    sleep_eat_work_fixture_logs_need_effects_and_replays

test result: FAILED. 34 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
