*** crates/tracewake-core/src/events/apply.rs:460:9: delete match arm EventKind::SleepStarted | EventKind::SleepCompleted | EventKind::SleepInterrupted | EventKind::FoodServiceUsed | EventKind::EatFailed | EventKind::WorkBlockStarted | EventKind::WorkBlockCompleted | EventKind::WorkBlockFailed in apply_agent_event_with_capability

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete match arm EventKind::SleepStarted | EventKind::SleepCompleted | EventKind::SleepInterrupted | EventKind::FoodServiceUsed | EventKind::EatFailed | EventKind::WorkBlockStarted | EventKind::WorkBlockCompleted | EventKind::WorkBlockFailed in apply_agent_event_with_capability
@@ -452,48 +452,17 @@
                     to_value,
                     from_band: required(&payload, "from_band")?.to_string(),
                     to_band: required(&payload, "to_band")?.to_string(),
                     payload_fields: payload_fields(event),
                 },
             );
             Ok(ApplyOutcome::Applied)
         }
-        EventKind::SleepStarted
-        | EventKind::SleepCompleted
-        | EventKind::SleepInterrupted
-        | EventKind::FoodServiceUsed
-        | EventKind::EatFailed
-        | EventKind::WorkBlockStarted
-        | EventKind::WorkBlockCompleted
-        | EventKind::WorkBlockFailed => {
-            require_payload_version(&payload, "payload_schema_version", "1")?;
-            reject_duplicate_duration_terminal(state, event)?;
-            state.ordinary_life_episodes.insert(
-                event.event_id.clone(),
-                crate::state::OrdinaryLifeEpisodeRecord {
-                    event_id: event.event_id.clone(),
-                    event_kind: event.event_type.stable_id().to_string(),
-                    actor_id: event.actor_id.clone(),
-                    proposal_id: event.proposal_id.clone(),
-                    caused_event_ids: event
-                        .causes
-                        .iter()
-                        .filter_map(|cause| match cause {
-                            EventCause::Event(event_id) => Some(event_id.clone()),
-                            _ => None,
-                        })
-                        .collect(),
-                    sim_tick: event.sim_tick,
-                    payload_fields: payload_fields(event),
-                    summary: event.effects_summary.clone(),
-                },
-            );
-            Ok(ApplyOutcome::Applied)
-        }
+         /* ~ changed by cargo-mutants ~ */
         EventKind::CandidateGoalsEvaluated => {
             require_payload_version(&payload, "payload_schema_version", "1")?;
             state.candidate_goal_evaluations.insert(
                 event.event_id.clone(),
                 crate::state::CandidateGoalEvaluationRecord {
                     event_id: event.event_id.clone(),
                     event_kind: event.event_type.stable_id().to_string(),
                     actor_id: event.actor_id.clone(),

---- episode_tamper_output_tag_poisons_replay stdout ----

thread 'episode_tamper_output_tag_poisons_replay' (26037) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:993:10:
sleep starts

---- ordinary_workday_fixture_moves_before_work_completion stdout ----

thread 'ordinary_workday_fixture_moves_before_work_completion' (26052) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1142:10:
work starts after movement ancestry

---- serialized_event_log_replays_to_identical_state stdout ----

thread 'serialized_event_log_replays_to_identical_state' (26068) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:993:10:
sleep starts

failures:
    episode_tamper_output_tag_poisons_replay
    episode_tamper_proration_poisons_replay
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    ordinary_workday_fixture_moves_before_work_completion
    serialized_event_log_replays_to_identical_state
    sleep_eat_work_fixture_logs_need_effects_and_replays
    sleep_spanning_window_boundary_charges_each_tick_once
    work_block_failed_then_sleep_succeeds_fixture_closes_reservation

test result: FAILED. 33 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.31s

*** result: Failure(101)
