*** crates/tracewake-core/src/events/apply.rs:481:29: delete match arm EventCause::Event(event_id) in apply_agent_event_with_capability

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete match arm EventCause::Event(event_id) in apply_agent_event_with_capability
@@ -473,17 +473,17 @@
                     event_id: event.event_id.clone(),
                     event_kind: event.event_type.stable_id().to_string(),
                     actor_id: event.actor_id.clone(),
                     proposal_id: event.proposal_id.clone(),
                     caused_event_ids: event
                         .causes
                         .iter()
                         .filter_map(|cause| match cause {
-                            EventCause::Event(event_id) => Some(event_id.clone()),
+                             /* ~ changed by cargo-mutants ~ */
                             _ => None,
                         })
                         .collect(),
                     sim_tick: event.sim_tick,
                     payload_fields: payload_fields(event),
                     summary: event.effects_summary.clone(),
                 },
             );

---- events::apply::tests::duplicate_duration_terminal_rejected_live stdout ----

thread 'events::apply::tests::duplicate_duration_terminal_rejected_live' (23695) panicked at crates/tracewake-core/src/events/apply.rs:2361:9:
assertion `left == right` failed
  left: Ok(Applied)
 right: Err(DuplicateDurationTerminal { start_event_id: EventId(StableId("event.work.started.actor_tomas")) })

failures:
    events::apply::tests::duplicate_duration_terminal_rejected_live

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
