*** crates/tracewake-core/src/events/apply.rs:48:21: replace != with == in apply_event_stream

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace != with == in apply_event_stream
@@ -40,17 +40,17 @@
     Agent(ApplyError),
     Epistemic(EpistemicApplyError),
 }
 
 pub fn apply_event_stream(
     context: &mut EventApplicationContext<'_>,
     event: &EventEnvelope,
 ) -> Result<ApplyOutcome, EventApplicationError> {
-    if event.stream != event.event_type.stream() {
+    if event.stream == /* ~ changed by cargo-mutants ~ */ event.event_type.stream() {
         return Err(EventApplicationError::World(
             ApplyError::EventKindStreamMismatch,
         ));
     }
 
     match event.stream {
         EventStream::World => {
             apply_event(context.physical_state, event).map_err(EventApplicationError::World)

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (12800) panicked at crates/tracewake-content/tests/fixtures_load.rs:1217:5:
assertion failed: report.ordinary_pipeline_events > 0

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
