*** crates/tracewake-core/src/events/apply.rs:492:9: delete match arm EventKind::CandidateGoalsEvaluated in apply_agent_event_with_capability

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete match arm EventKind::CandidateGoalsEvaluated in apply_agent_event_with_capability
@@ -484,33 +484,17 @@
                         .collect(),
                     sim_tick: event.sim_tick,
                     payload_fields: payload_fields(event),
                     summary: event.effects_summary.clone(),
                 },
             );
             Ok(ApplyOutcome::Applied)
         }
-        EventKind::CandidateGoalsEvaluated => {
-            require_payload_version(&payload, "payload_schema_version", "1")?;
-            state.candidate_goal_evaluations.insert(
-                event.event_id.clone(),
-                crate::state::CandidateGoalEvaluationRecord {
-                    event_id: event.event_id.clone(),
-                    event_kind: event.event_type.stable_id().to_string(),
-                    actor_id: event.actor_id.clone(),
-                    proposal_id: event.proposal_id.clone(),
-                    caused_event_ids: caused_event_ids(event),
-                    sim_tick: event.sim_tick,
-                    payload_fields: payload_fields(event),
-                    summary: event.effects_summary.clone(),
-                },
-            );
-            Ok(ApplyOutcome::Applied)
-        }
+         /* ~ changed by cargo-mutants ~ */
         EventKind::ContinueRoutineProposed
         | EventKind::ContinueRoutineAccepted
         | EventKind::ContinueRoutineRejected => {
             require_payload_version(&payload, "payload_schema_version", "1")?;
             state.continue_routine_arbitrations.insert(
                 event.event_id.clone(),
                 crate::state::ContinueRoutineArbitrationRecord {
                     event_id: event.event_id.clone(),

---- agent_stream_event_kinds_have_explicit_agent_apply_arms stdout ----

thread 'agent_stream_event_kinds_have_explicit_agent_apply_arms' (30664) panicked at crates/tracewake-core/tests/anti_regression_guards.rs:9142:5:
agent-stream event kinds lack explicit agent apply arms or no-op allowlist entries: [CandidateGoalsEvaluated]

---- materialized_agent_apply_arms_require_payload_schema_version stdout ----

thread 'materialized_agent_apply_arms_require_payload_schema_version' (30715) panicked at crates/tracewake-core/tests/anti_regression_guards.rs:8105:5:
assertion `left == right` failed: derived apply-arm census must cover every checksum-covered AgentState map
  left: {"active_intention_by_actor", "continue_routine_arbitrations", "decision_traces", "intentions", "need_threshold_crossings", "need_tick_charges", "needs_by_actor", "ordinary_life_episodes", "routine_executions", "stuck_diagnostics"}
 right: {"active_intention_by_actor", "candidate_goal_evaluations", "continue_routine_arbitrations", "decision_traces", "intentions", "need_threshold_crossings", "need_tick_charges", "needs_by_actor", "ordinary_life_episodes", "routine_executions", "stuck_diagnostics"}

failures:
    agent_stream_event_kinds_have_explicit_agent_apply_arms
    materialized_agent_apply_arms_require_payload_schema_version

test result: FAILED. 78 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.35s

*** result: Failure(101)
