*** crates/tracewake-core/src/events/apply.rs:509:9: delete match arm EventKind::ContinueRoutineProposed | EventKind::ContinueRoutineAccepted | EventKind::ContinueRoutineRejected in apply_agent_event_with_capability

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete match arm EventKind::ContinueRoutineProposed | EventKind::ContinueRoutineAccepted | EventKind::ContinueRoutineRejected in apply_agent_event_with_capability
@@ -501,35 +501,17 @@
                     caused_event_ids: caused_event_ids(event),
                     sim_tick: event.sim_tick,
                     payload_fields: payload_fields(event),
                     summary: event.effects_summary.clone(),
                 },
             );
             Ok(ApplyOutcome::Applied)
         }
-        EventKind::ContinueRoutineProposed
-        | EventKind::ContinueRoutineAccepted
-        | EventKind::ContinueRoutineRejected => {
-            require_payload_version(&payload, "payload_schema_version", "1")?;
-            state.continue_routine_arbitrations.insert(
-                event.event_id.clone(),
-                crate::state::ContinueRoutineArbitrationRecord {
-                    event_id: event.event_id.clone(),
-                    event_kind: event.event_type.stable_id().to_string(),
-                    actor_id: event.actor_id.clone(),
-                    proposal_id: event.proposal_id.clone(),
-                    caused_event_ids: caused_event_ids(event),
-                    sim_tick: event.sim_tick,
-                    payload_fields: payload_fields(event),
-                    summary: event.effects_summary.clone(),
-                },
-            );
-            Ok(ApplyOutcome::Applied)
-        }
+         /* ~ changed by cargo-mutants ~ */
         kind if AGENT_WORLD_NOOP_ALLOWLIST.contains(&kind) => Ok(ApplyOutcome::WorldNoOp),
         _ => Err(ApplyError::NonAgentEvent),
     }
 }
 
 fn caused_event_ids(event: &EventEnvelope) -> Vec<EventId> {
     event
         .causes

---- continue_routine_tamper_kind_flip_poisons_replay stdout ----

thread 'continue_routine_tamper_kind_flip_poisons_replay' (2326) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2781:5:
assertion failed: !replay.agent_checksum_matches

---- continue_routine_tamper_reason_rewrite_poisons_replay stdout ----

thread 'continue_routine_tamper_reason_rewrite_poisons_replay' (2327) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2803:5:
assertion failed: !replay.agent_checksum_matches

---- possession_fixture_preserves_intention_needs_and_can_continue stdout ----

thread 'possession_fixture_preserves_intention_needs_and_can_continue' (2350) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1878:5:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    continue_routine_tamper_kind_flip_poisons_replay
    continue_routine_tamper_reason_rewrite_poisons_replay
    possession_fixture_preserves_intention_needs_and_can_continue

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.57s

*** result: Failure(101)
