*** crates/tracewake-core/src/events/apply.rs:528:17: replace match guard AGENT_WORLD_NOOP_ALLOWLIST.contains(&kind) with true in apply_agent_event_with_capability

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace match guard AGENT_WORLD_NOOP_ALLOWLIST.contains(&kind) with true in apply_agent_event_with_capability
@@ -520,17 +520,17 @@
                     caused_event_ids: caused_event_ids(event),
                     sim_tick: event.sim_tick,
                     payload_fields: payload_fields(event),
                     summary: event.effects_summary.clone(),
                 },
             );
             Ok(ApplyOutcome::Applied)
         }
-        kind if AGENT_WORLD_NOOP_ALLOWLIST.contains(&kind) => Ok(ApplyOutcome::WorldNoOp),
+        kind if true /* ~ changed by cargo-mutants ~ */ => Ok(ApplyOutcome::WorldNoOp),
         _ => Err(ApplyError::NonAgentEvent),
     }
 }
 
 fn caused_event_ids(event: &EventEnvelope) -> Vec<EventId> {
     event
         .causes
         .iter()

---- agent_noop_allowlist_remains_narrow_and_behavioral stdout ----

thread 'agent_noop_allowlist_remains_narrow_and_behavioral' (7039) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:2689:5:
agent no-op fallback must stay tied to the explicit allowlist

failures:
    agent_noop_allowlist_remains_narrow_and_behavioral

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
