*** crates/tracewake-core/src/events/apply.rs:528:17: replace match guard AGENT_WORLD_NOOP_ALLOWLIST.contains(&kind) with false in apply_agent_event_with_capability

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace match guard AGENT_WORLD_NOOP_ALLOWLIST.contains(&kind) with false in apply_agent_event_with_capability
@@ -520,17 +520,17 @@
                     caused_event_ids: caused_event_ids(event),
                     sim_tick: event.sim_tick,
                     payload_fields: payload_fields(event),
                     summary: event.effects_summary.clone(),
                 },
             );
             Ok(ApplyOutcome::Applied)
         }
-        kind if AGENT_WORLD_NOOP_ALLOWLIST.contains(&kind) => Ok(ApplyOutcome::WorldNoOp),
+        kind if false /* ~ changed by cargo-mutants ~ */ => Ok(ApplyOutcome::WorldNoOp),
         _ => Err(ApplyError::NonAgentEvent),
     }
 }
 
 fn caused_event_ids(event: &EventEnvelope) -> Vec<EventId> {
     event
         .causes
         .iter()

---- no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash stdout ----

thread 'no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash' (11140) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2907:5:
[Phase3AReplayFailure { event_position: 11, event_kind: DecisionTraceRecorded, schema_version: "event_schema_v1", issue: "prefix_apply_error:Agent(NonAgentEvent)", actor_id: Some("actor_bruno"), routine_id: None, trace_id: Some("trace_decision_actor_bruno_0_goal_actor_bruno_0_eat") }]

---- severe_safety_with_known_exit_produces_move_and_replays stdout ----

thread 'severe_safety_with_known_exit_produces_move_and_replays' (11162) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1735:5:

---- no_human_decision_context_hash_gate_fails_when_source_evidence_tampered stdout ----

thread 'no_human_decision_context_hash_gate_fails_when_source_evidence_tampered' (11141) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2963:5:

failures:
    no_human_day_real_run_replays_metrics_and_trace_projection
    no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash
    no_human_decision_context_hash_gate_fails_when_source_evidence_tampered
    severe_safety_with_known_exit_produces_move_and_replays

test result: FAILED. 38 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.29s

*** result: Failure(101)
