*** crates/tracewake-core/src/events/apply.rs:534:5: replace caused_event_ids -> Vec<EventId> with vec![]

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace caused_event_ids -> Vec<EventId> with vec![]
@@ -526,24 +526,17 @@
             Ok(ApplyOutcome::Applied)
         }
         kind if AGENT_WORLD_NOOP_ALLOWLIST.contains(&kind) => Ok(ApplyOutcome::WorldNoOp),
         _ => Err(ApplyError::NonAgentEvent),
     }
 }
 
 fn caused_event_ids(event: &EventEnvelope) -> Vec<EventId> {
-    event
-        .causes
-        .iter()
-        .filter_map(|cause| match cause {
-            EventCause::Event(event_id) => Some(event_id.clone()),
-            _ => None,
-        })
-        .collect()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn payload_fields(event: &EventEnvelope) -> Vec<(String, String)> {
     let mut fields = event
         .payload
         .iter()
         .map(|field| (field.key.clone(), field.value.clone()))
         .collect::<Vec<_>>();

---- agent_apply_matrix_observes_parser_arms_transitions_and_causality stdout ----

thread 'agent_apply_matrix_observes_parser_arms_transitions_and_causality' (28528) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:2597:5:
assertion `left == right` failed
  left: []
 right: [EventId(StableId("event_candidate_cause_source_matrix"))]

failures:
    agent_apply_matrix_observes_parser_arms_transitions_and_causality

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
