*** crates/tracewake-core/src/events/apply.rs:545:5: replace payload_fields -> Vec<(String, String)> with vec![("xyzzy".into(), "xyzzy".into())]

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace payload_fields -> Vec<(String, String)> with vec![("xyzzy".into(), "xyzzy".into())]
@@ -537,23 +537,17 @@
         .filter_map(|cause| match cause {
             EventCause::Event(event_id) => Some(event_id.clone()),
             _ => None,
         })
         .collect()
 }
 
 fn payload_fields(event: &EventEnvelope) -> Vec<(String, String)> {
-    let mut fields = event
-        .payload
-        .iter()
-        .map(|field| (field.key.clone(), field.value.clone()))
-        .collect::<Vec<_>>();
-    fields.sort();
-    fields
+    vec![("xyzzy".into(), "xyzzy".into())] /* ~ changed by cargo-mutants ~ */
 }
 
 fn reject_duplicate_duration_terminal(
     state: &AgentState,
     event: &EventEnvelope,
 ) -> Result<(), ApplyError> {
     if !is_duration_terminal(event.event_type) {
         return Ok(());

---- continue_routine_tamper_reason_rewrite_poisons_replay stdout ----

thread 'continue_routine_tamper_reason_rewrite_poisons_replay' (21257) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2802:5:
assertion failed: !replay.matches_expected

---- episode_tamper_output_tag_poisons_replay stdout ----

thread 'episode_tamper_output_tag_poisons_replay' (21258) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2829:5:
assertion failed: !replay.matches_expected

---- episode_tamper_proration_poisons_replay stdout ----

thread 'episode_tamper_proration_poisons_replay' (21259) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2870:5:
assertion failed: !replay.matches_expected

failures:
    continue_routine_tamper_reason_rewrite_poisons_replay
    episode_tamper_output_tag_poisons_replay
    episode_tamper_proration_poisons_replay

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.59s

*** result: Failure(101)
