*** crates/tracewake-core/src/events/apply.rs:558:8: delete ! in reject_duplicate_duration_terminal

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete ! in reject_duplicate_duration_terminal
@@ -550,17 +550,17 @@
     fields.sort();
     fields
 }
 
 fn reject_duplicate_duration_terminal(
     state: &AgentState,
     event: &EventEnvelope,
 ) -> Result<(), ApplyError> {
-    if !is_duration_terminal(event.event_type) {
+    if  /* ~ changed by cargo-mutants ~ */is_duration_terminal(event.event_type) {
         return Ok(());
     }
     for start_event_id in event.causes.iter().filter_map(|cause| match cause {
         EventCause::Event(event_id) => Some(event_id),
         _ => None,
     }) {
         let already_terminated = state.ordinary_life_episodes.values().any(|episode| {
             matches!(

---- events::apply::tests::duplicate_duration_terminal_rejected_live stdout ----

thread 'events::apply::tests::duplicate_duration_terminal_rejected_live' (30252) panicked at crates/tracewake-core/src/events/apply.rs:2361:9:
assertion `left == right` failed
  left: Ok(Applied)
 right: Err(DuplicateDurationTerminal { start_event_id: EventId(StableId("event.work.started.actor_tomas")) })

failures:
    events::apply::tests::duplicate_duration_terminal_rejected_live

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
