*** crates/tracewake-core/src/events/apply.rs:572:15: replace && with || in reject_duplicate_duration_terminal

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace && with || in reject_duplicate_duration_terminal
@@ -564,17 +564,17 @@
     }) {
         let already_terminated = state.ordinary_life_episodes.values().any(|episode| {
             matches!(
                 episode.event_kind.as_str(),
                 "sleep_completed"
                     | "sleep_interrupted"
                     | "work_block_completed"
                     | "work_block_failed"
-            ) && episode
+            ) || /* ~ changed by cargo-mutants ~ */ episode
                 .caused_event_ids
                 .iter()
                 .any(|id| id == start_event_id)
         });
         if already_terminated {
             return Err(ApplyError::DuplicateDurationTerminal {
                 start_event_id: start_event_id.clone(),
             });

---- episode_tamper_output_tag_poisons_replay stdout ----

thread 'episode_tamper_output_tag_poisons_replay' (2019) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:598:65:
called `Result::unwrap()` on an `Err` value: Agent(DuplicateDurationTerminal { start_event_id: EventId(StableId("event.work_block_started.proposal_sleep_eat_work_work")) })

---- serialized_event_log_replays_to_identical_state stdout ----

thread 'serialized_event_log_replays_to_identical_state' (2050) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:598:65:
called `Result::unwrap()` on an `Err` value: Agent(DuplicateDurationTerminal { start_event_id: EventId(StableId("event.work_block_started.proposal_sleep_eat_work_work")) })

---- sleep_eat_work_fixture_logs_need_effects_and_replays stdout ----

thread 'sleep_eat_work_fixture_logs_need_effects_and_replays' (2053) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:598:65:
called `Result::unwrap()` on an `Err` value: Agent(DuplicateDurationTerminal { start_event_id: EventId(StableId("event.work_block_started.proposal_sleep_eat_work_work")) })

failures:
    episode_tamper_output_tag_poisons_replay
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    serialized_event_log_replays_to_identical_state
    sleep_eat_work_fixture_logs_need_effects_and_replays

test result: FAILED. 37 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.40s

*** result: Failure(101)
