*** crates/tracewake-core/src/events/apply.rs:596:19: replace != with == in validate_typed_diagnostic_payload

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace != with == in validate_typed_diagnostic_payload
@@ -588,17 +588,17 @@
     typed: &crate::agent::TypedDiagnosticFields,
 ) -> Result<(), ApplyError> {
     if let Some(value) = payload.get("responsible_layer") {
         let parsed =
             crate::agent::ResponsibleLayer::parse(value).map_err(|_| ApplyError::BadPayload {
                 key: "responsible_layer",
                 value: (*value).to_string(),
             })?;
-        if parsed != typed.responsible_layer {
+        if parsed == /* ~ changed by cargo-mutants ~ */ typed.responsible_layer {
             return Err(ApplyError::BadPayload {
                 key: "responsible_layer",
                 value: (*value).to_string(),
             });
         }
     }
     if let Some(value) = payload.get("blocker_code") {
         let parsed =

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (14886) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:
agent event applies to live state: BadPayload { key: "responsible_layer", value: "candidate_generation" }

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
