*** crates/tracewake-core/src/events/apply.rs:609:19: replace != with == in validate_typed_diagnostic_payload

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace != with == in validate_typed_diagnostic_payload
@@ -601,17 +601,17 @@
         }
     }
     if let Some(value) = payload.get("blocker_code") {
         let parsed =
             crate::agent::BlockerCode::parse(value).map_err(|_| ApplyError::BadPayload {
                 key: "blocker_code",
                 value: (*value).to_string(),
             })?;
-        if parsed != typed.blocker_code {
+        if parsed == /* ~ changed by cargo-mutants ~ */ typed.blocker_code {
             return Err(ApplyError::BadPayload {
                 key: "blocker_code",
                 value: (*value).to_string(),
             });
         }
     }
     if let Some(value) = payload.get("hidden_truth_referenced") {
         let parsed = match *value {

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (18917) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:
agent event applies to live state: BadPayload { key: "blocker_code", value: "none" }

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
