*** crates/tracewake-core/src/events/apply.rs:618:13: delete match arm "true" in validate_typed_diagnostic_payload

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete match arm "true" in validate_typed_diagnostic_payload
@@ -610,17 +610,17 @@
             return Err(ApplyError::BadPayload {
                 key: "blocker_code",
                 value: (*value).to_string(),
             });
         }
     }
     if let Some(value) = payload.get("hidden_truth_referenced") {
         let parsed = match *value {
-            "true" => true,
+             /* ~ changed by cargo-mutants ~ */
             "false" => false,
             _ => {
                 return Err(ApplyError::BadPayload {
                     key: "hidden_truth_referenced",
                     value: (*value).to_string(),
                 });
             }
         };

---- typed_diagnostic_hidden_truth_true_is_validated_and_replayed stdout ----

thread 'typed_diagnostic_hidden_truth_true_is_validated_and_replayed' (23618) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:2654:5:
assertion `left == right` failed
  left: Err(BadPayload { key: "hidden_truth_referenced", value: "true" })
 right: Ok(Applied)

failures:
    typed_diagnostic_hidden_truth_true_is_validated_and_replayed

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
