*** crates/tracewake-core/src/events/apply.rs:619:13: delete match arm "false" in validate_typed_diagnostic_payload

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete match arm "false" in validate_typed_diagnostic_payload
@@ -611,17 +611,17 @@
                 key: "blocker_code",
                 value: (*value).to_string(),
             });
         }
     }
     if let Some(value) = payload.get("hidden_truth_referenced") {
         let parsed = match *value {
             "true" => true,
-            "false" => false,
+             /* ~ changed by cargo-mutants ~ */
             _ => {
                 return Err(ApplyError::BadPayload {
                     key: "hidden_truth_referenced",
                     value: (*value).to_string(),
                 });
             }
         };
         if parsed != typed.hidden_truth_referenced {

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (27650) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:
agent event applies to live state: BadPayload { key: "hidden_truth_referenced", value: "false" }

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
