*** crates/tracewake-core/src/events/apply.rs:627:19: replace != with == in validate_typed_diagnostic_payload

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace != with == in validate_typed_diagnostic_payload
@@ -619,17 +619,17 @@
             "false" => false,
             _ => {
                 return Err(ApplyError::BadPayload {
                     key: "hidden_truth_referenced",
                     value: (*value).to_string(),
                 });
             }
         };
-        if parsed != typed.hidden_truth_referenced {
+        if parsed == /* ~ changed by cargo-mutants ~ */ typed.hidden_truth_referenced {
             return Err(ApplyError::BadPayload {
                 key: "hidden_truth_referenced",
                 value: (*value).to_string(),
             });
         }
     }
     for (key, expected) in [
         ("input_source", typed.input_source.as_str()),

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (31681) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:
agent event applies to live state: BadPayload { key: "hidden_truth_referenced", value: "false" }

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
