*** crates/tracewake-core/src/events/apply.rs:640:23: replace != with == in validate_typed_diagnostic_payload

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace != with == in validate_typed_diagnostic_payload
@@ -632,17 +632,17 @@
         }
     }
     for (key, expected) in [
         ("input_source", typed.input_source.as_str()),
         ("actual_source", typed.actual_source.as_str()),
         ("remediation_hint", typed.remediation_hint.as_str()),
     ] {
         if let Some(value) = payload.get(key) {
-            if *value != expected {
+            if *value == /* ~ changed by cargo-mutants ~ */ expected {
                 return Err(ApplyError::BadPayload {
                     key,
                     value: (*value).to_string(),
                 });
             }
         }
     }
     Ok(())

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (3244) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:
agent event applies to live state: BadPayload { key: "input_source", value: "actor_known_context" }

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
