*** crates/tracewake-core/src/events/apply.rs:662:5: replace required -> Result<&'a str, ApplyError> with Ok("")

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace required -> Result<&'a str, ApplyError> with Ok("")
@@ -654,20 +654,17 @@
         .map(|field| (field.key.as_str(), field.value.as_str()))
         .collect()
 }
 
 fn required<'a>(
     payload: &'a BTreeMap<&str, &str>,
     key: &'static str,
 ) -> Result<&'a str, ApplyError> {
-    payload
-        .get(key)
-        .copied()
-        .ok_or(ApplyError::MissingPayload(key))
+    Ok("") /* ~ changed by cargo-mutants ~ */
 }
 
 fn require_payload_version(
     payload: &BTreeMap<&str, &str>,
     key: &'static str,
     expected: &'static str,
 ) -> Result<(), ApplyError> {
     let actual = required(payload, key)?;

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (27431) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:
agent event applies to live state: BadPayload { key: "intention_id", value: "" }

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
