*** crates/tracewake-core/src/events/apply.rs:673:5: replace require_payload_version -> Result<(), ApplyError> with Ok(())

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace require_payload_version -> Result<(), ApplyError> with Ok(())
@@ -665,25 +665,17 @@
         .ok_or(ApplyError::MissingPayload(key))
 }
 
 fn require_payload_version(
     payload: &BTreeMap<&str, &str>,
     key: &'static str,
     expected: &'static str,
 ) -> Result<(), ApplyError> {
-    let actual = required(payload, key)?;
-    if actual == expected {
-        Ok(())
-    } else {
-        Err(ApplyError::BadPayload {
-            key,
-            value: actual.to_string(),
-        })
-    }
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn required_epistemic<'a>(
     payload: &'a BTreeMap<&str, &str>,
     key: &'static str,
 ) -> Result<&'a str, EpistemicApplyError> {
     payload
         .get(key)

---- events::apply::tests::agent_trace_event_rejects_unsupported_payload_version stdout ----

thread 'events::apply::tests::agent_trace_event_rejects_unsupported_payload_version' (3394) panicked at crates/tracewake-core/src/events/apply.rs:2255:9:
assertion failed: matches!(apply_agent_event(&mut state, &trace_event),
    Err(ApplyError::BadPayload { key: "trace_schema_version", .. }))

failures:
    events::apply::tests::agent_trace_event_rejects_unsupported_payload_version

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
