*** crates/tracewake-core/src/events/apply.rs:674:15: replace == with != in require_payload_version

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace == with != in require_payload_version
@@ -666,17 +666,17 @@
 }
 
 fn require_payload_version(
     payload: &BTreeMap<&str, &str>,
     key: &'static str,
     expected: &'static str,
 ) -> Result<(), ApplyError> {
     let actual = required(payload, key)?;
-    if actual == expected {
+    if actual != /* ~ changed by cargo-mutants ~ */ expected {
         Ok(())
     } else {
         Err(ApplyError::BadPayload {
             key,
             value: actual.to_string(),
         })
     }
 }

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (7585) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:
agent event applies to live state: BadPayload { key: "trace_schema_version", value: "1" }

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
