*** crates/tracewake-core/src/events/apply.rs:688:5: replace required_epistemic -> Result<&'a str, EpistemicApplyError> with Ok("xyzzy")

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace required_epistemic -> Result<&'a str, EpistemicApplyError> with Ok("xyzzy")
@@ -680,20 +680,17 @@
         })
     }
 }
 
 fn required_epistemic<'a>(
     payload: &'a BTreeMap<&str, &str>,
     key: &'static str,
 ) -> Result<&'a str, EpistemicApplyError> {
-    payload
-        .get(key)
-        .copied()
-        .ok_or(EpistemicApplyError::MissingPayload(key))
+    Ok("xyzzy") /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_actor_id_epistemic(
     payload: &BTreeMap<&str, &str>,
     key: &'static str,
 ) -> Result<ActorId, EpistemicApplyError> {
     let value = required_epistemic(payload, key)?;
     ActorId::new(value).map_err(|_| EpistemicApplyError::BadPayload {

---- fixture_fingerprint_reprices_secondary_file_bytes stdout ----

thread 'fixture_fingerprint_reprices_secondary_file_bytes' (15622) panicked at crates/tracewake-content/tests/fixtures_load.rs:629:6:
called `Result::unwrap()` on an `Err` value: EpistemicSeedEvent("fixture seed epistemic event event_seed_initial_belief_belief_tomas_expects_coin_stack_01_in_strongbox_tomas failed: UnsupportedPayloadSchemaVersion(\"xyzzy\")")

---- fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture stdout ----

thread 'fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture' (15621) panicked at crates/tracewake-content/tests/fixtures_load.rs:661:6:
called `Result::unwrap()` on an `Err` value: EpistemicSeedEvent("fixture seed epistemic event event_seed_initial_belief_belief_tomas_expects_coin_stack_01_in_strongbox_tomas failed: UnsupportedPayloadSchemaVersion(\"xyzzy\")")

---- fixture_scope_raw_lines_drive_loader_registry_and_fail_closed stdout ----

thread 'fixture_scope_raw_lines_drive_loader_registry_and_fail_closed' (15623) panicked at crates/tracewake-content/tests/fixtures_load.rs:846:6:
called `Result::unwrap()` on an `Err` value: EpistemicSeedEvent("fixture seed epistemic event event_seed_starting_belief_actor_tomas_sleep_place_bed_tomas failed: UnsupportedPayloadSchemaVersion(\"xyzzy\")")

failures:
    all_fixtures_load_deterministically_and_validate
    fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture
    fixture_fingerprint_reprices_secondary_file_bytes
    fixture_scope_raw_lines_drive_loader_registry_and_fail_closed
    fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering
    phase3a_load_emits_authored_prehistory_seed_events
    seed_event_log_order_and_projection_provenance_are_causal_and_stable
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food
    stale_workplace_notice_superseded_by_newer_001

test result: FAILED. 25 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
