*** crates/tracewake-core/src/events/apply.rs:764:5: replace parse_tick -> Result<SimTick, EpistemicApplyError> with Ok(Default::default())

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace parse_tick -> Result<SimTick, EpistemicApplyError> with Ok(Default::default())
@@ -756,24 +756,17 @@
         value: value.to_string(),
     })
 }
 
 fn parse_tick(
     payload: &BTreeMap<&str, &str>,
     key: &'static str,
 ) -> Result<SimTick, EpistemicApplyError> {
-    let value = required_epistemic(payload, key)?;
-    let parsed = value
-        .parse::<u64>()
-        .map_err(|_| EpistemicApplyError::BadPayload {
-            key,
-            value: value.to_string(),
-        })?;
-    Ok(SimTick::new(parsed))
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_optional_tick(
     payload: &BTreeMap<&str, &str>,
     key: &'static str,
 ) -> Result<Option<SimTick>, EpistemicApplyError> {
     payload
         .get(key)

---- agent::no_human_surface::tests::food_record_from_other_place_surfaces_as_remembered_find_food_input stdout ----

thread 'agent::no_human_surface::tests::food_record_from_other_place_surfaces_as_remembered_find_food_input' (19980) panicked at crates/tracewake-core/src/agent/no_human_surface.rs:1207:9:
assertion `left == right` failed
  left: Some(SimTick(0))
 right: Some(SimTick(4))

---- agent::no_human_surface::tests::sleep_record_from_other_place_surfaces_as_remembered_reachable_sleep_input stdout ----

thread 'agent::no_human_surface::tests::sleep_record_from_other_place_surfaces_as_remembered_reachable_sleep_input' (19984) panicked at crates/tracewake-core/src/agent/no_human_surface.rs:1296:9:
assertion `left == right` failed
  left: Some(SimTick(0))
 right: Some(SimTick(4))

---- agent::no_human_surface::tests::aged_food_record_surfaces_as_remembered_belief_not_observation stdout ----

thread 'agent::no_human_surface::tests::aged_food_record_surfaces_as_remembered_belief_not_observation' (19978) panicked at crates/tracewake-core/src/agent/no_human_surface.rs:1150:9:
assertion `left == right` failed
  left: Some(SimTick(0))
 right: Some(SimTick(4))

failures:
    agent::no_human_surface::tests::aged_food_record_surfaces_as_remembered_belief_not_observation
    agent::no_human_surface::tests::food_record_from_other_place_surfaces_as_remembered_find_food_input
    agent::no_human_surface::tests::sleep_record_from_other_place_surfaces_as_remembered_reachable_sleep_input

test result: FAILED. 452 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
