*** crates/tracewake-core/src/events/apply.rs:778:5: replace parse_optional_tick -> Result<Option<SimTick>, EpistemicApplyError> with Ok(Some(Default::default()))

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace parse_optional_tick -> Result<Option<SimTick>, EpistemicApplyError> with Ok(Some(Default::default()))
@@ -770,20 +770,17 @@
         })?;
     Ok(SimTick::new(parsed))
 }
 
 fn parse_optional_tick(
     payload: &BTreeMap<&str, &str>,
     key: &'static str,
 ) -> Result<Option<SimTick>, EpistemicApplyError> {
-    payload
-        .get(key)
-        .map(|_| parse_tick(payload, key))
-        .transpose()
+    Ok(Some(Default::default())) /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_confidence(payload: &BTreeMap<&str, &str>) -> Result<Confidence, EpistemicApplyError> {
     let value = required_epistemic(payload, "confidence")?;
     let parsed = value
         .parse::<u16>()
         .map_err(|_| EpistemicApplyError::BadPayload {
             key: "confidence",

---- belief_stale_frontier_and_witness_links_survive_projection_debug_and_replay stdout ----

thread 'belief_stale_frontier_and_witness_links_survive_projection_debug_and_replay' (29657) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:2166:5:
assertion `left == right` failed
  left: Some(SimTick(0))
 right: Some(SimTick(17))

failures:
    belief_stale_frontier_and_witness_links_survive_projection_debug_and_replay

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
