*** crates/tracewake-core/src/events/apply.rs:801:9: delete match arm "believes_true" in parse_stance

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete match arm "believes_true" in parse_stance
@@ -793,17 +793,17 @@
         key: "confidence",
         value: value.to_string(),
     })
 }
 
 fn parse_stance(payload: &BTreeMap<&str, &str>) -> Result<Stance, EpistemicApplyError> {
     let value = required_epistemic(payload, "stance")?;
     match value {
-        "believes_true" => Ok(Stance::BelievesTrue),
+         /* ~ changed by cargo-mutants ~ */
         "believes_false" => Ok(Stance::BelievesFalse),
         "expects_true" => Ok(Stance::ExpectsTrue),
         "plausible" => Ok(Stance::Plausible),
         "doubts" => Ok(Stance::Doubts),
         "unknown_or_unresolved" => Ok(Stance::UnknownOrUnresolved),
         _ => Err(EpistemicApplyError::BadPayload {
             key: "stance",
             value: value.to_string(),

---- seed_event_log_order_and_projection_provenance_are_causal_and_stable stdout ----

thread 'seed_event_log_order_and_projection_provenance_are_causal_and_stable' (1268) panicked at crates/tracewake-content/tests/fixtures_load.rs:920:74:
called `Result::unwrap()` on an `Err` value: EpistemicSeedEvent("fixture seed epistemic event event_seed_initial_belief_belief_tomas_seed_counter_probe failed: BadPayload { key: \"stance\", value: \"believes_true\" }")

failures:
    seed_event_log_order_and_projection_provenance_are_causal_and_stable

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
