*** crates/tracewake-core/src/events/apply.rs:803:9: delete match arm "expects_true" in parse_stance

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete match arm "expects_true" in parse_stance
@@ -795,17 +795,17 @@
     })
 }
 
 fn parse_stance(payload: &BTreeMap<&str, &str>) -> Result<Stance, EpistemicApplyError> {
     let value = required_epistemic(payload, "stance")?;
     match value {
         "believes_true" => Ok(Stance::BelievesTrue),
         "believes_false" => Ok(Stance::BelievesFalse),
-        "expects_true" => Ok(Stance::ExpectsTrue),
+         /* ~ changed by cargo-mutants ~ */
         "plausible" => Ok(Stance::Plausible),
         "doubts" => Ok(Stance::Doubts),
         "unknown_or_unresolved" => Ok(Stance::UnknownOrUnresolved),
         _ => Err(EpistemicApplyError::BadPayload {
             key: "stance",
             value: value.to_string(),
         }),
     }

---- fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture stdout ----

thread 'fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture' (9977) panicked at crates/tracewake-content/tests/fixtures_load.rs:661:6:
called `Result::unwrap()` on an `Err` value: EpistemicSeedEvent("fixture seed epistemic event event_seed_initial_belief_belief_tomas_expects_coin_stack_01_in_strongbox_tomas failed: BadPayload { key: \"stance\", value: \"expects_true\" }")

---- fixture_fingerprint_reprices_secondary_file_bytes stdout ----

thread 'fixture_fingerprint_reprices_secondary_file_bytes' (9978) panicked at crates/tracewake-content/tests/fixtures_load.rs:629:6:
called `Result::unwrap()` on an `Err` value: EpistemicSeedEvent("fixture seed epistemic event event_seed_initial_belief_belief_tomas_expects_coin_stack_01_in_strongbox_tomas failed: BadPayload { key: \"stance\", value: \"expects_true\" }")

---- all_fixtures_load_deterministically_and_validate stdout ----

thread 'all_fixtures_load_deterministically_and_validate' (9975) panicked at crates/tracewake-content/tests/fixtures_load.rs:598:10:
called `Result::unwrap()` on an `Err` value: EpistemicSeedEvent("fixture seed epistemic event event_seed_initial_belief_belief_tomas_expects_coin_stack_01_in_strongbox_tomas failed: BadPayload { key: \"stance\", value: \"expects_true\" }")

failures:
    all_fixtures_load_deterministically_and_validate
    fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture
    fixture_fingerprint_reprices_secondary_file_bytes

test result: FAILED. 31 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
