*** crates/tracewake-core/src/events/apply.rs:804:9: delete match arm "plausible" in parse_stance

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete match arm "plausible" in parse_stance
@@ -796,17 +796,17 @@
 }
 
 fn parse_stance(payload: &BTreeMap<&str, &str>) -> Result<Stance, EpistemicApplyError> {
     let value = required_epistemic(payload, "stance")?;
     match value {
         "believes_true" => Ok(Stance::BelievesTrue),
         "believes_false" => Ok(Stance::BelievesFalse),
         "expects_true" => Ok(Stance::ExpectsTrue),
-        "plausible" => Ok(Stance::Plausible),
+         /* ~ changed by cargo-mutants ~ */
         "doubts" => Ok(Stance::Doubts),
         "unknown_or_unresolved" => Ok(Stance::UnknownOrUnresolved),
         _ => Err(EpistemicApplyError::BadPayload {
             key: "stance",
             value: value.to_string(),
         }),
     }
 }

---- all_fixtures_load_deterministically_and_validate stdout ----

thread 'all_fixtures_load_deterministically_and_validate' (14006) panicked at crates/tracewake-content/tests/fixtures_load.rs:598:10:
called `Result::unwrap()` on an `Err` value: EpistemicSeedEvent("fixture seed epistemic event event_seed_initial_belief_belief_elena_heard_sound_near_house_tomas failed: BadPayload { key: \"stance\", value: \"plausible\" }")

failures:
    all_fixtures_load_deterministically_and_validate

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
