*** crates/tracewake-core/src/events/apply.rs:805:9: delete match arm "doubts" in parse_stance

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete match arm "doubts" in parse_stance
@@ -797,17 +797,17 @@
 
 fn parse_stance(payload: &BTreeMap<&str, &str>) -> Result<Stance, EpistemicApplyError> {
     let value = required_epistemic(payload, "stance")?;
     match value {
         "believes_true" => Ok(Stance::BelievesTrue),
         "believes_false" => Ok(Stance::BelievesFalse),
         "expects_true" => Ok(Stance::ExpectsTrue),
         "plausible" => Ok(Stance::Plausible),
-        "doubts" => Ok(Stance::Doubts),
+         /* ~ changed by cargo-mutants ~ */
         "unknown_or_unresolved" => Ok(Stance::UnknownOrUnresolved),
         _ => Err(EpistemicApplyError::BadPayload {
             key: "stance",
             value: value.to_string(),
         }),
     }
 }

---- epistemic_apply_matrix_preserves_fields_and_rejects_unknown_tokens stdout ----

thread 'epistemic_apply_matrix_preserves_fields_and_rejects_unknown_tokens' (18717) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:1908:9:
assertion `left == right` failed
  left: Err(BadPayload { key: "stance", value: "doubts" })
 right: Ok(Applied)

failures:
    epistemic_apply_matrix_preserves_fields_and_rejects_unknown_tokens

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
