*** crates/tracewake-core/src/events/apply.rs:817:9: delete match arm "direct_sight" in parse_channel

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete match arm "direct_sight" in parse_channel
@@ -809,17 +809,17 @@
             value: value.to_string(),
         }),
     }
 }
 
 fn parse_channel(payload: &BTreeMap<&str, &str>) -> Result<Channel, EpistemicApplyError> {
     let value = required_epistemic(payload, "channel")?;
     match value {
-        "direct_sight" => Ok(Channel::DirectSight),
+         /* ~ changed by cargo-mutants ~ */
         "touch_or_search" => Ok(Channel::TouchOrSearch),
         "simple_sound" => Ok(Channel::SimpleSound),
         "absence_marker" => Ok(Channel::AbsenceMarker),
         "reading_placeholder_schema_only" => Ok(Channel::ReadingPlaceholderSchemaOnly),
         _ => Err(EpistemicApplyError::BadPayload {
             key: "channel",
             value: value.to_string(),
         }),

---- no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash stdout ----

thread 'no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash' (27525) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2907:5:

---- severe_safety_with_known_exit_produces_move_and_replays stdout ----

thread 'severe_safety_with_known_exit_produces_move_and_replays' (27547) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1715:10:
severe safety should commit a move

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (27523) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash
    no_human_decision_context_hash_gate_fails_when_source_evidence_tampered
    severe_safety_with_known_exit_produces_move_and_replays

test result: FAILED. 37 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.22s

*** result: Failure(101)
