*** crates/tracewake-core/src/events/apply.rs:818:9: delete match arm "touch_or_search" in parse_channel

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete match arm "touch_or_search" in parse_channel
@@ -810,17 +810,17 @@
         }),
     }
 }
 
 fn parse_channel(payload: &BTreeMap<&str, &str>) -> Result<Channel, EpistemicApplyError> {
     let value = required_epistemic(payload, "channel")?;
     match value {
         "direct_sight" => Ok(Channel::DirectSight),
-        "touch_or_search" => Ok(Channel::TouchOrSearch),
+         /* ~ changed by cargo-mutants ~ */
         "simple_sound" => Ok(Channel::SimpleSound),
         "absence_marker" => Ok(Channel::AbsenceMarker),
         "reading_placeholder_schema_only" => Ok(Channel::ReadingPlaceholderSchemaOnly),
         _ => Err(EpistemicApplyError::BadPayload {
             key: "channel",
             value: value.to_string(),
         }),
     }

---- belief_stale_frontier_and_witness_links_survive_projection_debug_and_replay stdout ----

thread 'belief_stale_frontier_and_witness_links_survive_projection_debug_and_replay' (32226) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:2154:9:
assertion `left == right` failed
  left: Err(BadPayload { key: "channel", value: "touch_or_search" })
 right: Ok(Applied)

---- epistemic_apply_matrix_preserves_fields_and_rejects_unknown_tokens stdout ----

thread 'epistemic_apply_matrix_preserves_fields_and_rejects_unknown_tokens' (32232) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:1908:9:
assertion `left == right` failed
  left: Err(BadPayload { key: "channel", value: "touch_or_search" })
 right: Ok(Applied)

---- starting_observation_and_contradiction_events_survive_replay_with_sources stdout ----

thread 'starting_observation_and_contradiction_events_survive_replay_with_sources' (32248) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:2056:9:
assertion `left == right` failed
  left: Err(BadPayload { key: "channel", value: "touch_or_search" })
 right: Ok(Applied)

failures:
    belief_stale_frontier_and_witness_links_survive_projection_debug_and_replay
    epistemic_apply_matrix_preserves_fields_and_rejects_unknown_tokens
    starting_observation_and_contradiction_events_survive_replay_with_sources

test result: FAILED. 29 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
