*** crates/tracewake-core/src/events/apply.rs:819:9: delete match arm "simple_sound" in parse_channel

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete match arm "simple_sound" in parse_channel
@@ -811,17 +811,17 @@
     }
 }
 
 fn parse_channel(payload: &BTreeMap<&str, &str>) -> Result<Channel, EpistemicApplyError> {
     let value = required_epistemic(payload, "channel")?;
     match value {
         "direct_sight" => Ok(Channel::DirectSight),
         "touch_or_search" => Ok(Channel::TouchOrSearch),
-        "simple_sound" => Ok(Channel::SimpleSound),
+         /* ~ changed by cargo-mutants ~ */
         "absence_marker" => Ok(Channel::AbsenceMarker),
         "reading_placeholder_schema_only" => Ok(Channel::ReadingPlaceholderSchemaOnly),
         _ => Err(EpistemicApplyError::BadPayload {
             key: "channel",
             value: value.to_string(),
         }),
     }
 }

---- all_fixtures_load_deterministically_and_validate stdout ----

thread 'all_fixtures_load_deterministically_and_validate' (3786) panicked at crates/tracewake-content/tests/fixtures_load.rs:598:10:
called `Result::unwrap()` on an `Err` value: EpistemicSeedEvent("fixture seed epistemic event event_seed_initial_belief_belief_elena_heard_sound_near_house_tomas failed: BadPayload { key: \"channel\", value: \"simple_sound\" }")

failures:
    all_fixtures_load_deterministically_and_validate

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
