*** crates/tracewake-core/src/events/apply.rs:820:9: delete match arm "absence_marker" in parse_channel

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ delete match arm "absence_marker" in parse_channel
@@ -812,17 +812,17 @@
 }
 
 fn parse_channel(payload: &BTreeMap<&str, &str>) -> Result<Channel, EpistemicApplyError> {
     let value = required_epistemic(payload, "channel")?;
     match value {
         "direct_sight" => Ok(Channel::DirectSight),
         "touch_or_search" => Ok(Channel::TouchOrSearch),
         "simple_sound" => Ok(Channel::SimpleSound),
-        "absence_marker" => Ok(Channel::AbsenceMarker),
+         /* ~ changed by cargo-mutants ~ */
         "reading_placeholder_schema_only" => Ok(Channel::ReadingPlaceholderSchemaOnly),
         _ => Err(EpistemicApplyError::BadPayload {
             key: "channel",
             value: value.to_string(),
         }),
     }
 }

---- events::apply::tests::epistemic_application_updates_projection stdout ----

thread 'events::apply::tests::epistemic_application_updates_projection' (8217) panicked at crates/tracewake-core/src/events/apply.rs:2028:9:
assertion `left == right` failed
  left: Err(BadPayload { key: "channel", value: "absence_marker" })
 right: Ok(Applied)

---- replay::rebuild::tests::epistemic_rebuild_is_deterministic_across_repeated_runs stdout ----

thread 'replay::rebuild::tests::epistemic_rebuild_is_deterministic_across_repeated_runs' (8300) panicked at crates/tracewake-core/src/replay/rebuild.rs:819:9:
assertion failed: first.epistemic_application_errors.is_empty()

failures:
    events::apply::tests::epistemic_application_updates_projection
    replay::rebuild::tests::epistemic_rebuild_is_deterministic_across_repeated_runs

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
