*** crates/tracewake-core/src/events/apply.rs:873:5: replace parse_observation_ids -> Result<Vec<ObservationId>, EpistemicApplyError> with Ok(vec![])

*** mutation diff:
--- crates/tracewake-core/src/events/apply.rs
+++ replace parse_observation_ids -> Result<Vec<ObservationId>, EpistemicApplyError> with Ok(vec![])
@@ -865,26 +865,17 @@
         for contradiction_id in parse_contradiction_ids(contradiction_ids)? {
             belief = belief.with_contradiction(contradiction_id);
         }
     }
     Ok(belief)
 }
 
 fn parse_observation_ids(value: &str) -> Result<Vec<ObservationId>, EpistemicApplyError> {
-    value
-        .split(',')
-        .filter(|part| !part.is_empty())
-        .map(|part| {
-            ObservationId::new(part).map_err(|_| EpistemicApplyError::BadPayload {
-                key: "observation_ids",
-                value: part.to_string(),
-            })
-        })
-        .collect()
+    Ok(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 fn parse_contradiction_ids(value: &str) -> Result<Vec<ContradictionId>, EpistemicApplyError> {
     value
         .split(',')
         .filter(|part| !part.is_empty())
         .map(|part| {
             ContradictionId::new(part).map_err(|_| EpistemicApplyError::BadPayload {

---- belief_stale_frontier_and_witness_links_survive_projection_debug_and_replay stdout ----

thread 'belief_stale_frontier_and_witness_links_survive_projection_debug_and_replay' (17777) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:2188:5:
assertion failed: belief_after.observation_ids().contains(&observation_id)

failures:
    belief_stale_frontier_and_witness_links_survive_projection_debug_and_replay

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
