*** crates/tracewake-core/src/events/envelope.rs:1010:5: replace stream_from_id -> Option<EventStream> with None

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ replace stream_from_id -> Option<EventStream> with None
@@ -1002,25 +1002,17 @@
         EventStream::Epistemic => "epistemic",
         EventStream::Diagnostic => "diagnostic",
         EventStream::Controller => "controller",
         EventStream::ReplayDebug => "replay_debug",
     }
 }
 
 fn stream_from_id(value: &str) -> Option<EventStream> {
-    match value {
-        "world" => Some(EventStream::World),
-        "agent" => Some(EventStream::Agent),
-        "epistemic" => Some(EventStream::Epistemic),
-        "diagnostic" => Some(EventStream::Diagnostic),
-        "controller" => Some(EventStream::Controller),
-        "replay_debug" => Some(EventStream::ReplayDebug),
-        _ => None,
-    }
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn serialize_ordering_key(key: &OrderingKey) -> String {
     [
         key.sim_tick.value().to_string(),
         schedule_phase_id(&key.phase).to_string(),
         serialize_source_id(&key.source_id),
         key.proposal_sequence.value().to_string(),

---- serialization::tests::event_log_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::event_log_serialization_round_trips_byte_identically' (19875) panicked at crates/tracewake-content/src/serialization.rs:920:73:
called `Result::unwrap()` on an `Err` value: EventLog(Parse(UnknownStream))

failures:
    serialization::tests::event_log_serialization_round_trips_byte_identically

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
