*** crates/tracewake-core/src/events/envelope.rs:1011:9: delete match arm "world" in stream_from_id

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ delete match arm "world" in stream_from_id
@@ -1003,17 +1003,17 @@
         EventStream::Diagnostic => "diagnostic",
         EventStream::Controller => "controller",
         EventStream::ReplayDebug => "replay_debug",
     }
 }
 
 fn stream_from_id(value: &str) -> Option<EventStream> {
     match value {
-        "world" => Some(EventStream::World),
+         /* ~ changed by cargo-mutants ~ */
         "agent" => Some(EventStream::Agent),
         "epistemic" => Some(EventStream::Epistemic),
         "diagnostic" => Some(EventStream::Diagnostic),
         "controller" => Some(EventStream::Controller),
         "replay_debug" => Some(EventStream::ReplayDebug),
         _ => None,
     }
 }

---- serialization::tests::event_log_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::event_log_serialization_round_trips_byte_identically' (23883) panicked at crates/tracewake-content/src/serialization.rs:920:73:
called `Result::unwrap()` on an `Err` value: EventLog(Parse(UnknownStream))

failures:
    serialization::tests::event_log_serialization_round_trips_byte_identically

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
