*** crates/tracewake-core/src/events/envelope.rs:1013:9: delete match arm "epistemic" in stream_from_id

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ delete match arm "epistemic" in stream_from_id
@@ -1005,17 +1005,17 @@
         EventStream::ReplayDebug => "replay_debug",
     }
 }
 
 fn stream_from_id(value: &str) -> Option<EventStream> {
     match value {
         "world" => Some(EventStream::World),
         "agent" => Some(EventStream::Agent),
-        "epistemic" => Some(EventStream::Epistemic),
+         /* ~ changed by cargo-mutants ~ */
         "diagnostic" => Some(EventStream::Diagnostic),
         "controller" => Some(EventStream::Controller),
         "replay_debug" => Some(EventStream::ReplayDebug),
         _ => None,
     }
 }
 
 fn serialize_ordering_key(key: &OrderingKey) -> String {

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (32081) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2704:68:
called `Result::unwrap()` on an `Err` value: Parse(UnknownStream)

failures:
    no_human_day_real_run_replays_metrics_and_trace_projection

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.37s

*** result: Failure(101)
