*** crates/tracewake-core/src/events/envelope.rs:1014:9: delete match arm "diagnostic" in stream_from_id

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ delete match arm "diagnostic" in stream_from_id
@@ -1006,17 +1006,17 @@
     }
 }
 
 fn stream_from_id(value: &str) -> Option<EventStream> {
     match value {
         "world" => Some(EventStream::World),
         "agent" => Some(EventStream::Agent),
         "epistemic" => Some(EventStream::Epistemic),
-        "diagnostic" => Some(EventStream::Diagnostic),
+         /* ~ changed by cargo-mutants ~ */
         "controller" => Some(EventStream::Controller),
         "replay_debug" => Some(EventStream::ReplayDebug),
         _ => None,
     }
 }
 
 fn serialize_ordering_key(key: &OrderingKey) -> String {
     [

---- events::tests::envelope_round_trips_with_stable_schema_version stdout ----

thread 'events::tests::envelope_round_trips_with_stable_schema_version' (4065) panicked at crates/tracewake-core/src/events/mod.rs:87:74:
called `Result::unwrap()` on an `Err` value: UnknownStream

---- events::log::tests::deserialization_rejects_reordered_global_order stdout ----

thread 'events::log::tests::deserialization_rejects_reordered_global_order' (4061) panicked at crates/tracewake-core/src/events/log.rs:213:9:
assertion `left == right` failed
  left: Parse(UnknownStream)
 right: GlobalOrderMismatch { expected: 0, actual: 1 }

---- events::log::tests::log_serialization_round_trips stdout ----

thread 'events::log::tests::log_serialization_round_trips' (4062) panicked at crates/tracewake-core/src/events/log.rs:195:69:
called `Result::unwrap()` on an `Err` value: Parse(UnknownStream)

failures:
    events::log::tests::deserialization_rejects_reordered_global_order
    events::log::tests::log_serialization_round_trips
    events::tests::envelope_round_trips_with_stable_schema_version

test result: FAILED. 452 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
