*** crates/tracewake-core/src/events/envelope.rs:1015:9: delete match arm "controller" in stream_from_id

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ delete match arm "controller" in stream_from_id
@@ -1007,17 +1007,17 @@
 }
 
 fn stream_from_id(value: &str) -> Option<EventStream> {
     match value {
         "world" => Some(EventStream::World),
         "agent" => Some(EventStream::Agent),
         "epistemic" => Some(EventStream::Epistemic),
         "diagnostic" => Some(EventStream::Diagnostic),
-        "controller" => Some(EventStream::Controller),
+         /* ~ changed by cargo-mutants ~ */
         "replay_debug" => Some(EventStream::ReplayDebug),
         _ => None,
     }
 }
 
 fn serialize_ordering_key(key: &OrderingKey) -> String {
     [
         key.sim_tick.value().to_string(),

---- envelope_identity_round_trips_stream_phase_source_cause_and_random_draws stdout ----

thread 'envelope_identity_round_trips_stream_phase_source_cause_and_random_draws' (8880) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:1776:72:
called `Result::unwrap()` on an `Err` value: Parse(UnknownStream)

failures:
    envelope_identity_round_trips_stream_phase_source_cause_and_random_draws

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
