*** crates/tracewake-core/src/events/envelope.rs:1022:5: replace serialize_ordering_key -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ replace serialize_ordering_key -> String with "xyzzy".into()
@@ -1014,29 +1014,17 @@
         "diagnostic" => Some(EventStream::Diagnostic),
         "controller" => Some(EventStream::Controller),
         "replay_debug" => Some(EventStream::ReplayDebug),
         _ => None,
     }
 }
 
 fn serialize_ordering_key(key: &OrderingKey) -> String {
-    [
-        key.sim_tick.value().to_string(),
-        schedule_phase_id(&key.phase).to_string(),
-        serialize_source_id(&key.source_id),
-        key.proposal_sequence.value().to_string(),
-        key.action_id.as_str().to_string(),
-        key.target_ids.join(","),
-        key.final_tie_breaker.clone(),
-    ]
-    .into_iter()
-    .map(|part| encode(&part))
-    .collect::<Vec<_>>()
-    .join("|")
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 fn deserialize_ordering_key(value: &str) -> Result<OrderingKey, EventEnvelopeParseError> {
     let parts = value
         .split('|')
         .map(decode)
         .collect::<Result<Vec<_>, _>>()?;
     if parts.len() != 7 {

---- serialization::tests::event_log_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::event_log_serialization_round_trips_byte_identically' (21569) panicked at crates/tracewake-content/src/serialization.rs:920:73:
called `Result::unwrap()` on an `Err` value: EventLog(Parse(BadHex))

failures:
    serialization::tests::event_log_serialization_round_trips_byte_identically

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
