*** crates/tracewake-core/src/events/envelope.rs:1042:20: replace != with == in deserialize_ordering_key

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ replace != with == in deserialize_ordering_key
@@ -1034,17 +1034,17 @@
     .join("|")
 }
 
 fn deserialize_ordering_key(value: &str) -> Result<OrderingKey, EventEnvelopeParseError> {
     let parts = value
         .split('|')
         .map(decode)
         .collect::<Result<Vec<_>, _>>()?;
-    if parts.len() != 7 {
+    if parts.len() == /* ~ changed by cargo-mutants ~ */ 7 {
         return Err(EventEnvelopeParseError::InvalidTuple);
     }
 
     Ok(OrderingKey::new(
         SimTick::new(parts[0].parse()?),
         schedule_phase_from_id(&parts[1]).ok_or(EventEnvelopeParseError::UnknownSchedulePhase)?,
         deserialize_source_id(&parts[2])?,
         ProposalSequence::new(parts[3].parse()?),

---- serialization::tests::event_log_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::event_log_serialization_round_trips_byte_identically' (25577) panicked at crates/tracewake-content/src/serialization.rs:920:73:
called `Result::unwrap()` on an `Err` value: EventLog(Parse(InvalidTuple))

failures:
    serialization::tests::event_log_serialization_round_trips_byte_identically

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
