*** crates/tracewake-core/src/events/envelope.rs:1062:5: replace schedule_phase_id -> &'static str with ""

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ replace schedule_phase_id -> &'static str with ""
@@ -1054,22 +1054,17 @@
         } else {
             parts[5].split(',').map(ToString::to_string).collect()
         },
         parts[6].clone(),
     ))
 }
 
 fn schedule_phase_id(phase: &SchedulePhase) -> &'static str {
-    match phase {
-        SchedulePhase::HumanCommand => "human_command",
-        SchedulePhase::NoHumanProcess => "no_human_process",
-        SchedulePhase::DeferredProcess => "deferred_process",
-        SchedulePhase::Replay => "replay",
-    }
+    "" /* ~ changed by cargo-mutants ~ */
 }
 
 fn schedule_phase_from_id(value: &str) -> Option<SchedulePhase> {
     match value {
         "human_command" => Some(SchedulePhase::HumanCommand),
         "no_human_process" => Some(SchedulePhase::NoHumanProcess),
         "deferred_process" => Some(SchedulePhase::DeferredProcess),
         "replay" => Some(SchedulePhase::Replay),

---- serialization::tests::event_log_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::event_log_serialization_round_trips_byte_identically' (29573) panicked at crates/tracewake-content/src/serialization.rs:920:73:
called `Result::unwrap()` on an `Err` value: EventLog(Parse(UnknownSchedulePhase))

failures:
    serialization::tests::event_log_serialization_round_trips_byte_identically

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
