*** crates/tracewake-core/src/events/envelope.rs:1071:5: replace schedule_phase_from_id -> Option<SchedulePhase> with None

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ replace schedule_phase_from_id -> Option<SchedulePhase> with None
@@ -1063,23 +1063,17 @@
         SchedulePhase::HumanCommand => "human_command",
         SchedulePhase::NoHumanProcess => "no_human_process",
         SchedulePhase::DeferredProcess => "deferred_process",
         SchedulePhase::Replay => "replay",
     }
 }
 
 fn schedule_phase_from_id(value: &str) -> Option<SchedulePhase> {
-    match value {
-        "human_command" => Some(SchedulePhase::HumanCommand),
-        "no_human_process" => Some(SchedulePhase::NoHumanProcess),
-        "deferred_process" => Some(SchedulePhase::DeferredProcess),
-        "replay" => Some(SchedulePhase::Replay),
-        _ => None,
-    }
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn serialize_source_id(source_id: &SchedulerSourceId) -> String {
     match source_id {
         SchedulerSourceId::Actor(id) => format!("actor:{}", id.as_str()),
         SchedulerSourceId::Controller(id) => format!("controller:{}", id.as_str()),
         SchedulerSourceId::Process(id) => format!("process:{}", id.as_str()),
     }

---- serialization::tests::event_log_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::event_log_serialization_round_trips_byte_identically' (5097) panicked at crates/tracewake-content/src/serialization.rs:920:73:
called `Result::unwrap()` on an `Err` value: EventLog(Parse(UnknownSchedulePhase))

failures:
    serialization::tests::event_log_serialization_round_trips_byte_identically

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
