*** crates/tracewake-core/src/events/envelope.rs:1072:9: delete match arm "human_command" in schedule_phase_from_id

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ delete match arm "human_command" in schedule_phase_from_id
@@ -1064,17 +1064,17 @@
         SchedulePhase::NoHumanProcess => "no_human_process",
         SchedulePhase::DeferredProcess => "deferred_process",
         SchedulePhase::Replay => "replay",
     }
 }
 
 fn schedule_phase_from_id(value: &str) -> Option<SchedulePhase> {
     match value {
-        "human_command" => Some(SchedulePhase::HumanCommand),
+         /* ~ changed by cargo-mutants ~ */
         "no_human_process" => Some(SchedulePhase::NoHumanProcess),
         "deferred_process" => Some(SchedulePhase::DeferredProcess),
         "replay" => Some(SchedulePhase::Replay),
         _ => None,
     }
 }
 
 fn serialize_source_id(source_id: &SchedulerSourceId) -> String {

---- serialization::tests::event_log_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::event_log_serialization_round_trips_byte_identically' (9106) panicked at crates/tracewake-content/src/serialization.rs:920:73:
called `Result::unwrap()` on an `Err` value: EventLog(Parse(UnknownSchedulePhase))

failures:
    serialization::tests::event_log_serialization_round_trips_byte_identically

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
