*** crates/tracewake-core/src/events/envelope.rs:1073:9: delete match arm "no_human_process" in schedule_phase_from_id

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ delete match arm "no_human_process" in schedule_phase_from_id
@@ -1065,17 +1065,17 @@
         SchedulePhase::DeferredProcess => "deferred_process",
         SchedulePhase::Replay => "replay",
     }
 }
 
 fn schedule_phase_from_id(value: &str) -> Option<SchedulePhase> {
     match value {
         "human_command" => Some(SchedulePhase::HumanCommand),
-        "no_human_process" => Some(SchedulePhase::NoHumanProcess),
+         /* ~ changed by cargo-mutants ~ */
         "deferred_process" => Some(SchedulePhase::DeferredProcess),
         "replay" => Some(SchedulePhase::Replay),
         _ => None,
     }
 }
 
 fn serialize_source_id(source_id: &SchedulerSourceId) -> String {
     match source_id {

---- serialized_event_log_replays_to_identical_state stdout ----

thread 'serialized_event_log_replays_to_identical_state' (13227) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:436:59:
called `Result::unwrap()` on an `Err` value: EventLog(Parse(UnknownSchedulePhase))

---- sleep_eat_work_fixture_logs_need_effects_and_replays stdout ----

thread 'sleep_eat_work_fixture_logs_need_effects_and_replays' (13230) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1280:80:
called `Result::unwrap()` on an `Err` value: Parse(UnknownSchedulePhase)

---- work_block_failed_then_sleep_succeeds_fixture_closes_reservation stdout ----

thread 'work_block_failed_then_sleep_succeeds_fixture_closes_reservation' (13234) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1382:80:
called `Result::unwrap()` on an `Err` value: Parse(UnknownSchedulePhase)

failures:
    no_human_day_real_run_replays_metrics_and_trace_projection
    serialized_event_log_replays_to_identical_state
    sleep_eat_work_fixture_logs_need_effects_and_replays
    work_block_failed_then_sleep_succeeds_fixture_closes_reservation

test result: FAILED. 38 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.40s

*** result: Failure(101)
