*** crates/tracewake-core/src/events/envelope.rs:1075:9: delete match arm "replay" in schedule_phase_from_id

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ delete match arm "replay" in schedule_phase_from_id
@@ -1067,17 +1067,17 @@
     }
 }
 
 fn schedule_phase_from_id(value: &str) -> Option<SchedulePhase> {
     match value {
         "human_command" => Some(SchedulePhase::HumanCommand),
         "no_human_process" => Some(SchedulePhase::NoHumanProcess),
         "deferred_process" => Some(SchedulePhase::DeferredProcess),
-        "replay" => Some(SchedulePhase::Replay),
+         /* ~ changed by cargo-mutants ~ */
         _ => None,
     }
 }
 
 fn serialize_source_id(source_id: &SchedulerSourceId) -> String {
     match source_id {
         SchedulerSourceId::Actor(id) => format!("actor:{}", id.as_str()),
         SchedulerSourceId::Controller(id) => format!("controller:{}", id.as_str()),

---- envelope_identity_round_trips_stream_phase_source_cause_and_random_draws stdout ----

thread 'envelope_identity_round_trips_stream_phase_source_cause_and_random_draws' (22614) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:1776:72:
called `Result::unwrap()` on an `Err` value: Parse(UnknownSchedulePhase)

failures:
    envelope_identity_round_trips_stream_phase_source_cause_and_random_draws

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
