*** crates/tracewake-core/src/events/envelope.rs:1081:5: replace serialize_source_id -> String with String::new()

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ replace serialize_source_id -> String with String::new()
@@ -1073,21 +1073,17 @@
         "no_human_process" => Some(SchedulePhase::NoHumanProcess),
         "deferred_process" => Some(SchedulePhase::DeferredProcess),
         "replay" => Some(SchedulePhase::Replay),
         _ => None,
     }
 }
 
 fn serialize_source_id(source_id: &SchedulerSourceId) -> String {
-    match source_id {
-        SchedulerSourceId::Actor(id) => format!("actor:{}", id.as_str()),
-        SchedulerSourceId::Controller(id) => format!("controller:{}", id.as_str()),
-        SchedulerSourceId::Process(id) => format!("process:{}", id.as_str()),
-    }
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn deserialize_source_id(value: &str) -> Result<SchedulerSourceId, EventEnvelopeParseError> {
     let (kind, value) = value
         .split_once(':')
         .ok_or(EventEnvelopeParseError::UnknownSchedulerSource)?;
     match kind {
         "actor" => Ok(SchedulerSourceId::Actor(ActorId::new(value)?)),

---- serialization::tests::event_log_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::event_log_serialization_round_trips_byte_identically' (26605) panicked at crates/tracewake-content/src/serialization.rs:920:73:
called `Result::unwrap()` on an `Err` value: EventLog(Parse(UnknownSchedulerSource))

failures:
    serialization::tests::event_log_serialization_round_trips_byte_identically

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
