*** crates/tracewake-core/src/events/envelope.rs:1093:9: delete match arm "actor" in deserialize_source_id

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ delete match arm "actor" in deserialize_source_id
@@ -1085,17 +1085,17 @@
     }
 }
 
 fn deserialize_source_id(value: &str) -> Result<SchedulerSourceId, EventEnvelopeParseError> {
     let (kind, value) = value
         .split_once(':')
         .ok_or(EventEnvelopeParseError::UnknownSchedulerSource)?;
     match kind {
-        "actor" => Ok(SchedulerSourceId::Actor(ActorId::new(value)?)),
+         /* ~ changed by cargo-mutants ~ */
         "controller" => Ok(SchedulerSourceId::Controller(ControllerId::new(value)?)),
         "process" => Ok(SchedulerSourceId::Process(ProcessId::new(value)?)),
         _ => Err(EventEnvelopeParseError::UnknownSchedulerSource),
     }
 }
 
 fn serialize_cause(cause: &EventCause) -> String {
     match cause {

---- serialization::tests::event_log_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::event_log_serialization_round_trips_byte_identically' (2141) panicked at crates/tracewake-content/src/serialization.rs:920:73:
called `Result::unwrap()` on an `Err` value: EventLog(Parse(UnknownSchedulerSource))

failures:
    serialization::tests::event_log_serialization_round_trips_byte_identically

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
