*** crates/tracewake-core/src/events/envelope.rs:1094:9: delete match arm "controller" in deserialize_source_id

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ delete match arm "controller" in deserialize_source_id
@@ -1086,17 +1086,17 @@
 }
 
 fn deserialize_source_id(value: &str) -> Result<SchedulerSourceId, EventEnvelopeParseError> {
     let (kind, value) = value
         .split_once(':')
         .ok_or(EventEnvelopeParseError::UnknownSchedulerSource)?;
     match kind {
         "actor" => Ok(SchedulerSourceId::Actor(ActorId::new(value)?)),
-        "controller" => Ok(SchedulerSourceId::Controller(ControllerId::new(value)?)),
+         /* ~ changed by cargo-mutants ~ */
         "process" => Ok(SchedulerSourceId::Process(ProcessId::new(value)?)),
         _ => Err(EventEnvelopeParseError::UnknownSchedulerSource),
     }
 }
 
 fn serialize_cause(cause: &EventCause) -> String {
     match cause {
         EventCause::Event(id) => format!("event:{}", id.as_str()),

---- envelope_identity_round_trips_stream_phase_source_cause_and_random_draws stdout ----

thread 'envelope_identity_round_trips_stream_phase_source_cause_and_random_draws' (6849) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:1776:72:
called `Result::unwrap()` on an `Err` value: Parse(UnknownSchedulerSource)

failures:
    envelope_identity_round_trips_stream_phase_source_cause_and_random_draws

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
