*** crates/tracewake-core/src/events/envelope.rs:1095:9: delete match arm "process" in deserialize_source_id

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ delete match arm "process" in deserialize_source_id
@@ -1087,17 +1087,17 @@
 
 fn deserialize_source_id(value: &str) -> Result<SchedulerSourceId, EventEnvelopeParseError> {
     let (kind, value) = value
         .split_once(':')
         .ok_or(EventEnvelopeParseError::UnknownSchedulerSource)?;
     match kind {
         "actor" => Ok(SchedulerSourceId::Actor(ActorId::new(value)?)),
         "controller" => Ok(SchedulerSourceId::Controller(ControllerId::new(value)?)),
-        "process" => Ok(SchedulerSourceId::Process(ProcessId::new(value)?)),
+         /* ~ changed by cargo-mutants ~ */
         _ => Err(EventEnvelopeParseError::UnknownSchedulerSource),
     }
 }
 
 fn serialize_cause(cause: &EventCause) -> String {
     match cause {
         EventCause::Event(id) => format!("event:{}", id.as_str()),
         EventCause::Proposal(id) => format!("proposal:{}", id.as_str()),

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (10943) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2704:68:
called `Result::unwrap()` on an `Err` value: Parse(UnknownSchedulerSource)

failures:
    no_human_day_real_run_replays_metrics_and_trace_projection

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.38s

*** result: Failure(101)
