*** crates/tracewake-core/src/events/envelope.rs:1101:5: replace serialize_cause -> String with String::new()

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ replace serialize_cause -> String with String::new()
@@ -1093,22 +1093,17 @@
         "actor" => Ok(SchedulerSourceId::Actor(ActorId::new(value)?)),
         "controller" => Ok(SchedulerSourceId::Controller(ControllerId::new(value)?)),
         "process" => Ok(SchedulerSourceId::Process(ProcessId::new(value)?)),
         _ => Err(EventEnvelopeParseError::UnknownSchedulerSource),
     }
 }
 
 fn serialize_cause(cause: &EventCause) -> String {
-    match cause {
-        EventCause::Event(id) => format!("event:{}", id.as_str()),
-        EventCause::Proposal(id) => format!("proposal:{}", id.as_str()),
-        EventCause::ValidationReport(id) => format!("validation_report:{}", id.as_str()),
-        EventCause::Process(id) => format!("process:{}", id.as_str()),
-    }
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn deserialize_cause(value: &str) -> Result<EventCause, EventEnvelopeParseError> {
     let (kind, value) = value
         .split_once(':')
         .ok_or(EventEnvelopeParseError::UnknownCause)?;
     match kind {
         "event" => Ok(EventCause::Event(EventId::new(value)?)),

---- serialized_event_log_replays_to_identical_state stdout ----

thread 'serialized_event_log_replays_to_identical_state' (15064) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:436:59:
called `Result::unwrap()` on an `Err` value: EventLog(Parse(UnknownCause))

---- sleep_eat_work_fixture_logs_need_effects_and_replays stdout ----

thread 'sleep_eat_work_fixture_logs_need_effects_and_replays' (15067) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1280:80:
called `Result::unwrap()` on an `Err` value: Parse(UnknownCause)

---- work_block_failed_then_sleep_succeeds_fixture_closes_reservation stdout ----

thread 'work_block_failed_then_sleep_succeeds_fixture_closes_reservation' (15071) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1383:5:
assertion `left == right` failed

failures:
    no_human_day_real_run_replays_metrics_and_trace_projection
    serialized_event_log_replays_to_identical_state
    sleep_eat_work_fixture_logs_need_effects_and_replays
    work_block_failed_then_sleep_succeeds_fixture_closes_reservation

test result: FAILED. 38 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.37s

*** result: Failure(101)
