*** crates/tracewake-core/src/events/envelope.rs:1115:9: delete match arm "proposal" in deserialize_cause

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ delete match arm "proposal" in deserialize_cause
@@ -1107,17 +1107,17 @@
 }
 
 fn deserialize_cause(value: &str) -> Result<EventCause, EventEnvelopeParseError> {
     let (kind, value) = value
         .split_once(':')
         .ok_or(EventEnvelopeParseError::UnknownCause)?;
     match kind {
         "event" => Ok(EventCause::Event(EventId::new(value)?)),
-        "proposal" => Ok(EventCause::Proposal(ProposalId::new(value)?)),
+         /* ~ changed by cargo-mutants ~ */
         "validation_report" => Ok(EventCause::ValidationReport(ValidationReportId::new(
             value,
         )?)),
         "process" => Ok(EventCause::Process(ProcessId::new(value)?)),
         _ => Err(EventEnvelopeParseError::UnknownCause),
     }
 }

---- serialized_event_log_replays_to_identical_state stdout ----

thread 'serialized_event_log_replays_to_identical_state' (27373) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:436:59:
called `Result::unwrap()` on an `Err` value: EventLog(Parse(UnknownCause))

---- work_block_failed_then_sleep_succeeds_fixture_closes_reservation stdout ----

thread 'work_block_failed_then_sleep_succeeds_fixture_closes_reservation' (27380) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1382:80:
called `Result::unwrap()` on an `Err` value: Parse(UnknownCause)

---- sleep_eat_work_fixture_logs_need_effects_and_replays stdout ----

thread 'sleep_eat_work_fixture_logs_need_effects_and_replays' (27376) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1280:80:
called `Result::unwrap()` on an `Err` value: Parse(UnknownCause)

failures:
    no_human_day_real_run_replays_metrics_and_trace_projection
    serialized_event_log_replays_to_identical_state
    sleep_eat_work_fixture_logs_need_effects_and_replays
    work_block_failed_then_sleep_succeeds_fixture_closes_reservation

test result: FAILED. 38 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.36s

*** result: Failure(101)
