*** crates/tracewake-core/src/events/envelope.rs:1116:9: delete match arm "validation_report" in deserialize_cause

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ delete match arm "validation_report" in deserialize_cause
@@ -1108,19 +1108,17 @@
 
 fn deserialize_cause(value: &str) -> Result<EventCause, EventEnvelopeParseError> {
     let (kind, value) = value
         .split_once(':')
         .ok_or(EventEnvelopeParseError::UnknownCause)?;
     match kind {
         "event" => Ok(EventCause::Event(EventId::new(value)?)),
         "proposal" => Ok(EventCause::Proposal(ProposalId::new(value)?)),
-        "validation_report" => Ok(EventCause::ValidationReport(ValidationReportId::new(
-            value,
-        )?)),
+         /* ~ changed by cargo-mutants ~ */
         "process" => Ok(EventCause::Process(ProcessId::new(value)?)),
         _ => Err(EventEnvelopeParseError::UnknownCause),
     }
 }
 
 fn serialize_random_draw(draw: &RandomDrawRef) -> String {
     [draw.scope.clone(), draw.draw_id.clone(), draw.value.clone()]
         .into_iter()

---- envelope_identity_round_trips_stream_phase_source_cause_and_random_draws stdout ----

thread 'envelope_identity_round_trips_stream_phase_source_cause_and_random_draws' (32058) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:1776:72:
called `Result::unwrap()` on an `Err` value: Parse(UnknownCause)

failures:
    envelope_identity_round_trips_stream_phase_source_cause_and_random_draws

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
