*** crates/tracewake-core/src/events/envelope.rs:1119:9: delete match arm "process" in deserialize_cause

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ delete match arm "process" in deserialize_cause
@@ -1111,17 +1111,17 @@
         .split_once(':')
         .ok_or(EventEnvelopeParseError::UnknownCause)?;
     match kind {
         "event" => Ok(EventCause::Event(EventId::new(value)?)),
         "proposal" => Ok(EventCause::Proposal(ProposalId::new(value)?)),
         "validation_report" => Ok(EventCause::ValidationReport(ValidationReportId::new(
             value,
         )?)),
-        "process" => Ok(EventCause::Process(ProcessId::new(value)?)),
+         /* ~ changed by cargo-mutants ~ */
         _ => Err(EventEnvelopeParseError::UnknownCause),
     }
 }
 
 fn serialize_random_draw(draw: &RandomDrawRef) -> String {
     [draw.scope.clone(), draw.draw_id.clone(), draw.value.clone()]
         .into_iter()
         .map(|part| encode(&part))

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (3684) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2704:68:
called `Result::unwrap()` on an `Err` value: Parse(UnknownCause)

failures:
    no_human_day_real_run_replays_metrics_and_trace_projection

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.37s

*** result: Failure(101)
