*** crates/tracewake-core/src/events/envelope.rs:1125:5: replace serialize_random_draw -> String with String::new()

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ replace serialize_random_draw -> String with String::new()
@@ -1117,21 +1117,17 @@
             value,
         )?)),
         "process" => Ok(EventCause::Process(ProcessId::new(value)?)),
         _ => Err(EventEnvelopeParseError::UnknownCause),
     }
 }
 
 fn serialize_random_draw(draw: &RandomDrawRef) -> String {
-    [draw.scope.clone(), draw.draw_id.clone(), draw.value.clone()]
-        .into_iter()
-        .map(|part| encode(&part))
-        .collect::<Vec<_>>()
-        .join(":")
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn deserialize_random_draw(value: &str) -> Result<RandomDrawRef, EventEnvelopeParseError> {
     let parts = value
         .split(':')
         .map(decode)
         .collect::<Result<Vec<_>, _>>()?;
     if parts.len() != 3 {

---- random_draw_deserialization_rejects_malformed_and_bad_hex_records stdout ----

thread 'random_draw_deserialization_rejects_malformed_and_bad_hex_records' (8407) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:1845:5:
event_id=6576656e745f72616e646f6d5f647261775f636f7272757074696f6e5f6d6174726978
event_type=6163746f725f776169746564
event_schema_version=6576656e745f736368656d615f7631
stream=776f726c64
stream_position=0
global_order=0
sim_tick=0
actor_id=
process_id=
participants=

---- envelope_identity_round_trips_stream_phase_source_cause_and_random_draws stdout ----

thread 'envelope_identity_round_trips_stream_phase_source_cause_and_random_draws' (8393) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:1782:5:
assertion `left == right` failed

failures:
    envelope_identity_round_trips_stream_phase_source_cause_and_random_draws
    random_draw_deserialization_rejects_malformed_and_bad_hex_records

test result: FAILED. 30 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
