*** crates/tracewake-core/src/events/envelope.rs:1137:20: replace != with == in deserialize_random_draw

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ replace != with == in deserialize_random_draw
@@ -1129,17 +1129,17 @@
         .join(":")
 }
 
 fn deserialize_random_draw(value: &str) -> Result<RandomDrawRef, EventEnvelopeParseError> {
     let parts = value
         .split(':')
         .map(decode)
         .collect::<Result<Vec<_>, _>>()?;
-    if parts.len() != 3 {
+    if parts.len() == /* ~ changed by cargo-mutants ~ */ 3 {
         return Err(EventEnvelopeParseError::InvalidTuple);
     }
     Ok(RandomDrawRef::new(&parts[0], &parts[1], &parts[2]))
 }
 
 fn serialize_payload(field: &PayloadField) -> String {
     format!("{}:{}", encode(&field.key), encode(&field.value))
 }

---- envelope_identity_round_trips_stream_phase_source_cause_and_random_draws stdout ----

thread 'envelope_identity_round_trips_stream_phase_source_cause_and_random_draws' (17810) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:1776:72:
called `Result::unwrap()` on an `Err` value: Parse(InvalidTuple)

---- random_draw_deserialization_rejects_malformed_and_bad_hex_records stdout ----

thread 'random_draw_deserialization_rejects_malformed_and_bad_hex_records' (17824) panicked at crates/tracewake-core/src/events/envelope.rs:1140:55:
index out of bounds: the len is 2 but the index is 2

failures:
    envelope_identity_round_trips_stream_phase_source_cause_and_random_draws
    random_draw_deserialization_rejects_malformed_and_bad_hex_records

test result: FAILED. 30 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
