*** crates/tracewake-core/src/events/envelope.rs:1144:5: replace serialize_payload -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ replace serialize_payload -> String with "xyzzy".into()
@@ -1136,17 +1136,17 @@
         .collect::<Result<Vec<_>, _>>()?;
     if parts.len() != 3 {
         return Err(EventEnvelopeParseError::InvalidTuple);
     }
     Ok(RandomDrawRef::new(&parts[0], &parts[1], &parts[2]))
 }
 
 fn serialize_payload(field: &PayloadField) -> String {
-    format!("{}:{}", encode(&field.key), encode(&field.value))
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 fn deserialize_payload(value: &str) -> Result<PayloadField, EventEnvelopeParseError> {
     let (key, value) = value
         .split_once(':')
         .ok_or(EventEnvelopeParseError::InvalidTuple)?;
     Ok(PayloadField::new(decode(key)?, decode(value)?))
 }

---- serialized_event_log_replays_to_identical_state stdout ----

thread 'serialized_event_log_replays_to_identical_state' (26025) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:436:59:
called `Result::unwrap()` on an `Err` value: EventLog(Parse(InvalidTuple))

---- sleep_eat_work_fixture_logs_need_effects_and_replays stdout ----

thread 'sleep_eat_work_fixture_logs_need_effects_and_replays' (26028) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1280:80:
called `Result::unwrap()` on an `Err` value: Parse(InvalidTuple)

---- work_block_failed_then_sleep_succeeds_fixture_closes_reservation stdout ----

thread 'work_block_failed_then_sleep_succeeds_fixture_closes_reservation' (26032) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1382:80:
called `Result::unwrap()` on an `Err` value: Parse(InvalidTuple)

failures:
    no_human_day_real_run_replays_metrics_and_trace_projection
    serialized_event_log_replays_to_identical_state
    sleep_eat_work_fixture_logs_need_effects_and_replays
    work_block_failed_then_sleep_succeeds_fixture_closes_reservation

test result: FAILED. 38 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.29s

*** result: Failure(101)
