*** crates/tracewake-core/src/events/envelope.rs:1155:5: replace encode_opt -> String with String::new()

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ replace encode_opt -> String with String::new()
@@ -1147,17 +1147,17 @@
 fn deserialize_payload(value: &str) -> Result<PayloadField, EventEnvelopeParseError> {
     let (key, value) = value
         .split_once(':')
         .ok_or(EventEnvelopeParseError::InvalidTuple)?;
     Ok(PayloadField::new(decode(key)?, decode(value)?))
 }
 
 fn encode_opt(value: Option<&str>) -> String {
-    value.map(encode).unwrap_or_default()
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn decode_opt(value: &str) -> Result<Option<String>, EventEnvelopeParseError> {
     if value.is_empty() {
         Ok(None)
     } else {
         Ok(Some(decode(value)?))
     }

---- work_block_failed_then_sleep_succeeds_fixture_closes_reservation stdout ----

thread 'work_block_failed_then_sleep_succeeds_fixture_closes_reservation' (30143) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1383:5:
assertion `left == right` failed

---- sleep_eat_work_fixture_logs_need_effects_and_replays stdout ----

thread 'sleep_eat_work_fixture_logs_need_effects_and_replays' (30139) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1281:5:
assertion `left == right` failed

---- serialized_event_log_replays_to_identical_state stdout ----

thread 'serialized_event_log_replays_to_identical_state' (30136) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:454:5:
assertion `left == right` failed
  left: AgentStateChecksum("twa1-da0568c14cb68db2")
 right: AgentStateChecksum("twa1-054f9ffb6085ba9e")

failures:
    no_human_day_real_run_replays_metrics_and_trace_projection
    serialized_event_log_replays_to_identical_state
    sleep_eat_work_fixture_logs_need_effects_and_replays
    work_block_failed_then_sleep_succeeds_fixture_closes_reservation

test result: FAILED. 38 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.58s

*** result: Failure(101)
