*** crates/tracewake-core/src/events/envelope.rs:1155:5: replace encode_opt -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ replace encode_opt -> String with "xyzzy".into()
@@ -1147,17 +1147,17 @@
 fn deserialize_payload(value: &str) -> Result<PayloadField, EventEnvelopeParseError> {
     let (key, value) = value
         .split_once(':')
         .ok_or(EventEnvelopeParseError::InvalidTuple)?;
     Ok(PayloadField::new(decode(key)?, decode(value)?))
 }
 
 fn encode_opt(value: Option<&str>) -> String {
-    value.map(encode).unwrap_or_default()
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 fn decode_opt(value: &str) -> Result<Option<String>, EventEnvelopeParseError> {
     if value.is_empty() {
         Ok(None)
     } else {
         Ok(Some(decode(value)?))
     }

---- serialization::tests::event_log_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::event_log_serialization_round_trips_byte_identically' (1642) panicked at crates/tracewake-content/src/serialization.rs:920:73:
called `Result::unwrap()` on an `Err` value: EventLog(Parse(BadHex))

failures:
    serialization::tests::event_log_serialization_round_trips_byte_identically

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
