*** crates/tracewake-core/src/events/envelope.rs:1159:5: replace decode_opt -> Result<Option<String>, EventEnvelopeParseError> with Ok(Some("xyzzy".into()))

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ replace decode_opt -> Result<Option<String>, EventEnvelopeParseError> with Ok(Some("xyzzy".into()))
@@ -1151,21 +1151,17 @@
     Ok(PayloadField::new(decode(key)?, decode(value)?))
 }
 
 fn encode_opt(value: Option<&str>) -> String {
     value.map(encode).unwrap_or_default()
 }
 
 fn decode_opt(value: &str) -> Result<Option<String>, EventEnvelopeParseError> {
-    if value.is_empty() {
-        Ok(None)
-    } else {
-        Ok(Some(decode(value)?))
-    }
+    Ok(Some("xyzzy".into())) /* ~ changed by cargo-mutants ~ */
 }
 
 fn encode_vec(values: &[String]) -> String {
     values
         .iter()
         .map(|value| encode(value))
         .collect::<Vec<_>>()
         .join(";")

---- serialization::tests::event_log_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::event_log_serialization_round_trips_byte_identically' (13734) panicked at crates/tracewake-content/src/serialization.rs:922:9:
assertion `left == right` failed

failures:
    serialization::tests::event_log_serialization_round_trips_byte_identically

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
