*** crates/tracewake-core/src/events/envelope.rs:1167:5: replace encode_vec -> String with String::new()

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ replace encode_vec -> String with String::new()
@@ -1159,21 +1159,17 @@
     if value.is_empty() {
         Ok(None)
     } else {
         Ok(Some(decode(value)?))
     }
 }
 
 fn encode_vec(values: &[String]) -> String {
-    values
-        .iter()
-        .map(|value| encode(value))
-        .collect::<Vec<_>>()
-        .join(";")
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn decode_vec(value: &str) -> Result<Vec<String>, EventEnvelopeParseError> {
     if value.is_empty() {
         Ok(Vec::new())
     } else {
         value.split(';').map(decode).collect()
     }

---- serialized_event_log_replays_to_identical_state stdout ----

thread 'serialized_event_log_replays_to_identical_state' (17855) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:453:5:
assertion `left == right` failed
  left: PhysicalChecksum("twc1-9445ea90892ac503")
 right: PhysicalChecksum("twc1-8ed2e066167c51de")

---- work_block_failed_then_sleep_succeeds_fixture_closes_reservation stdout ----

thread 'work_block_failed_then_sleep_succeeds_fixture_closes_reservation' (17862) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1383:5:
assertion `left == right` failed

---- sleep_eat_work_fixture_logs_need_effects_and_replays stdout ----

thread 'sleep_eat_work_fixture_logs_need_effects_and_replays' (17858) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1281:5:
assertion `left == right` failed

failures:
    serialized_event_log_replays_to_identical_state
    sleep_eat_work_fixture_logs_need_effects_and_replays
    work_block_failed_then_sleep_succeeds_fixture_closes_reservation

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.35s

*** result: Failure(101)
