*** crates/tracewake-core/src/events/envelope.rs:1167:5: replace encode_vec -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ replace encode_vec -> String with "xyzzy".into()
@@ -1159,21 +1159,17 @@
     if value.is_empty() {
         Ok(None)
     } else {
         Ok(Some(decode(value)?))
     }
 }
 
 fn encode_vec(values: &[String]) -> String {
-    values
-        .iter()
-        .map(|value| encode(value))
-        .collect::<Vec<_>>()
-        .join(";")
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 fn decode_vec(value: &str) -> Result<Vec<String>, EventEnvelopeParseError> {
     if value.is_empty() {
         Ok(Vec::new())
     } else {
         value.split(';').map(decode).collect()
     }

---- serialization::tests::event_log_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::event_log_serialization_round_trips_byte_identically' (21829) panicked at crates/tracewake-content/src/serialization.rs:920:73:
called `Result::unwrap()` on an `Err` value: EventLog(Parse(BadHex))

failures:
    serialization::tests::event_log_serialization_round_trips_byte_identically

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
