*** crates/tracewake-core/src/events/envelope.rs:1175:5: replace decode_vec -> Result<Vec<String>, EventEnvelopeParseError> with Ok(vec![String::new()])

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ replace decode_vec -> Result<Vec<String>, EventEnvelopeParseError> with Ok(vec![String::new()])
@@ -1167,21 +1167,17 @@
     values
         .iter()
         .map(|value| encode(value))
         .collect::<Vec<_>>()
         .join(";")
 }
 
 fn decode_vec(value: &str) -> Result<Vec<String>, EventEnvelopeParseError> {
-    if value.is_empty() {
-        Ok(Vec::new())
-    } else {
-        value.split(';').map(decode).collect()
-    }
+    Ok(vec![String::new()]) /* ~ changed by cargo-mutants ~ */
 }
 
 fn encode(value: &str) -> String {
     value
         .as_bytes()
         .iter()
         .map(|byte| format!("{byte:02x}"))
         .collect()

---- serialization::tests::event_log_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::event_log_serialization_round_trips_byte_identically' (29924) panicked at crates/tracewake-content/src/serialization.rs:920:73:
called `Result::unwrap()` on an `Err` value: EventLog(Parse(UnknownCause))

failures:
    serialization::tests::event_log_serialization_round_trips_byte_identically

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
