*** crates/tracewake-core/src/events/envelope.rs:1183:5: replace encode -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ replace encode -> String with "xyzzy".into()
@@ -1175,21 +1175,17 @@
     if value.is_empty() {
         Ok(Vec::new())
     } else {
         value.split(';').map(decode).collect()
     }
 }
 
 fn encode(value: &str) -> String {
-    value
-        .as_bytes()
-        .iter()
-        .map(|byte| format!("{byte:02x}"))
-        .collect()
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 fn decode(value: &str) -> Result<String, EventEnvelopeParseError> {
     if !value.len().is_multiple_of(2) {
         return Err(EventEnvelopeParseError::BadHex);
     }
 
     let mut bytes = Vec::with_capacity(value.len() / 2);

---- serialization::tests::event_log_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::event_log_serialization_round_trips_byte_identically' (9445) panicked at crates/tracewake-content/src/serialization.rs:920:73:
called `Result::unwrap()` on an `Err` value: EventLog(Parse(BadHex))

failures:
    serialization::tests::event_log_serialization_round_trips_byte_identically

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
