*** crates/tracewake-core/src/events/envelope.rs:1191:8: delete ! in decode

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ delete ! in decode
@@ -1183,17 +1183,17 @@
     value
         .as_bytes()
         .iter()
         .map(|byte| format!("{byte:02x}"))
         .collect()
 }
 
 fn decode(value: &str) -> Result<String, EventEnvelopeParseError> {
-    if !value.len().is_multiple_of(2) {
+    if  /* ~ changed by cargo-mutants ~ */value.len().is_multiple_of(2) {
         return Err(EventEnvelopeParseError::BadHex);
     }
 
     let mut bytes = Vec::with_capacity(value.len() / 2);
     let chars: Vec<_> = value.as_bytes().chunks_exact(2).collect();
     for chunk in chars {
         let hex = std::str::from_utf8(chunk).map_err(|_| EventEnvelopeParseError::BadHex)?;
         let byte = u8::from_str_radix(hex, 16).map_err(|_| EventEnvelopeParseError::BadHex)?;

---- serialization::tests::event_log_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::event_log_serialization_round_trips_byte_identically' (21433) panicked at crates/tracewake-content/src/serialization.rs:920:73:
called `Result::unwrap()` on an `Err` value: EventLog(Parse(BadHex))

failures:
    serialization::tests::event_log_serialization_round_trips_byte_identically

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
