*** crates/tracewake-core/src/events/envelope.rs:200:9: replace EventKind::registry -> Vec<EventKindMetadata> with vec![]

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ replace EventKind::registry -> Vec<EventKindMetadata> with vec![]
@@ -192,17 +192,17 @@
             EventKind::StuckDiagnosticRecorded,
             EventKind::NoHumanDayStarted,
             EventKind::NoHumanDayCompleted,
             EventKind::ReplayProjectionRebuilt,
         ]
     }
 
     pub fn registry() -> Vec<EventKindMetadata> {
-        Self::all().iter().map(|kind| kind.metadata()).collect()
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 
     pub const fn metadata(self) -> EventKindMetadata {
         EventKindMetadata {
             kind: self,
             stream: self.stream(),
             schema_version: EventSchemaVersion::V1,
             physical_mutating: self.physical_mutating(),

---- events::tests::registry_covers_every_known_kind stdout ----

thread 'events::tests::registry_covers_every_known_kind' (13696) panicked at crates/tracewake-core/src/events/mod.rs:54:9:
assertion `left == right` failed
  left: []

failures:
    events::tests::registry_covers_every_known_kind

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
