*** crates/tracewake-core/src/events/envelope.rs:277:9: replace EventKind::physical_mutating -> bool with true

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ replace EventKind::physical_mutating -> bool with true
@@ -269,31 +269,17 @@
             | EventKind::ItemPlacedInPlace
             | EventKind::FoodConsumed
             | EventKind::ActorWaited
             | EventKind::TimeAdvanced => EventStream::World,
         }
     }
 
     pub const fn physical_mutating(self) -> bool {
-        matches!(
-            self,
-            EventKind::ActorMoved
-                | EventKind::DoorOpened
-                | EventKind::DoorClosed
-                | EventKind::ContainerOpened
-                | EventKind::ContainerClosed
-                | EventKind::ItemRemovedFromContainer
-                | EventKind::ItemTakenFromPlace
-                | EventKind::ItemPlacedInContainer
-                | EventKind::ItemPlacedInPlace
-                | EventKind::FoodConsumed
-                | EventKind::ActorWaited
-                | EventKind::TimeAdvanced
-        )
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     pub const fn stable_id(self) -> &'static str {
         match self {
             EventKind::ControllerAttached => "controller_attached",
             EventKind::ControllerDetached => "controller_detached",
             EventKind::ActorMoved => "actor_moved",
             EventKind::DoorOpened => "door_opened",

---- events::envelope::tests::epistemic_event_kinds_classify_to_epistemic_stream stdout ----

thread 'events::envelope::tests::epistemic_event_kinds_classify_to_epistemic_stream' (18277) panicked at crates/tracewake-core/src/events/envelope.rs:1352:13:
assertion failed: !kind.physical_mutating()

---- events::envelope::tests::phase_3a_event_kinds_are_agent_stream_and_round_trip stdout ----

thread 'events::envelope::tests::phase_3a_event_kinds_are_agent_stream_and_round_trip' (18282) panicked at crates/tracewake-core/src/events/envelope.rs:1374:13:
assertion failed: !kind.physical_mutating()

---- events::tests::event_kinds_map_to_one_stream_and_non_world_is_non_mutating stdout ----

thread 'events::tests::event_kinds_map_to_one_stream_and_non_world_is_non_mutating' (18290) panicked at crates/tracewake-core/src/events/mod.rs:41:17:
assertion failed: !metadata.physical_mutating

failures:
    events::envelope::tests::epistemic_event_kinds_classify_to_epistemic_stream
    events::envelope::tests::phase_3a_event_kinds_are_agent_stream_and_round_trip
    events::tests::event_kinds_map_to_one_stream_and_non_world_is_non_mutating

test result: FAILED. 452 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
