*** crates/tracewake-core/src/events/envelope.rs:277:9: replace EventKind::physical_mutating -> bool with false

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ replace EventKind::physical_mutating -> bool with false
@@ -269,31 +269,17 @@
             | EventKind::ItemPlacedInPlace
             | EventKind::FoodConsumed
             | EventKind::ActorWaited
             | EventKind::TimeAdvanced => EventStream::World,
         }
     }
 
     pub const fn physical_mutating(self) -> bool {
-        matches!(
-            self,
-            EventKind::ActorMoved
-                | EventKind::DoorOpened
-                | EventKind::DoorClosed
-                | EventKind::ContainerOpened
-                | EventKind::ContainerClosed
-                | EventKind::ItemRemovedFromContainer
-                | EventKind::ItemTakenFromPlace
-                | EventKind::ItemPlacedInContainer
-                | EventKind::ItemPlacedInPlace
-                | EventKind::FoodConsumed
-                | EventKind::ActorWaited
-                | EventKind::TimeAdvanced
-        )
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     pub const fn stable_id(self) -> &'static str {
         match self {
             EventKind::ControllerAttached => "controller_attached",
             EventKind::ControllerDetached => "controller_detached",
             EventKind::ActorMoved => "actor_moved",
             EventKind::DoorOpened => "door_opened",

---- events::envelope::tests::food_consumed_is_physical_world_event stdout ----

thread 'events::envelope::tests::food_consumed_is_physical_world_event' (22840) panicked at crates/tracewake-core/src/events/envelope.rs:1400:9:
assertion failed: EventKind::FoodConsumed.physical_mutating()

failures:
    events::envelope::tests::food_consumed_is_physical_world_event

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
