*** crates/tracewake-core/src/events/envelope.rs:295:9: replace EventKind::stable_id -> &'static str with ""

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ replace EventKind::stable_id -> &'static str with ""
@@ -287,74 +287,17 @@
                 | EventKind::ItemPlacedInPlace
                 | EventKind::FoodConsumed
                 | EventKind::ActorWaited
                 | EventKind::TimeAdvanced
         )
     }
 
     pub const fn stable_id(self) -> &'static str {
-        match self {
-            EventKind::ControllerAttached => "controller_attached",
-            EventKind::ControllerDetached => "controller_detached",
-            EventKind::ActorMoved => "actor_moved",
-            EventKind::DoorOpened => "door_opened",
-            EventKind::DoorClosed => "door_closed",
-            EventKind::ContainerOpened => "container_opened",
-            EventKind::ContainerClosed => "container_closed",
-            EventKind::ItemRemovedFromContainer => "item_removed_from_container",
-            EventKind::ItemTakenFromPlace => "item_taken_from_place",
-            EventKind::ItemPlacedInContainer => "item_placed_in_container",
-            EventKind::ItemPlacedInPlace => "item_placed_in_place",
-            EventKind::ActorWaited => "actor_waited",
-            EventKind::TimeAdvanced => "time_advanced",
-            EventKind::ActionStarted => "action_started",
-            EventKind::ActionFailed => "action_failed",
-            EventKind::ActionRejected => "action_rejected",
-            EventKind::NoHumanAdvanceStarted => "no_human_advance_started",
-            EventKind::NoHumanAdvanceCompleted => "no_human_advance_completed",
-            EventKind::InitialBeliefSeeded => "initial_belief_seeded",
-            EventKind::RoleAssignmentNoticeRecorded => "role_assignment_notice_recorded",
-            EventKind::StartingBeliefRecorded => "starting_belief_recorded",
-            EventKind::ObservationRecorded => "observation_recorded",
-            EventKind::BeliefUpdated => "belief_updated",
-            EventKind::ExpectationContradicted => "expectation_contradicted",
-            EventKind::ContainerChecked => "container_checked",
-            EventKind::NeedDeltaApplied => "need_delta_applied",
-            EventKind::NeedThresholdCrossed => "need_threshold_crossed",
-            EventKind::CandidateGoalsEvaluated => "candidate_goals_evaluated",
-            EventKind::IntentionStarted => "intention_started",
-            EventKind::IntentionContinued => "intention_continued",
-            EventKind::IntentionSuspended => "intention_suspended",
-            EventKind::IntentionResumed => "intention_resumed",
-            EventKind::IntentionCompleted => "intention_completed",
-            EventKind::IntentionFailed => "intention_failed",
-            EventKind::IntentionAbandoned => "intention_abandoned",
-            EventKind::IntentionInterrupted => "intention_interrupted",
-            EventKind::RoutineStepStarted => "routine_step_started",
-            EventKind::RoutineStepCompleted => "routine_step_completed",
-            EventKind::RoutineStepFailed => "routine_step_failed",
-            EventKind::DecisionTraceRecorded => "decision_trace_recorded",
-            EventKind::SleepStarted => "sleep_started",
-            EventKind::SleepCompleted => "sleep_completed",
-            EventKind::SleepInterrupted => "sleep_interrupted",
-            EventKind::FoodConsumed => "food_consumed",
-            EventKind::FoodServiceUsed => "food_service_used",
-            EventKind::EatFailed => "eat_failed",
-            EventKind::WorkBlockStarted => "work_block_started",
-            EventKind::WorkBlockCompleted => "work_block_completed",
-            EventKind::WorkBlockFailed => "work_block_failed",
-            EventKind::ContinueRoutineProposed => "continue_routine_proposed",
-            EventKind::ContinueRoutineAccepted => "continue_routine_accepted",
-            EventKind::ContinueRoutineRejected => "continue_routine_rejected",
-            EventKind::StuckDiagnosticRecorded => "stuck_diagnostic_recorded",
-            EventKind::NoHumanDayStarted => "no_human_day_started",
-            EventKind::NoHumanDayCompleted => "no_human_day_completed",
-            EventKind::ReplayProjectionRebuilt => "replay_projection_rebuilt",
-        }
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     fn from_stable_id(value: &str) -> Option<Self> {
         Self::all()
             .iter()
             .copied()
             .find(|kind| kind.stable_id() == value)
     }

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (27011) panicked at crates/tracewake-core/src/scheduler.rs:2321:49:
called `Result::unwrap()` on an `Err` value: Empty

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
