*** crates/tracewake-core/src/events/envelope.rs:295:9: replace EventKind::stable_id -> &'static str with "xyzzy"

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ replace EventKind::stable_id -> &'static str with "xyzzy"
@@ -287,74 +287,17 @@
                 | EventKind::ItemPlacedInPlace
                 | EventKind::FoodConsumed
                 | EventKind::ActorWaited
                 | EventKind::TimeAdvanced
         )
     }
 
     pub const fn stable_id(self) -> &'static str {
-        match self {
-            EventKind::ControllerAttached => "controller_attached",
-            EventKind::ControllerDetached => "controller_detached",
-            EventKind::ActorMoved => "actor_moved",
-            EventKind::DoorOpened => "door_opened",
-            EventKind::DoorClosed => "door_closed",
-            EventKind::ContainerOpened => "container_opened",
-            EventKind::ContainerClosed => "container_closed",
-            EventKind::ItemRemovedFromContainer => "item_removed_from_container",
-            EventKind::ItemTakenFromPlace => "item_taken_from_place",
-            EventKind::ItemPlacedInContainer => "item_placed_in_container",
-            EventKind::ItemPlacedInPlace => "item_placed_in_place",
-            EventKind::ActorWaited => "actor_waited",
-            EventKind::TimeAdvanced => "time_advanced",
-            EventKind::ActionStarted => "action_started",
-            EventKind::ActionFailed => "action_failed",
-            EventKind::ActionRejected => "action_rejected",
-            EventKind::NoHumanAdvanceStarted => "no_human_advance_started",
-            EventKind::NoHumanAdvanceCompleted => "no_human_advance_completed",
-            EventKind::InitialBeliefSeeded => "initial_belief_seeded",
-            EventKind::RoleAssignmentNoticeRecorded => "role_assignment_notice_recorded",
-            EventKind::StartingBeliefRecorded => "starting_belief_recorded",
-            EventKind::ObservationRecorded => "observation_recorded",
-            EventKind::BeliefUpdated => "belief_updated",
-            EventKind::ExpectationContradicted => "expectation_contradicted",
-            EventKind::ContainerChecked => "container_checked",
-            EventKind::NeedDeltaApplied => "need_delta_applied",
-            EventKind::NeedThresholdCrossed => "need_threshold_crossed",
-            EventKind::CandidateGoalsEvaluated => "candidate_goals_evaluated",
-            EventKind::IntentionStarted => "intention_started",
-            EventKind::IntentionContinued => "intention_continued",
-            EventKind::IntentionSuspended => "intention_suspended",
-            EventKind::IntentionResumed => "intention_resumed",
-            EventKind::IntentionCompleted => "intention_completed",
-            EventKind::IntentionFailed => "intention_failed",
-            EventKind::IntentionAbandoned => "intention_abandoned",
-            EventKind::IntentionInterrupted => "intention_interrupted",
-            EventKind::RoutineStepStarted => "routine_step_started",
-            EventKind::RoutineStepCompleted => "routine_step_completed",
-            EventKind::RoutineStepFailed => "routine_step_failed",
-            EventKind::DecisionTraceRecorded => "decision_trace_recorded",
-            EventKind::SleepStarted => "sleep_started",
-            EventKind::SleepCompleted => "sleep_completed",
-            EventKind::SleepInterrupted => "sleep_interrupted",
-            EventKind::FoodConsumed => "food_consumed",
-            EventKind::FoodServiceUsed => "food_service_used",
-            EventKind::EatFailed => "eat_failed",
-            EventKind::WorkBlockStarted => "work_block_started",
-            EventKind::WorkBlockCompleted => "work_block_completed",
-            EventKind::WorkBlockFailed => "work_block_failed",
-            EventKind::ContinueRoutineProposed => "continue_routine_proposed",
-            EventKind::ContinueRoutineAccepted => "continue_routine_accepted",
-            EventKind::ContinueRoutineRejected => "continue_routine_rejected",
-            EventKind::StuckDiagnosticRecorded => "stuck_diagnostic_recorded",
-            EventKind::NoHumanDayStarted => "no_human_day_started",
-            EventKind::NoHumanDayCompleted => "no_human_day_completed",
-            EventKind::ReplayProjectionRebuilt => "replay_projection_rebuilt",
-        }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     fn from_stable_id(value: &str) -> Option<Self> {
         Self::all()
             .iter()
             .copied()
             .find(|kind| kind.stable_id() == value)
     }

---- continue_routine_tamper_kind_flip_poisons_replay stdout ----

thread 'continue_routine_tamper_kind_flip_poisons_replay' (31074) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2780:5:
assertion failed: !replay.matches_expected

---- sleep_eat_work_fixture_logs_need_effects_and_replays stdout ----

thread 'sleep_eat_work_fixture_logs_need_effects_and_replays' (31110) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1281:5:
assertion `left == right` failed

---- serialized_event_log_replays_to_identical_state stdout ----

thread 'serialized_event_log_replays_to_identical_state' (31107) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:453:5:
assertion `left == right` failed
  left: PhysicalChecksum("twc1-9445ea90892ac503")
 right: PhysicalChecksum("twc1-8ed2e066167c51de")

failures:
    continue_routine_tamper_kind_flip_poisons_replay
    no_human_day_real_run_replays_metrics_and_trace_projection
    serialized_event_log_replays_to_identical_state
    sleep_eat_work_fixture_logs_need_effects_and_replays
    work_block_failed_then_sleep_succeeds_fixture_closes_reservation

test result: FAILED. 37 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.56s

*** result: Failure(101)
