*** crates/tracewake-core/src/events/envelope.rs:356:9: replace EventKind::from_stable_id -> Option<Self> with None

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ replace EventKind::from_stable_id -> Option<Self> with None
@@ -348,20 +348,17 @@
             EventKind::StuckDiagnosticRecorded => "stuck_diagnostic_recorded",
             EventKind::NoHumanDayStarted => "no_human_day_started",
             EventKind::NoHumanDayCompleted => "no_human_day_completed",
             EventKind::ReplayProjectionRebuilt => "replay_projection_rebuilt",
         }
     }
 
     fn from_stable_id(value: &str) -> Option<Self> {
-        Self::all()
-            .iter()
-            .copied()
-            .find(|kind| kind.stable_id() == value)
+        None /* ~ changed by cargo-mutants ~ */
     }
 }
 
 pub const fn is_duration_terminal(kind: EventKind) -> bool {
     match kind {
         EventKind::SleepCompleted
         | EventKind::SleepInterrupted
         | EventKind::WorkBlockCompleted

---- serialization::tests::event_log_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::event_log_serialization_round_trips_byte_identically' (2614) panicked at crates/tracewake-content/src/serialization.rs:920:73:
called `Result::unwrap()` on an `Err` value: EventLog(Parse(UnknownEventKind))

failures:
    serialization::tests::event_log_serialization_round_trips_byte_identically

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
