*** crates/tracewake-core/src/events/envelope.rs:359:43: replace == with != in EventKind::from_stable_id

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ replace == with != in EventKind::from_stable_id
@@ -351,17 +351,17 @@
             EventKind::ReplayProjectionRebuilt => "replay_projection_rebuilt",
         }
     }
 
     fn from_stable_id(value: &str) -> Option<Self> {
         Self::all()
             .iter()
             .copied()
-            .find(|kind| kind.stable_id() == value)
+            .find(|kind| kind.stable_id() != /* ~ changed by cargo-mutants ~ */ value)
     }
 }
 
 pub const fn is_duration_terminal(kind: EventKind) -> bool {
     match kind {
         EventKind::SleepCompleted
         | EventKind::SleepInterrupted
         | EventKind::WorkBlockCompleted

---- serialization::tests::event_log_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::event_log_serialization_round_trips_byte_identically' (6623) panicked at crates/tracewake-content/src/serialization.rs:922:9:
assertion `left == right` failed

failures:
    serialization::tests::event_log_serialization_round_trips_byte_identically

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
