*** crates/tracewake-core/src/events/envelope.rs:364:5: replace is_duration_terminal -> bool with true

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ replace is_duration_terminal -> bool with true
@@ -356,74 +356,17 @@
         Self::all()
             .iter()
             .copied()
             .find(|kind| kind.stable_id() == value)
     }
 }
 
 pub const fn is_duration_terminal(kind: EventKind) -> bool {
-    match kind {
-        EventKind::SleepCompleted
-        | EventKind::SleepInterrupted
-        | EventKind::WorkBlockCompleted
-        | EventKind::WorkBlockFailed => true,
-        EventKind::ControllerAttached
-        | EventKind::ControllerDetached
-        | EventKind::ActorMoved
-        | EventKind::DoorOpened
-        | EventKind::DoorClosed
-        | EventKind::ContainerOpened
-        | EventKind::ContainerClosed
-        | EventKind::ItemRemovedFromContainer
-        | EventKind::ItemTakenFromPlace
-        | EventKind::ItemPlacedInContainer
-        | EventKind::ItemPlacedInPlace
-        | EventKind::ActorWaited
-        | EventKind::TimeAdvanced
-        | EventKind::ActionStarted
-        | EventKind::ActionFailed
-        | EventKind::ActionRejected
-        | EventKind::NoHumanAdvanceStarted
-        | EventKind::NoHumanAdvanceCompleted
-        | EventKind::InitialBeliefSeeded
-        | EventKind::RoleAssignmentNoticeRecorded
-        | EventKind::StartingBeliefRecorded
-        | EventKind::ObservationRecorded
-        | EventKind::BeliefUpdated
-        | EventKind::ExpectationContradicted
-        | EventKind::ContainerChecked
-        | EventKind::NeedDeltaApplied
-        | EventKind::NeedThresholdCrossed
-        | EventKind::CandidateGoalsEvaluated
-        | EventKind::IntentionStarted
-        | EventKind::IntentionContinued
-        | EventKind::IntentionSuspended
-        | EventKind::IntentionResumed
-        | EventKind::IntentionCompleted
-        | EventKind::IntentionFailed
-        | EventKind::IntentionAbandoned
-        | EventKind::IntentionInterrupted
-        | EventKind::RoutineStepStarted
-        | EventKind::RoutineStepCompleted
-        | EventKind::RoutineStepFailed
-        | EventKind::DecisionTraceRecorded
-        | EventKind::SleepStarted
-        | EventKind::FoodConsumed
-        | EventKind::FoodServiceUsed
-        | EventKind::EatFailed
-        | EventKind::WorkBlockStarted
-        | EventKind::ContinueRoutineProposed
-        | EventKind::ContinueRoutineAccepted
-        | EventKind::ContinueRoutineRejected
-        | EventKind::StuckDiagnosticRecorded
-        | EventKind::NoHumanDayStarted
-        | EventKind::NoHumanDayCompleted
-        | EventKind::ReplayProjectionRebuilt => false,
-    }
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 impl EventKind {
     pub const fn requires_cause(self) -> bool {
         self.metadata().cause_required
     }
 
     const fn cause_required(self) -> bool {

---- episode_tamper_output_tag_poisons_replay stdout ----

thread 'episode_tamper_output_tag_poisons_replay' (10713) panicked at crates/tracewake-core/src/actions/pipeline.rs:416:6:

---- episode_tamper_proration_poisons_replay stdout ----

thread 'episode_tamper_proration_poisons_replay' (10714) panicked at crates/tracewake-core/src/need_accounting.rs:97:50:

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (10721) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2172:5:
assertion `left == right` failed
  left: {ActorId(StableId("actor_anna"))}
 right: {ActorId(StableId("actor_anna")), ActorId(StableId("actor_elena")), ActorId(StableId("actor_mara")), ActorId(StableId("actor_tomas"))}

failures:
    episode_tamper_output_tag_poisons_replay
    episode_tamper_proration_poisons_replay
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    serialized_event_log_replays_to_identical_state
    severe_safety_with_known_exit_produces_move_and_replays
    sleep_eat_work_fixture_logs_need_effects_and_replays
    sleep_spanning_window_boundary_charges_each_tick_once
    wait_then_window_passive_charges_each_tick_once
    work_block_failed_then_sleep_succeeds_fixture_closes_reservation

test result: FAILED. 32 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
