*** crates/tracewake-core/src/events/envelope.rs:364:5: replace is_duration_terminal -> bool with false

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ replace is_duration_terminal -> bool with false
@@ -356,74 +356,17 @@
         Self::all()
             .iter()
             .copied()
             .find(|kind| kind.stable_id() == value)
     }
 }
 
 pub const fn is_duration_terminal(kind: EventKind) -> bool {
-    match kind {
-        EventKind::SleepCompleted
-        | EventKind::SleepInterrupted
-        | EventKind::WorkBlockCompleted
-        | EventKind::WorkBlockFailed => true,
-        EventKind::ControllerAttached
-        | EventKind::ControllerDetached
-        | EventKind::ActorMoved
-        | EventKind::DoorOpened
-        | EventKind::DoorClosed
-        | EventKind::ContainerOpened
-        | EventKind::ContainerClosed
-        | EventKind::ItemRemovedFromContainer
-        | EventKind::ItemTakenFromPlace
-        | EventKind::ItemPlacedInContainer
-        | EventKind::ItemPlacedInPlace
-        | EventKind::ActorWaited
-        | EventKind::TimeAdvanced
-        | EventKind::ActionStarted
-        | EventKind::ActionFailed
-        | EventKind::ActionRejected
-        | EventKind::NoHumanAdvanceStarted
-        | EventKind::NoHumanAdvanceCompleted
-        | EventKind::InitialBeliefSeeded
-        | EventKind::RoleAssignmentNoticeRecorded
-        | EventKind::StartingBeliefRecorded
-        | EventKind::ObservationRecorded
-        | EventKind::BeliefUpdated
-        | EventKind::ExpectationContradicted
-        | EventKind::ContainerChecked
-        | EventKind::NeedDeltaApplied
-        | EventKind::NeedThresholdCrossed
-        | EventKind::CandidateGoalsEvaluated
-        | EventKind::IntentionStarted
-        | EventKind::IntentionContinued
-        | EventKind::IntentionSuspended
-        | EventKind::IntentionResumed
-        | EventKind::IntentionCompleted
-        | EventKind::IntentionFailed
-        | EventKind::IntentionAbandoned
-        | EventKind::IntentionInterrupted
-        | EventKind::RoutineStepStarted
-        | EventKind::RoutineStepCompleted
-        | EventKind::RoutineStepFailed
-        | EventKind::DecisionTraceRecorded
-        | EventKind::SleepStarted
-        | EventKind::FoodConsumed
-        | EventKind::FoodServiceUsed
-        | EventKind::EatFailed
-        | EventKind::WorkBlockStarted
-        | EventKind::ContinueRoutineProposed
-        | EventKind::ContinueRoutineAccepted
-        | EventKind::ContinueRoutineRejected
-        | EventKind::StuckDiagnosticRecorded
-        | EventKind::NoHumanDayStarted
-        | EventKind::NoHumanDayCompleted
-        | EventKind::ReplayProjectionRebuilt => false,
-    }
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 impl EventKind {
     pub const fn requires_cause(self) -> bool {
         self.metadata().cause_required
     }
 
     const fn cause_required(self) -> bool {

---- episode_tamper_output_tag_poisons_replay stdout ----

thread 'episode_tamper_output_tag_poisons_replay' (14812) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1055:10:
work starts

---- serialized_event_log_replays_to_identical_state stdout ----

thread 'serialized_event_log_replays_to_identical_state' (14843) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1055:10:
work starts

---- sleep_eat_work_fixture_logs_need_effects_and_replays stdout ----

thread 'sleep_eat_work_fixture_logs_need_effects_and_replays' (14846) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1255:10:
work starts

failures:
    episode_tamper_output_tag_poisons_replay
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    serialized_event_log_replays_to_identical_state
    sleep_eat_work_fixture_logs_need_effects_and_replays
    work_block_failed_then_sleep_succeeds_fixture_closes_reservation

test result: FAILED. 37 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.58s

*** result: Failure(101)
