*** crates/tracewake-core/src/events/envelope.rs:38:9: replace EventSchemaVersion::as_str -> &'static str with ""

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ replace EventSchemaVersion::as_str -> &'static str with ""
@@ -30,19 +30,17 @@
 }];
 
 impl EventSchemaVersion {
     pub const fn all() -> &'static [EventSchemaVersion] {
         &[EventSchemaVersion::V1]
     }
 
     pub const fn as_str(self) -> &'static str {
-        match self {
-            EventSchemaVersion::V1 => "event_schema_v1",
-        }
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn to_schema_version(self) -> SchemaVersion {
         SchemaVersion::new(self.as_str()).expect("event schema registry uses valid stable ids")
     }
 
     pub fn from_schema_version(version: &SchemaVersion) -> Option<Self> {
         EVENT_SCHEMA_REGISTRY

---- serialization::tests::event_log_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::event_log_serialization_round_trips_byte_identically' (15409) panicked at crates/tracewake-core/src/events/envelope.rs:42:43:
event schema registry uses valid stable ids: Empty

failures:
    serialization::tests::event_log_serialization_round_trips_byte_identically

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
