*** crates/tracewake-core/src/events/envelope.rs:38:9: replace EventSchemaVersion::as_str -> &'static str with "xyzzy"

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ replace EventSchemaVersion::as_str -> &'static str with "xyzzy"
@@ -30,19 +30,17 @@
 }];
 
 impl EventSchemaVersion {
     pub const fn all() -> &'static [EventSchemaVersion] {
         &[EventSchemaVersion::V1]
     }
 
     pub const fn as_str(self) -> &'static str {
-        match self {
-            EventSchemaVersion::V1 => "event_schema_v1",
-        }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn to_schema_version(self) -> SchemaVersion {
         SchemaVersion::new(self.as_str()).expect("event schema registry uses valid stable ids")
     }
 
     pub fn from_schema_version(version: &SchemaVersion) -> Option<Self> {
         EVENT_SCHEMA_REGISTRY

---- events::tests::envelope_round_trips_with_stable_schema_version stdout ----

thread 'events::tests::envelope_round_trips_with_stable_schema_version' (19861) panicked at crates/tracewake-core/src/events/mod.rs:90:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "event_schema_v1"

---- events::tests::envelope_direct_decode_rejects_unsupported_schema_version stdout ----

thread 'events::tests::envelope_direct_decode_rejects_unsupported_schema_version' (19860) panicked at crates/tracewake-core/src/events/mod.rs:141:80:

failures:
    events::tests::envelope_direct_decode_rejects_unsupported_schema_version
    events::tests::envelope_round_trips_with_stable_schema_version

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
