*** crates/tracewake-core/src/events/envelope.rs:426:9: replace EventKind::requires_cause -> bool with false

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ replace EventKind::requires_cause -> bool with false
@@ -418,17 +418,17 @@
         | EventKind::NoHumanDayStarted
         | EventKind::NoHumanDayCompleted
         | EventKind::ReplayProjectionRebuilt => false,
     }
 }
 
 impl EventKind {
     pub const fn requires_cause(self) -> bool {
-        self.metadata().cause_required
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     const fn cause_required(self) -> bool {
         match self {
             EventKind::ActorMoved
             | EventKind::DoorOpened
             | EventKind::DoorClosed
             | EventKind::ContainerOpened

---- events::envelope::tests::phase_3a_event_kinds_are_agent_stream_and_round_trip stdout ----

thread 'events::envelope::tests::phase_3a_event_kinds_are_agent_stream_and_round_trip' (23297) panicked at crates/tracewake-core/src/events/envelope.rs:1387:13:
assertion failed: kind.requires_cause()

---- events::envelope::tests::caused_constructor_rejects_causeless_phase_3a_event stdout ----

thread 'events::envelope::tests::caused_constructor_rejects_causeless_phase_3a_event' (23291) panicked at crates/tracewake-core/src/events/envelope.rs:1435:14:

---- events::envelope::tests::food_consumed_is_physical_world_event stdout ----

thread 'events::envelope::tests::food_consumed_is_physical_world_event' (23296) panicked at crates/tracewake-core/src/events/envelope.rs:1415:9:
assertion failed: EventKind::FoodConsumed.requires_cause()

failures:
    events::envelope::tests::caused_constructor_rejects_causeless_phase_3a_event
    events::envelope::tests::food_consumed_is_physical_world_event
    events::envelope::tests::phase_3a_event_kinds_are_agent_stream_and_round_trip

test result: FAILED. 452 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
