*** crates/tracewake-core/src/events/envelope.rs:430:9: replace EventKind::cause_required -> bool with true

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ replace EventKind::cause_required -> bool with true
@@ -422,74 +422,17 @@
 }
 
 impl EventKind {
     pub const fn requires_cause(self) -> bool {
         self.metadata().cause_required
     }
 
     const fn cause_required(self) -> bool {
-        match self {
-            EventKind::ActorMoved
-            | EventKind::DoorOpened
-            | EventKind::DoorClosed
-            | EventKind::ContainerOpened
-            | EventKind::ContainerClosed
-            | EventKind::ItemRemovedFromContainer
-            | EventKind::ItemTakenFromPlace
-            | EventKind::ItemPlacedInContainer
-            | EventKind::ItemPlacedInPlace
-            | EventKind::ActorWaited
-            | EventKind::ObservationRecorded
-            | EventKind::BeliefUpdated
-            | EventKind::ContainerChecked
-            | EventKind::NeedDeltaApplied
-            | EventKind::NeedThresholdCrossed
-            | EventKind::CandidateGoalsEvaluated
-            | EventKind::IntentionStarted
-            | EventKind::IntentionContinued
-            | EventKind::IntentionSuspended
-            | EventKind::IntentionResumed
-            | EventKind::IntentionCompleted
-            | EventKind::IntentionFailed
-            | EventKind::IntentionAbandoned
-            | EventKind::IntentionInterrupted
-            | EventKind::RoutineStepStarted
-            | EventKind::RoutineStepCompleted
-            | EventKind::RoutineStepFailed
-            | EventKind::DecisionTraceRecorded
-            | EventKind::SleepStarted
-            | EventKind::SleepCompleted
-            | EventKind::SleepInterrupted
-            | EventKind::FoodConsumed
-            | EventKind::FoodServiceUsed
-            | EventKind::EatFailed
-            | EventKind::WorkBlockStarted
-            | EventKind::WorkBlockCompleted
-            | EventKind::WorkBlockFailed
-            | EventKind::ContinueRoutineProposed
-            | EventKind::ContinueRoutineAccepted
-            | EventKind::ContinueRoutineRejected
-            | EventKind::StuckDiagnosticRecorded
-            | EventKind::NoHumanDayStarted
-            | EventKind::NoHumanDayCompleted => true,
-            EventKind::ControllerAttached
-            | EventKind::ControllerDetached
-            | EventKind::TimeAdvanced
-            | EventKind::ActionStarted
-            | EventKind::ActionFailed
-            | EventKind::ActionRejected
-            | EventKind::NoHumanAdvanceStarted
-            | EventKind::NoHumanAdvanceCompleted
-            | EventKind::InitialBeliefSeeded
-            | EventKind::RoleAssignmentNoticeRecorded
-            | EventKind::StartingBeliefRecorded
-            | EventKind::ExpectationContradicted
-            | EventKind::ReplayProjectionRebuilt => false,
-        }
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Copy, Debug, PartialEq, Eq)]
 pub struct EventKindMetadata {
     pub kind: EventKind,
     pub stream: EventStream,
     pub schema_version: EventSchemaVersion,

---- fixture_fingerprint_reprices_secondary_file_bytes stdout ----

thread 'fixture_fingerprint_reprices_secondary_file_bytes' (27442) panicked at crates/tracewake-content/tests/fixtures_load.rs:629:6:
called `Result::unwrap()` on an `Err` value: EpistemicSeedEvent("fixture seed epistemic event event_seed_initial_belief_belief_tomas_expects_coin_stack_01_in_strongbox_tomas failed: MissingCause")

---- fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture stdout ----

thread 'fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture' (27441) panicked at crates/tracewake-content/tests/fixtures_load.rs:661:6:
called `Result::unwrap()` on an `Err` value: EpistemicSeedEvent("fixture seed epistemic event event_seed_initial_belief_belief_tomas_expects_coin_stack_01_in_strongbox_tomas failed: MissingCause")

---- fixture_scope_raw_lines_drive_loader_registry_and_fail_closed stdout ----

thread 'fixture_scope_raw_lines_drive_loader_registry_and_fail_closed' (27443) panicked at crates/tracewake-content/tests/fixtures_load.rs:846:6:
called `Result::unwrap()` on an `Err` value: EpistemicSeedEvent("fixture seed epistemic event event_seed_starting_belief_actor_tomas_sleep_place_bed_tomas failed: MissingCause")

failures:
    all_fixtures_load_deterministically_and_validate
    fixture_fingerprint_reprices_raw_primary_bytes_with_same_parsed_fixture
    fixture_fingerprint_reprices_secondary_file_bytes
    fixture_scope_raw_lines_drive_loader_registry_and_fail_closed
    fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering
    phase3a_load_emits_authored_prehistory_seed_events
    seed_event_log_order_and_projection_provenance_are_causal_and_stable
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food
    stale_workplace_notice_superseded_by_newer_001

test result: FAILED. 25 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
