*** crates/tracewake-core/src/events/envelope.rs:430:9: replace EventKind::cause_required -> bool with false

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ replace EventKind::cause_required -> bool with false
@@ -422,74 +422,17 @@
 }
 
 impl EventKind {
     pub const fn requires_cause(self) -> bool {
         self.metadata().cause_required
     }
 
     const fn cause_required(self) -> bool {
-        match self {
-            EventKind::ActorMoved
-            | EventKind::DoorOpened
-            | EventKind::DoorClosed
-            | EventKind::ContainerOpened
-            | EventKind::ContainerClosed
-            | EventKind::ItemRemovedFromContainer
-            | EventKind::ItemTakenFromPlace
-            | EventKind::ItemPlacedInContainer
-            | EventKind::ItemPlacedInPlace
-            | EventKind::ActorWaited
-            | EventKind::ObservationRecorded
-            | EventKind::BeliefUpdated
-            | EventKind::ContainerChecked
-            | EventKind::NeedDeltaApplied
-            | EventKind::NeedThresholdCrossed
-            | EventKind::CandidateGoalsEvaluated
-            | EventKind::IntentionStarted
-            | EventKind::IntentionContinued
-            | EventKind::IntentionSuspended
-            | EventKind::IntentionResumed
-            | EventKind::IntentionCompleted
-            | EventKind::IntentionFailed
-            | EventKind::IntentionAbandoned
-            | EventKind::IntentionInterrupted
-            | EventKind::RoutineStepStarted
-            | EventKind::RoutineStepCompleted
-            | EventKind::RoutineStepFailed
-            | EventKind::DecisionTraceRecorded
-            | EventKind::SleepStarted
-            | EventKind::SleepCompleted
-            | EventKind::SleepInterrupted
-            | EventKind::FoodConsumed
-            | EventKind::FoodServiceUsed
-            | EventKind::EatFailed
-            | EventKind::WorkBlockStarted
-            | EventKind::WorkBlockCompleted
-            | EventKind::WorkBlockFailed
-            | EventKind::ContinueRoutineProposed
-            | EventKind::ContinueRoutineAccepted
-            | EventKind::ContinueRoutineRejected
-            | EventKind::StuckDiagnosticRecorded
-            | EventKind::NoHumanDayStarted
-            | EventKind::NoHumanDayCompleted => true,
-            EventKind::ControllerAttached
-            | EventKind::ControllerDetached
-            | EventKind::TimeAdvanced
-            | EventKind::ActionStarted
-            | EventKind::ActionFailed
-            | EventKind::ActionRejected
-            | EventKind::NoHumanAdvanceStarted
-            | EventKind::NoHumanAdvanceCompleted
-            | EventKind::InitialBeliefSeeded
-            | EventKind::RoleAssignmentNoticeRecorded
-            | EventKind::StartingBeliefRecorded
-            | EventKind::ExpectationContradicted
-            | EventKind::ReplayProjectionRebuilt => false,
-        }
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Copy, Debug, PartialEq, Eq)]
 pub struct EventKindMetadata {
     pub kind: EventKind,
     pub stream: EventStream,
     pub schema_version: EventSchemaVersion,

---- events::envelope::tests::caused_constructor_rejects_causeless_phase_3a_event stdout ----

thread 'events::envelope::tests::caused_constructor_rejects_causeless_phase_3a_event' (31881) panicked at crates/tracewake-core/src/events/envelope.rs:1378:14:

---- events::envelope::tests::food_consumed_is_physical_world_event stdout ----

thread 'events::envelope::tests::food_consumed_is_physical_world_event' (31886) panicked at crates/tracewake-core/src/events/envelope.rs:1358:9:
assertion failed: EventKind::FoodConsumed.requires_cause()

---- events::envelope::tests::phase_3a_event_kinds_are_agent_stream_and_round_trip stdout ----

thread 'events::envelope::tests::phase_3a_event_kinds_are_agent_stream_and_round_trip' (31887) panicked at crates/tracewake-core/src/events/envelope.rs:1330:13:
assertion failed: kind.requires_cause()

failures:
    events::envelope::tests::caused_constructor_rejects_causeless_phase_3a_event
    events::envelope::tests::food_consumed_is_physical_world_event
    events::envelope::tests::phase_3a_event_kinds_are_agent_stream_and_round_trip

test result: FAILED. 452 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
