*** crates/tracewake-core/src/events/envelope.rs:48:9: replace EventSchemaVersion::from_schema_version -> Option<Self> with None

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ replace EventSchemaVersion::from_schema_version -> Option<Self> with None
@@ -40,20 +40,17 @@
         }
     }
 
     pub fn to_schema_version(self) -> SchemaVersion {
         SchemaVersion::new(self.as_str()).expect("event schema registry uses valid stable ids")
     }
 
     pub fn from_schema_version(version: &SchemaVersion) -> Option<Self> {
-        EVENT_SCHEMA_REGISTRY
-            .iter()
-            .find(|entry| entry.version.as_str() == version.as_str())
-            .map(|entry| entry.version)
+        None /* ~ changed by cargo-mutants ~ */
     }
 }
 
 pub fn event_schema_registry() -> &'static [EventSchemaRegistryEntry] {
     EVENT_SCHEMA_REGISTRY
 }
 
 pub fn event_schema_registry_entry(

---- events::envelope::tests::event_schema_registry_has_one_current_version_with_migration_proof stdout ----

thread 'events::envelope::tests::event_schema_registry_has_one_current_version_with_migration_proof' (24423) panicked at crates/tracewake-core/src/events/envelope.rs:1255:9:
assertion `left == right` failed
  left: None
 right: Some(V1)

failures:
    events::envelope::tests::event_schema_registry_has_one_current_version_with_migration_proof

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
