*** crates/tracewake-core/src/events/envelope.rs:50:50: replace == with != in EventSchemaVersion::from_schema_version

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ replace == with != in EventSchemaVersion::from_schema_version
@@ -42,17 +42,17 @@
 
     pub fn to_schema_version(self) -> SchemaVersion {
         SchemaVersion::new(self.as_str()).expect("event schema registry uses valid stable ids")
     }
 
     pub fn from_schema_version(version: &SchemaVersion) -> Option<Self> {
         EVENT_SCHEMA_REGISTRY
             .iter()
-            .find(|entry| entry.version.as_str() == version.as_str())
+            .find(|entry| entry.version.as_str() != /* ~ changed by cargo-mutants ~ */ version.as_str())
             .map(|entry| entry.version)
     }
 }
 
 pub fn event_schema_registry() -> &'static [EventSchemaRegistryEntry] {
     EVENT_SCHEMA_REGISTRY
 }

---- events::envelope::tests::unknown_event_schema_version_is_not_registry_supported stdout ----

thread 'events::envelope::tests::unknown_event_schema_version_is_not_registry_supported' (28997) panicked at crates/tracewake-core/src/events/envelope.rs:1268:9:
assertion `left == right` failed
  left: Some(V1)
 right: None

---- events::envelope::tests::event_schema_registry_has_one_current_version_with_migration_proof stdout ----

thread 'events::envelope::tests::event_schema_registry_has_one_current_version_with_migration_proof' (28994) panicked at crates/tracewake-core/src/events/envelope.rs:1258:9:
assertion `left == right` failed
  left: None
 right: Some(V1)

failures:
    events::envelope::tests::event_schema_registry_has_one_current_version_with_migration_proof
    events::envelope::tests::unknown_event_schema_version_is_not_registry_supported

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
