*** crates/tracewake-core/src/events/envelope.rs:529:9: replace InitialBeliefSourceKind::stable_id -> &'static str with "xyzzy"

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ replace InitialBeliefSourceKind::stable_id -> &'static str with "xyzzy"
@@ -521,19 +521,17 @@
 
 #[derive(Clone, Copy, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
 pub enum InitialBeliefSourceKind {
     AuthoredPrehistory,
 }
 
 impl InitialBeliefSourceKind {
     pub const fn stable_id(self) -> &'static str {
-        match self {
-            InitialBeliefSourceKind::AuthoredPrehistory => "authored_prehistory",
-        }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq)]
 pub struct InitialBeliefSeededPayload {
     pub schema_version: SchemaVersion,
     pub source_kind: InitialBeliefSourceKind,
     pub belief: Belief,

---- validate::tests::fixture_serialization_golden_bytes_are_pinned_001 stdout ----

thread 'validate::tests::fixture_serialization_golden_bytes_are_pinned_001' (7552) panicked at crates/tracewake-content/src/validate.rs:3216:13:
assertion `left == right` failed: phase2a serialization golden changed

failures:
    validate::tests::fixture_serialization_golden_bytes_are_pinned_001

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
