*** crates/tracewake-core/src/events/envelope.rs:56:5: replace event_schema_registry -> &'static[EventSchemaRegistryEntry] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ replace event_schema_registry -> &'static[EventSchemaRegistryEntry] with Vec::leak(Vec::new())
@@ -48,17 +48,17 @@
         EVENT_SCHEMA_REGISTRY
             .iter()
             .find(|entry| entry.version.as_str() == version.as_str())
             .map(|entry| entry.version)
     }
 }
 
 pub fn event_schema_registry() -> &'static [EventSchemaRegistryEntry] {
-    EVENT_SCHEMA_REGISTRY
+    Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn event_schema_registry_entry(
     version: &SchemaVersion,
 ) -> Option<&'static EventSchemaRegistryEntry> {
     EVENT_SCHEMA_REGISTRY
         .iter()
         .find(|entry| entry.version.as_str() == version.as_str())

---- events::envelope::tests::event_schema_registry_has_one_current_version_with_migration_proof stdout ----

thread 'events::envelope::tests::event_schema_registry_has_one_current_version_with_migration_proof' (1085) panicked at crates/tracewake-core/src/events/envelope.rs:1251:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    events::envelope::tests::event_schema_registry_has_one_current_version_with_migration_proof

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
