*** crates/tracewake-core/src/events/envelope.rs:62:5: replace event_schema_registry_entry -> Option<&'static EventSchemaRegistryEntry> with None

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ replace event_schema_registry_entry -> Option<&'static EventSchemaRegistryEntry> with None
@@ -54,19 +54,17 @@
 
 pub fn event_schema_registry() -> &'static [EventSchemaRegistryEntry] {
     EVENT_SCHEMA_REGISTRY
 }
 
 pub fn event_schema_registry_entry(
     version: &SchemaVersion,
 ) -> Option<&'static EventSchemaRegistryEntry> {
-    EVENT_SCHEMA_REGISTRY
-        .iter()
-        .find(|entry| entry.version.as_str() == version.as_str())
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 #[derive(Clone, Copy, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
 pub enum EventStream {
     World,
     Agent,
     Epistemic,
     Diagnostic,

---- serialization::tests::event_log_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::event_log_serialization_round_trips_byte_identically' (5209) panicked at crates/tracewake-content/src/serialization.rs:917:27:
called `Result::unwrap()` on an `Err` value: UnsupportedSchemaVersion("event_schema_v1")

failures:
    serialization::tests::event_log_serialization_round_trips_byte_identically

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
