*** crates/tracewake-core/src/events/envelope.rs:773:9: replace EventEnvelope::has_supported_schema_version -> bool with true

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ replace EventEnvelope::has_supported_schema_version -> bool with true
@@ -765,17 +765,17 @@
             random_draws: Vec::new(),
             payload: Vec::new(),
             effects_summary: String::new(),
             content_manifest_id,
         }
     }
 
     pub fn has_supported_schema_version(&self) -> bool {
-        event_schema_registry_entry(&self.event_schema_version).is_some()
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     #[allow(clippy::too_many_arguments)]
     pub fn new_caused_v1(
         event_id: EventId,
         event_type: EventKind,
         stream_position: u64,
         global_order: u64,

---- events::apply::tests::unsupported_schema_version_errors stdout ----

thread 'events::apply::tests::unsupported_schema_version_errors' (12070) panicked at crates/tracewake-core/src/events/apply.rs:1986:9:
assertion `left == right` failed
  left: Err(MissingPayload("actor_id"))
 right: Err(UnsupportedSchemaVersion("event_schema_v999"))

---- events::envelope::tests::unknown_event_schema_version_is_not_registry_supported stdout ----

thread 'events::envelope::tests::unknown_event_schema_version_is_not_registry_supported' (12080) panicked at crates/tracewake-core/src/events/envelope.rs:1280:9:
assertion failed: !event.has_supported_schema_version()

---- events::tests::unknown_schema_version_is_flagged stdout ----

thread 'events::tests::unknown_schema_version_is_flagged' (12089) panicked at crates/tracewake-core/src/events/mod.rs:164:9:
assertion failed: !envelope.has_supported_schema_version()

failures:
    events::apply::tests::unsupported_schema_version_errors
    events::envelope::tests::unknown_event_schema_version_is_not_registry_supported
    events::tests::unknown_schema_version_is_flagged
    replay::rebuild::tests::unsupported_agent_event_schema_reports_position_kind_and_ids
    replay::rebuild::tests::unsupported_epistemic_event_schema_reports_position_and_version
    replay::rebuild::tests::unsupported_event_schema_version_replay_fails_loudly
    replay::report::tests::unsupported_version_is_reported_and_not_applied

test result: FAILED. 448 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
