*** crates/tracewake-core/src/events/envelope.rs:773:9: replace EventEnvelope::has_supported_schema_version -> bool with false

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ replace EventEnvelope::has_supported_schema_version -> bool with false
@@ -765,17 +765,17 @@
             random_draws: Vec::new(),
             payload: Vec::new(),
             effects_summary: String::new(),
             content_manifest_id,
         }
     }
 
     pub fn has_supported_schema_version(&self) -> bool {
-        event_schema_registry_entry(&self.event_schema_version).is_some()
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     #[allow(clippy::too_many_arguments)]
     pub fn new_caused_v1(
         event_id: EventId,
         event_type: EventKind,
         stream_position: u64,
         global_order: u64,

---- serialization::tests::event_log_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::event_log_serialization_round_trips_byte_identically' (16189) panicked at crates/tracewake-content/src/serialization.rs:917:27:
called `Result::unwrap()` on an `Err` value: UnsupportedSchemaVersion("event_schema_v1")

failures:
    serialization::tests::event_log_serialization_round_trips_byte_identically

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
