*** crates/tracewake-core/src/events/envelope.rs:787:40: replace && with || in EventEnvelope::new_caused_v1

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ replace && with || in EventEnvelope::new_caused_v1
@@ -779,17 +779,17 @@
         event_type: EventKind,
         stream_position: u64,
         global_order: u64,
         sim_tick: SimTick,
         ordering_key: OrderingKey,
         content_manifest_id: ContentManifestId,
         causes: Vec<EventCause>,
     ) -> Result<Self, EventEnvelopeBuildError> {
-        if event_type.requires_cause() && causes.is_empty() {
+        if event_type.requires_cause() || /* ~ changed by cargo-mutants ~ */ causes.is_empty() {
             return Err(EventEnvelopeBuildError::MissingRequiredCause);
         }
 
         let mut envelope = Self::new_v1(
             event_id,
             event_type,
             stream_position,
             global_order,

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (20257) panicked at crates/tracewake-core/src/agent/perception.rs:596:6:
perception observations carry process ancestry: MissingRequiredCause

---- stale_workplace_notice_superseded_by_newer_001 stdout ----

thread 'stale_workplace_notice_superseded_by_newer_001' (20259) panicked at crates/tracewake-core/src/agent/perception.rs:596:6:
perception observations carry process ancestry: MissingRequiredCause

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food
    stale_workplace_notice_superseded_by_newer_001

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
