*** crates/tracewake-core/src/events/envelope.rs:805:9: replace EventEnvelope::serialize_canonical -> Vec<u8> with vec![]

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ replace EventEnvelope::serialize_canonical -> Vec<u8> with vec![]
@@ -797,93 +797,17 @@
             ordering_key,
             content_manifest_id,
         );
         envelope.causes = causes;
         Ok(envelope)
     }
 
     pub fn serialize_canonical(&self) -> Vec<u8> {
-        let fields = [
-            ("event_id", encode(self.event_id.as_str())),
-            ("event_type", encode(self.event_type.stable_id())),
-            (
-                "event_schema_version",
-                encode(self.event_schema_version.as_str()),
-            ),
-            ("stream", encode(stream_id(self.stream))),
-            ("stream_position", self.stream_position.to_string()),
-            ("global_order", self.global_order.to_string()),
-            ("sim_tick", self.sim_tick.value().to_string()),
-            (
-                "ordering_key",
-                encode(&serialize_ordering_key(&self.ordering_key)),
-            ),
-            (
-                "actor_id",
-                encode_opt(self.actor_id.as_ref().map(ActorId::as_str)),
-            ),
-            (
-                "process_id",
-                encode_opt(self.process_id.as_ref().map(ProcessId::as_str)),
-            ),
-            ("participants", encode_vec(&self.participants)),
-            (
-                "place_id",
-                encode_opt(self.place_id.as_ref().map(PlaceId::as_str)),
-            ),
-            (
-                "causes",
-                encode_vec(&self.causes.iter().map(serialize_cause).collect::<Vec<_>>()),
-            ),
-            (
-                "proposal_id",
-                encode_opt(self.proposal_id.as_ref().map(ProposalId::as_str)),
-            ),
-            (
-                "validation_report_id",
-                encode_opt(
-                    self.validation_report_id
-                        .as_ref()
-                        .map(ValidationReportId::as_str),
-                ),
-            ),
-            (
-                "random_draws",
-                encode_vec(
-                    &self
-                        .random_draws
-                        .iter()
-                        .map(serialize_random_draw)
-                        .collect::<Vec<_>>(),
-                ),
-            ),
-            (
-                "payload",
-                encode_vec(
-                    &self
-                        .payload
-                        .iter()
-                        .map(serialize_payload)
-                        .collect::<Vec<_>>(),
-                ),
-            ),
-            ("effects_summary", encode(&self.effects_summary)),
-            (
-                "content_manifest_id",
-                encode(self.content_manifest_id.as_str()),
-            ),
-        ];
-
-        fields
-            .into_iter()
-            .map(|(key, value)| format!("{key}={value}"))
-            .collect::<Vec<_>>()
-            .join("\n")
-            .into_bytes()
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn deserialize_canonical(bytes: &[u8]) -> Result<Self, EventEnvelopeParseError> {
         let text = std::str::from_utf8(bytes).map_err(|_| EventEnvelopeParseError::InvalidUtf8)?;
         let mut map = std::collections::BTreeMap::new();
         for line in text.lines() {
             let (key, value) = line
                 .split_once('=')

---- serialized_event_log_replays_to_identical_state stdout ----

thread 'serialized_event_log_replays_to_identical_state' (24354) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:436:59:
called `Result::unwrap()` on an `Err` value: EventLog(Parse(MissingField("event_type")))

---- sleep_eat_work_fixture_logs_need_effects_and_replays stdout ----

thread 'sleep_eat_work_fixture_logs_need_effects_and_replays' (24357) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1280:80:
called `Result::unwrap()` on an `Err` value: Parse(MissingField("event_type"))

---- work_block_failed_then_sleep_succeeds_fixture_closes_reservation stdout ----

thread 'work_block_failed_then_sleep_succeeds_fixture_closes_reservation' (24361) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1382:80:
called `Result::unwrap()` on an `Err` value: Parse(MissingField("event_type"))

failures:
    no_human_day_real_run_replays_metrics_and_trace_projection
    serialized_event_log_replays_to_identical_state
    sleep_eat_work_fixture_logs_need_effects_and_replays
    work_block_failed_then_sleep_succeeds_fixture_closes_reservation

test result: FAILED. 38 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.27s

*** result: Failure(101)
