*** crates/tracewake-core/src/events/envelope.rs:993:5: replace required -> Result<&'a str, EventEnvelopeParseError> with Ok("xyzzy")

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ replace required -> Result<&'a str, EventEnvelopeParseError> with Ok("xyzzy")
@@ -985,19 +985,17 @@
         Self::Number
     }
 }
 
 fn required<'a>(
     map: &'a std::collections::BTreeMap<&str, &str>,
     key: &'static str,
 ) -> Result<&'a str, EventEnvelopeParseError> {
-    map.get(key)
-        .copied()
-        .ok_or(EventEnvelopeParseError::MissingField(key))
+    Ok("xyzzy") /* ~ changed by cargo-mutants ~ */
 }
 
 fn stream_id(stream: EventStream) -> &'static str {
     match stream {
         EventStream::World => "world",
         EventStream::Agent => "agent",
         EventStream::Epistemic => "epistemic",
         EventStream::Diagnostic => "diagnostic",

---- serialization::tests::event_log_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::event_log_serialization_round_trips_byte_identically' (7887) panicked at crates/tracewake-content/src/serialization.rs:920:73:
called `Result::unwrap()` on an `Err` value: EventLog(Parse(BadHex))

failures:
    serialization::tests::event_log_serialization_round_trips_byte_identically

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
