*** crates/tracewake-core/src/events/envelope.rs:999:5: replace stream_id -> &'static str with ""

*** mutation diff:
--- crates/tracewake-core/src/events/envelope.rs
+++ replace stream_id -> &'static str with ""
@@ -991,24 +991,17 @@
     key: &'static str,
 ) -> Result<&'a str, EventEnvelopeParseError> {
     map.get(key)
         .copied()
         .ok_or(EventEnvelopeParseError::MissingField(key))
 }
 
 fn stream_id(stream: EventStream) -> &'static str {
-    match stream {
-        EventStream::World => "world",
-        EventStream::Agent => "agent",
-        EventStream::Epistemic => "epistemic",
-        EventStream::Diagnostic => "diagnostic",
-        EventStream::Controller => "controller",
-        EventStream::ReplayDebug => "replay_debug",
-    }
+    "" /* ~ changed by cargo-mutants ~ */
 }
 
 fn stream_from_id(value: &str) -> Option<EventStream> {
     match value {
         "world" => Some(EventStream::World),
         "agent" => Some(EventStream::Agent),
         "epistemic" => Some(EventStream::Epistemic),
         "diagnostic" => Some(EventStream::Diagnostic),

---- serialization::tests::event_log_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::event_log_serialization_round_trips_byte_identically' (11883) panicked at crates/tracewake-content/src/serialization.rs:920:73:
called `Result::unwrap()` on an `Err` value: EventLog(Parse(UnknownStream))

failures:
    serialization::tests::event_log_serialization_round_trips_byte_identically

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
