*** crates/tracewake-core/src/events/log.rs:116:5: replace encode_hex -> String with String::new()

*** mutation diff:
--- crates/tracewake-core/src/events/log.rs
+++ replace encode_hex -> String with String::new()
@@ -108,17 +108,17 @@
         EventEnvelopeParseError::UnsupportedSchemaVersion(version) => {
             EventLogError::UnsupportedSchemaVersion(version)
         }
         other => EventLogError::Parse(other),
     }
 }
 
 fn encode_hex(bytes: &[u8]) -> String {
-    bytes.iter().map(|byte| format!("{byte:02x}")).collect()
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn decode_hex(value: &str) -> Result<Vec<u8>, EventLogError> {
     if !value.len().is_multiple_of(2) {
         return Err(EventLogError::BadHex);
     }
     value
         .as_bytes()

---- serialized_event_log_replays_to_identical_state stdout ----

thread 'serialized_event_log_replays_to_identical_state' (4899) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:436:59:
called `Result::unwrap()` on an `Err` value: EventLog(Parse(MissingField("event_type")))

---- sleep_eat_work_fixture_logs_need_effects_and_replays stdout ----

thread 'sleep_eat_work_fixture_logs_need_effects_and_replays' (4902) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1280:80:
called `Result::unwrap()` on an `Err` value: Parse(MissingField("event_type"))

---- work_block_failed_then_sleep_succeeds_fixture_closes_reservation stdout ----

thread 'work_block_failed_then_sleep_succeeds_fixture_closes_reservation' (4906) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1382:80:
called `Result::unwrap()` on an `Err` value: Parse(MissingField("event_type"))

failures:
    no_human_day_real_run_replays_metrics_and_trace_projection
    serialized_event_log_replays_to_identical_state
    sleep_eat_work_fixture_logs_need_effects_and_replays
    work_block_failed_then_sleep_succeeds_fixture_closes_reservation

test result: FAILED. 38 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.31s

*** result: Failure(101)
