*** crates/tracewake-core/src/events/log.rs:116:5: replace encode_hex -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-core/src/events/log.rs
+++ replace encode_hex -> String with "xyzzy".into()
@@ -108,17 +108,17 @@
         EventEnvelopeParseError::UnsupportedSchemaVersion(version) => {
             EventLogError::UnsupportedSchemaVersion(version)
         }
         other => EventLogError::Parse(other),
     }
 }
 
 fn encode_hex(bytes: &[u8]) -> String {
-    bytes.iter().map(|byte| format!("{byte:02x}")).collect()
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 fn decode_hex(value: &str) -> Result<Vec<u8>, EventLogError> {
     if !value.len().is_multiple_of(2) {
         return Err(EventLogError::BadHex);
     }
     value
         .as_bytes()

---- serialization::tests::event_log_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::event_log_serialization_round_trips_byte_identically' (8874) panicked at crates/tracewake-content/src/serialization.rs:920:73:
called `Result::unwrap()` on an `Err` value: EventLog(BadHex)

failures:
    serialization::tests::event_log_serialization_round_trips_byte_identically

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
