*** crates/tracewake-core/src/events/log.rs:120:5: replace decode_hex -> Result<Vec<u8>, EventLogError> with Ok(vec![0])

*** mutation diff:
--- crates/tracewake-core/src/events/log.rs
+++ replace decode_hex -> Result<Vec<u8>, EventLogError> with Ok(vec![0])
@@ -112,27 +112,17 @@
     }
 }
 
 fn encode_hex(bytes: &[u8]) -> String {
     bytes.iter().map(|byte| format!("{byte:02x}")).collect()
 }
 
 fn decode_hex(value: &str) -> Result<Vec<u8>, EventLogError> {
-    if !value.len().is_multiple_of(2) {
-        return Err(EventLogError::BadHex);
-    }
-    value
-        .as_bytes()
-        .chunks_exact(2)
-        .map(|chunk| {
-            let hex = std::str::from_utf8(chunk).map_err(|_| EventLogError::BadHex)?;
-            u8::from_str_radix(hex, 16).map_err(|_| EventLogError::BadHex)
-        })
-        .collect()
+    Ok(vec![0]) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::events::EventKind;
     use crate::ids::{ActionId, ActorId, ContentManifestId, EventId};
     use crate::scheduler::{OrderingKey, ProposalSequence, SchedulePhase, SchedulerSourceId};

---- serialization::tests::event_log_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::event_log_serialization_round_trips_byte_identically' (16866) panicked at crates/tracewake-content/src/serialization.rs:920:73:
called `Result::unwrap()` on an `Err` value: EventLog(Parse(MalformedField))

failures:
    serialization::tests::event_log_serialization_round_trips_byte_identically

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
