*** crates/tracewake-core/src/events/log.rs:24:12: delete ! in EventLog::append

*** mutation diff:
--- crates/tracewake-core/src/events/log.rs
+++ delete ! in EventLog::append
@@ -16,17 +16,17 @@
 }
 
 impl EventLog {
     pub fn new() -> Self {
         Self { events: Vec::new() }
     }
 
     pub fn append(&mut self, mut event: EventEnvelope) -> Result<EventEnvelope, EventLogError> {
-        if !event.has_supported_schema_version() {
+        if  /* ~ changed by cargo-mutants ~ */event.has_supported_schema_version() {
             return Err(EventLogError::UnsupportedSchemaVersion(
                 event.event_schema_version.as_str().to_string(),
             ));
         }
 
         event.global_order = self.events.len() as u64;
         event.stream_position = self
             .events

---- serialization::tests::event_log_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::event_log_serialization_round_trips_byte_identically' (25441) panicked at crates/tracewake-content/src/serialization.rs:917:27:
called `Result::unwrap()` on an `Err` value: UnsupportedSchemaVersion("event_schema_v1")

failures:
    serialization::tests::event_log_serialization_round_trips_byte_identically

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
