*** crates/tracewake-core/src/events/log.rs:34:48: replace == with != in EventLog::append

*** mutation diff:
--- crates/tracewake-core/src/events/log.rs
+++ replace == with != in EventLog::append
@@ -26,17 +26,17 @@
                 event.event_schema_version.as_str().to_string(),
             ));
         }
 
         event.global_order = self.events.len() as u64;
         event.stream_position = self
             .events
             .iter()
-            .filter(|existing| existing.stream == event.stream)
+            .filter(|existing| existing.stream != /* ~ changed by cargo-mutants ~ */ event.stream)
             .count() as u64;
         self.events.push(event.clone());
         Ok(event)
     }
 
     fn append_deserialized(
         &mut self,
         event: EventEnvelope,

---- seed_event_log_order_and_projection_provenance_are_causal_and_stable stdout ----

thread 'seed_event_log_order_and_projection_provenance_are_causal_and_stable' (29496) panicked at crates/tracewake-content/tests/fixtures_load.rs:934:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    seed_event_log_order_and_projection_provenance_are_causal_and_stable

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
