*** crates/tracewake-core/src/events/log.rs:44:12: delete ! in EventLog::append_deserialized

*** mutation diff:
--- crates/tracewake-core/src/events/log.rs
+++ delete ! in EventLog::append_deserialized
@@ -36,17 +36,17 @@
         self.events.push(event.clone());
         Ok(event)
     }
 
     fn append_deserialized(
         &mut self,
         event: EventEnvelope,
     ) -> Result<EventEnvelope, EventLogError> {
-        if !event.has_supported_schema_version() {
+        if  /* ~ changed by cargo-mutants ~ */event.has_supported_schema_version() {
             return Err(EventLogError::UnsupportedSchemaVersion(
                 event.event_schema_version.as_str().to_string(),
             ));
         }
         let expected_global_order = self.events.len() as u64;
         if event.global_order != expected_global_order {
             return Err(EventLogError::GlobalOrderMismatch {
                 expected: expected_global_order,

---- serialization::tests::event_log_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::event_log_serialization_round_trips_byte_identically' (1012) panicked at crates/tracewake-content/src/serialization.rs:920:73:
called `Result::unwrap()` on an `Err` value: EventLog(UnsupportedSchemaVersion("event_schema_v1"))

failures:
    serialization::tests::event_log_serialization_round_trips_byte_identically

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
