*** crates/tracewake-core/src/events/log.rs:61:34: replace != with == in EventLog::append_deserialized

*** mutation diff:
--- crates/tracewake-core/src/events/log.rs
+++ replace != with == in EventLog::append_deserialized
@@ -53,17 +53,17 @@
                 actual: event.global_order,
             });
         }
         let expected_stream_position = self
             .events
             .iter()
             .filter(|existing| existing.stream == event.stream)
             .count() as u64;
-        if event.stream_position != expected_stream_position {
+        if event.stream_position == /* ~ changed by cargo-mutants ~ */ expected_stream_position {
             return Err(EventLogError::StreamPositionMismatch {
                 expected: expected_stream_position,
                 actual: event.stream_position,
             });
         }
         self.events.push(event.clone());
         Ok(event)
     }

---- serialization::tests::event_log_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::event_log_serialization_round_trips_byte_identically' (13104) panicked at crates/tracewake-content/src/serialization.rs:920:73:
called `Result::unwrap()` on an `Err` value: EventLog(StreamPositionMismatch { expected: 0, actual: 0 })

failures:
    serialization::tests::event_log_serialization_round_trips_byte_identically

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
