*** crates/tracewake-core/src/events/log.rs:72:9: replace EventLog::events -> &[EventEnvelope] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/tracewake-core/src/events/log.rs
+++ replace EventLog::events -> &[EventEnvelope] with Vec::leak(Vec::new())
@@ -64,17 +64,17 @@
                 actual: event.stream_position,
             });
         }
         self.events.push(event.clone());
         Ok(event)
     }
 
     pub fn events(&self) -> &[EventEnvelope] {
-        &self.events
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     #[cfg(test)]
     pub(crate) fn from_ordered_events_for_replay_tests(events: Vec<EventEnvelope>) -> Self {
         Self { events }
     }
 
     pub fn serialize_canonical(&self) -> Vec<u8> {

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (17160) panicked at crates/tracewake-content/tests/fixtures_load.rs:1217:5:
assertion failed: report.ordinary_pipeline_events > 0

---- seed_event_log_order_and_projection_provenance_are_causal_and_stable stdout ----

thread 'seed_event_log_order_and_projection_provenance_are_causal_and_stable' (17159) panicked at crates/tracewake-content/tests/fixtures_load.rs:925:5:
assertion `left == right` failed
  left: 0
 right: 5

---- phase3a_load_emits_authored_prehistory_seed_events stdout ----

thread 'phase3a_load_emits_authored_prehistory_seed_events' (17157) panicked at crates/tracewake-content/tests/fixtures_load.rs:775:10:
workplace assignment notice is seeded

failures:
    phase3a_load_emits_authored_prehistory_seed_events
    seed_event_log_order_and_projection_provenance_are_causal_and_stable
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 31 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
