*** crates/tracewake-core/src/events/log.rs:81:9: replace EventLog::serialize_canonical -> Vec<u8> with vec![]

*** mutation diff:
--- crates/tracewake-core/src/events/log.rs
+++ replace EventLog::serialize_canonical -> Vec<u8> with vec![]
@@ -73,22 +73,17 @@
     }
 
     #[cfg(test)]
     pub(crate) fn from_ordered_events_for_replay_tests(events: Vec<EventEnvelope>) -> Self {
         Self { events }
     }
 
     pub fn serialize_canonical(&self) -> Vec<u8> {
-        self.events
-            .iter()
-            .map(|event| encode_hex(&event.serialize_canonical()))
-            .collect::<Vec<_>>()
-            .join("\n")
-            .into_bytes()
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn deserialize_canonical(bytes: &[u8]) -> Result<Self, EventLogError> {
         let text = std::str::from_utf8(bytes).map_err(|_| EventLogError::InvalidUtf8)?;
         let mut log = EventLog::new();
         if text.is_empty() {
             return Ok(log);
         }

---- serialized_event_log_replays_to_identical_state stdout ----

thread 'serialized_event_log_replays_to_identical_state' (21268) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:432:5:
nonempty event logs must serialize to nonempty canonical bytes

---- sleep_eat_work_fixture_logs_need_effects_and_replays stdout ----

thread 'sleep_eat_work_fixture_logs_need_effects_and_replays' (21271) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1281:5:
assertion `left == right` failed
  left: EventLog { events: [] }

---- work_block_failed_then_sleep_succeeds_fixture_closes_reservation stdout ----

thread 'work_block_failed_then_sleep_succeeds_fixture_closes_reservation' (21275) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1383:5:
assertion `left == right` failed
  left: EventLog { events: [] }

failures:
    no_human_day_real_run_replays_metrics_and_trace_projection
    serialized_event_log_replays_to_identical_state
    sleep_eat_work_fixture_logs_need_effects_and_replays
    work_block_failed_then_sleep_succeeds_fixture_closes_reservation

test result: FAILED. 38 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.26s

*** result: Failure(101)
