*** crates/tracewake-core/src/events/log.rs:81:9: replace EventLog::serialize_canonical -> Vec<u8> with vec![0]

*** mutation diff:
--- crates/tracewake-core/src/events/log.rs
+++ replace EventLog::serialize_canonical -> Vec<u8> with vec![0]
@@ -73,22 +73,17 @@
     }
 
     #[cfg(test)]
     pub(crate) fn from_ordered_events_for_replay_tests(events: Vec<EventEnvelope>) -> Self {
         Self { events }
     }
 
     pub fn serialize_canonical(&self) -> Vec<u8> {
-        self.events
-            .iter()
-            .map(|event| encode_hex(&event.serialize_canonical()))
-            .collect::<Vec<_>>()
-            .join("\n")
-            .into_bytes()
+        vec![0] /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn deserialize_canonical(bytes: &[u8]) -> Result<Self, EventLogError> {
         let text = std::str::from_utf8(bytes).map_err(|_| EventLogError::InvalidUtf8)?;
         let mut log = EventLog::new();
         if text.is_empty() {
             return Ok(log);
         }

---- serialization::tests::event_log_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::event_log_serialization_round_trips_byte_identically' (25242) panicked at crates/tracewake-content/src/serialization.rs:920:73:
called `Result::unwrap()` on an `Err` value: EventLog(BadHex)

failures:
    serialization::tests::event_log_serialization_round_trips_byte_identically

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
