*** crates/tracewake-core/src/events/log.rs:90:9: replace EventLog::deserialize_canonical -> Result<Self, EventLogError> with Ok(Default::default())

*** mutation diff:
--- crates/tracewake-core/src/events/log.rs
+++ replace EventLog::deserialize_canonical -> Result<Self, EventLogError> with Ok(Default::default())
@@ -82,29 +82,17 @@
             .iter()
             .map(|event| encode_hex(&event.serialize_canonical()))
             .collect::<Vec<_>>()
             .join("\n")
             .into_bytes()
     }
 
     pub fn deserialize_canonical(bytes: &[u8]) -> Result<Self, EventLogError> {
-        let text = std::str::from_utf8(bytes).map_err(|_| EventLogError::InvalidUtf8)?;
-        let mut log = EventLog::new();
-        if text.is_empty() {
-            return Ok(log);
-        }
-
-        for line in text.lines() {
-            let event_bytes = decode_hex(line)?;
-            let event = EventEnvelope::deserialize_canonical(&event_bytes)
-                .map_err(envelope_parse_error_for_log)?;
-            log.append_deserialized(event)?;
-        }
-        Ok(log)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 fn envelope_parse_error_for_log(error: EventEnvelopeParseError) -> EventLogError {
     match error {
         EventEnvelopeParseError::UnsupportedSchemaVersion(version) => {
             EventLogError::UnsupportedSchemaVersion(version)
         }

---- serialization::tests::event_log_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::event_log_serialization_round_trips_byte_identically' (766) panicked at crates/tracewake-content/src/serialization.rs:922:9:
assertion `left == right` failed
 right: []

failures:
    serialization::tests::event_log_serialization_round_trips_byte_identically

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
