*** crates/tracewake-core/src/projections.rs:1022:5: replace visible_exit_blocker_summary -> Option<String> with Some(String::new())

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace visible_exit_blocker_summary -> Option<String> with Some(String::new())
@@ -1014,33 +1014,17 @@
     }
 }
 
 fn visible_exit_blocker_summary(
     connected_doors: &[ActorKnownDoorSurface],
     from_place_id: &PlaceId,
     destination_place_id: &PlaceId,
 ) -> Option<String> {
-    connected_doors
-        .iter()
-        .find(|door| door_connects_edge(door, from_place_id, destination_place_id))
-        .and_then(|door| {
-            if door.is_locked && !door.is_open {
-                Some(format!(
-                    "door {} is closed and locked",
-                    door.door_id.as_str()
-                ))
-            } else if door.is_locked {
-                Some(format!("door {} is locked", door.door_id.as_str()))
-            } else if !door.is_open && door.blocks_movement_when_closed {
-                Some(format!("door {} is closed", door.door_id.as_str()))
-            } else {
-                None
-            }
-        })
+    Some(String::new()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn door_connects_edge(
     door: &ActorKnownDoorSurface,
     from_place_id: &PlaceId,
     to_place_id: &PlaceId,
 ) -> bool {
     (&door.endpoint_a == from_place_id && &door.endpoint_b == to_place_id)

---- projections::tests::embodied_exit_surfaces_perceived_closed_locked_door_blocker stdout ----

thread 'projections::tests::embodied_exit_surfaces_perceived_closed_locked_door_blocker' (9924) panicked at crates/tracewake-core/src/projections.rs:2007:9:
assertion `left == right` failed
  left: Some("")
 right: Some("door door_shop_back is closed and locked")

---- projections::tests::embodied_exit_omits_unperceived_door_blocker_on_known_route stdout ----

thread 'projections::tests::embodied_exit_omits_unperceived_door_blocker_on_known_route' (9923) panicked at crates/tracewake-core/src/projections.rs:2036:9:
assertion `left == right` failed
  left: Some("")
 right: None

---- projections::tests::visible_exit_blocker_summary_distinguishes_blocker_branches stdout ----

thread 'projections::tests::visible_exit_blocker_summary_distinguishes_blocker_branches' (9950) panicked at crates/tracewake-core/src/projections.rs:3261:9:
assertion `left == right` failed
  left: Some("")
 right: Some("door door_lc is closed and locked")

failures:
    projections::tests::embodied_exit_omits_unperceived_door_blocker_on_known_route
    projections::tests::embodied_exit_surfaces_perceived_closed_locked_door_blocker
    projections::tests::visible_exit_blocker_summary_distinguishes_blocker_branches
    projections::tests::visible_exit_blocker_summary_uses_connected_door_set_as_colocation_gate

test result: FAILED. 451 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
