*** crates/tracewake-core/src/projections.rs:1026:31: replace && with || in visible_exit_blocker_summary

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace && with || in visible_exit_blocker_summary
@@ -1018,17 +1018,17 @@
     connected_doors: &[ActorKnownDoorSurface],
     from_place_id: &PlaceId,
     destination_place_id: &PlaceId,
 ) -> Option<String> {
     connected_doors
         .iter()
         .find(|door| door_connects_edge(door, from_place_id, destination_place_id))
         .and_then(|door| {
-            if door.is_locked && !door.is_open {
+            if door.is_locked || /* ~ changed by cargo-mutants ~ */ !door.is_open {
                 Some(format!(
                     "door {} is closed and locked",
                     door.door_id.as_str()
                 ))
             } else if door.is_locked {
                 Some(format!("door {} is locked", door.door_id.as_str()))
             } else if !door.is_open && door.blocks_movement_when_closed {
                 Some(format!("door {} is closed", door.door_id.as_str()))

---- projections::tests::visible_exit_blocker_summary_distinguishes_blocker_branches stdout ----

thread 'projections::tests::visible_exit_blocker_summary_distinguishes_blocker_branches' (19068) panicked at crates/tracewake-core/src/projections.rs:3288:9:
assertion `left == right` failed
  left: Some("door door_lo is closed and locked")
 right: Some("door door_lo is locked")

failures:
    projections::tests::visible_exit_blocker_summary_distinguishes_blocker_branches

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
