*** crates/tracewake-core/src/projections.rs:1026:34: delete ! in visible_exit_blocker_summary

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ delete ! in visible_exit_blocker_summary
@@ -1018,17 +1018,17 @@
     connected_doors: &[ActorKnownDoorSurface],
     from_place_id: &PlaceId,
     destination_place_id: &PlaceId,
 ) -> Option<String> {
     connected_doors
         .iter()
         .find(|door| door_connects_edge(door, from_place_id, destination_place_id))
         .and_then(|door| {
-            if door.is_locked && !door.is_open {
+            if door.is_locked &&  /* ~ changed by cargo-mutants ~ */door.is_open {
                 Some(format!(
                     "door {} is closed and locked",
                     door.door_id.as_str()
                 ))
             } else if door.is_locked {
                 Some(format!("door {} is locked", door.door_id.as_str()))
             } else if !door.is_open && door.blocks_movement_when_closed {
                 Some(format!("door {} is closed", door.door_id.as_str()))

---- projections::tests::embodied_exit_surfaces_perceived_closed_locked_door_blocker stdout ----

thread 'projections::tests::embodied_exit_surfaces_perceived_closed_locked_door_blocker' (23601) panicked at crates/tracewake-core/src/projections.rs:2023:9:
assertion `left == right` failed
  left: Some("door door_shop_back is locked")
 right: Some("door door_shop_back is closed and locked")

---- projections::tests::visible_exit_blocker_summary_distinguishes_blocker_branches stdout ----

thread 'projections::tests::visible_exit_blocker_summary_distinguishes_blocker_branches' (23627) panicked at crates/tracewake-core/src/projections.rs:3277:9:
assertion `left == right` failed
  left: Some("door door_lc is locked")
 right: Some("door door_lc is closed and locked")

failures:
    projections::tests::embodied_exit_surfaces_perceived_closed_locked_door_blocker
    projections::tests::visible_exit_blocker_summary_distinguishes_blocker_branches

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
