*** crates/tracewake-core/src/projections.rs:1033:23: delete ! in visible_exit_blocker_summary

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ delete ! in visible_exit_blocker_summary
@@ -1025,17 +1025,17 @@
         .and_then(|door| {
             if door.is_locked && !door.is_open {
                 Some(format!(
                     "door {} is closed and locked",
                     door.door_id.as_str()
                 ))
             } else if door.is_locked {
                 Some(format!("door {} is locked", door.door_id.as_str()))
-            } else if !door.is_open && door.blocks_movement_when_closed {
+            } else if  /* ~ changed by cargo-mutants ~ */door.is_open && door.blocks_movement_when_closed {
                 Some(format!("door {} is closed", door.door_id.as_str()))
             } else {
                 None
             }
         })
 }
 
 fn door_connects_edge(

---- projections::tests::visible_exit_blocker_summary_distinguishes_blocker_branches stdout ----

thread 'projections::tests::visible_exit_blocker_summary_distinguishes_blocker_branches' (32745) panicked at crates/tracewake-core/src/projections.rs:3298:9:
assertion `left == right` failed
  left: None
 right: Some("door door_cb is closed")

failures:
    projections::tests::visible_exit_blocker_summary_distinguishes_blocker_branches

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
