*** crates/tracewake-core/src/projections.rs:1046:40: replace && with || in door_connects_edge

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace && with || in door_connects_edge
@@ -1038,17 +1038,17 @@
         })
 }
 
 fn door_connects_edge(
     door: &ActorKnownDoorSurface,
     from_place_id: &PlaceId,
     to_place_id: &PlaceId,
 ) -> bool {
-    (&door.endpoint_a == from_place_id && &door.endpoint_b == to_place_id)
+    (&door.endpoint_a == from_place_id || /* ~ changed by cargo-mutants ~ */ &door.endpoint_b == to_place_id)
         || (&door.endpoint_b == from_place_id && &door.endpoint_a == to_place_id)
 }
 
 #[derive(Clone)]
 struct SemanticActionPreflightContext<'a> {
     state: &'a PhysicalState,
     agent_state: &'a AgentState,
     registry: &'a ActionRegistry,

---- projections::tests::door_connects_edge_requires_the_full_endpoint_pair stdout ----

thread 'projections::tests::door_connects_edge_requires_the_full_endpoint_pair' (18486) panicked at crates/tracewake-core/src/projections.rs:3245:9:
assertion failed: !door_connects_edge(&door, &place_id("place_a"), &place_id("place_c"))

failures:
    projections::tests::door_connects_edge_requires_the_full_endpoint_pair

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
