*** crates/tracewake-core/src/projections.rs:1046:5: replace door_connects_edge -> bool with false

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace door_connects_edge -> bool with false
@@ -1038,18 +1038,17 @@
         })
 }
 
 fn door_connects_edge(
     door: &ActorKnownDoorSurface,
     from_place_id: &PlaceId,
     to_place_id: &PlaceId,
 ) -> bool {
-    (&door.endpoint_a == from_place_id && &door.endpoint_b == to_place_id)
-        || (&door.endpoint_b == from_place_id && &door.endpoint_a == to_place_id)
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 #[derive(Clone)]
 struct SemanticActionPreflightContext<'a> {
     state: &'a PhysicalState,
     agent_state: &'a AgentState,
     registry: &'a ActionRegistry,
     content_manifest_id: &'a ContentManifestId,

---- projections::tests::door_connects_edge_requires_the_full_endpoint_pair stdout ----

thread 'projections::tests::door_connects_edge_requires_the_full_endpoint_pair' (9368) panicked at crates/tracewake-core/src/projections.rs:3230:9:
assertion failed: door_connects_edge(&door, &place_id("place_a"), &place_id("place_b"))

---- projections::tests::embodied_exit_surfaces_perceived_closed_locked_door_blocker stdout ----

thread 'projections::tests::embodied_exit_surfaces_perceived_closed_locked_door_blocker' (9370) panicked at crates/tracewake-core/src/projections.rs:2022:9:
assertion `left == right` failed
  left: None
 right: Some("door door_shop_back is closed and locked")

---- projections::tests::visible_exit_blocker_summary_distinguishes_blocker_branches stdout ----

thread 'projections::tests::visible_exit_blocker_summary_distinguishes_blocker_branches' (9396) panicked at crates/tracewake-core/src/projections.rs:3276:9:
assertion `left == right` failed
  left: None
 right: Some("door door_lc is closed and locked")

failures:
    projections::tests::door_connects_edge_requires_the_full_endpoint_pair
    projections::tests::embodied_exit_surfaces_perceived_closed_locked_door_blocker
    projections::tests::visible_exit_blocker_summary_distinguishes_blocker_branches

test result: FAILED. 452 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
