*** crates/tracewake-core/src/projections.rs:1070:5: replace semantic_actions -> Vec<SemanticActionEntry> with vec![]

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace semantic_actions -> Vec<SemanticActionEntry> with vec![]
@@ -1062,142 +1062,17 @@
 fn semantic_actions(
     preflight: &SemanticActionPreflightContext<'_>,
     visible_exits: &[VisibleExit],
     visible_doors: &[VisibleDoor],
     visible_containers: &[VisibleContainer],
     visible_items: &[VisibleItem],
     carried_items: &[ItemId],
 ) -> Vec<SemanticActionEntry> {
-    let mut actions = Vec::new();
-    actions.push(with_validator_availability(
-        SemanticActionEntry::new(
-            SemanticActionId::new("wait.1_tick").unwrap(),
-            ActionId::new("wait").unwrap(),
-            vec!["1_tick".to_string()],
-            "Wait",
-            true,
-            None,
-        ),
-        preflight,
-    ));
-
-    for exit in visible_exits {
-        actions.push(with_validator_availability(
-            SemanticActionEntry::new(
-                SemanticActionId::new(format!("move.to.{}", exit.destination_place_id.as_str()))
-                    .unwrap(),
-                ActionId::new("move").unwrap(),
-                vec![exit.destination_place_id.to_string()],
-                format!("Move to {}", exit.destination_place_id.as_str()),
-                true,
-                None,
-            ),
-            preflight,
-        ));
-    }
-
-    for door in visible_doors {
-        let action = if door.is_open { "close" } else { "open" };
-        actions.push(with_validator_availability(
-            SemanticActionEntry::new(
-                SemanticActionId::new(format!("{action}.door.{}", door.door_id.as_str())).unwrap(),
-                ActionId::new(action).unwrap(),
-                vec![door.door_id.to_string()],
-                format!("{action} {}", door.door_id.as_str()),
-                true,
-                None,
-            ),
-            preflight,
-        ));
-    }
-
-    for container in visible_containers {
-        actions.push(with_validator_availability(
-            SemanticActionEntry::new(
-                SemanticActionId::new(format!(
-                    "check.container.{}",
-                    container.container_id.as_str()
-                ))
-                .unwrap(),
-                ActionId::new("check_container").unwrap(),
-                vec![container.container_id.to_string()],
-                format!("Check {}", container.container_id.as_str()),
-                true,
-                None,
-            ),
-            preflight,
-        ));
-        let action = if container.is_open { "close" } else { "open" };
-        actions.push(with_validator_availability(
-            SemanticActionEntry::new(
-                SemanticActionId::new(format!(
-                    "{action}.container.{}",
-                    container.container_id.as_str()
-                ))
-                .unwrap(),
-                ActionId::new(action).unwrap(),
-                vec![container.container_id.to_string()],
-                format!("{action} {}", container.container_id.as_str()),
-                true,
-                None,
-            ),
-            preflight,
-        ));
-    }
-
-    for item in visible_items {
-        let source_label = match &item.source {
-            VisibleItemSource::Place => "place".to_string(),
-            VisibleItemSource::Container(container_id) => container_id.to_string(),
-            VisibleItemSource::Carried => "carried".to_string(),
-        };
-        actions.push(with_validator_availability(
-            SemanticActionEntry::new(
-                SemanticActionId::new(format!(
-                    "take.item.{}.from.{source_label}",
-                    item.item_id.as_str()
-                ))
-                .unwrap(),
-                ActionId::new("take").unwrap(),
-                vec![item.item_id.to_string()],
-                format!("Take {}", item.item_id.as_str()),
-                true,
-                None,
-            ),
-            preflight,
-        ));
-        actions.push(with_validator_availability(
-            SemanticActionEntry::new(
-                SemanticActionId::new(format!("inspect.item.{}", item.item_id.as_str())).unwrap(),
-                ActionId::new("inspect_entity").unwrap(),
-                vec![item.item_id.to_string()],
-                format!("Inspect {}", item.item_id.as_str()),
-                true,
-                None,
-            ),
-            preflight,
-        ));
-    }
-
-    for item_id in carried_items {
-        actions.push(with_validator_availability(
-            SemanticActionEntry::new(
-                SemanticActionId::new(format!("place.item.{}.at.place", item_id.as_str())).unwrap(),
-                ActionId::new("place").unwrap(),
-                vec![item_id.to_string()],
-                format!("Place {}", item_id.as_str()),
-                true,
-                None,
-            ),
-            preflight,
-        ));
-    }
-
-    actions
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn with_validator_availability(
     entry: SemanticActionEntry,
     preflight: &SemanticActionPreflightContext<'_>,
 ) -> SemanticActionEntry {
     let proposal = proposal_from_semantic_action_entry(
         ProposalId::new(format!(

---- projections::tests::closed_opaque_container_check_is_disabled_with_validator_reason stdout ----

thread 'projections::tests::closed_opaque_container_check_is_disabled_with_validator_reason' (13368) panicked at crates/tracewake-core/src/projections.rs:2165:14:
called `Option::unwrap()` on a `None` value

---- projections::tests::closed_blocking_door_move_is_disabled_with_validator_reason stdout ----

thread 'projections::tests::closed_blocking_door_move_is_disabled_with_validator_reason' (13367) panicked at crates/tracewake-core/src/projections.rs:2197:14:
called `Option::unwrap()` on a `None` value

---- projections::tests::container_sourced_visible_item_uses_container_take_id stdout ----

thread 'projections::tests::container_sourced_visible_item_uses_container_take_id' (13369) panicked at crates/tracewake-core/src/projections.rs:2138:9:
assertion failed: view.semantic_actions.iter().any(|entry|
        entry.semantic_action_id.as_str() ==
            "take.item.coin_stack_01.from.strongbox_tomas")

failures:
    projections::tests::closed_blocking_door_move_is_disabled_with_validator_reason
    projections::tests::closed_opaque_container_check_is_disabled_with_validator_reason
    projections::tests::container_sourced_visible_item_uses_container_take_id
    projections::tests::disabled_embodied_availability_provenance_uses_actor_visible_facts_only
    projections::tests::embodied_projection_separates_carried_items_from_reachable_items
    projections::tests::locked_container_check_is_disabled_with_validator_reason
    projections::tests::semantic_actions_are_target_specific_and_deterministic

test result: FAILED. 448 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
