*** crates/tracewake-core/src/projections.rs:1237:33: replace == with != in with_validator_availability

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace == with != in with_validator_availability
@@ -1229,17 +1229,17 @@
             controller_bindings: None,
             epistemic_projection: None,
             content_manifest_id: preflight.content_manifest_id,
             ordering_key: &ordering_key,
             current_event_frontier: preflight.knowledge_context_frontier,
         },
         &proposal,
     );
-    let enabled = report.status == ReportStatus::Accepted;
+    let enabled = report.status != /* ~ changed by cargo-mutants ~ */ ReportStatus::Accepted;
     let availability = if enabled {
         ActionAvailability::available()
     } else {
         let mut provenance_refs = vec![
             ActionAvailabilityProvenance::new(
                 ActionAvailabilityProvenanceKind::HolderKnownContext,
                 preflight.knowledge_context_id.as_str(),
             ),

---- projections::tests::closed_opaque_container_check_is_disabled_with_validator_reason stdout ----

thread 'projections::tests::closed_opaque_container_check_is_disabled_with_validator_reason' (17951) panicked at crates/tracewake-core/src/projections.rs:2292:9:
assertion failed: !entry.enabled

---- projections::tests::closed_blocking_door_move_is_disabled_with_validator_reason stdout ----

thread 'projections::tests::closed_blocking_door_move_is_disabled_with_validator_reason' (17950) panicked at crates/tracewake-core/src/projections.rs:2324:9:
assertion failed: !entry.enabled

---- projections::tests::disabled_embodied_availability_provenance_uses_actor_visible_facts_only stdout ----

thread 'projections::tests::disabled_embodied_availability_provenance_uses_actor_visible_facts_only' (17955) panicked at crates/tracewake-core/src/projections.rs:2416:9:
disabled availability must carry provenance

failures:
    projections::tests::closed_blocking_door_move_is_disabled_with_validator_reason
    projections::tests::closed_opaque_container_check_is_disabled_with_validator_reason
    projections::tests::disabled_embodied_availability_provenance_uses_actor_visible_facts_only
    projections::tests::locked_container_check_is_disabled_with_validator_reason

test result: FAILED. 451 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
