*** crates/tracewake-core/src/projections.rs:1317:42: replace == with != in proposal_from_semantic_action_entry

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace == with != in proposal_from_semantic_action_entry
@@ -1309,17 +1309,17 @@
                 .collect(),
         }));
     }
     if let Some(controller_id) = controller_id {
         proposal
             .parameters
             .insert("controller_id".to_string(), controller_id.to_string());
     }
-    if entry.semantic_action_id.as_str() == "wait.1_tick" {
+    if entry.semantic_action_id.as_str() != /* ~ changed by cargo-mutants ~ */ "wait.1_tick" {
         proposal
             .parameters
             .insert("ticks".to_string(), "1".to_string());
         proposal
             .parameters
             .insert("reason".to_string(), "actor selected wait".to_string());
     }
     if entry.action_id.as_str() == "sleep" {

---- projections::tests::semantic_action_entry_proposal_branches_are_exact stdout ----

thread 'projections::tests::semantic_action_entry_proposal_branches_are_exact' (22551) panicked at crates/tracewake-core/src/projections.rs:3071:9:
assertion `left == right` failed
  left: None
 right: Some("1")

failures:
    projections::tests::semantic_action_entry_proposal_branches_are_exact

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
