*** crates/tracewake-core/src/projections.rs:1333:33: replace == with != in proposal_from_semantic_action_entry

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace == with != in proposal_from_semantic_action_entry
@@ -1325,17 +1325,17 @@
     if entry.action_id.as_str() == "sleep" {
         if let Some(sleep_affordance_id) = entry.target_ids.first() {
             proposal.parameters.insert(
                 "sleep_affordance_id".to_string(),
                 sleep_affordance_id.clone(),
             );
         }
     }
-    if entry.action_id.as_str() == "continue_routine" {
+    if entry.action_id.as_str() != /* ~ changed by cargo-mutants ~ */ "continue_routine" {
         if let Some(intention_id) = entry.target_ids.first() {
             proposal
                 .parameters
                 .insert("active_intention_id".to_string(), intention_id.clone());
         }
         if let Some(next_action_id) = entry.target_ids.get(1) {
             proposal
                 .parameters

---- projections::tests::semantic_action_entry_proposal_branches_are_exact stdout ----

thread 'projections::tests::semantic_action_entry_proposal_branches_are_exact' (31669) panicked at crates/tracewake-core/src/projections.rs:3099:9:
assertion `left == right` failed
  left: None
 right: Some("intention_breakfast")

failures:
    projections::tests::semantic_action_entry_proposal_branches_are_exact

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
