*** crates/tracewake-core/src/projections.rs:133:5: replace actor_known_current_place_label -> Option<&'a str> with Some("")

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace actor_known_current_place_label -> Option<&'a str> with Some("")
@@ -125,21 +125,17 @@
         }
     }
 }
 
 fn actor_known_current_place_label<'a>(
     context: &'a KnowledgeContext,
     current_place_id: &PlaceId,
 ) -> Option<&'a str> {
-    context
-        .actor_known_current_places()
-        .iter()
-        .find(|fact| fact.place_id() == current_place_id)
-        .map(ActorKnownCurrentPlaceFact::display_label)
+    Some("") /* ~ changed by cargo-mutants ~ */
 }
 
 fn actor_known_carried_item<'a>(
     context: &'a KnowledgeContext,
     item_id: &ItemId,
 ) -> Option<&'a ActorKnownCarriedItemFact> {
     context
         .actor_known_carried_items()

---- projections::tests::embodied_projection_renders_observed_place_label_not_live_truth stdout ----

thread 'projections::tests::embodied_projection_renders_observed_place_label_not_live_truth' (5486) panicked at crates/tracewake-core/src/projections.rs:2196:9:
assertion `left == right` failed
  left: ""
 right: "Shop front"

failures:
    projections::tests::embodied_projection_renders_observed_place_label_not_live_truth

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
