*** crates/tracewake-core/src/projections.rs:1354:5: replace visible_open_sleep_affordance -> Option<SleepAffordanceId> with None

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace visible_open_sleep_affordance -> Option<SleepAffordanceId> with None
@@ -1346,17 +1346,17 @@
             .insert("intention_status".to_string(), "active".to_string());
     }
     proposal
 }
 
 fn visible_open_sleep_affordance(
     source: &EmbodiedProjectionSource<'_>,
 ) -> Option<SleepAffordanceId> {
-    source.actor_known_sleep_affordances.first().cloned()
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn proposal_from_current_view_semantic_action(
     proposal_id: ProposalId,
     actor_id: ActorId,
     requested_tick: SimTick,
     entry: &SemanticActionEntry,
     source_view: &EmbodiedViewModel,

---- projections::tests::phase3a_semantic_actions_include_disabled_empty_food_and_known_sleep stdout ----

thread 'projections::tests::phase3a_semantic_actions_include_disabled_empty_food_and_known_sleep' (3756) panicked at crates/tracewake-core/src/projections.rs:1818:9:
assertion `left == right` failed
  left: None
 right: Some(SleepAffordanceId(StableId("bed_tomas")))

failures:
    projections::tests::phase3a_semantic_actions_include_disabled_empty_food_and_known_sleep

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
