*** crates/tracewake-core/src/projections.rs:136:38: replace == with != in actor_known_current_place_label

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace == with != in actor_known_current_place_label
@@ -128,17 +128,17 @@
 
 fn actor_known_current_place_label<'a>(
     context: &'a KnowledgeContext,
     current_place_id: &PlaceId,
 ) -> Option<&'a str> {
     context
         .actor_known_current_places()
         .iter()
-        .find(|fact| fact.place_id() == current_place_id)
+        .find(|fact| fact.place_id() != /* ~ changed by cargo-mutants ~ */ current_place_id)
         .map(ActorKnownCurrentPlaceFact::display_label)
 }
 
 fn actor_known_carried_item<'a>(
     context: &'a KnowledgeContext,
     item_id: &ItemId,
 ) -> Option<&'a ActorKnownCarriedItemFact> {
     context

---- controller::tests::human_binding_adds_no_extra_semantic_actions stdout ----

thread 'controller::tests::human_binding_adds_no_extra_semantic_actions' (14479) panicked at crates/tracewake-core/src/projections.rs:107:14:
sealed embodied source requires observed current-place label

---- projections::tests::closed_blocking_door_move_is_disabled_with_validator_reason stdout ----

thread 'projections::tests::closed_blocking_door_move_is_disabled_with_validator_reason' (14592) panicked at crates/tracewake-core/src/projections.rs:107:14:
sealed embodied source requires observed current-place label

---- projections::tests::closed_opaque_container_check_is_disabled_with_validator_reason stdout ----

thread 'projections::tests::closed_opaque_container_check_is_disabled_with_validator_reason' (14593) panicked at crates/tracewake-core/src/projections.rs:107:14:
sealed embodied source requires observed current-place label

failures:
    controller::tests::human_binding_adds_no_extra_semantic_actions
    projections::tests::closed_blocking_door_move_is_disabled_with_validator_reason
    projections::tests::closed_opaque_container_check_is_disabled_with_validator_reason
    projections::tests::container_sourced_visible_item_uses_container_take_id
    projections::tests::disabled_embodied_availability_provenance_uses_actor_visible_facts_only
    projections::tests::embodied_exit_omits_unperceived_door_blocker_on_known_route
    projections::tests::embodied_exit_surfaces_perceived_closed_locked_door_blocker
    projections::tests::embodied_projection_excludes_hidden_and_debug_truth
    projections::tests::embodied_projection_renders_observed_carried_item_attributes_not_live_truth
    projections::tests::embodied_projection_renders_observed_place_label_not_live_truth
    projections::tests::embodied_projection_

test result: FAILED. 441 passed; 14 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
