*** crates/tracewake-core/src/projections.rs:144:5: replace actor_known_carried_item -> Option<&'a ActorKnownCarriedItemFact> with None

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace actor_known_carried_item -> Option<&'a ActorKnownCarriedItemFact> with None
@@ -136,20 +136,17 @@
         .find(|fact| fact.place_id() == current_place_id)
         .map(ActorKnownCurrentPlaceFact::display_label)
 }
 
 fn actor_known_carried_item<'a>(
     context: &'a KnowledgeContext,
     item_id: &ItemId,
 ) -> Option<&'a ActorKnownCarriedItemFact> {
-    context
-        .actor_known_carried_items()
-        .iter()
-        .find(|fact| fact.item_id() == item_id)
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 pub struct EmbodiedPreflightSource<'a> {
     state: &'a PhysicalState,
     registry: &'a ActionRegistry,
     content_manifest_id: &'a ContentManifestId,
 }

---- projections::tests::embodied_projection_renders_observed_carried_item_attributes_not_live_truth stdout ----

thread 'projections::tests::embodied_projection_renders_observed_carried_item_attributes_not_live_truth' (19163) panicked at crates/tracewake-core/src/projections.rs:2244:14:
observed carried item renders from actor-known fact

---- projections::tests::embodied_projection_separates_carried_items_from_reachable_items stdout ----

thread 'projections::tests::embodied_projection_separates_carried_items_from_reachable_items' (19166) panicked at crates/tracewake-core/src/projections.rs:2079:9:
assertion failed: view.carried_items.iter().any(|item| item.item_id == item_id("coin_stack_01"))

failures:
    projections::tests::embodied_projection_renders_observed_carried_item_attributes_not_live_truth
    projections::tests::embodied_projection_separates_carried_items_from_reachable_items

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
