*** crates/tracewake-core/src/projections.rs:147:37: replace == with != in actor_known_carried_item

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace == with != in actor_known_carried_item
@@ -139,17 +139,17 @@
 
 fn actor_known_carried_item<'a>(
     context: &'a KnowledgeContext,
     item_id: &ItemId,
 ) -> Option<&'a ActorKnownCarriedItemFact> {
     context
         .actor_known_carried_items()
         .iter()
-        .find(|fact| fact.item_id() == item_id)
+        .find(|fact| fact.item_id() != /* ~ changed by cargo-mutants ~ */ item_id)
 }
 
 pub struct EmbodiedPreflightSource<'a> {
     state: &'a PhysicalState,
     registry: &'a ActionRegistry,
     content_manifest_id: &'a ContentManifestId,
 }

---- projections::tests::embodied_projection_renders_observed_carried_item_attributes_not_live_truth stdout ----

thread 'projections::tests::embodied_projection_renders_observed_carried_item_attributes_not_live_truth' (23734) panicked at crates/tracewake-core/src/projections.rs:2247:14:
observed carried item renders from actor-known fact

---- projections::tests::embodied_projection_separates_carried_items_from_reachable_items stdout ----

thread 'projections::tests::embodied_projection_separates_carried_items_from_reachable_items' (23737) panicked at crates/tracewake-core/src/projections.rs:2082:9:
assertion failed: view.carried_items.iter().any(|item| item.item_id == item_id("coin_stack_01"))

failures:
    projections::tests::embodied_projection_renders_observed_carried_item_attributes_not_live_truth
    projections::tests::embodied_projection_separates_carried_items_from_reachable_items

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
