*** crates/tracewake-core/src/projections.rs:226:5: replace actor_known_food_sources_for_context -> Vec<ActorKnownFoodSourceSurface> with vec![]

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace actor_known_food_sources_for_context -> Vec<ActorKnownFoodSourceSurface> with vec![]
@@ -218,27 +218,17 @@
             actor_known_local_actors,
         }
     }
 }
 
 fn actor_known_food_sources_for_context(
     context: &KnowledgeContext,
 ) -> Vec<ActorKnownFoodSourceSurface> {
-    let mut food_sources = context
-        .actor_known_food_sources()
-        .iter()
-        .map(|fact| ActorKnownFoodSourceSurface {
-            food_supply_id: fact.food_supply_id().clone(),
-            believed_servings: fact.believed_servings(),
-        })
-        .collect::<Vec<_>>();
-    food_sources.sort();
-    food_sources.dedup();
-    food_sources
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn actor_known_sleep_affordances_for_context(context: &KnowledgeContext) -> Vec<SleepAffordanceId> {
     let mut sleep_affordances = context
         .actor_known_sleep_affordances()
         .iter()
         .map(|fact| fact.sleep_affordance_id().clone())
         .collect::<Vec<_>>();

---- projections::tests::phase3a_semantic_actions_include_disabled_empty_food_and_known_sleep stdout ----

thread 'projections::tests::phase3a_semantic_actions_include_disabled_empty_food_and_known_sleep' (28331) panicked at crates/tracewake-core/src/projections.rs:1823:14:
called `Option::unwrap()` on a `None` value

---- projections::tests::view_models_embodied_phase3a_status_is_viewer_scoped_and_actor_known stdout ----

thread 'projections::tests::view_models_embodied_phase3a_status_is_viewer_scoped_and_actor_known' (28338) panicked at crates/tracewake-core/src/projections.rs:2747:9:
assertion failed: view.semantic_actions.iter().any(|entry|
        entry.semantic_action_id.as_str() == "eat.food.food_soup_pot")

failures:
    projections::tests::phase3a_semantic_actions_include_disabled_empty_food_and_known_sleep
    projections::tests::view_models_embodied_phase3a_status_is_viewer_scoped_and_actor_known

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
