*** crates/tracewake-core/src/projections.rs:240:5: replace actor_known_sleep_affordances_for_context -> Vec<SleepAffordanceId> with vec![]

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace actor_known_sleep_affordances_for_context -> Vec<SleepAffordanceId> with vec![]
@@ -232,24 +232,17 @@
         })
         .collect::<Vec<_>>();
     food_sources.sort();
     food_sources.dedup();
     food_sources
 }
 
 fn actor_known_sleep_affordances_for_context(context: &KnowledgeContext) -> Vec<SleepAffordanceId> {
-    let mut sleep_affordances = context
-        .actor_known_sleep_affordances()
-        .iter()
-        .map(|fact| fact.sleep_affordance_id().clone())
-        .collect::<Vec<_>>();
-    sleep_affordances.sort();
-    sleep_affordances.dedup();
-    sleep_affordances
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn actor_known_routes_for_context(
     context: &KnowledgeContext,
     current_place_id: Option<&PlaceId>,
 ) -> Vec<PlaceId> {
     let mut routes = context
         .actor_known_routes()

---- projections::tests::phase3a_semantic_actions_include_disabled_empty_food_and_known_sleep stdout ----

thread 'projections::tests::phase3a_semantic_actions_include_disabled_empty_food_and_known_sleep' (434) panicked at crates/tracewake-core/src/projections.rs:1807:9:
assertion `left == right` failed
  left: []
 right: [SleepAffordanceId(StableId("bed_tomas"))]

failures:
    projections::tests::phase3a_semantic_actions_include_disabled_empty_food_and_known_sleep

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
