*** crates/tracewake-core/src/projections.rs:254:5: replace actor_known_routes_for_context -> Vec<PlaceId> with vec![]

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace actor_known_routes_for_context -> Vec<PlaceId> with vec![]
@@ -246,25 +246,17 @@
     sleep_affordances.dedup();
     sleep_affordances
 }
 
 fn actor_known_routes_for_context(
     context: &KnowledgeContext,
     current_place_id: Option<&PlaceId>,
 ) -> Vec<PlaceId> {
-    let mut routes = context
-        .actor_known_routes()
-        .iter()
-        .filter(|fact| current_place_id.is_some_and(|place_id| fact.from_place_id() == place_id))
-        .map(|fact| fact.to_place_id().clone())
-        .collect::<Vec<_>>();
-    routes.sort();
-    routes.dedup();
-    routes
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn actor_known_workplaces_for_context(
     context: &KnowledgeContext,
 ) -> Vec<ActorKnownWorkplaceSurface> {
     let mut workplaces = context
         .actor_known_workplaces()
         .iter()

---- projections::tests::disabled_embodied_availability_provenance_uses_actor_visible_facts_only stdout ----

thread 'projections::tests::disabled_embodied_availability_provenance_uses_actor_visible_facts_only' (4984) panicked at crates/tracewake-core/src/projections.rs:2400:14:
called `Option::unwrap()` on a `None` value

---- projections::tests::embodied_exit_surfaces_perceived_closed_locked_door_blocker stdout ----

thread 'projections::tests::embodied_exit_surfaces_perceived_closed_locked_door_blocker' (4987) panicked at crates/tracewake-core/src/projections.rs:2014:9:
assertion `left == right` failed
  left: 0
 right: 1

---- projections::tests::embodied_exit_omits_unperceived_door_blocker_on_known_route stdout ----

thread 'projections::tests::embodied_exit_omits_unperceived_door_blocker_on_known_route' (4986) panicked at crates/tracewake-core/src/projections.rs:2039:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    projections::tests::closed_blocking_door_move_is_disabled_with_validator_reason
    projections::tests::disabled_embodied_availability_provenance_uses_actor_visible_facts_only
    projections::tests::embodied_exit_omits_unperceived_door_blocker_on_known_route
    projections::tests::embodied_exit_surfaces_perceived_closed_locked_door_blocker
    projections::tests::semantic_actions_are_target_specific_and_deterministic

test result: FAILED. 450 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
