*** crates/tracewake-core/src/projections.rs:257:85: replace == with != in actor_known_routes_for_context

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace == with != in actor_known_routes_for_context
@@ -249,17 +249,17 @@
 
 fn actor_known_routes_for_context(
     context: &KnowledgeContext,
     current_place_id: Option<&PlaceId>,
 ) -> Vec<PlaceId> {
     let mut routes = context
         .actor_known_routes()
         .iter()
-        .filter(|fact| current_place_id.is_some_and(|place_id| fact.from_place_id() == place_id))
+        .filter(|fact| current_place_id.is_some_and(|place_id| fact.from_place_id() != /* ~ changed by cargo-mutants ~ */ place_id))
         .map(|fact| fact.to_place_id().clone())
         .collect::<Vec<_>>();
     routes.sort();
     routes.dedup();
     routes
 }
 
 fn actor_known_workplaces_for_context(

---- projections::tests::closed_blocking_door_move_is_disabled_with_validator_reason stdout ----

thread 'projections::tests::closed_blocking_door_move_is_disabled_with_validator_reason' (9551) panicked at crates/tracewake-core/src/projections.rs:2322:14:
called `Option::unwrap()` on a `None` value

---- projections::tests::disabled_embodied_availability_provenance_uses_actor_visible_facts_only stdout ----

thread 'projections::tests::disabled_embodied_availability_provenance_uses_actor_visible_facts_only' (9556) panicked at crates/tracewake-core/src/projections.rs:2408:14:
called `Option::unwrap()` on a `None` value

---- projections::tests::embodied_exit_omits_unperceived_door_blocker_on_known_route stdout ----

thread 'projections::tests::embodied_exit_omits_unperceived_door_blocker_on_known_route' (9558) panicked at crates/tracewake-core/src/projections.rs:2047:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    projections::tests::closed_blocking_door_move_is_disabled_with_validator_reason
    projections::tests::disabled_embodied_availability_provenance_uses_actor_visible_facts_only
    projections::tests::embodied_exit_omits_unperceived_door_blocker_on_known_route
    projections::tests::embodied_exit_surfaces_perceived_closed_locked_door_blocker
    projections::tests::semantic_actions_are_target_specific_and_deterministic

test result: FAILED. 450 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
