*** crates/tracewake-core/src/projections.rs:268:5: replace actor_known_workplaces_for_context -> Vec<ActorKnownWorkplaceSurface> with vec![]

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace actor_known_workplaces_for_context -> Vec<ActorKnownWorkplaceSurface> with vec![]
@@ -260,29 +260,17 @@
     routes.sort();
     routes.dedup();
     routes
 }
 
 fn actor_known_workplaces_for_context(
     context: &KnowledgeContext,
 ) -> Vec<ActorKnownWorkplaceSurface> {
-    let mut workplaces = context
-        .actor_known_workplaces()
-        .iter()
-        .map(|fact| ActorKnownWorkplaceSurface {
-            workplace_id: fact.workplace_id().clone(),
-            place_id: fact.place_id().clone(),
-            believed_access_open: fact.believed_access_open(),
-            source_event_ids: fact.source_event_ids().as_slice().to_vec(),
-        })
-        .collect::<Vec<_>>();
-    workplaces.sort();
-    workplaces.dedup();
-    workplaces
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn actor_known_doors_for_context(context: &KnowledgeContext) -> Vec<ActorKnownDoorSurface> {
     let mut doors = context
         .actor_known_doors()
         .iter()
         .map(|fact: &ActorKnownDoorFact| ActorKnownDoorSurface {
             door_id: fact.door_id().clone(),

---- projections::tests::phase3a_workplace_semantic_actions_require_place_access_and_provenance stdout ----

thread 'projections::tests::phase3a_workplace_semantic_actions_require_place_access_and_provenance' (14137) panicked at crates/tracewake-core/src/projections.rs:1870:14:
current open workplace action exists

---- projections::tests::view_models_embodied_phase3a_status_is_viewer_scoped_and_actor_known stdout ----

thread 'projections::tests::view_models_embodied_phase3a_status_is_viewer_scoped_and_actor_known' (14143) panicked at crates/tracewake-core/src/projections.rs:2768:9:
assertion failed: view.semantic_actions.iter().any(|entry|
        entry.semantic_action_id.as_str() == "work.block.workplace_tomas")

failures:
    projections::tests::phase3a_workplace_semantic_actions_require_place_access_and_provenance
    projections::tests::view_models_embodied_phase3a_status_is_viewer_scoped_and_actor_known

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
