*** crates/tracewake-core/src/projections.rs:284:5: replace actor_known_doors_for_context -> Vec<ActorKnownDoorSurface> with vec![]

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace actor_known_doors_for_context -> Vec<ActorKnownDoorSurface> with vec![]
@@ -276,31 +276,17 @@
         })
         .collect::<Vec<_>>();
     workplaces.sort();
     workplaces.dedup();
     workplaces
 }
 
 fn actor_known_doors_for_context(context: &KnowledgeContext) -> Vec<ActorKnownDoorSurface> {
-    let mut doors = context
-        .actor_known_doors()
-        .iter()
-        .map(|fact: &ActorKnownDoorFact| ActorKnownDoorSurface {
-            door_id: fact.door_id().clone(),
-            endpoint_a: fact.endpoint_a().clone(),
-            endpoint_b: fact.endpoint_b().clone(),
-            is_open: fact.is_open(),
-            is_locked: fact.is_locked(),
-            blocks_movement_when_closed: fact.blocks_movement_when_closed(),
-        })
-        .collect::<Vec<_>>();
-    doors.sort();
-    doors.dedup();
-    doors
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn actor_known_containers_for_context(
     context: &KnowledgeContext,
 ) -> Vec<ActorKnownContainerSurface> {
     let mut containers = context
         .actor_known_containers()
         .iter()

---- projections::tests::embodied_exit_surfaces_perceived_closed_locked_door_blocker stdout ----

thread 'projections::tests::embodied_exit_surfaces_perceived_closed_locked_door_blocker' (18689) panicked at crates/tracewake-core/src/projections.rs:2009:9:
assertion `left == right` failed
  left: None
 right: Some("door door_shop_back is closed and locked")

failures:
    projections::tests::embodied_exit_surfaces_perceived_closed_locked_door_blocker

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
