*** crates/tracewake-core/src/projections.rs:304:5: replace actor_known_containers_for_context -> Vec<ActorKnownContainerSurface> with vec![]

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace actor_known_containers_for_context -> Vec<ActorKnownContainerSurface> with vec![]
@@ -296,30 +296,17 @@
     doors.sort();
     doors.dedup();
     doors
 }
 
 fn actor_known_containers_for_context(
     context: &KnowledgeContext,
 ) -> Vec<ActorKnownContainerSurface> {
-    let mut containers = context
-        .actor_known_containers()
-        .iter()
-        .map(
-            |fact: &ActorKnownContainerFact| ActorKnownContainerSurface {
-                container_id: fact.container_id().clone(),
-                is_open: fact.is_open(),
-                is_locked: fact.is_locked(),
-            },
-        )
-        .collect::<Vec<_>>();
-    containers.sort();
-    containers.dedup();
-    containers
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn actor_known_items_for_context(context: &KnowledgeContext) -> Vec<ActorKnownItemSurface> {
     let mut items = context
         .actor_known_items()
         .iter()
         .map(|fact: &ActorKnownItemFact| ActorKnownItemSurface {
             item_id: fact.item_id().clone(),

---- projections::tests::closed_opaque_container_check_is_disabled_with_validator_reason stdout ----

thread 'projections::tests::closed_opaque_container_check_is_disabled_with_validator_reason' (23253) panicked at crates/tracewake-core/src/projections.rs:2277:14:
called `Option::unwrap()` on a `None` value

---- projections::tests::embodied_projection_excludes_hidden_and_debug_truth stdout ----

thread 'projections::tests::embodied_projection_excludes_hidden_and_debug_truth' (23262) panicked at crates/tracewake-core/src/projections.rs:1733:9:
assertion failed: view.visible_containers.iter().any(|container|
        container.container_id == container_id("strongbox_tomas"))

---- projections::tests::locked_container_check_is_disabled_with_validator_reason stdout ----

thread 'projections::tests::locked_container_check_is_disabled_with_validator_reason' (23271) panicked at crates/tracewake-core/src/projections.rs:2429:14:
called `Option::unwrap()` on a `None` value

failures:
    projections::tests::closed_opaque_container_check_is_disabled_with_validator_reason
    projections::tests::embodied_projection_excludes_hidden_and_debug_truth
    projections::tests::locked_container_check_is_disabled_with_validator_reason

test result: FAILED. 452 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
