*** crates/tracewake-core/src/projections.rs:321:5: replace actor_known_items_for_context -> Vec<ActorKnownItemSurface> with vec![]

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace actor_known_items_for_context -> Vec<ActorKnownItemSurface> with vec![]
@@ -313,28 +313,17 @@
         )
         .collect::<Vec<_>>();
     containers.sort();
     containers.dedup();
     containers
 }
 
 fn actor_known_items_for_context(context: &KnowledgeContext) -> Vec<ActorKnownItemSurface> {
-    let mut items = context
-        .actor_known_items()
-        .iter()
-        .map(|fact: &ActorKnownItemFact| ActorKnownItemSurface {
-            item_id: fact.item_id().clone(),
-            source: fact.source().clone(),
-            portable: fact.portable(),
-        })
-        .collect::<Vec<_>>();
-    items.sort();
-    items.dedup();
-    items
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn actor_known_local_actors_for_context(context: &KnowledgeContext) -> Vec<ActorId> {
     let mut actors = context
         .actor_known_local_actors()
         .iter()
         .map(|fact: &ActorKnownLocalActorFact| fact.actor_id().clone())
         .collect::<Vec<_>>();

---- projections::tests::container_sourced_visible_item_uses_container_take_id stdout ----

thread 'projections::tests::container_sourced_visible_item_uses_container_take_id' (27825) panicked at crates/tracewake-core/src/projections.rs:2252:9:
assertion failed: view.semantic_actions.iter().any(|entry|
        entry.semantic_action_id.as_str() ==
            "take.item.coin_stack_01.from.strongbox_tomas")

---- projections::tests::embodied_projection_excludes_hidden_and_debug_truth stdout ----

thread 'projections::tests::embodied_projection_excludes_hidden_and_debug_truth' (27833) panicked at crates/tracewake-core/src/projections.rs:1739:9:
assertion failed: view.visible_items.iter().any(|item| item.item_id == item_id("loose_coin_01"))

---- projections::tests::embodied_projection_renders_stale_projected_item_not_live_truth stdout ----

thread 'projections::tests::embodied_projection_renders_stale_projected_item_not_live_truth' (27837) panicked at crates/tracewake-core/src/projections.rs:2157:14:
stale actor-known item should render from projected observation

failures:
    projections::tests::container_sourced_visible_item_uses_container_take_id
    projections::tests::embodied_projection_excludes_hidden_and_debug_truth
    projections::tests::embodied_projection_renders_stale_projected_item_not_live_truth

test result: FAILED. 452 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
