*** crates/tracewake-core/src/projections.rs:336:5: replace actor_known_local_actors_for_context -> Vec<ActorId> with vec![]

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace actor_known_local_actors_for_context -> Vec<ActorId> with vec![]
@@ -328,24 +328,17 @@
         })
         .collect::<Vec<_>>();
     items.sort();
     items.dedup();
     items
 }
 
 fn actor_known_local_actors_for_context(context: &KnowledgeContext) -> Vec<ActorId> {
-    let mut actors = context
-        .actor_known_local_actors()
-        .iter()
-        .map(|fact: &ActorKnownLocalActorFact| fact.actor_id().clone())
-        .collect::<Vec<_>>();
-    actors.sort();
-    actors.dedup();
-    actors
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 #[derive(Clone, Debug, PartialEq, Eq)]
 pub struct NoHumanDayMetrics {
     pub projection_version: String,
     pub events_per_day: usize,
     pub routine_event_count: usize,
     pub meals_completed: usize,

---- actor_known_local_actor_reaches_embodied_view_model_with_context_provenance stdout ----

thread 'actor_known_local_actor_reaches_embodied_view_model_with_context_provenance' (32676) panicked at crates/tracewake-core/tests/hidden_truth_gates.rs:1642:5:
assertion failed: view.local_actors.iter().any(|actor| actor.actor_id == known_actor)

failures:
    actor_known_local_actor_reaches_embodied_view_model_with_context_provenance

test result: FAILED. 15 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
