*** crates/tracewake-core/src/projections.rs:402:48: replace * with + in no_human_day_metrics

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace * with + in no_human_day_metrics
@@ -394,17 +394,17 @@
     let events = log.events();
     let player_conditioned_event_count = events
         .iter()
         .filter(|event| contains_player_conditioned_fact(event))
         .count();
     let player_conditioned_event_rate_per_1000 = if events.is_empty() {
         0
     } else {
-        (player_conditioned_event_count as u64 * 1000) / events.len() as u64
+        (player_conditioned_event_count as u64 + /* ~ changed by cargo-mutants ~ */ 1000) / events.len() as u64
     };
     let start_tick = events
         .iter()
         .find(|event| event.event_type == EventKind::NoHumanDayStarted)
         .map(|event| event.sim_tick)
         .unwrap_or(SimTick::ZERO);
     let end_tick = events
         .iter()

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (21632) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2507:5:
assertion `left == right` failed
  left: 4
 right: 0

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.65s

*** result: Failure(101)
