*** crates/tracewake-core/src/projections.rs:406:40: replace == with != in no_human_day_metrics

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace == with != in no_human_day_metrics
@@ -398,17 +398,17 @@
         .count();
     let player_conditioned_event_rate_per_1000 = if events.is_empty() {
         0
     } else {
         (player_conditioned_event_count as u64 * 1000) / events.len() as u64
     };
     let start_tick = events
         .iter()
-        .find(|event| event.event_type == EventKind::NoHumanDayStarted)
+        .find(|event| event.event_type != /* ~ changed by cargo-mutants ~ */ EventKind::NoHumanDayStarted)
         .map(|event| event.sim_tick)
         .unwrap_or(SimTick::ZERO);
     let end_tick = events
         .iter()
         .rev()
         .find(|event| event.event_type == EventKind::NoHumanDayCompleted)
         .map(|event| event.sim_tick)
         .unwrap_or(start_tick);

---- projections::tests::no_human_day_metrics_are_independent_event_log_counts stdout ----

thread 'projections::tests::no_human_day_metrics_are_independent_event_log_counts' (30684) panicked at crates/tracewake-core/src/projections.rs:2978:9:
assertion `left == right` failed
  left: 23
 right: 24

failures:
    projections::tests::no_human_day_metrics_are_independent_event_log_counts

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
