*** crates/tracewake-core/src/projections.rs:412:40: replace == with != in no_human_day_metrics

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace == with != in no_human_day_metrics
@@ -404,17 +404,17 @@
     let start_tick = events
         .iter()
         .find(|event| event.event_type == EventKind::NoHumanDayStarted)
         .map(|event| event.sim_tick)
         .unwrap_or(SimTick::ZERO);
     let end_tick = events
         .iter()
         .rev()
-        .find(|event| event.event_type == EventKind::NoHumanDayCompleted)
+        .find(|event| event.event_type != /* ~ changed by cargo-mutants ~ */ EventKind::NoHumanDayCompleted)
         .map(|event| event.sim_tick)
         .unwrap_or(start_tick);
     let mut stuck_actor_ids = events
         .iter()
         .filter(|event| event.event_type == EventKind::StuckDiagnosticRecorded)
         .filter_map(|event| event.actor_id.clone())
         .collect::<Vec<_>>();
     stuck_actor_ids.sort();

---- projections::tests::no_human_day_metrics_are_independent_event_log_counts stdout ----

thread 'projections::tests::no_human_day_metrics_are_independent_event_log_counts' (2775) panicked at crates/tracewake-core/src/projections.rs:2978:9:
assertion `left == right` failed
  left: 20
 right: 24

failures:
    projections::tests::no_human_day_metrics_are_independent_event_log_counts

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
