*** crates/tracewake-core/src/projections.rs:438:13: replace + with - in no_human_day_metrics

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace + with - in no_human_day_metrics
@@ -430,17 +430,17 @@
         meals_completed: count_kind(events, EventKind::FoodConsumed),
         meals_missed: count_kind(events, EventKind::EatFailed),
         sleep_completed: count_kind(events, EventKind::SleepCompleted),
         sleep_interrupted: count_kind(events, EventKind::SleepInterrupted),
         work_blocks_completed: count_kind(events, EventKind::WorkBlockCompleted),
         work_blocks_failed: count_kind(events, EventKind::WorkBlockFailed),
         need_threshold_crossings: count_kind(events, EventKind::NeedThresholdCrossed),
         routine_interruptions: count_kind(events, EventKind::IntentionInterrupted)
-            + count_kind(events, EventKind::RoutineStepFailed),
+            - /* ~ changed by cargo-mutants ~ */ count_kind(events, EventKind::RoutineStepFailed),
         planner_failures: events
             .iter()
             .filter(|event| is_typed_planner_failure_event(event))
             .count(),
         stuck_actor_count: stuck_actor_ids.len(),
         run_duration_ticks: end_tick.value().saturating_sub(start_tick.value()),
         replay_failure_count: events
             .iter()

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (11500) panicked at crates/tracewake-core/src/projections.rs:437:32:
attempt to subtract with overflow

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (11501) panicked at crates/tracewake-core/src/projections.rs:437:32:
attempt to subtract with overflow

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection

test result: FAILED. 40 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.54s

*** result: Failure(101)
