*** crates/tracewake-core/src/projections.rs:438:13: replace + with * in no_human_day_metrics

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace + with * in no_human_day_metrics
@@ -430,17 +430,17 @@
         meals_completed: count_kind(events, EventKind::FoodConsumed),
         meals_missed: count_kind(events, EventKind::EatFailed),
         sleep_completed: count_kind(events, EventKind::SleepCompleted),
         sleep_interrupted: count_kind(events, EventKind::SleepInterrupted),
         work_blocks_completed: count_kind(events, EventKind::WorkBlockCompleted),
         work_blocks_failed: count_kind(events, EventKind::WorkBlockFailed),
         need_threshold_crossings: count_kind(events, EventKind::NeedThresholdCrossed),
         routine_interruptions: count_kind(events, EventKind::IntentionInterrupted)
-            + count_kind(events, EventKind::RoutineStepFailed),
+            * /* ~ changed by cargo-mutants ~ */ count_kind(events, EventKind::RoutineStepFailed),
         planner_failures: events
             .iter()
             .filter(|event| is_typed_planner_failure_event(event))
             .count(),
         stuck_actor_count: stuck_actor_ids.len(),
         run_duration_ticks: end_tick.value().saturating_sub(start_tick.value()),
         replay_failure_count: events
             .iter()

---- projections::tests::no_human_day_metrics_are_independent_event_log_counts stdout ----

thread 'projections::tests::no_human_day_metrics_are_independent_event_log_counts' (15993) panicked at crates/tracewake-core/src/projections.rs:2975:9:
assertion `left == right` failed
  left: 1
 right: 2

failures:
    projections::tests::no_human_day_metrics_are_independent_event_log_counts

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
