*** crates/tracewake-core/src/projections.rs:448:34: replace == with != in no_human_day_metrics

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace == with != in no_human_day_metrics
@@ -440,17 +440,17 @@
             .iter()
             .filter(|event| is_typed_planner_failure_event(event))
             .count(),
         stuck_actor_count: stuck_actor_ids.len(),
         run_duration_ticks: end_tick.value().saturating_sub(start_tick.value()),
         replay_failure_count: events
             .iter()
             .filter(|event| {
-                event.event_type == EventKind::ReplayProjectionRebuilt
+                event.event_type != /* ~ changed by cargo-mutants ~ */ EventKind::ReplayProjectionRebuilt
                     && event
                         .payload
                         .iter()
                         .any(|field| field.value.contains("failure"))
             })
             .count(),
         tui_action_coverage: unique_action_count(events),
         player_conditioned_event_count,

---- projections::tests::no_human_day_metrics_are_independent_event_log_counts stdout ----

thread 'projections::tests::no_human_day_metrics_are_independent_event_log_counts' (25111) panicked at crates/tracewake-core/src/projections.rs:2979:9:
assertion `left == right` failed
  left: 2
 right: 1

failures:
    projections::tests::no_human_day_metrics_are_independent_event_log_counts

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
