*** crates/tracewake-core/src/projections.rs:462:5: replace count_kind -> usize with 0

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace count_kind -> usize with 0
@@ -454,20 +454,17 @@
             .count(),
         tui_action_coverage: unique_action_count(events),
         player_conditioned_event_count,
         player_conditioned_event_rate_per_1000,
     }
 }
 
 fn count_kind(events: &[EventEnvelope], kind: EventKind) -> usize {
-    events
-        .iter()
-        .filter(|event| event.event_type == kind)
-        .count()
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 fn is_typed_planner_failure_event(event: &EventEnvelope) -> bool {
     if !matches!(
         event.event_type,
         EventKind::DecisionTraceRecorded | EventKind::StuckDiagnosticRecorded
     ) {
         return false;

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (29276) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2500:5:
assertion failed: metrics.meals_completed > 0

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.65s

*** result: Failure(101)
