*** crates/tracewake-core/src/projections.rs:462:5: replace count_kind -> usize with 1

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace count_kind -> usize with 1
@@ -454,20 +454,17 @@
             .count(),
         tui_action_coverage: unique_action_count(events),
         player_conditioned_event_count,
         player_conditioned_event_rate_per_1000,
     }
 }
 
 fn count_kind(events: &[EventEnvelope], kind: EventKind) -> usize {
-    events
-        .iter()
-        .filter(|event| event.event_type == kind)
-        .count()
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 fn is_typed_planner_failure_event(event: &EventEnvelope) -> bool {
     if !matches!(
         event.event_type,
         EventKind::DecisionTraceRecorded | EventKind::StuckDiagnosticRecorded
     ) {
         return false;

---- projections::tests::continue_routine_marker_alone_counts_as_no_behavioral_progress stdout ----

thread 'projections::tests::continue_routine_marker_alone_counts_as_no_behavioral_progress' (1285) panicked at crates/tracewake-core/src/projections.rs:3146:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    projections::tests::continue_routine_marker_alone_counts_as_no_behavioral_progress

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
