*** crates/tracewake-core/src/projections.rs:464:42: replace == with != in count_kind

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace == with != in count_kind
@@ -456,17 +456,17 @@
         player_conditioned_event_count,
         player_conditioned_event_rate_per_1000,
     }
 }
 
 fn count_kind(events: &[EventEnvelope], kind: EventKind) -> usize {
     events
         .iter()
-        .filter(|event| event.event_type == kind)
+        .filter(|event| event.event_type != /* ~ changed by cargo-mutants ~ */ kind)
         .count()
 }
 
 fn is_typed_planner_failure_event(event: &EventEnvelope) -> bool {
     if !matches!(
         event.event_type,
         EventKind::DecisionTraceRecorded | EventKind::StuckDiagnosticRecorded
     ) {

---- projections::tests::continue_routine_marker_alone_counts_as_no_behavioral_progress stdout ----

thread 'projections::tests::continue_routine_marker_alone_counts_as_no_behavioral_progress' (5845) panicked at crates/tracewake-core/src/projections.rs:3149:9:
assertion `left == right` failed
  left: 3
 right: 0

---- projections::tests::continue_routine_follow_on_progress_survives_replay_from_event_chain stdout ----

thread 'projections::tests::continue_routine_follow_on_progress_survives_replay_from_event_chain' (5844) panicked at crates/tracewake-core/src/projections.rs:3168:9:
assertion `left == right` failed
  left: 4
 right: 1

---- projections::tests::no_human_day_metrics_are_independent_event_log_counts stdout ----

thread 'projections::tests::no_human_day_metrics_are_independent_event_log_counts' (5861) panicked at crates/tracewake-core/src/projections.rs:2926:9:
assertion `left == right` failed
  left: 21
 right: 1

failures:
    projections::tests::continue_routine_follow_on_progress_survives_replay_from_event_chain
    projections::tests::continue_routine_marker_alone_counts_as_no_behavioral_progress
    projections::tests::no_human_day_metrics_are_independent_event_log_counts

test result: FAILED. 452 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
