*** crates/tracewake-core/src/projections.rs:469:5: replace is_typed_planner_failure_event -> bool with false

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace is_typed_planner_failure_event -> bool with false
@@ -461,33 +461,17 @@
 fn count_kind(events: &[EventEnvelope], kind: EventKind) -> usize {
     events
         .iter()
         .filter(|event| event.event_type == kind)
         .count()
 }
 
 fn is_typed_planner_failure_event(event: &EventEnvelope) -> bool {
-    if !matches!(
-        event.event_type,
-        EventKind::DecisionTraceRecorded | EventKind::StuckDiagnosticRecorded
-    ) {
-        return false;
-    }
-    let responsible_layer = typed_responsible_layer(event);
-    let blocker_code = typed_blocker_code(event);
-    matches!(responsible_layer, Some(ResponsibleLayer::LocalPlanning))
-        || matches!(
-            blocker_code,
-            Some(
-                BlockerCode::PlannerBudgetExhausted
-                    | BlockerCode::EmptyLocalPlan
-                    | BlockerCode::LocalPlanFailed
-            )
-        )
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn typed_responsible_layer(event: &EventEnvelope) -> Option<ResponsibleLayer> {
     payload_value(event, "responsible_layer").and_then(|value| ResponsibleLayer::parse(value).ok())
 }
 
 fn typed_blocker_code(event: &EventEnvelope) -> Option<BlockerCode> {
     payload_value(event, "blocker_code").and_then(|value| BlockerCode::parse(value).ok())

---- projections::tests::no_human_metrics_helpers_use_typed_fields_and_player_terms stdout ----

thread 'projections::tests::no_human_metrics_helpers_use_typed_fields_and_player_terms' (14981) panicked at crates/tracewake-core/src/projections.rs:2984:9:
assertion failed: is_typed_planner_failure_event(&local_planning)

---- projections::tests::no_human_day_metrics_are_independent_event_log_counts stdout ----

thread 'projections::tests::no_human_day_metrics_are_independent_event_log_counts' (14979) panicked at crates/tracewake-core/src/projections.rs:2960:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    projections::tests::no_human_day_metrics_are_independent_event_log_counts
    projections::tests::no_human_metrics_helpers_use_typed_fields_and_player_terms

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
