*** crates/tracewake-core/src/projections.rs:469:8: delete ! in is_typed_planner_failure_event

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ delete ! in is_typed_planner_failure_event
@@ -461,17 +461,17 @@
 fn count_kind(events: &[EventEnvelope], kind: EventKind) -> usize {
     events
         .iter()
         .filter(|event| event.event_type == kind)
         .count()
 }
 
 fn is_typed_planner_failure_event(event: &EventEnvelope) -> bool {
-    if !matches!(
+    if  /* ~ changed by cargo-mutants ~ */matches!(
         event.event_type,
         EventKind::DecisionTraceRecorded | EventKind::StuckDiagnosticRecorded
     ) {
         return false;
     }
     let responsible_layer = typed_responsible_layer(event);
     let blocker_code = typed_blocker_code(event);
     matches!(responsible_layer, Some(ResponsibleLayer::LocalPlanning))

---- projections::tests::no_human_metrics_helpers_use_typed_fields_and_player_terms stdout ----

thread 'projections::tests::no_human_metrics_helpers_use_typed_fields_and_player_terms' (19540) panicked at crates/tracewake-core/src/projections.rs:3000:9:
assertion failed: is_typed_planner_failure_event(&local_planning)

---- projections::tests::no_human_day_metrics_are_independent_event_log_counts stdout ----

thread 'projections::tests::no_human_day_metrics_are_independent_event_log_counts' (19538) panicked at crates/tracewake-core/src/projections.rs:2976:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    projections::tests::no_human_day_metrics_are_independent_event_log_counts
    projections::tests::no_human_metrics_helpers_use_typed_fields_and_player_terms

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
