*** crates/tracewake-core/src/projections.rs:478:9: replace || with && in is_typed_planner_failure_event

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace || with && in is_typed_planner_failure_event
@@ -470,17 +470,17 @@
         event.event_type,
         EventKind::DecisionTraceRecorded | EventKind::StuckDiagnosticRecorded
     ) {
         return false;
     }
     let responsible_layer = typed_responsible_layer(event);
     let blocker_code = typed_blocker_code(event);
     matches!(responsible_layer, Some(ResponsibleLayer::LocalPlanning))
-        || matches!(
+        && /* ~ changed by cargo-mutants ~ */ matches!(
             blocker_code,
             Some(
                 BlockerCode::PlannerBudgetExhausted
                     | BlockerCode::EmptyLocalPlan
                     | BlockerCode::LocalPlanFailed
             )
         )
 }

---- projections::tests::no_human_metrics_helpers_use_typed_fields_and_player_terms stdout ----

thread 'projections::tests::no_human_metrics_helpers_use_typed_fields_and_player_terms' (24099) panicked at crates/tracewake-core/src/projections.rs:3000:9:
assertion failed: is_typed_planner_failure_event(&local_planning)

failures:
    projections::tests::no_human_metrics_helpers_use_typed_fields_and_player_terms

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
