*** crates/tracewake-core/src/projections.rs:489:5: replace typed_responsible_layer -> Option<ResponsibleLayer> with None

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace typed_responsible_layer -> Option<ResponsibleLayer> with None
@@ -481,17 +481,17 @@
                 BlockerCode::PlannerBudgetExhausted
                     | BlockerCode::EmptyLocalPlan
                     | BlockerCode::LocalPlanFailed
             )
         )
 }
 
 fn typed_responsible_layer(event: &EventEnvelope) -> Option<ResponsibleLayer> {
-    payload_value(event, "responsible_layer").and_then(|value| ResponsibleLayer::parse(value).ok())
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn typed_blocker_code(event: &EventEnvelope) -> Option<BlockerCode> {
     payload_value(event, "blocker_code").and_then(|value| BlockerCode::parse(value).ok())
 }
 
 fn payload_value<'a>(event: &'a EventEnvelope, key: &str) -> Option<&'a str> {
     event

---- projections::tests::no_human_metrics_helpers_use_typed_fields_and_player_terms stdout ----

thread 'projections::tests::no_human_metrics_helpers_use_typed_fields_and_player_terms' (28658) panicked at crates/tracewake-core/src/projections.rs:2995:9:
assertion `left == right` failed
  left: None
 right: Some(LocalPlanning)

failures:
    projections::tests::no_human_metrics_helpers_use_typed_fields_and_player_terms

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
