*** crates/tracewake-core/src/projections.rs:493:5: replace typed_blocker_code -> Option<BlockerCode> with None

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace typed_blocker_code -> Option<BlockerCode> with None
@@ -485,17 +485,17 @@
         )
 }
 
 fn typed_responsible_layer(event: &EventEnvelope) -> Option<ResponsibleLayer> {
     payload_value(event, "responsible_layer").and_then(|value| ResponsibleLayer::parse(value).ok())
 }
 
 fn typed_blocker_code(event: &EventEnvelope) -> Option<BlockerCode> {
-    payload_value(event, "blocker_code").and_then(|value| BlockerCode::parse(value).ok())
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn payload_value<'a>(event: &'a EventEnvelope, key: &str) -> Option<&'a str> {
     event
         .payload
         .iter()
         .find(|field| field.key == key)
         .map(|field| field.value.as_str())

---- projections::tests::no_human_metrics_helpers_use_typed_fields_and_player_terms stdout ----

thread 'projections::tests::no_human_metrics_helpers_use_typed_fields_and_player_terms' (761) panicked at crates/tracewake-core/src/projections.rs:2999:9:
assertion `left == right` failed
  left: None
 right: Some(None)

failures:
    projections::tests::no_human_metrics_helpers_use_typed_fields_and_player_terms

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
