*** crates/tracewake-core/src/projections.rs:497:5: replace payload_value -> Option<&'a str> with Some("")

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace payload_value -> Option<&'a str> with Some("")
@@ -489,21 +489,17 @@
     payload_value(event, "responsible_layer").and_then(|value| ResponsibleLayer::parse(value).ok())
 }
 
 fn typed_blocker_code(event: &EventEnvelope) -> Option<BlockerCode> {
     payload_value(event, "blocker_code").and_then(|value| BlockerCode::parse(value).ok())
 }
 
 fn payload_value<'a>(event: &'a EventEnvelope, key: &str) -> Option<&'a str> {
-    event
-        .payload
-        .iter()
-        .find(|field| field.key == key)
-        .map(|field| field.value.as_str())
+    Some("") /* ~ changed by cargo-mutants ~ */
 }
 
 fn is_routine_event(kind: EventKind) -> bool {
     matches!(
         kind,
         EventKind::RoutineStepStarted
             | EventKind::RoutineStepCompleted
             | EventKind::RoutineStepFailed

---- projections::tests::no_human_metrics_helpers_use_typed_fields_and_player_terms stdout ----

thread 'projections::tests::no_human_metrics_helpers_use_typed_fields_and_player_terms' (9892) panicked at crates/tracewake-core/src/projections.rs:2991:9:
assertion `left == right` failed
  left: None
 right: Some(LocalPlanning)

---- projections::tests::no_human_day_metrics_are_independent_event_log_counts stdout ----

thread 'projections::tests::no_human_day_metrics_are_independent_event_log_counts' (9890) panicked at crates/tracewake-core/src/projections.rs:2972:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    projections::tests::no_human_day_metrics_are_independent_event_log_counts
    projections::tests::no_human_metrics_helpers_use_typed_fields_and_player_terms

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
