*** crates/tracewake-core/src/projections.rs:505:5: replace is_routine_event -> bool with true

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace is_routine_event -> bool with true
@@ -497,24 +497,17 @@
     event
         .payload
         .iter()
         .find(|field| field.key == key)
         .map(|field| field.value.as_str())
 }
 
 fn is_routine_event(kind: EventKind) -> bool {
-    matches!(
-        kind,
-        EventKind::RoutineStepStarted
-            | EventKind::RoutineStepCompleted
-            | EventKind::RoutineStepFailed
-            | EventKind::ContinueRoutineAccepted
-            | EventKind::ContinueRoutineRejected
-    )
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn unique_action_count(events: &[EventEnvelope]) -> usize {
     let mut action_ids = events
         .iter()
         .map(|event| event.ordering_key.action_id.clone())
         .collect::<Vec<_>>();
     action_ids.sort();

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (23173) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2486:5:
assertion `left == right` failed
  left: 231
 right: 8

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.65s

*** result: Failure(101)
