*** crates/tracewake-core/src/projections.rs:516:5: replace unique_action_count -> usize with 1

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace unique_action_count -> usize with 1
@@ -508,23 +508,17 @@
             | EventKind::RoutineStepCompleted
             | EventKind::RoutineStepFailed
             | EventKind::ContinueRoutineAccepted
             | EventKind::ContinueRoutineRejected
     )
 }
 
 fn unique_action_count(events: &[EventEnvelope]) -> usize {
-    let mut action_ids = events
-        .iter()
-        .map(|event| event.ordering_key.action_id.clone())
-        .collect::<Vec<_>>();
-    action_ids.sort();
-    action_ids.dedup();
-    action_ids.len()
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 fn contains_player_conditioned_fact(event: &EventEnvelope) -> bool {
     event.participants.iter().any(|value| is_player_term(value))
         || event
             .payload
             .iter()
             .any(|field| is_player_term(&field.key) || is_player_term(&field.value))

---- projections::tests::no_human_day_metrics_are_independent_event_log_counts stdout ----

thread 'projections::tests::no_human_day_metrics_are_independent_event_log_counts' (3856) panicked at crates/tracewake-core/src/projections.rs:2974:9:
assertion `left == right` failed
  left: 1
 right: 22

failures:
    projections::tests::no_human_day_metrics_are_independent_event_log_counts

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
