*** crates/tracewake-core/src/projections.rs:526:5: replace contains_player_conditioned_fact -> bool with true

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace contains_player_conditioned_fact -> bool with true
@@ -518,22 +518,17 @@
         .map(|event| event.ordering_key.action_id.clone())
         .collect::<Vec<_>>();
     action_ids.sort();
     action_ids.dedup();
     action_ids.len()
 }
 
 fn contains_player_conditioned_fact(event: &EventEnvelope) -> bool {
-    event.participants.iter().any(|value| is_player_term(value))
-        || event
-            .payload
-            .iter()
-            .any(|field| is_player_term(&field.key) || is_player_term(&field.value))
-        || is_player_term(&event.effects_summary)
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 fn is_player_term(value: &str) -> bool {
     let lowered = value.to_ascii_lowercase();
     lowered.contains("player") || lowered.contains("controller")
 }
 
 pub fn build_embodied_view_model(

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (8022) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2506:5:
assertion `left == right` failed
  left: 231
 right: 0

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.67s

*** result: Failure(101)
