*** crates/tracewake-core/src/projections.rs:526:5: replace contains_player_conditioned_fact -> bool with false

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace contains_player_conditioned_fact -> bool with false
@@ -518,22 +518,17 @@
         .map(|event| event.ordering_key.action_id.clone())
         .collect::<Vec<_>>();
     action_ids.sort();
     action_ids.dedup();
     action_ids.len()
 }
 
 fn contains_player_conditioned_fact(event: &EventEnvelope) -> bool {
-    event.participants.iter().any(|value| is_player_term(value))
-        || event
-            .payload
-            .iter()
-            .any(|field| is_player_term(&field.key) || is_player_term(&field.value))
-        || is_player_term(&event.effects_summary)
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 fn is_player_term(value: &str) -> bool {
     let lowered = value.to_ascii_lowercase();
     lowered.contains("player") || lowered.contains("controller")
 }
 
 pub fn build_embodied_view_model(

---- projections::tests::no_human_metrics_helpers_use_typed_fields_and_player_terms stdout ----

thread 'projections::tests::no_human_metrics_helpers_use_typed_fields_and_player_terms' (12517) panicked at crates/tracewake-core/src/projections.rs:3013:9:
assertion failed: contains_player_conditioned_fact(&participant_player)

---- projections::tests::no_human_day_metrics_are_independent_event_log_counts stdout ----

thread 'projections::tests::no_human_day_metrics_are_independent_event_log_counts' (12515) panicked at crates/tracewake-core/src/projections.rs:2976:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    projections::tests::no_human_day_metrics_are_independent_event_log_counts
    projections::tests::no_human_metrics_helpers_use_typed_fields_and_player_terms

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
