*** crates/tracewake-core/src/projections.rs:527:9: replace || with && in contains_player_conditioned_fact

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace || with && in contains_player_conditioned_fact
@@ -519,17 +519,17 @@
         .collect::<Vec<_>>();
     action_ids.sort();
     action_ids.dedup();
     action_ids.len()
 }
 
 fn contains_player_conditioned_fact(event: &EventEnvelope) -> bool {
     event.participants.iter().any(|value| is_player_term(value))
-        || event
+        && /* ~ changed by cargo-mutants ~ */ event
             .payload
             .iter()
             .any(|field| is_player_term(&field.key) || is_player_term(&field.value))
         || is_player_term(&event.effects_summary)
 }
 
 fn is_player_term(value: &str) -> bool {
     let lowered = value.to_ascii_lowercase();

---- projections::tests::no_human_metrics_helpers_use_typed_fields_and_player_terms stdout ----

thread 'projections::tests::no_human_metrics_helpers_use_typed_fields_and_player_terms' (21635) panicked at crates/tracewake-core/src/projections.rs:3018:9:
assertion failed: contains_player_conditioned_fact(&participant_player)

failures:
    projections::tests::no_human_metrics_helpers_use_typed_fields_and_player_terms

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
