*** crates/tracewake-core/src/projections.rs:530:53: replace || with && in contains_player_conditioned_fact

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace || with && in contains_player_conditioned_fact
@@ -522,17 +522,17 @@
     action_ids.len()
 }
 
 fn contains_player_conditioned_fact(event: &EventEnvelope) -> bool {
     event.participants.iter().any(|value| is_player_term(value))
         || event
             .payload
             .iter()
-            .any(|field| is_player_term(&field.key) || is_player_term(&field.value))
+            .any(|field| is_player_term(&field.key) && /* ~ changed by cargo-mutants ~ */ is_player_term(&field.value))
         || is_player_term(&event.effects_summary)
 }
 
 fn is_player_term(value: &str) -> bool {
     let lowered = value.to_ascii_lowercase();
     lowered.contains("player") || lowered.contains("controller")
 }

---- projections::tests::no_human_metrics_helpers_use_typed_fields_and_player_terms stdout ----

thread 'projections::tests::no_human_metrics_helpers_use_typed_fields_and_player_terms' (26194) panicked at crates/tracewake-core/src/projections.rs:3022:9:
assertion failed: contains_player_conditioned_fact(&payload_player)

failures:
    projections::tests::no_human_metrics_helpers_use_typed_fields_and_player_terms

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
