*** crates/tracewake-core/src/projections.rs:531:9: replace || with && in contains_player_conditioned_fact

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace || with && in contains_player_conditioned_fact
@@ -523,17 +523,17 @@
 }
 
 fn contains_player_conditioned_fact(event: &EventEnvelope) -> bool {
     event.participants.iter().any(|value| is_player_term(value))
         || event
             .payload
             .iter()
             .any(|field| is_player_term(&field.key) || is_player_term(&field.value))
-        || is_player_term(&event.effects_summary)
+        && /* ~ changed by cargo-mutants ~ */ is_player_term(&event.effects_summary)
 }
 
 fn is_player_term(value: &str) -> bool {
     let lowered = value.to_ascii_lowercase();
     lowered.contains("player") || lowered.contains("controller")
 }
 
 pub fn build_embodied_view_model(

---- projections::tests::no_human_day_metrics_are_independent_event_log_counts stdout ----

thread 'projections::tests::no_human_day_metrics_are_independent_event_log_counts' (17074) panicked at crates/tracewake-core/src/projections.rs:2981:9:
assertion `left == right` failed
  left: 0
 right: 1

---- projections::tests::no_human_metrics_helpers_use_typed_fields_and_player_terms stdout ----

thread 'projections::tests::no_human_metrics_helpers_use_typed_fields_and_player_terms' (17076) panicked at crates/tracewake-core/src/projections.rs:3022:9:
assertion failed: contains_player_conditioned_fact(&payload_player)

failures:
    projections::tests::no_human_day_metrics_are_independent_event_log_counts
    projections::tests::no_human_metrics_helpers_use_typed_fields_and_player_terms

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
