*** crates/tracewake-core/src/projections.rs:535:5: replace is_player_term -> bool with true

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace is_player_term -> bool with true
@@ -527,18 +527,17 @@
         || event
             .payload
             .iter()
             .any(|field| is_player_term(&field.key) || is_player_term(&field.value))
         || is_player_term(&event.effects_summary)
 }
 
 fn is_player_term(value: &str) -> bool {
-    let lowered = value.to_ascii_lowercase();
-    lowered.contains("player") || lowered.contains("controller")
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn build_embodied_view_model(
     context: &KnowledgeContext,
     source: &EmbodiedProjectionSource<'_>,
     preflight_source: &EmbodiedPreflightSource<'_>,
     last_rejection: Option<&ValidationReport>,
 ) -> Result<EmbodiedViewModel, ProjectionError> {

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (30357) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2506:5:
assertion `left == right` failed
  left: 231
 right: 0

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.65s

*** result: Failure(101)
