*** crates/tracewake-core/src/projections.rs:535:5: replace is_player_term -> bool with false

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace is_player_term -> bool with false
@@ -527,18 +527,17 @@
         || event
             .payload
             .iter()
             .any(|field| is_player_term(&field.key) || is_player_term(&field.value))
         || is_player_term(&event.effects_summary)
 }
 
 fn is_player_term(value: &str) -> bool {
-    let lowered = value.to_ascii_lowercase();
-    lowered.contains("player") || lowered.contains("controller")
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn build_embodied_view_model(
     context: &KnowledgeContext,
     source: &EmbodiedProjectionSource<'_>,
     preflight_source: &EmbodiedPreflightSource<'_>,
     last_rejection: Option<&ValidationReport>,
 ) -> Result<EmbodiedViewModel, ProjectionError> {

---- projections::tests::no_human_day_metrics_are_independent_event_log_counts stdout ----

thread 'projections::tests::no_human_day_metrics_are_independent_event_log_counts' (2382) panicked at crates/tracewake-core/src/projections.rs:2980:9:
assertion `left == right` failed
  left: 0
 right: 1

---- projections::tests::no_human_metrics_helpers_use_typed_fields_and_player_terms stdout ----

thread 'projections::tests::no_human_metrics_helpers_use_typed_fields_and_player_terms' (2384) panicked at crates/tracewake-core/src/projections.rs:3017:9:
assertion failed: contains_player_conditioned_fact(&participant_player)

failures:
    projections::tests::no_human_day_metrics_are_independent_event_log_counts
    projections::tests::no_human_metrics_helpers_use_typed_fields_and_player_terms

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
