*** crates/tracewake-core/src/projections.rs:536:32: replace || with && in is_player_term

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace || with && in is_player_term
@@ -528,17 +528,17 @@
             .payload
             .iter()
             .any(|field| is_player_term(&field.key) || is_player_term(&field.value))
         || is_player_term(&event.effects_summary)
 }
 
 fn is_player_term(value: &str) -> bool {
     let lowered = value.to_ascii_lowercase();
-    lowered.contains("player") || lowered.contains("controller")
+    lowered.contains("player") && /* ~ changed by cargo-mutants ~ */ lowered.contains("controller")
 }
 
 pub fn build_embodied_view_model(
     context: &KnowledgeContext,
     source: &EmbodiedProjectionSource<'_>,
     preflight_source: &EmbodiedPreflightSource<'_>,
     last_rejection: Option<&ValidationReport>,
 ) -> Result<EmbodiedViewModel, ProjectionError> {

---- projections::tests::no_human_metrics_helpers_use_typed_fields_and_player_terms stdout ----

thread 'projections::tests::no_human_metrics_helpers_use_typed_fields_and_player_terms' (6944) panicked at crates/tracewake-core/src/projections.rs:3018:9:
assertion failed: contains_player_conditioned_fact(&participant_player)

---- projections::tests::no_human_day_metrics_are_independent_event_log_counts stdout ----

thread 'projections::tests::no_human_day_metrics_are_independent_event_log_counts' (6942) panicked at crates/tracewake-core/src/projections.rs:2981:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    projections::tests::no_human_day_metrics_are_independent_event_log_counts
    projections::tests::no_human_metrics_helpers_use_typed_fields_and_player_terms

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
