*** crates/tracewake-core/src/projections.rs:547:65: replace == with != in build_embodied_view_model

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace == with != in build_embodied_view_model
@@ -539,17 +539,17 @@
 pub fn build_embodied_view_model(
     context: &KnowledgeContext,
     source: &EmbodiedProjectionSource<'_>,
     preflight_source: &EmbodiedPreflightSource<'_>,
     last_rejection: Option<&ValidationReport>,
 ) -> Result<EmbodiedViewModel, ProjectionError> {
     let viewer_actor_id = context.viewer_actor_id();
     let viewer_rejection =
-        last_rejection.filter(|report| report.actor_id.as_ref() == Some(viewer_actor_id));
+        last_rejection.filter(|report| report.actor_id.as_ref() != /* ~ changed by cargo-mutants ~ */ Some(viewer_actor_id));
     let sim_tick = context.current_tick();
     let agent_state = source.agent_state;
 
     let mut visible_exits = source
         .actor_known_routes
         .iter()
         .cloned()
         .map(|destination_place_id| VisibleExit {

---- projections::tests::rejection_report_must_match_viewer_before_embodied_projection_renders_it stdout ----

thread 'projections::tests::rejection_report_must_match_viewer_before_embodied_projection_renders_it' (11522) panicked at crates/tracewake-core/src/projections.rs:2385:9:
assertion `left == right` failed
  left: Some("The door is closed.")
 right: None

failures:
    projections::tests::rejection_report_must_match_viewer_before_embodied_projection_renders_it

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
