*** crates/tracewake-core/src/projections.rs:745:29: replace != with == in typed_notebook_lead

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace != with == in typed_notebook_lead
@@ -737,17 +737,17 @@
     }
 }
 
 fn typed_notebook_lead(
     projection: &EpistemicProjection,
     context: &KnowledgeContext,
     contradiction: &Contradiction,
 ) -> Option<NotebookLeadEntry> {
-    if contradiction.kind() != ContradictionKind::ExpectedItemAbsentFromContainer {
+    if contradiction.kind() == /* ~ changed by cargo-mutants ~ */ ContradictionKind::ExpectedItemAbsentFromContainer {
         return None;
     }
     let Proposition::ItemMissingFromExpectedLocation {
         item_id,
         expected_location,
     } = &contradiction.observed_proposition()
     else {
         return None;

---- projections::tests::notebook_leads_come_from_typed_contradictions_not_belief_wording stdout ----

thread 'projections::tests::notebook_leads_come_from_typed_contradictions_not_belief_wording' (20658) panicked at crates/tracewake-core/src/projections.rs:2568:9:
assertion `left == right` failed
  left: 0
 right: 1

---- projections::tests::notebook_for_tomas_shows_missing_belief_without_culprit_leak stdout ----

thread 'projections::tests::notebook_for_tomas_shows_missing_belief_without_culprit_leak' (20657) panicked at crates/tracewake-core/src/projections.rs:2545:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    projections::tests::notebook_for_tomas_shows_missing_belief_without_culprit_leak
    projections::tests::notebook_leads_come_from_typed_contradictions_not_belief_wording

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
