*** crates/tracewake-core/src/projections.rs:745:5: replace typed_notebook_lead -> Option<NotebookLeadEntry> with None

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace typed_notebook_lead -> Option<NotebookLeadEntry> with None
@@ -737,57 +737,17 @@
     }
 }
 
 fn typed_notebook_lead(
     projection: &EpistemicProjection,
     context: &KnowledgeContext,
     contradiction: &Contradiction,
 ) -> Option<NotebookLeadEntry> {
-    if contradiction.kind() != ContradictionKind::ExpectedItemAbsentFromContainer {
-        return None;
-    }
-    let Proposition::ItemMissingFromExpectedLocation {
-        item_id,
-        expected_location,
-    } = &contradiction.observed_proposition()
-    else {
-        return None;
-    };
-    let observation = projection.observation(contradiction.contradicting_observation_id())?;
-    let possible_next_actions = match expected_location {
-        Location::InContainer(container_id) => {
-            vec![format!("check.container.{}", container_id.as_str())]
-        }
-        Location::AtPlace(place_id) => vec![format!("inspect.place.{}", place_id.as_str())],
-        Location::CarriedBy(actor_id) => vec![format!("ask.actor.{}", actor_id.as_str())],
-    };
-
-    Some(NotebookLeadEntry {
-        lead_id: format!("lead.{}", contradiction.contradiction_id().as_str()),
-        contradiction_id: contradiction.contradiction_id().as_str().to_string(),
-        belief_id: contradiction
-            .prior_expectation_belief_id()
-            .as_str()
-            .to_string(),
-        observation_id: observation.observation_id().as_str().to_string(),
-        source_kind: source_kind(observation.source()).to_string(),
-        source_summary: source_summary(observation.source()),
-        confidence_label: observation.confidence().serialize_canonical(),
-        detected_tick: contradiction.detected_tick().value(),
-        staleness_label: staleness_label(context, contradiction.detected_tick()),
-        how_this_may_be_wrong: "The item may have moved through an unobserved ordinary event."
-            .to_string(),
-        possible_next_actions,
-        summary: format!(
-            "Source-bound lead from {}: {} missing from expected location",
-            contradiction.contradiction_id().as_str(),
-            item_id.as_str()
-        ),
-    })
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn source_kind(source: &SourceRef) -> &'static str {
     match source {
         SourceRef::Event(_) => "event",
         SourceRef::Action(_) => "action",
         SourceRef::Cause(_) => "cause",
     }

---- projections::tests::notebook_for_tomas_shows_missing_belief_without_culprit_leak stdout ----

thread 'projections::tests::notebook_for_tomas_shows_missing_belief_without_culprit_leak' (16087) panicked at crates/tracewake-core/src/projections.rs:2505:9:
assertion `left == right` failed
  left: 0
 right: 1

---- projections::tests::notebook_leads_come_from_typed_contradictions_not_belief_wording stdout ----

thread 'projections::tests::notebook_leads_come_from_typed_contradictions_not_belief_wording' (16088) panicked at crates/tracewake-core/src/projections.rs:2528:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    projections::tests::notebook_for_tomas_shows_missing_belief_without_culprit_leak
    projections::tests::notebook_leads_come_from_typed_contradictions_not_belief_wording

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
