*** crates/tracewake-core/src/projections.rs:789:5: replace source_kind -> &'static str with "xyzzy"

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace source_kind -> &'static str with "xyzzy"
@@ -781,21 +781,17 @@
             "Source-bound lead from {}: {} missing from expected location",
             contradiction.contradiction_id().as_str(),
             item_id.as_str()
         ),
     })
 }
 
 fn source_kind(source: &SourceRef) -> &'static str {
-    match source {
-        SourceRef::Event(_) => "event",
-        SourceRef::Action(_) => "action",
-        SourceRef::Cause(_) => "cause",
-    }
+    "xyzzy" /* ~ changed by cargo-mutants ~ */
 }
 
 fn source_summary(source: &SourceRef) -> String {
     match source {
         SourceRef::Event(event_id) => format!("event:{}", event_id.as_str()),
         SourceRef::Action(action_id) => format!("action:{}", action_id.as_str()),
         SourceRef::Cause(cause) => format!("cause:{cause:?}"),
     }

---- projections::tests::notebook_for_tomas_shows_missing_belief_without_culprit_leak stdout ----

thread 'projections::tests::notebook_for_tomas_shows_missing_belief_without_culprit_leak' (29775) panicked at crates/tracewake-core/src/projections.rs:2545:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "event"

failures:
    projections::tests::notebook_for_tomas_shows_missing_belief_without_culprit_leak

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
