*** crates/tracewake-core/src/projections.rs:805:5: replace staleness_label -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace staleness_label -> String with "xyzzy".into()
@@ -797,25 +797,17 @@
     match source {
         SourceRef::Event(event_id) => format!("event:{}", event_id.as_str()),
         SourceRef::Action(action_id) => format!("action:{}", action_id.as_str()),
         SourceRef::Cause(cause) => format!("cause:{cause:?}"),
     }
 }
 
 fn staleness_label(context: &KnowledgeContext, detected_tick: SimTick) -> String {
-    let elapsed = context
-        .current_tick()
-        .value()
-        .saturating_sub(detected_tick.value());
-    if elapsed == 0 {
-        "current_tick".to_string()
-    } else {
-        format!("{} ticks old", elapsed)
-    }
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 fn phase3a_salient_interruption(
     agent_state: &AgentState,
     viewer_actor_id: &ActorId,
 ) -> Option<String> {
     agent_state
         .ordinary_life_episodes()

---- projections::tests::notebook_for_tomas_shows_missing_belief_without_culprit_leak stdout ----

thread 'projections::tests::notebook_for_tomas_shows_missing_belief_without_culprit_leak' (15544) panicked at crates/tracewake-core/src/projections.rs:2544:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "1 ticks old"

failures:
    projections::tests::notebook_for_tomas_shows_missing_belief_without_culprit_leak

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
