*** crates/tracewake-core/src/projections.rs:809:16: replace == with != in staleness_label

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace == with != in staleness_label
@@ -801,17 +801,17 @@
     }
 }
 
 fn staleness_label(context: &KnowledgeContext, detected_tick: SimTick) -> String {
     let elapsed = context
         .current_tick()
         .value()
         .saturating_sub(detected_tick.value());
-    if elapsed == 0 {
+    if elapsed != /* ~ changed by cargo-mutants ~ */ 0 {
         "current_tick".to_string()
     } else {
         format!("{} ticks old", elapsed)
     }
 }
 
 fn phase3a_salient_interruption(
     agent_state: &AgentState,

---- projections::tests::notebook_for_tomas_shows_missing_belief_without_culprit_leak stdout ----

thread 'projections::tests::notebook_for_tomas_shows_missing_belief_without_culprit_leak' (20103) panicked at crates/tracewake-core/src/projections.rs:2552:9:
assertion `left == right` failed
  left: "current_tick"
 right: "1 ticks old"

failures:
    projections::tests::notebook_for_tomas_shows_missing_belief_without_culprit_leak

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
