*** crates/tracewake-core/src/projections.rs:823:53: replace == with != in phase3a_salient_interruption

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace == with != in phase3a_salient_interruption
@@ -815,17 +815,17 @@
 
 fn phase3a_salient_interruption(
     agent_state: &AgentState,
     viewer_actor_id: &ActorId,
 ) -> Option<String> {
     agent_state
         .ordinary_life_episodes()
         .values()
-        .filter(|episode| episode.actor_id.as_ref() == Some(viewer_actor_id))
+        .filter(|episode| episode.actor_id.as_ref() != /* ~ changed by cargo-mutants ~ */ Some(viewer_actor_id))
         .filter(|episode| {
             matches!(
                 episode.event_kind.as_str(),
                 "sleep_interrupted" | "work_block_failed"
             )
         })
         .max_by(|left, right| {
             left.sim_tick

---- projections::tests::view_models_embodied_phase3a_salient_interruption_is_viewer_scoped stdout ----

thread 'projections::tests::view_models_embodied_phase3a_salient_interruption_is_viewer_scoped' (5880) panicked at crates/tracewake-core/src/projections.rs:2849:9:
assertion `left == right` failed
  left: "sleep_interrupted at tick 9: Mara woke because of door noise"
 right: "sleep_interrupted at tick 8: Sleep interrupted by hunger"

failures:
    projections::tests::view_models_embodied_phase3a_salient_interruption_is_viewer_scoped

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
