*** crates/tracewake-core/src/projections.rs:892:5: replace phase3a_semantic_actions -> Vec<SemanticActionEntry> with vec![]

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace phase3a_semantic_actions -> Vec<SemanticActionEntry> with vec![]
@@ -884,110 +884,17 @@
 }
 
 fn phase3a_semantic_actions(
     agent_state: Option<&AgentState>,
     source: &EmbodiedProjectionSource<'_>,
     current_place_id: &PlaceId,
     viewer_actor_id: &ActorId,
 ) -> Vec<SemanticActionEntry> {
-    let mut actions = Vec::new();
-    if let Some(sleep_affordance_id) = visible_open_sleep_affordance(source) {
-        actions.push(SemanticActionEntry::with_availability(
-            SemanticActionId::new("sleep.here").unwrap(),
-            ActionId::new("sleep").unwrap(),
-            vec![sleep_affordance_id.to_string()],
-            "Sleep here",
-            ActionAvailability::available(),
-        ));
-    }
-
-    for food_source in &source.actor_known_food_sources {
-        let availability = match food_source.believed_servings {
-            Some(0) => ActionAvailability::disabled(
-                vec![ReasonCode::KnowledgePreconditionNotMet],
-                "You know that food source is empty.",
-                vec![ActionAvailabilityProvenance::new(
-                    ActionAvailabilityProvenanceKind::HolderKnownContext,
-                    source.knowledge_context_id.as_str(),
-                )],
-                Vec::new(),
-            ),
-            _ => ActionAvailability::available(),
-        };
-        actions.push(SemanticActionEntry::with_availability(
-            SemanticActionId::new(format!("eat.food.{}", food_source.food_supply_id.as_str()))
-                .unwrap(),
-            ActionId::new("eat").unwrap(),
-            vec![food_source.food_supply_id.to_string()],
-            format!("Eat {}", food_source.food_supply_id.as_str()),
-            availability,
-        ));
-    }
-
-    for workplace in &source.actor_known_workplaces {
-        let at_workplace = workplace.place_id == *current_place_id;
-        let provenance_refs = workplace_availability_provenance_refs(
-            &source.knowledge_context_id,
-            &workplace.source_event_ids,
-        );
-        let availability = if !at_workplace {
-            ActionAvailability::disabled(
-                vec![ReasonCode::ActorNotAtRequiredPlace],
-                "You are not at that workplace.",
-                provenance_refs,
-                Vec::new(),
-            )
-        } else if !workplace.believed_access_open {
-            ActionAvailability::disabled(
-                vec![ReasonCode::KnowledgePreconditionNotMet],
-                "You know that workplace access is closed.",
-                provenance_refs,
-                Vec::new(),
-            )
-        } else {
-            ActionAvailability::available()
-        };
-        actions.push(SemanticActionEntry::with_availability(
-            SemanticActionId::new(format!("work.block.{}", workplace.workplace_id.as_str()))
-                .unwrap(),
-            ActionId::new("work_block").unwrap(),
-            vec![workplace.workplace_id.to_string()],
-            format!("Work at {}", workplace.workplace_id.as_str()),
-            availability,
-        ));
-    }
-
-    if let Some((intention_id, intention)) = agent_state.and_then(|agent_state| {
-        agent_state
-            .active_intention_by_actor
-            .get(viewer_actor_id)
-            .and_then(|intention_id| {
-                agent_state
-                    .intentions
-                    .get(intention_id)
-                    .map(|intention| (intention_id, intention))
-            })
-    }) {
-        actions.push(SemanticActionEntry::with_availability(
-            SemanticActionId::new(format!("continue.routine.{}", intention_id.as_str())).unwrap(),
-            ActionId::new("continue_routine").unwrap(),
-            vec![
-                intention_id.to_string(),
-                intention
-                    .current_step
-                    .clone()
-                    .unwrap_or_else(|| "wait".to_string()),
-            ],
-            "Continue routine",
-            ActionAvailability::available(),
-        ));
-    }
-
-    actions
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn workplace_availability_provenance_refs(
     context_id: &HolderKnownContextId,
     source_event_ids: &[EventId],
 ) -> Vec<ActionAvailabilityProvenance> {
     let mut refs = vec![ActionAvailabilityProvenance::new(
         ActionAvailabilityProvenanceKind::HolderKnownContext,

---- projections::tests::phase3a_semantic_actions_include_disabled_empty_food_and_known_sleep stdout ----

thread 'projections::tests::phase3a_semantic_actions_include_disabled_empty_food_and_known_sleep' (10448) panicked at crates/tracewake-core/src/projections.rs:1731:9:
assertion failed: view.semantic_actions.iter().any(|entry|
        entry.semantic_action_id.as_str() == "sleep.here" &&
            entry.target_ids == ["bed_tomas"])

---- projections::tests::phase3a_workplace_semantic_actions_require_place_access_and_provenance stdout ----

thread 'projections::tests::phase3a_workplace_semantic_actions_require_place_access_and_provenance' (10449) panicked at crates/tracewake-core/src/projections.rs:1789:14:
current open workplace action exists

---- projections::tests::view_models_embodied_phase3a_status_is_viewer_scoped_and_actor_known stdout ----

thread 'projections::tests::view_models_embodied_phase3a_status_is_viewer_scoped_and_actor_known' (10455) panicked at crates/tracewake-core/src/projections.rs:2664:9:
assertion failed: view.semantic_actions.iter().any(|entry|
        entry.semantic_action_id.as_str() == "eat.food.food_soup_pot")

failures:
    projections::tests::phase3a_semantic_actions_include_disabled_empty_food_and_known_sleep
    projections::tests::phase3a_workplace_semantic_actions_require_place_access_and_provenance
    projections::tests::view_models_embodied_phase3a_status_is_viewer_scoped_and_actor_known

test result: FAILED. 452 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
