*** crates/tracewake-core/src/projections.rs:905:13: delete match arm Some(0) in phase3a_semantic_actions

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ delete match arm Some(0) in phase3a_semantic_actions
@@ -897,25 +897,17 @@
             vec![sleep_affordance_id.to_string()],
             "Sleep here",
             ActionAvailability::available(),
         ));
     }
 
     for food_source in &source.actor_known_food_sources {
         let availability = match food_source.believed_servings {
-            Some(0) => ActionAvailability::disabled(
-                vec![ReasonCode::KnowledgePreconditionNotMet],
-                "You know that food source is empty.",
-                vec![ActionAvailabilityProvenance::new(
-                    ActionAvailabilityProvenanceKind::HolderKnownContext,
-                    source.knowledge_context_id.as_str(),
-                )],
-                Vec::new(),
-            ),
+             /* ~ changed by cargo-mutants ~ */
             _ => ActionAvailability::available(),
         };
         actions.push(SemanticActionEntry::with_availability(
             SemanticActionId::new(format!("eat.food.{}", food_source.food_supply_id.as_str()))
                 .unwrap(),
             ActionId::new("eat").unwrap(),
             vec![food_source.food_supply_id.to_string()],
             format!("Eat {}", food_source.food_supply_id.as_str()),

---- projections::tests::phase3a_semantic_actions_include_disabled_empty_food_and_known_sleep stdout ----

thread 'projections::tests::phase3a_semantic_actions_include_disabled_empty_food_and_known_sleep' (15019) panicked at crates/tracewake-core/src/projections.rs:1826:9:
assertion failed: !eat_empty.enabled

failures:
    projections::tests::phase3a_semantic_actions_include_disabled_empty_food_and_known_sleep

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
