*** crates/tracewake-core/src/projections.rs:932:31: delete ! in phase3a_semantic_actions

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ delete ! in phase3a_semantic_actions
@@ -924,17 +924,17 @@
     }
 
     for workplace in &source.actor_known_workplaces {
         let at_workplace = workplace.place_id == *current_place_id;
         let provenance_refs = workplace_availability_provenance_refs(
             &source.knowledge_context_id,
             &workplace.source_event_ids,
         );
-        let availability = if !at_workplace {
+        let availability = if  /* ~ changed by cargo-mutants ~ */at_workplace {
             ActionAvailability::disabled(
                 vec![ReasonCode::ActorNotAtRequiredPlace],
                 "You are not at that workplace.",
                 provenance_refs,
                 Vec::new(),
             )
         } else if !workplace.believed_access_open {
             ActionAvailability::disabled(

---- projections::tests::phase3a_workplace_semantic_actions_require_place_access_and_provenance stdout ----

thread 'projections::tests::phase3a_workplace_semantic_actions_require_place_access_and_provenance' (24138) panicked at crates/tracewake-core/src/projections.rs:1883:9:
assertion failed: here.enabled

failures:
    projections::tests::phase3a_workplace_semantic_actions_require_place_access_and_provenance

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
