*** crates/tracewake-core/src/projections.rs:939:19: delete ! in phase3a_semantic_actions

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ delete ! in phase3a_semantic_actions
@@ -931,17 +931,17 @@
         );
         let availability = if !at_workplace {
             ActionAvailability::disabled(
                 vec![ReasonCode::ActorNotAtRequiredPlace],
                 "You are not at that workplace.",
                 provenance_refs,
                 Vec::new(),
             )
-        } else if !workplace.believed_access_open {
+        } else if  /* ~ changed by cargo-mutants ~ */workplace.believed_access_open {
             ActionAvailability::disabled(
                 vec![ReasonCode::KnowledgePreconditionNotMet],
                 "You know that workplace access is closed.",
                 provenance_refs,
                 Vec::new(),
             )
         } else {
             ActionAvailability::available()

---- projections::tests::phase3a_workplace_semantic_actions_require_place_access_and_provenance stdout ----

thread 'projections::tests::phase3a_workplace_semantic_actions_require_place_access_and_provenance' (28697) panicked at crates/tracewake-core/src/projections.rs:1883:9:
assertion failed: here.enabled

failures:
    projections::tests::phase3a_workplace_semantic_actions_require_place_access_and_provenance

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
