*** crates/tracewake-core/src/projections.rs:992:5: replace workplace_availability_provenance_refs -> Vec<ActionAvailabilityProvenance> with vec![]

*** mutation diff:
--- crates/tracewake-core/src/projections.rs
+++ replace workplace_availability_provenance_refs -> Vec<ActionAvailabilityProvenance> with vec![]
@@ -984,27 +984,17 @@
 
     actions
 }
 
 fn workplace_availability_provenance_refs(
     context_id: &HolderKnownContextId,
     source_event_ids: &[EventId],
 ) -> Vec<ActionAvailabilityProvenance> {
-    let mut refs = vec![ActionAvailabilityProvenance::new(
-        ActionAvailabilityProvenanceKind::HolderKnownContext,
-        context_id.as_str(),
-    )];
-    refs.extend(source_event_ids.iter().map(|event_id| {
-        ActionAvailabilityProvenance::new(
-            ActionAvailabilityProvenanceKind::SourceEvent,
-            event_id.as_str(),
-        )
-    }));
-    refs
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn build_debug_event_log_view(log: &EventLog) -> DebugEventLogView {
     DebugEventLogView::new(log.events().iter().map(DebugEventSummary::from).collect())
 }
 
 fn visible_item_source(location: &Location) -> VisibleItemSource {
     match location {

---- projections::tests::phase3a_workplace_semantic_actions_require_place_access_and_provenance stdout ----

thread 'projections::tests::phase3a_workplace_semantic_actions_require_place_access_and_provenance' (788) panicked at crates/tracewake-core/src/projections.rs:1891:9:
assertion `left == right` failed
  left: []
 right: [(HolderKnownContext, "hkc.actor_tomas.1.7"), (SourceEvent, "event_role_notice_elsewhere")]

failures:
    projections::tests::phase3a_workplace_semantic_actions_require_place_access_and_provenance

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
