*** crates/tracewake-core/src/replay/rebuild.rs:110:41: replace += with -= in rebuild_projection

*** mutation diff:
--- crates/tracewake-core/src/replay/rebuild.rs
+++ replace += with -= in rebuild_projection
@@ -102,17 +102,17 @@
         let mut application_context = EventApplicationContext {
             physical_state: &mut rebuilt,
             agent_state: &mut rebuilt_agent,
             epistemic_projection: Some(&mut epistemic_projection),
         };
         match apply_event_stream(&mut application_context, event) {
             Ok(_) => match event.stream {
                 EventStream::World => {
-                    event_count_applied += 1;
+                    event_count_applied -= /* ~ changed by cargo-mutants ~ */ 1;
                     last_event_id = Some(event.event_id.clone());
                     last_stream_position = Some(event.stream_position);
                 }
                 EventStream::Epistemic => {
                     epistemic_projection.record_applied_event(event.event_id.clone());
                 }
                 EventStream::Agent => {
                     last_event_id = Some(event.event_id.clone());

---- episode_tamper_output_tag_poisons_replay stdout ----

thread 'episode_tamper_output_tag_poisons_replay' (4714) panicked at crates/tracewake-core/src/replay/rebuild.rs:110:21:
attempt to subtract with overflow

---- severe_safety_with_known_exit_produces_move_and_replays stdout ----

thread 'severe_safety_with_known_exit_produces_move_and_replays' (4746) panicked at crates/tracewake-core/src/replay/rebuild.rs:110:21:
attempt to subtract with overflow

---- serialized_event_log_replays_to_identical_state stdout ----

thread 'serialized_event_log_replays_to_identical_state' (4745) panicked at crates/tracewake-core/src/replay/rebuild.rs:110:21:
attempt to subtract with overflow

failures:
    episode_tamper_output_tag_poisons_replay
    no_human_day_real_run_replays_metrics_and_trace_projection
    no_human_decision_context_hash_gate_fails_when_source_evidence_tampered
    serialized_event_log_replays_to_identical_state
    severe_safety_with_known_exit_produces_move_and_replays

test result: FAILED. 37 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
