*** crates/tracewake-core/src/replay/rebuild.rs:110:41: replace += with *= in rebuild_projection

*** mutation diff:
--- crates/tracewake-core/src/replay/rebuild.rs
+++ replace += with *= in rebuild_projection
@@ -102,17 +102,17 @@
         let mut application_context = EventApplicationContext {
             physical_state: &mut rebuilt,
             agent_state: &mut rebuilt_agent,
             epistemic_projection: Some(&mut epistemic_projection),
         };
         match apply_event_stream(&mut application_context, event) {
             Ok(_) => match event.stream {
                 EventStream::World => {
-                    event_count_applied += 1;
+                    event_count_applied *= /* ~ changed by cargo-mutants ~ */ 1;
                     last_event_id = Some(event.event_id.clone());
                     last_stream_position = Some(event.stream_position);
                 }
                 EventStream::Epistemic => {
                     epistemic_projection.record_applied_event(event.event_id.clone());
                 }
                 EventStream::Agent => {
                     last_event_id = Some(event.event_id.clone());

---- replay::rebuild::tests::rebuild_from_fixture_and_events_equals_live_run stdout ----

thread 'replay::rebuild::tests::rebuild_from_fixture_and_events_equals_live_run' (9235) panicked at crates/tracewake-core/src/replay/rebuild.rs:722:9:
assertion `left == right` failed
  left: 0
 right: 2

---- replay::report::tests::replay_clean_log_matches_expected stdout ----

thread 'replay::report::tests::replay_clean_log_matches_expected' (9242) panicked at crates/tracewake-core/src/replay/report.rs:301:9:
assertion `left == right` failed
  left: 0
 right: 1

---- replay::report::tests::replay_divergence_reports_first_event_and_field_family stdout ----

thread 'replay::report::tests::replay_divergence_reports_first_event_and_field_family' (9245) panicked at crates/tracewake-core/src/replay/report.rs:345:9:
assertion `left == right` failed
  left: Some(ReplayDivergenceDetail { first_divergent_event_id: None, field_family: Actor })
 right: Some(ReplayDivergenceDetail { first_divergent_event_id: Some("event.item_removed_from_container.proposal_take"), field_family: Actor })

failures:
    replay::rebuild::tests::rebuild_from_fixture_and_events_equals_live_run
    replay::report::tests::replay_clean_log_matches_expected
    replay::report::tests::replay_divergence_reports_first_event_and_field_family

test result: FAILED. 452 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
