*** crates/tracewake-core/src/replay/rebuild.rs:179:5: replace verify_event_ordering -> Vec<String> with vec![]

*** mutation diff:
--- crates/tracewake-core/src/replay/rebuild.rs
+++ replace verify_event_ordering -> Vec<String> with vec![]
@@ -171,42 +171,17 @@
         epistemic_application_errors,
         agent_application_errors,
         decision_context_hash_failures,
         state_diff,
     }
 }
 
 fn verify_event_ordering(log: &EventLog) -> Vec<String> {
-    let mut issues = Vec::new();
-    let mut stream_positions = std::collections::BTreeMap::<EventStream, u64>::new();
-    for (index, event) in log.events().iter().enumerate() {
-        let expected_global = index as u64;
-        if event.global_order != expected_global {
-            issues.push(format!(
-                "event_order_mismatch:event_id={} expected_global_order={} actual_global_order={}",
-                event.event_id.as_str(),
-                expected_global,
-                event.global_order
-            ));
-            break;
-        }
-        let expected_stream = stream_positions.entry(event.stream).or_insert(0);
-        if event.stream_position != *expected_stream {
-            issues.push(format!(
-                "event_stream_position_mismatch:event_id={} expected_stream_position={} actual_stream_position={}",
-                event.event_id.as_str(),
-                *expected_stream,
-                event.stream_position
-            ));
-            break;
-        }
-        *expected_stream += 1;
-    }
-    issues
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn rebuild_decision_context_hashes(
     initial_state: &PhysicalState,
     initial_agent_state: &AgentState,
     log: &EventLog,
 ) -> Vec<Phase3AReplayFailure> {
     log.events()

---- replay::rebuild::tests::reordered_in_memory_log_is_detected_before_rebuild stdout ----

thread 'replay::rebuild::tests::reordered_in_memory_log_is_detected_before_rebuild' (13796) panicked at crates/tracewake-core/src/replay/rebuild.rs:716:9:
assertion `left == right` failed
  left: 2
 right: 0

failures:
    replay::rebuild::tests::reordered_in_memory_log_is_detected_before_rebuild

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
