*** crates/tracewake-core/src/replay/rebuild.rs:179:5: replace verify_event_ordering -> Vec<String> with vec![String::new()]

*** mutation diff:
--- crates/tracewake-core/src/replay/rebuild.rs
+++ replace verify_event_ordering -> Vec<String> with vec![String::new()]
@@ -171,42 +171,17 @@
         epistemic_application_errors,
         agent_application_errors,
         decision_context_hash_failures,
         state_diff,
     }
 }
 
 fn verify_event_ordering(log: &EventLog) -> Vec<String> {
-    let mut issues = Vec::new();
-    let mut stream_positions = std::collections::BTreeMap::<EventStream, u64>::new();
-    for (index, event) in log.events().iter().enumerate() {
-        let expected_global = index as u64;
-        if event.global_order != expected_global {
-            issues.push(format!(
-                "event_order_mismatch:event_id={} expected_global_order={} actual_global_order={}",
-                event.event_id.as_str(),
-                expected_global,
-                event.global_order
-            ));
-            break;
-        }
-        let expected_stream = stream_positions.entry(event.stream).or_insert(0);
-        if event.stream_position != *expected_stream {
-            issues.push(format!(
-                "event_stream_position_mismatch:event_id={} expected_stream_position={} actual_stream_position={}",
-                event.event_id.as_str(),
-                *expected_stream,
-                event.stream_position
-            ));
-            break;
-        }
-        *expected_stream += 1;
-    }
-    issues
+    vec![String::new()] /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn rebuild_decision_context_hashes(
     initial_state: &PhysicalState,
     initial_agent_state: &AgentState,
     log: &EventLog,
 ) -> Vec<Phase3AReplayFailure> {
     log.events()

---- partial_food_source_knowledge_seeds_only_authored_actor_edge stdout ----

thread 'partial_food_source_knowledge_seeds_only_authored_actor_edge' (17950) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2039:5:
assertion failed: rebuild.invariant_violations.is_empty()

---- severe_safety_with_known_exit_produces_move_and_replays stdout ----

thread 'severe_safety_with_known_exit_produces_move_and_replays' (17966) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1735:5:

---- serialized_event_log_replays_to_identical_state stdout ----

thread 'serialized_event_log_replays_to_identical_state' (17965) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:453:5:
assertion `left == right` failed
  left: PhysicalChecksum("twc1-9445ea90892ac503")
 right: PhysicalChecksum("twc1-8ed2e066167c51de")

failures:
    no_human_day_real_run_replays_metrics_and_trace_projection
    partial_food_source_knowledge_seeds_only_authored_actor_edge
    serialized_event_log_replays_to_identical_state
    severe_safety_with_known_exit_produces_move_and_replays

test result: FAILED. 38 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.47s

*** result: Failure(101)
