*** crates/tracewake-core/src/replay/rebuild.rs:202:26: replace += with -= in verify_event_ordering

*** mutation diff:
--- crates/tracewake-core/src/replay/rebuild.rs
+++ replace += with -= in verify_event_ordering
@@ -194,17 +194,17 @@
             issues.push(format!(
                 "event_stream_position_mismatch:event_id={} expected_stream_position={} actual_stream_position={}",
                 event.event_id.as_str(),
                 *expected_stream,
                 event.stream_position
             ));
             break;
         }
-        *expected_stream += 1;
+        *expected_stream -= /* ~ changed by cargo-mutants ~ */ 1;
     }
     issues
 }
 
 pub fn rebuild_decision_context_hashes(
     initial_state: &PhysicalState,
     initial_agent_state: &AgentState,
     log: &EventLog,

---- continue_routine_tamper_reason_rewrite_poisons_replay stdout ----

thread 'continue_routine_tamper_reason_rewrite_poisons_replay' (1862) panicked at crates/tracewake-core/src/replay/rebuild.rs:202:9:
attempt to subtract with overflow

---- continue_routine_tamper_kind_flip_poisons_replay stdout ----

thread 'continue_routine_tamper_kind_flip_poisons_replay' (1861) panicked at crates/tracewake-core/src/replay/rebuild.rs:202:9:
attempt to subtract with overflow

---- episode_tamper_output_tag_poisons_replay stdout ----

thread 'episode_tamper_output_tag_poisons_replay' (1863) panicked at crates/tracewake-core/src/replay/rebuild.rs:202:9:
attempt to subtract with overflow

failures:
    continue_routine_tamper_kind_flip_poisons_replay
    continue_routine_tamper_reason_rewrite_poisons_replay
    episode_tamper_output_tag_poisons_replay
    episode_tamper_proration_poisons_replay
    no_human_day_real_run_replays_metrics_and_trace_projection
    no_human_decision_context_hash_gate_fails_when_source_evidence_tampered
    partial_food_source_knowledge_seeds_only_authored_actor_edge
    serialized_event_log_replays_to_identical_state
    severe_safety_with_known_exit_produces_move_and_replays

test result: FAILED. 33 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
