*** crates/tracewake-core/src/replay/rebuild.rs:202:26: replace += with *= in verify_event_ordering

*** mutation diff:
--- crates/tracewake-core/src/replay/rebuild.rs
+++ replace += with *= in verify_event_ordering
@@ -194,17 +194,17 @@
             issues.push(format!(
                 "event_stream_position_mismatch:event_id={} expected_stream_position={} actual_stream_position={}",
                 event.event_id.as_str(),
                 *expected_stream,
                 event.stream_position
             ));
             break;
         }
-        *expected_stream += 1;
+        *expected_stream *= /* ~ changed by cargo-mutants ~ */ 1;
     }
     issues
 }
 
 pub fn rebuild_decision_context_hashes(
     initial_state: &PhysicalState,
     initial_agent_state: &AgentState,
     log: &EventLog,

---- partial_food_source_knowledge_seeds_only_authored_actor_edge stdout ----

thread 'partial_food_source_knowledge_seeds_only_authored_actor_edge' (5979) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2039:5:
assertion failed: rebuild.invariant_violations.is_empty()

---- severe_safety_with_known_exit_produces_move_and_replays stdout ----

thread 'severe_safety_with_known_exit_produces_move_and_replays' (5995) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1735:5:

---- serialized_event_log_replays_to_identical_state stdout ----

thread 'serialized_event_log_replays_to_identical_state' (5994) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:453:5:
assertion `left == right` failed
  left: PhysicalChecksum("twc1-9445ea90892ac503")
 right: PhysicalChecksum("twc1-8ed2e066167c51de")

failures:
    no_human_day_real_run_replays_metrics_and_trace_projection
    partial_food_source_knowledge_seeds_only_authored_actor_edge
    serialized_event_log_replays_to_identical_state
    severe_safety_with_known_exit_produces_move_and_replays

test result: FAILED. 38 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.45s

*** result: Failure(101)
