*** crates/tracewake-core/src/replay/rebuild.rs:212:5: replace rebuild_decision_context_hashes -> Vec<Phase3AReplayFailure> with vec![]

*** mutation diff:
--- crates/tracewake-core/src/replay/rebuild.rs
+++ replace rebuild_decision_context_hashes -> Vec<Phase3AReplayFailure> with vec![]
@@ -204,25 +204,17 @@
     issues
 }
 
 pub fn rebuild_decision_context_hashes(
     initial_state: &PhysicalState,
     initial_agent_state: &AgentState,
     log: &EventLog,
 ) -> Vec<Phase3AReplayFailure> {
-    log.events()
-        .iter()
-        .filter(|event| event.event_type == EventKind::DecisionTraceRecorded)
-        .filter_map(|event| {
-            rebuild_decision_context_hash(initial_state, initial_agent_state, log, event)
-                .err()
-                .map(|failure| *failure)
-        })
-        .collect()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 fn rebuild_decision_context_hash(
     initial_state: &PhysicalState,
     initial_agent_state: &AgentState,
     log: &EventLog,
     trace_event: &EventEnvelope,
 ) -> Result<(), Box<Phase3AReplayFailure>> {

---- no_human_decision_context_hash_gate_fails_when_source_evidence_tampered stdout ----

thread 'no_human_decision_context_hash_gate_fails_when_source_evidence_tampered' (10074) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2962:5:
assertion failed: !replay.decision_context_hash_failures.is_empty()

failures:
    no_human_decision_context_hash_gate_fails_when_source_evidence_tampered

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.41s

*** result: Failure(101)
