*** crates/tracewake-core/src/replay/rebuild.rs:214:42: replace == with != in rebuild_decision_context_hashes

*** mutation diff:
--- crates/tracewake-core/src/replay/rebuild.rs
+++ replace == with != in rebuild_decision_context_hashes
@@ -206,17 +206,17 @@
 
 pub fn rebuild_decision_context_hashes(
     initial_state: &PhysicalState,
     initial_agent_state: &AgentState,
     log: &EventLog,
 ) -> Vec<Phase3AReplayFailure> {
     log.events()
         .iter()
-        .filter(|event| event.event_type == EventKind::DecisionTraceRecorded)
+        .filter(|event| event.event_type != /* ~ changed by cargo-mutants ~ */ EventKind::DecisionTraceRecorded)
         .filter_map(|event| {
             rebuild_decision_context_hash(initial_state, initial_agent_state, log, event)
                 .err()
                 .map(|failure| *failure)
         })
         .collect()
 }

---- no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash stdout ----

thread 'no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash' (14184) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2907:5:

---- severe_safety_with_known_exit_produces_move_and_replays stdout ----

thread 'severe_safety_with_known_exit_produces_move_and_replays' (14206) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1735:5:

---- no_human_decision_context_hash_gate_fails_when_source_evidence_tampered stdout ----

thread 'no_human_decision_context_hash_gate_fails_when_source_evidence_tampered' (14185) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2963:5:

failures:
    no_human_day_real_run_replays_metrics_and_trace_projection
    no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash
    no_human_decision_context_hash_gate_fails_when_source_evidence_tampered
    severe_safety_with_known_exit_produces_move_and_replays

test result: FAILED. 38 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.39s

*** result: Failure(101)
