*** crates/tracewake-core/src/replay/rebuild.rs:229:5: replace rebuild_decision_context_hash -> Result<(), Box<Phase3AReplayFailure>> with Ok(())

*** mutation diff:
--- crates/tracewake-core/src/replay/rebuild.rs
+++ replace rebuild_decision_context_hash -> Result<(), Box<Phase3AReplayFailure>> with Ok(())
@@ -221,129 +221,17 @@
 }
 
 fn rebuild_decision_context_hash(
     initial_state: &PhysicalState,
     initial_agent_state: &AgentState,
     log: &EventLog,
     trace_event: &EventEnvelope,
 ) -> Result<(), Box<Phase3AReplayFailure>> {
-    let record = decision_trace_record(trace_event)
-        .map_err(|issue| Box::new(phase3a_failure(trace_event, issue)))?;
-    let window_id = payload_value(trace_event, "window_id")
-        .ok_or_else(|| Box::new(phase3a_failure(trace_event, "missing_window_id")))?;
-    let window_end_tick = payload_value(trace_event, "window_end_tick")
-        .and_then(|value| value.parse::<u64>().ok())
-        .map(SimTick::new)
-        .ok_or_else(|| Box::new(phase3a_failure(trace_event, "missing_window_end_tick")))?;
-    let ordinary_event_id = payload_value(trace_event, "ordinary_event_id")
-        .and_then(|value| EventId::new(value).ok())
-        .or_else(|| {
-            trace_event.causes.iter().find_map(|cause| match cause {
-                crate::events::EventCause::Event(event_id) => Some(event_id.clone()),
-                _ => None,
-            })
-        })
-        .ok_or_else(|| Box::new(phase3a_failure(trace_event, "missing_ordinary_event_id")))?;
-    let ordinary_index = log
-        .events()
-        .iter()
-        .position(|event| event.event_id == ordinary_event_id)
-        .ok_or_else(|| Box::new(phase3a_failure(trace_event, "ordinary_event_not_found")))?;
-    let trace_index = log
-        .events()
-        .iter()
-        .position(|event| event.event_id == trace_event.event_id)
-        .ok_or_else(|| {
-            Box::new(phase3a_failure(
-                trace_event,
-                "decision_trace_event_not_found",
-            ))
-        })?;
-    if ordinary_index >= trace_index {
-        return Err(Box::new(phase3a_failure(
-            trace_event,
-            "ordinary_event_after_trace",
-        )));
-    }
-    let (prefix_log, prefix_state, prefix_agent_state, prefix_epistemic_projection) =
-        replay_prefix(
-            initial_state,
-            initial_agent_state,
-            &log.events()[..ordinary_index],
-        )
-        .map_err(|issue| Box::new(phase3a_failure(trace_event, issue)))?;
-    let actor = prefix_state.actors.get(&record.actor_id).ok_or_else(|| {
-        Box::new(phase3a_failure(
-            trace_event,
-            "actor_missing_at_decision_frontier",
-        ))
-    })?;
-    let surface =
-        NoHumanActorKnownSurfaceBuilder::from_projection(NoHumanActorKnownSurfaceRequest {
-            projection: &prefix_epistemic_projection,
-            agent_state: &prefix_agent_state,
-            actor_id: record.actor_id.clone(),
-            current_place_id: actor.current_place_id.clone(),
-            decision_tick: record.window_start_tick,
-            window_id,
-            window_end_tick,
-            current_place_witness_event_id: latest_current_place_perception_event_id(
-                &prefix_log,
-                &record.actor_id,
-                record.window_start_tick,
-                &actor.current_place_id,
-            ),
-            needs_witness_event_id: latest_need_event_id(&prefix_log, &record.actor_id),
-            frame_event_id: latest_frame_event_id(&prefix_log),
-        })
-        .build(&prefix_agent_state);
-    let rebuilt_inputs = surface
-        .context()
-        .actor_known_facts()
-        .iter()
-        .map(ActorKnownInputRef::from_fact)
-        .map(|input| input.render_for_trace())
-        .collect::<Vec<_>>();
-    let rebuilt_hash = compute_holder_known_context_hash(rebuilt_inputs.clone()).hash;
-    let Some(recorded_hash) = record.actor_known_context_hash.as_ref() else {
-        return Ok(());
-    };
-    if rebuilt_hash != *recorded_hash {
-        let recorded_inputs = record
-            .actor_known_inputs
-            .iter()
-            .collect::<std::collections::BTreeSet<_>>();
-        let rebuilt_input_set = rebuilt_inputs
-            .iter()
-            .collect::<std::collections::BTreeSet<_>>();
-        let missing_rebuilt = recorded_inputs
-            .difference(&rebuilt_input_set)
-            .next()
-            .map(|value| value.as_str())
-            .unwrap_or("-");
-        let extra_rebuilt = rebuilt_input_set
-            .difference(&recorded_inputs)
-            .next()
-            .map(|value| value.as_str())
-            .unwrap_or("-");
-        return Err(Box::new(phase3a_failure(
-            trace_event,
-            format!(
-                "decision_context_hash_mismatch:recorded={} rebuilt={} recorded_count={} rebuilt_count={} missing_rebuilt={} extra_rebuilt={}",
-                recorded_hash.as_str(),
-                rebuilt_hash.as_str(),
-                record.actor_known_inputs.len(),
-                rebuilt_inputs.len(),
-                missing_rebuilt,
-                extra_rebuilt
-            ),
-        )));
-    }
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn decision_trace_record(event: &EventEnvelope) -> Result<DecisionTraceRecord, &'static str> {
     let canonical = payload_value(event, "trace_canonical").ok_or("missing_trace_canonical")?;
     DecisionTraceRecord::deserialize_canonical(canonical.as_bytes())
         .map_err(|_| "invalid_trace_canonical")
 }

---- no_human_decision_context_hash_gate_fails_when_source_evidence_tampered stdout ----

thread 'no_human_decision_context_hash_gate_fails_when_source_evidence_tampered' (18285) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2962:5:
assertion failed: !replay.decision_context_hash_failures.is_empty()

failures:
    no_human_decision_context_hash_gate_fails_when_source_evidence_tampered

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.40s

*** result: Failure(101)
