*** crates/tracewake-core/src/replay/rebuild.rs:241:17: delete match arm crate::events::EventCause::Event(event_id) in rebuild_decision_context_hash

*** mutation diff:
--- crates/tracewake-core/src/replay/rebuild.rs
+++ delete match arm crate::events::EventCause::Event(event_id) in rebuild_decision_context_hash
@@ -233,17 +233,17 @@
     let window_end_tick = payload_value(trace_event, "window_end_tick")
         .and_then(|value| value.parse::<u64>().ok())
         .map(SimTick::new)
         .ok_or_else(|| Box::new(phase3a_failure(trace_event, "missing_window_end_tick")))?;
     let ordinary_event_id = payload_value(trace_event, "ordinary_event_id")
         .and_then(|value| EventId::new(value).ok())
         .or_else(|| {
             trace_event.causes.iter().find_map(|cause| match cause {
-                crate::events::EventCause::Event(event_id) => Some(event_id.clone()),
+                 /* ~ changed by cargo-mutants ~ */
                 _ => None,
             })
         })
         .ok_or_else(|| Box::new(phase3a_failure(trace_event, "missing_ordinary_event_id")))?;
     let ordinary_index = log
         .events()
         .iter()
         .position(|event| event.event_id == ordinary_event_id)

---- deterministic_rebuild_context_hash_uses_causal_and_latest_witnesses stdout ----

thread 'deterministic_rebuild_context_hash_uses_causal_and_latest_witnesses' (22987) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:1554:5:
[Phase3AReplayFailure { event_position: 11, event_kind: DecisionTraceRecorded, schema_version: "event_schema_v1", issue: "missing_ordinary_event_id", actor_id: Some("actor_tomas"), routine_id: None, trace_id: Some("trace_decision_actor_tomas_0_goal_actor_tomas_0_idle_with_reason") }]

failures:
    deterministic_rebuild_context_hash_uses_causal_and_latest_witnesses

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
