*** crates/tracewake-core/src/replay/rebuild.rs:249:42: replace == with != in rebuild_decision_context_hash

*** mutation diff:
--- crates/tracewake-core/src/replay/rebuild.rs
+++ replace == with != in rebuild_decision_context_hash
@@ -241,17 +241,17 @@
                 crate::events::EventCause::Event(event_id) => Some(event_id.clone()),
                 _ => None,
             })
         })
         .ok_or_else(|| Box::new(phase3a_failure(trace_event, "missing_ordinary_event_id")))?;
     let ordinary_index = log
         .events()
         .iter()
-        .position(|event| event.event_id == ordinary_event_id)
+        .position(|event| event.event_id != /* ~ changed by cargo-mutants ~ */ ordinary_event_id)
         .ok_or_else(|| Box::new(phase3a_failure(trace_event, "ordinary_event_not_found")))?;
     let trace_index = log
         .events()
         .iter()
         .position(|event| event.event_id == trace_event.event_id)
         .ok_or_else(|| {
             Box::new(phase3a_failure(
                 trace_event,

---- no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash stdout ----

thread 'no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash' (27085) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2907:5:

---- severe_safety_with_known_exit_produces_move_and_replays stdout ----

thread 'severe_safety_with_known_exit_produces_move_and_replays' (27107) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1735:5:

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (27084) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2726:5:

failures:
    no_human_day_real_run_replays_metrics_and_trace_projection
    no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash
    severe_safety_with_known_exit_produces_move_and_replays

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.41s

*** result: Failure(101)
