*** crates/tracewake-core/src/replay/rebuild.rs:261:23: replace >= with < in rebuild_decision_context_hash

*** mutation diff:
--- crates/tracewake-core/src/replay/rebuild.rs
+++ replace >= with < in rebuild_decision_context_hash
@@ -253,17 +253,17 @@
         .iter()
         .position(|event| event.event_id == trace_event.event_id)
         .ok_or_else(|| {
             Box::new(phase3a_failure(
                 trace_event,
                 "decision_trace_event_not_found",
             ))
         })?;
-    if ordinary_index >= trace_index {
+    if ordinary_index < /* ~ changed by cargo-mutants ~ */ trace_index {
         return Err(Box::new(phase3a_failure(
             trace_event,
             "ordinary_event_after_trace",
         )));
     }
     let (prefix_log, prefix_state, prefix_agent_state, prefix_epistemic_projection) =
         replay_prefix(
             initial_state,

---- no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash stdout ----

thread 'no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash' (2815) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2907:5:
[Phase3AReplayFailure { event_position: 11, event_kind: DecisionTraceRecorded, schema_version: "event_schema_v1", issue: "ordinary_event_after_trace", actor_id: Some("actor_bruno"), routine_id: None, trace_id: Some("trace_decision_actor_bruno_0_goal_actor_bruno_0_eat") }]

---- severe_safety_with_known_exit_produces_move_and_replays stdout ----

thread 'severe_safety_with_known_exit_produces_move_and_replays' (2837) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1735:5:

---- no_human_decision_context_hash_gate_fails_when_source_evidence_tampered stdout ----

thread 'no_human_decision_context_hash_gate_fails_when_source_evidence_tampered' (2816) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2963:5:

failures:
    no_human_day_real_run_replays_metrics_and_trace_projection
    no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash
    no_human_decision_context_hash_gate_fails_when_source_evidence_tampered
    severe_safety_with_known_exit_produces_move_and_replays

test result: FAILED. 38 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.41s

*** result: Failure(101)
