*** crates/tracewake-core/src/replay/rebuild.rs:310:21: replace != with == in rebuild_decision_context_hash

*** mutation diff:
--- crates/tracewake-core/src/replay/rebuild.rs
+++ replace != with == in rebuild_decision_context_hash
@@ -302,17 +302,17 @@
         .iter()
         .map(ActorKnownInputRef::from_fact)
         .map(|input| input.render_for_trace())
         .collect::<Vec<_>>();
     let rebuilt_hash = compute_holder_known_context_hash(rebuilt_inputs.clone()).hash;
     let Some(recorded_hash) = record.actor_known_context_hash.as_ref() else {
         return Ok(());
     };
-    if rebuilt_hash != *recorded_hash {
+    if rebuilt_hash == /* ~ changed by cargo-mutants ~ */ *recorded_hash {
         let recorded_inputs = record
             .actor_known_inputs
             .iter()
             .collect::<std::collections::BTreeSet<_>>();
         let rebuilt_input_set = rebuilt_inputs
             .iter()
             .collect::<std::collections::BTreeSet<_>>();
         let missing_rebuilt = recorded_inputs

---- no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash stdout ----

thread 'no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash' (6915) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2907:5:

---- severe_safety_with_known_exit_produces_move_and_replays stdout ----

thread 'severe_safety_with_known_exit_produces_move_and_replays' (6937) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1735:5:

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (6914) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2726:5:

failures:
    no_human_day_real_run_replays_metrics_and_trace_projection
    no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash
    severe_safety_with_known_exit_produces_move_and_replays

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.58s

*** result: Failure(101)
