*** crates/tracewake-core/src/replay/rebuild.rs:398:5: replace latest_current_place_perception_event_id -> Option<EventId> with None

*** mutation diff:
--- crates/tracewake-core/src/replay/rebuild.rs
+++ replace latest_current_place_perception_event_id -> Option<EventId> with None
@@ -390,26 +390,17 @@
 }
 
 fn latest_current_place_perception_event_id(
     log: &EventLog,
     actor_id: &ActorId,
     tick: SimTick,
     place_id: &PlaceId,
 ) -> Option<EventId> {
-    log.events()
-        .iter()
-        .rev()
-        .find(|event| {
-            event.event_type == EventKind::ObservationRecorded
-                && event.actor_id.as_ref() == Some(actor_id)
-                && event.sim_tick == tick
-                && event.place_id.as_ref() == Some(place_id)
-        })
-        .map(|event| event.event_id.clone())
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn latest_need_event_id(log: &EventLog, actor_id: &ActorId) -> Option<EventId> {
     log.events()
         .iter()
         .rev()
         .find(|event| {
             event.event_type == EventKind::NeedDeltaApplied

---- no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash stdout ----

thread 'no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash' (15149) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2907:5:

---- severe_safety_with_known_exit_produces_move_and_replays stdout ----

thread 'severe_safety_with_known_exit_produces_move_and_replays' (15171) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1735:5:

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (15148) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2726:5:

failures:
    no_human_day_real_run_replays_metrics_and_trace_projection
    no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash
    severe_safety_with_known_exit_produces_move_and_replays

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.57s

*** result: Failure(101)
