*** crates/tracewake-core/src/replay/rebuild.rs:405:17: replace && with || in latest_current_place_perception_event_id

*** mutation diff:
--- crates/tracewake-core/src/replay/rebuild.rs
+++ replace && with || in latest_current_place_perception_event_id
@@ -397,17 +397,17 @@
 ) -> Option<EventId> {
     log.events()
         .iter()
         .rev()
         .find(|event| {
             event.event_type == EventKind::ObservationRecorded
                 && event.actor_id.as_ref() == Some(actor_id)
                 && event.sim_tick == tick
-                && event.place_id.as_ref() == Some(place_id)
+                || /* ~ changed by cargo-mutants ~ */ event.place_id.as_ref() == Some(place_id)
         })
         .map(|event| event.event_id.clone())
 }
 
 fn latest_need_event_id(log: &EventLog, actor_id: &ActorId) -> Option<EventId> {
     log.events()
         .iter()
         .rev()

---- deterministic_rebuild_context_hash_uses_causal_and_latest_witnesses stdout ----

thread 'deterministic_rebuild_context_hash_uses_causal_and_latest_witnesses' (19864) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:1629:5:

failures:
    deterministic_rebuild_context_hash_uses_causal_and_latest_witnesses

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
