*** crates/tracewake-core/src/replay/rebuild.rs:416:17: replace && with || in latest_need_event_id

*** mutation diff:
--- crates/tracewake-core/src/replay/rebuild.rs
+++ replace && with || in latest_need_event_id
@@ -408,17 +408,17 @@
 }
 
 fn latest_need_event_id(log: &EventLog, actor_id: &ActorId) -> Option<EventId> {
     log.events()
         .iter()
         .rev()
         .find(|event| {
             event.event_type == EventKind::NeedDeltaApplied
-                && (event.actor_id.as_ref() == Some(actor_id)
+                || /* ~ changed by cargo-mutants ~ */ (event.actor_id.as_ref() == Some(actor_id)
                     || payload_value(event, "actor_id") == Some(actor_id.as_str()))
         })
         .map(|event| event.event_id.clone())
 }
 
 fn payload_value<'a>(event: &'a EventEnvelope, key: &str) -> Option<&'a str> {
     event
         .payload

---- no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash stdout ----

thread 'no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash' (21406) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2907:5:

---- severe_safety_with_known_exit_produces_move_and_replays stdout ----

thread 'severe_safety_with_known_exit_produces_move_and_replays' (21428) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1735:5:

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (21405) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2726:5:

failures:
    no_human_day_real_run_replays_metrics_and_trace_projection
    no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash
    severe_safety_with_known_exit_produces_move_and_replays

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.56s

*** result: Failure(101)
