*** crates/tracewake-core/src/replay/rebuild.rs:458:5: replace diff_physical_state -> Vec<String> with vec!["xyzzy".into()]

*** mutation diff:
--- crates/tracewake-core/src/replay/rebuild.rs
+++ replace diff_physical_state -> Vec<String> with vec!["xyzzy".into()]
@@ -450,73 +450,17 @@
         trace_id: payload
             .get("trace_id")
             .or_else(|| payload.get("decision_trace_id"))
             .map(|value| (*value).to_string()),
     }
 }
 
 pub fn diff_physical_state(expected: &PhysicalState, actual: &PhysicalState) -> Vec<String> {
-    let mut diffs = Vec::new();
-    if expected.actors != actual.actors {
-        diffs.push(format!(
-            "actors expected={:?} actual={:?}",
-            expected.actors, actual.actors
-        ));
-    }
-    if expected.places != actual.places {
-        diffs.push(format!(
-            "places expected={:?} actual={:?}",
-            expected.places, actual.places
-        ));
-    }
-    if expected.doors != actual.doors {
-        diffs.push(format!(
-            "doors expected={:?} actual={:?}",
-            expected.doors, actual.doors
-        ));
-    }
-    if expected.containers != actual.containers {
-        diffs.push(format!(
-            "containers expected={:?} actual={:?}",
-            expected.containers, actual.containers
-        ));
-    }
-    if expected.items != actual.items {
-        diffs.push(format!(
-            "items expected={:?} actual={:?}",
-            expected.items, actual.items
-        ));
-    }
-    if expected.food_supplies != actual.food_supplies {
-        diffs.push(format!(
-            "food_supplies expected={:?} actual={:?}",
-            expected.food_supplies, actual.food_supplies
-        ));
-    }
-    if expected.workplaces != actual.workplaces {
-        diffs.push(format!(
-            "workplaces expected={:?} actual={:?}",
-            expected.workplaces, actual.workplaces
-        ));
-    }
-    if expected.sleep_affordances != actual.sleep_affordances {
-        diffs.push(format!(
-            "sleep_affordances expected={:?} actual={:?}",
-            expected.sleep_affordances, actual.sleep_affordances
-        ));
-    }
-    if expected.need_model != actual.need_model {
-        diffs.push(format!(
-            "need_model expected={:?} actual={:?}",
-            expected.need_model, actual.need_model
-        ));
-    }
-    diffs.sort();
-    diffs
+    vec!["xyzzy".into()] /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::actions::pipeline::{run_pipeline, PipelineContext};
     use crate::actions::proposal::{Proposal, ProposalOrigin};
     use crate::actions::registry::ActionRegistry;

---- severe_safety_with_known_exit_produces_move_and_replays stdout ----

thread 'severe_safety_with_known_exit_produces_move_and_replays' (2215) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1735:5:

failures:
    severe_safety_with_known_exit_produces_move_and_replays

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.59s

*** result: Failure(101)
