*** crates/tracewake-core/src/replay/rebuild.rs:459:24: replace != with == in diff_physical_state

*** mutation diff:
--- crates/tracewake-core/src/replay/rebuild.rs
+++ replace != with == in diff_physical_state
@@ -451,17 +451,17 @@
             .get("trace_id")
             .or_else(|| payload.get("decision_trace_id"))
             .map(|value| (*value).to_string()),
     }
 }
 
 pub fn diff_physical_state(expected: &PhysicalState, actual: &PhysicalState) -> Vec<String> {
     let mut diffs = Vec::new();
-    if expected.actors != actual.actors {
+    if expected.actors == /* ~ changed by cargo-mutants ~ */ actual.actors {
         diffs.push(format!(
             "actors expected={:?} actual={:?}",
             expected.actors, actual.actors
         ));
     }
     if expected.places != actual.places {
         diffs.push(format!(
             "places expected={:?} actual={:?}",

---- severe_safety_with_known_exit_produces_move_and_replays stdout ----

thread 'severe_safety_with_known_exit_produces_move_and_replays' (6315) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1735:5:

failures:
    severe_safety_with_known_exit_produces_move_and_replays

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.62s

*** result: Failure(101)
