*** crates/tracewake-core/src/replay/rebuild.rs:471:23: replace != with == in diff_physical_state

*** mutation diff:
--- crates/tracewake-core/src/replay/rebuild.rs
+++ replace != with == in diff_physical_state
@@ -463,17 +463,17 @@
         ));
     }
     if expected.places != actual.places {
         diffs.push(format!(
             "places expected={:?} actual={:?}",
             expected.places, actual.places
         ));
     }
-    if expected.doors != actual.doors {
+    if expected.doors == /* ~ changed by cargo-mutants ~ */ actual.doors {
         diffs.push(format!(
             "doors expected={:?} actual={:?}",
             expected.doors, actual.doors
         ));
     }
     if expected.containers != actual.containers {
         diffs.push(format!(
             "containers expected={:?} actual={:?}",

---- severe_safety_with_known_exit_produces_move_and_replays stdout ----

thread 'severe_safety_with_known_exit_produces_move_and_replays' (14513) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1735:5:

failures:
    severe_safety_with_known_exit_produces_move_and_replays

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.57s

*** result: Failure(101)
