*** crates/tracewake-core/src/replay/rebuild.rs:477:28: replace != with == in diff_physical_state

*** mutation diff:
--- crates/tracewake-core/src/replay/rebuild.rs
+++ replace != with == in diff_physical_state
@@ -469,17 +469,17 @@
         ));
     }
     if expected.doors != actual.doors {
         diffs.push(format!(
             "doors expected={:?} actual={:?}",
             expected.doors, actual.doors
         ));
     }
-    if expected.containers != actual.containers {
+    if expected.containers == /* ~ changed by cargo-mutants ~ */ actual.containers {
         diffs.push(format!(
             "containers expected={:?} actual={:?}",
             expected.containers, actual.containers
         ));
     }
     if expected.items != actual.items {
         diffs.push(format!(
             "items expected={:?} actual={:?}",

---- severe_safety_with_known_exit_produces_move_and_replays stdout ----

thread 'severe_safety_with_known_exit_produces_move_and_replays' (18612) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1735:5:

failures:
    severe_safety_with_known_exit_produces_move_and_replays

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.59s

*** result: Failure(101)
