*** crates/tracewake-core/src/replay/rebuild.rs:483:23: replace != with == in diff_physical_state

*** mutation diff:
--- crates/tracewake-core/src/replay/rebuild.rs
+++ replace != with == in diff_physical_state
@@ -475,17 +475,17 @@
         ));
     }
     if expected.containers != actual.containers {
         diffs.push(format!(
             "containers expected={:?} actual={:?}",
             expected.containers, actual.containers
         ));
     }
-    if expected.items != actual.items {
+    if expected.items == /* ~ changed by cargo-mutants ~ */ actual.items {
         diffs.push(format!(
             "items expected={:?} actual={:?}",
             expected.items, actual.items
         ));
     }
     if expected.food_supplies != actual.food_supplies {
         diffs.push(format!(
             "food_supplies expected={:?} actual={:?}",

---- severe_safety_with_known_exit_produces_move_and_replays stdout ----

thread 'severe_safety_with_known_exit_produces_move_and_replays' (22711) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1735:5:

failures:
    severe_safety_with_known_exit_produces_move_and_replays

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.58s

*** result: Failure(101)
