*** crates/tracewake-core/src/replay/rebuild.rs:495:28: replace != with == in diff_physical_state

*** mutation diff:
--- crates/tracewake-core/src/replay/rebuild.rs
+++ replace != with == in diff_physical_state
@@ -487,17 +487,17 @@
         ));
     }
     if expected.food_supplies != actual.food_supplies {
         diffs.push(format!(
             "food_supplies expected={:?} actual={:?}",
             expected.food_supplies, actual.food_supplies
         ));
     }
-    if expected.workplaces != actual.workplaces {
+    if expected.workplaces == /* ~ changed by cargo-mutants ~ */ actual.workplaces {
         diffs.push(format!(
             "workplaces expected={:?} actual={:?}",
             expected.workplaces, actual.workplaces
         ));
     }
     if expected.sleep_affordances != actual.sleep_affordances {
         diffs.push(format!(
             "sleep_affordances expected={:?} actual={:?}",

---- severe_safety_with_known_exit_produces_move_and_replays stdout ----

thread 'severe_safety_with_known_exit_produces_move_and_replays' (30909) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1735:5:

failures:
    severe_safety_with_known_exit_produces_move_and_replays

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.60s

*** result: Failure(101)
