*** crates/tracewake-core/src/replay/rebuild.rs:501:35: replace != with == in diff_physical_state

*** mutation diff:
--- crates/tracewake-core/src/replay/rebuild.rs
+++ replace != with == in diff_physical_state
@@ -493,17 +493,17 @@
         ));
     }
     if expected.workplaces != actual.workplaces {
         diffs.push(format!(
             "workplaces expected={:?} actual={:?}",
             expected.workplaces, actual.workplaces
         ));
     }
-    if expected.sleep_affordances != actual.sleep_affordances {
+    if expected.sleep_affordances == /* ~ changed by cargo-mutants ~ */ actual.sleep_affordances {
         diffs.push(format!(
             "sleep_affordances expected={:?} actual={:?}",
             expected.sleep_affordances, actual.sleep_affordances
         ));
     }
     if expected.need_model != actual.need_model {
         diffs.push(format!(
             "need_model expected={:?} actual={:?}",

---- severe_safety_with_known_exit_produces_move_and_replays stdout ----

thread 'severe_safety_with_known_exit_produces_move_and_replays' (2540) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1735:5:

failures:
    severe_safety_with_known_exit_produces_move_and_replays

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.61s

*** result: Failure(101)
