*** crates/tracewake-core/src/replay/rebuild.rs:507:28: replace != with == in diff_physical_state

*** mutation diff:
--- crates/tracewake-core/src/replay/rebuild.rs
+++ replace != with == in diff_physical_state
@@ -499,17 +499,17 @@
         ));
     }
     if expected.sleep_affordances != actual.sleep_affordances {
         diffs.push(format!(
             "sleep_affordances expected={:?} actual={:?}",
             expected.sleep_affordances, actual.sleep_affordances
         ));
     }
-    if expected.need_model != actual.need_model {
+    if expected.need_model == /* ~ changed by cargo-mutants ~ */ actual.need_model {
         diffs.push(format!(
             "need_model expected={:?} actual={:?}",
             expected.need_model, actual.need_model
         ));
     }
     diffs.sort();
     diffs
 }

---- severe_safety_with_known_exit_produces_move_and_replays stdout ----

thread 'severe_safety_with_known_exit_produces_move_and_replays' (6640) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1735:5:

failures:
    severe_safety_with_known_exit_produces_move_and_replays

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.58s

*** result: Failure(101)
