*** crates/tracewake-core/src/replay/rebuild.rs:83:12: delete ! in rebuild_projection

*** mutation diff:
--- crates/tracewake-core/src/replay/rebuild.rs
+++ delete ! in rebuild_projection
@@ -75,17 +75,17 @@
     for issue in crate::need_accounting::duplicate_duration_terminal_violations(log) {
         invariant_violations.push(issue);
     }
 
     for event in log.events() {
         if !invariant_violations.is_empty() {
             break;
         }
-        if !event.has_supported_schema_version() {
+        if  /* ~ changed by cargo-mutants ~ */event.has_supported_schema_version() {
             let message = format!(
                 "event_position={} event_id={} version={}",
                 event.global_order,
                 event.event_id.as_str(),
                 event.event_schema_version.as_str()
             );
             match event.stream {
                 EventStream::Epistemic => unsupported_epistemic_versions.push(message),

---- partial_food_source_knowledge_seeds_only_authored_actor_edge stdout ----

thread 'partial_food_source_knowledge_seeds_only_authored_actor_edge' (631) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2073:5:
assertion failed: mara_known.known_food_sources().contains("food_shared_pantry")

---- severe_safety_with_known_exit_produces_move_and_replays stdout ----

thread 'severe_safety_with_known_exit_produces_move_and_replays' (647) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1735:5:

---- serialized_event_log_replays_to_identical_state stdout ----

thread 'serialized_event_log_replays_to_identical_state' (646) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:453:5:
assertion `left == right` failed
  left: PhysicalChecksum("twc1-9445ea90892ac503")
 right: PhysicalChecksum("twc1-8ed2e066167c51de")

failures:
    no_human_day_real_run_replays_metrics_and_trace_projection
    partial_food_source_knowledge_seeds_only_authored_actor_edge
    serialized_event_log_replays_to_identical_state
    severe_safety_with_known_exit_produces_move_and_replays

test result: FAILED. 38 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.46s

*** result: Failure(101)
