*** crates/tracewake-core/src/replay/report.rs:100:9: replace && with || in run_replay

*** mutation diff:
--- crates/tracewake-core/src/replay/report.rs
+++ replace && with || in run_replay
@@ -92,17 +92,17 @@
         .unwrap_or(true);
     let agent_checksum_matches = expected_agent_checksum
         .as_ref()
         .map(|expected| expected == &rebuild.final_agent_checksum)
         .unwrap_or(true);
     let matches_expected = checksum_matches
         && agent_checksum_matches
         && state_diff.is_empty()
-        && rebuild.unsupported_versions.is_empty()
+        || /* ~ changed by cargo-mutants ~ */ rebuild.unsupported_versions.is_empty()
         && rebuild.unsupported_epistemic_versions.is_empty()
         && rebuild.unsupported_agent_versions.is_empty()
         && rebuild.invariant_violations.is_empty()
         && rebuild.epistemic_application_errors.is_empty()
         && rebuild.agent_application_errors.is_empty()
         && rebuild.decision_context_hash_failures.is_empty();
     let epistemic_projection_version = rebuild
         .final_epistemic_projection

---- continue_routine_tamper_reason_rewrite_poisons_replay stdout ----

thread 'continue_routine_tamper_reason_rewrite_poisons_replay' (15745) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2802:5:
assertion failed: !replay.matches_expected

---- continue_routine_tamper_kind_flip_poisons_replay stdout ----

thread 'continue_routine_tamper_kind_flip_poisons_replay' (15744) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2780:5:
assertion failed: !replay.matches_expected

---- episode_tamper_output_tag_poisons_replay stdout ----

thread 'episode_tamper_output_tag_poisons_replay' (15746) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2829:5:
assertion failed: !replay.matches_expected

failures:
    continue_routine_tamper_kind_flip_poisons_replay
    continue_routine_tamper_reason_rewrite_poisons_replay
    episode_tamper_output_tag_poisons_replay
    episode_tamper_proration_poisons_replay
    no_human_day_real_run_replays_metrics_and_trace_projection

test result: FAILED. 37 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.59s

*** result: Failure(101)
