*** crates/tracewake-core/src/replay/report.rs:149:5: replace first_divergence_detail -> Option<ReplayDivergenceDetail> with None

*** mutation diff:
--- crates/tracewake-core/src/replay/report.rs
+++ replace first_divergence_detail -> Option<ReplayDivergenceDetail> with None
@@ -141,25 +141,17 @@
     }
 }
 
 fn first_divergence_detail(
     state_diff: &[String],
     log: &EventLog,
     event_count_applied: usize,
 ) -> Option<ReplayDivergenceDetail> {
-    let first_diff = state_diff.first()?;
-    let first_divergent_event_id = event_count_applied
-        .checked_sub(1)
-        .and_then(|index| log.events().get(index))
-        .map(|event| event.event_id.as_str().to_string());
-    Some(ReplayDivergenceDetail {
-        first_divergent_event_id,
-        field_family: classify_state_diff_family(first_diff),
-    })
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn classify_state_diff_family(diff: &str) -> ReplayDivergenceFieldFamily {
     if diff.starts_with("actors ") {
         ReplayDivergenceFieldFamily::Actor
     } else if diff.starts_with("places ") {
         ReplayDivergenceFieldFamily::Place
     } else if diff.starts_with("doors ") {

---- replay::report::tests::replay_divergence_classifies_need_model_family stdout ----

thread 'replay::report::tests::replay_divergence_classifies_need_model_family' (28474) panicked at crates/tracewake-core/src/replay/report.rs:394:9:
assertion `left == right` failed
  left: None
 right: Some(NeedModel)

---- replay::report::tests::replay_divergence_classifies_sleep_affordance_family stdout ----

thread 'replay::report::tests::replay_divergence_classifies_sleep_affordance_family' (28475) panicked at crates/tracewake-core/src/replay/report.rs:372:9:
assertion `left == right` failed
  left: None
 right: Some(SleepAffordance)

---- replay::report::tests::replay_divergence_reports_first_event_and_field_family stdout ----

thread 'replay::report::tests::replay_divergence_reports_first_event_and_field_family' (28476) panicked at crates/tracewake-core/src/replay/report.rs:337:9:
assertion `left == right` failed
  left: None
 right: Some(ReplayDivergenceDetail { first_divergent_event_id: Some("event.item_removed_from_container.proposal_take"), field_family: Actor })

failures:
    replay::report::tests::replay_divergence_classifies_need_model_family
    replay::report::tests::replay_divergence_classifies_sleep_affordance_family
    replay::report::tests::replay_divergence_reports_first_event_and_field_family

test result: FAILED. 452 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
