*** crates/tracewake-core/src/replay/report.rs:78:38: replace != with == in run_replay

*** mutation diff:
--- crates/tracewake-core/src/replay/report.rs
+++ replace != with == in run_replay
@@ -70,17 +70,17 @@
         initial_agent_state,
         log,
         context,
         expected_final_state,
     );
     let diagnostic_event_count = log
         .events()
         .iter()
-        .filter(|event| event.stream != EventStream::World)
+        .filter(|event| event.stream == /* ~ changed by cargo-mutants ~ */ EventStream::World)
         .count();
     let expected_state_diff = expected_final_state
         .map(|expected| diff_physical_state(expected, &rebuild.final_state))
         .unwrap_or_default();
     let state_diff = if expected_state_diff.is_empty() {
         rebuild.state_diff.clone()
     } else {
         expected_state_diff

---- replay_report_match_mismatch_pair_exposes_semantic_fingerprints stdout ----

thread 'replay_report_match_mismatch_pair_exposes_semantic_fingerprints' (11352) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:1143:5:
assertion `left == right` failed
  left: 1
 right: 12

failures:
    replay_report_match_mismatch_pair_exposes_semantic_fingerprints

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
