*** crates/tracewake-core/src/replay/report.rs:91:34: replace == with != in run_replay

*** mutation diff:
--- crates/tracewake-core/src/replay/report.rs
+++ replace == with != in run_replay
@@ -83,17 +83,17 @@
     let state_diff = if expected_state_diff.is_empty() {
         rebuild.state_diff.clone()
     } else {
         expected_state_diff
     };
     let first_divergence = first_divergence_detail(&state_diff, log, rebuild.event_count_applied);
     let checksum_matches = expected_checksum
         .as_ref()
-        .map(|expected| expected == &rebuild.final_checksum)
+        .map(|expected| expected != /* ~ changed by cargo-mutants ~ */ &rebuild.final_checksum)
         .unwrap_or(true);
     let agent_checksum_matches = expected_agent_checksum
         .as_ref()
         .map(|expected| expected == &rebuild.final_agent_checksum)
         .unwrap_or(true);
     let matches_expected = checksum_matches
         && agent_checksum_matches
         && state_diff.is_empty()

---- severe_safety_with_known_exit_produces_move_and_replays stdout ----

thread 'severe_safety_with_known_exit_produces_move_and_replays' (15453) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1735:5:

failures:
    severe_safety_with_known_exit_produces_move_and_replays

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.60s

*** result: Failure(101)
