*** crates/tracewake-core/src/replay/report.rs:95:34: replace == with != in run_replay

*** mutation diff:
--- crates/tracewake-core/src/replay/report.rs
+++ replace == with != in run_replay
@@ -87,17 +87,17 @@
     };
     let first_divergence = first_divergence_detail(&state_diff, log, rebuild.event_count_applied);
     let checksum_matches = expected_checksum
         .as_ref()
         .map(|expected| expected == &rebuild.final_checksum)
         .unwrap_or(true);
     let agent_checksum_matches = expected_agent_checksum
         .as_ref()
-        .map(|expected| expected == &rebuild.final_agent_checksum)
+        .map(|expected| expected != /* ~ changed by cargo-mutants ~ */ &rebuild.final_agent_checksum)
         .unwrap_or(true);
     let matches_expected = checksum_matches
         && agent_checksum_matches
         && state_diff.is_empty()
         && rebuild.unsupported_versions.is_empty()
         && rebuild.unsupported_epistemic_versions.is_empty()
         && rebuild.unsupported_agent_versions.is_empty()
         && rebuild.invariant_violations.is_empty()

---- continue_routine_tamper_reason_rewrite_poisons_replay stdout ----

thread 'continue_routine_tamper_reason_rewrite_poisons_replay' (19519) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2802:5:
assertion failed: !replay.matches_expected

---- continue_routine_tamper_kind_flip_poisons_replay stdout ----

thread 'continue_routine_tamper_kind_flip_poisons_replay' (19518) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2780:5:
assertion failed: !replay.matches_expected

---- episode_tamper_output_tag_poisons_replay stdout ----

thread 'episode_tamper_output_tag_poisons_replay' (19520) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2829:5:
assertion failed: !replay.matches_expected

failures:
    continue_routine_tamper_kind_flip_poisons_replay
    continue_routine_tamper_reason_rewrite_poisons_replay
    episode_tamper_output_tag_poisons_replay
    episode_tamper_proration_poisons_replay
    no_human_day_real_run_replays_metrics_and_trace_projection
    severe_safety_with_known_exit_produces_move_and_replays

test result: FAILED. 36 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.59s

*** result: Failure(101)
