*** crates/tracewake-core/src/scheduler.rs:106:5: replace build_passive_need_delta_events -> Vec<EventEnvelope> with vec![]

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace build_passive_need_delta_events -> Vec<EventEnvelope> with vec![]
@@ -98,85 +98,17 @@
 pub fn build_passive_need_delta_events(
     need_model: &NeedModelState,
     actor_ids: impl IntoIterator<Item = ActorId>,
     process_id: &ProcessId,
     start_tick: SimTick,
     elapsed_ticks: u64,
     content_manifest_id: &ContentManifestId,
 ) -> Vec<EventEnvelope> {
-    let deltas = passive_awake_need_deltas(need_model, elapsed_ticks);
-    actor_ids
-        .into_iter()
-        .flat_map(|actor_id| {
-            [
-                (NeedKind::Hunger, deltas.hunger_delta),
-                (NeedKind::Fatigue, deltas.fatigue_delta),
-            ]
-            .into_iter()
-            .flat_map(move |(need_kind, delta)| {
-                build_need_delta_and_threshold_events(
-                    NeedDeltaEventSpec {
-                        event_id: EventId::new(format!(
-                            "event.passive_need_delta.{}.{}.{}.{}",
-                            need_kind.stable_id(),
-                            actor_id.as_str(),
-                            start_tick.value(),
-                            elapsed_ticks
-                        ))
-                        .unwrap(),
-                        threshold_event_id: EventId::new(format!(
-                            "event.passive_need_threshold.{}.{}.{}.{}",
-                            need_kind.stable_id(),
-                            actor_id.as_str(),
-                            start_tick.value(),
-                            elapsed_ticks
-                        ))
-                        .unwrap(),
-                        tick: start_tick.advance_by(elapsed_ticks),
-                        ordering_key: OrderingKey::new(
-                            start_tick.advance_by(elapsed_ticks),
-                            SchedulePhase::NoHumanProcess,
-                            SchedulerSourceId::Process(process_id.clone()),
-                            ProposalSequence::new(0),
-                            ActionId::new("passive_need_delta").unwrap(),
-                            vec![
-                                actor_id.as_str().to_string(),
-                                need_kind.stable_id().to_string(),
-                            ],
-                            format!("{}:{}", actor_id.as_str(), need_kind.stable_id()),
-                        ),
-                        content_manifest_id: content_manifest_id.clone(),
-                        causes: vec![EventCause::Process(process_id.clone())],
-                        actor_id: actor_id.clone(),
-                        proposal_id: None,
-                        process_id: Some(process_id.clone()),
-                        participants: vec![actor_id.to_string()],
-                        need_kind,
-                        delta,
-                        elapsed_ticks,
-                        cause_kind: "tick_delta".to_string(),
-                        cause_action_id: None,
-                        extra_payload: Vec::new(),
-                        delta_effects_summary: format!(
-                            "{} rose by {} over {} elapsed ticks",
-                            need_kind.stable_id(),
-                            delta,
-                            elapsed_ticks
-                        ),
-                        threshold_effects_summary: format!(
-                            "{} crossed threshold during passive ticks",
-                            need_kind.stable_id()
-                        ),
-                    },
-                    None,
-                )
-            })
-        })
-        .collect()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn duration_completion_ordering_key(
     actor_id: &ActorId,
     action_id: &ActionId,
     completion_tick: SimTick,
     sequence: u64,
 ) -> OrderingKey {

---- scheduler::tests::passive_need_delta_emission_is_deterministic_over_advancement stdout ----

thread 'scheduler::tests::passive_need_delta_emission_is_deterministic_over_advancement' (1707) panicked at crates/tracewake-core/src/scheduler.rs:5418:9:
assertion `left == right` failed
  left: 0
 right: 4

failures:
    scheduler::tests::passive_need_delta_emission_is_deterministic_over_advancement

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
