*** crates/tracewake-core/src/scheduler.rs:1100:9: replace no_human::credit_completion with ()

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace no_human::credit_completion with ()
@@ -1092,22 +1092,17 @@
     }
 
     fn credit_completion(
         progress_by_window_actor: &mut BTreeMap<(String, ActorId), usize>,
         windows: &[DayWindow],
         completed_actor_id: &ActorId,
         completion_tick: SimTick,
     ) {
-        for window in windows {
-            if window.contains_tick(completion_tick) {
-                progress_by_window_actor
-                    .insert((window.window_id.clone(), completed_actor_id.clone()), 1);
-            }
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn append_routine_step_completed_after_duration_completion(
         log: &mut EventLog,
         agent_state: &mut AgentState,
         process_id: &ProcessId,
         content_manifest_id: &ContentManifestId,
         completion_event: &EventEnvelope,

---- scheduler::no_human::tests::completion_credit_uses_completion_tick_for_late_processed_duration stdout ----

thread 'scheduler::no_human::tests::completion_credit_uses_completion_tick_for_late_processed_duration' (14567) panicked at crates/tracewake-core/src/scheduler.rs:4079:13:
assertion failed: progress_by_window_actor.contains_key(&("middle".to_string(),
            actor_id.clone()))

failures:
    scheduler::no_human::tests::completion_credit_uses_completion_tick_for_late_processed_duration

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
