*** crates/tracewake-core/src/scheduler.rs:1115:9: replace no_human::append_routine_step_completed_after_duration_completion with ()

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace no_human::append_routine_step_completed_after_duration_completion with ()
@@ -1107,54 +1107,17 @@
 
     fn append_routine_step_completed_after_duration_completion(
         log: &mut EventLog,
         agent_state: &mut AgentState,
         process_id: &ProcessId,
         content_manifest_id: &ContentManifestId,
         completion_event: &EventEnvelope,
     ) {
-        let (family, ordinary_action_id) = match completion_event.event_type {
-            EventKind::SleepCompleted => (RoutineFamily::SleepNight, "sleep"),
-            EventKind::WorkBlockCompleted => (RoutineFamily::WorkBlock, "work_block"),
-            _ => return,
-        };
-        let Some(actor_id) = completion_event.actor_id.as_ref() else {
-            return;
-        };
-        let Some(execution_id) = agent_state
-            .routine_executions
-            .iter()
-            .filter(|(_, execution)| &execution.actor_id == actor_id)
-            .filter(|(_, execution)| execution.family == family)
-            .filter(|(_, execution)| execution.start_tick <= completion_event.sim_tick)
-            .filter(|(_, execution)| {
-                execution.step_status == crate::agent::RoutineStepStatus::InProgress
-            })
-            .min_by(|(_, left), (_, right)| {
-                left.start_tick
-                    .cmp(&right.start_tick)
-                    .then_with(|| left.execution_id.cmp(&right.execution_id))
-            })
-            .map(|(execution_id, _)| execution_id.clone())
-        else {
-            return;
-        };
-        append_and_apply_agent_event(
-            log,
-            agent_state,
-            build_duration_routine_step_completed_event(
-                process_id,
-                &execution_id,
-                actor_id,
-                ordinary_action_id,
-                content_manifest_id,
-                completion_event,
-            ),
-        );
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn build_duration_routine_step_completed_event(
         process_id: &ProcessId,
         execution_id: &RoutineExecutionId,
         actor_id: &ActorId,
         ordinary_action_id: &str,
         content_manifest_id: &ContentManifestId,

---- scheduler::no_human::tests::duration_completion_appends_exact_matching_routine_step_once stdout ----

thread 'scheduler::no_human::tests::duration_completion_appends_exact_matching_routine_step_once' (19131) panicked at crates/tracewake-core/src/scheduler.rs:2849:17:
assertion `left == right` failed: sleep
  left: 0
 right: 1

failures:
    scheduler::no_human::tests::duration_completion_appends_exact_matching_routine_step_once

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
