*** crates/tracewake-core/src/scheduler.rs:1116:13: delete match arm EventKind::SleepCompleted in no_human::append_routine_step_completed_after_duration_completion

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ delete match arm EventKind::SleepCompleted in no_human::append_routine_step_completed_after_duration_completion
@@ -1108,17 +1108,17 @@
     fn append_routine_step_completed_after_duration_completion(
         log: &mut EventLog,
         agent_state: &mut AgentState,
         process_id: &ProcessId,
         content_manifest_id: &ContentManifestId,
         completion_event: &EventEnvelope,
     ) {
         let (family, ordinary_action_id) = match completion_event.event_type {
-            EventKind::SleepCompleted => (RoutineFamily::SleepNight, "sleep"),
+             /* ~ changed by cargo-mutants ~ */
             EventKind::WorkBlockCompleted => (RoutineFamily::WorkBlock, "work_block"),
             _ => return,
         };
         let Some(actor_id) = completion_event.actor_id.as_ref() else {
             return;
         };
         let Some(execution_id) = agent_state
             .routine_executions

---- scheduler::no_human::tests::duration_completion_appends_exact_matching_routine_step_once stdout ----

thread 'scheduler::no_human::tests::duration_completion_appends_exact_matching_routine_step_once' (23690) panicked at crates/tracewake-core/src/scheduler.rs:2886:17:
assertion `left == right` failed: sleep
  left: 0
 right: 1

failures:
    scheduler::no_human::tests::duration_completion_appends_exact_matching_routine_step_once

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
