*** crates/tracewake-core/src/scheduler.rs:1128:59: replace <= with > in no_human::append_routine_step_completed_after_duration_completion

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace <= with > in no_human::append_routine_step_completed_after_duration_completion
@@ -1120,17 +1120,17 @@
         let Some(actor_id) = completion_event.actor_id.as_ref() else {
             return;
         };
         let Some(execution_id) = agent_state
             .routine_executions
             .iter()
             .filter(|(_, execution)| &execution.actor_id == actor_id)
             .filter(|(_, execution)| execution.family == family)
-            .filter(|(_, execution)| execution.start_tick <= completion_event.sim_tick)
+            .filter(|(_, execution)| execution.start_tick > /* ~ changed by cargo-mutants ~ */ completion_event.sim_tick)
             .filter(|(_, execution)| {
                 execution.step_status == crate::agent::RoutineStepStatus::InProgress
             })
             .min_by(|(_, left), (_, right)| {
                 left.start_tick
                     .cmp(&right.start_tick)
                     .then_with(|| left.execution_id.cmp(&right.execution_id))
             })

---- scheduler::no_human::tests::duration_completion_appends_exact_matching_routine_step_once stdout ----

thread 'scheduler::no_human::tests::duration_completion_appends_exact_matching_routine_step_once' (9459) panicked at crates/tracewake-core/src/scheduler.rs:2897:17:
assertion failed: routine_event.payload.iter().any(|field|
        {
            field.key == "routine_execution_id" &&
                field.value == matching_id.as_str()
        })

failures:
    scheduler::no_human::tests::duration_completion_appends_exact_matching_routine_step_once

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
