*** crates/tracewake-core/src/scheduler.rs:1214:9: replace no_human::scheduled_completion_tick -> Option<SimTick> with None

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace no_human::scheduled_completion_tick -> Option<SimTick> with None
@@ -1206,22 +1206,17 @@
             PayloadField::new("ordinary_action_id", ordinary_action_id),
         ];
         event.effects_summary =
             "duration routine step completed with ordinary completion ancestry".to_string();
         event
     }
 
     fn scheduled_completion_tick(event: &EventEnvelope) -> Option<SimTick> {
-        event
-            .payload
-            .iter()
-            .find(|field| field.key == "expected_completion_tick")
-            .and_then(|field| field.value.parse::<u64>().ok())
-            .map(SimTick::new)
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     fn payload_value<'a>(event: &'a EventEnvelope, key: &str) -> Option<&'a str> {
         event
             .payload
             .iter()
             .find(|field| field.key == key)
             .map(|field| field.value.as_str())

---- episode_tamper_proration_poisons_replay stdout ----

thread 'episode_tamper_proration_poisons_replay' (18148) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2851:5:
assertion failed: has_event(&log, EventKind::SleepInterrupted)

---- sleep_spanning_window_boundary_charges_each_tick_once stdout ----

thread 'sleep_spanning_window_boundary_charges_each_tick_once' (18182) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2529:5:
assertion failed: has_event(&log, EventKind::SleepCompleted)

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (18155) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

failures:
    episode_tamper_proration_poisons_replay
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    sleep_spanning_window_boundary_charges_each_tick_once

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.60s

*** result: Failure(101)
