*** crates/tracewake-core/src/scheduler.rs:1214:9: replace no_human::scheduled_completion_tick -> Option<SimTick> with Some(Default::default())

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace no_human::scheduled_completion_tick -> Option<SimTick> with Some(Default::default())
@@ -1206,22 +1206,17 @@
             PayloadField::new("ordinary_action_id", ordinary_action_id),
         ];
         event.effects_summary =
             "duration routine step completed with ordinary completion ancestry".to_string();
         event
     }
 
     fn scheduled_completion_tick(event: &EventEnvelope) -> Option<SimTick> {
-        event
-            .payload
-            .iter()
-            .find(|field| field.key == "expected_completion_tick")
-            .and_then(|field| field.value.parse::<u64>().ok())
-            .map(SimTick::new)
+        Some(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn payload_value<'a>(event: &'a EventEnvelope, key: &str) -> Option<&'a str> {
         event
             .payload
             .iter()
             .find(|field| field.key == key)
             .map(|field| field.value.as_str())

---- sleep_spanning_window_boundary_charges_each_tick_once stdout ----

thread 'sleep_spanning_window_boundary_charges_each_tick_once' (22281) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:738:17:
action_effect duration charge interval is positive

---- no_human_need_ledger_has_no_duplicate_regime_charges stdout ----

thread 'no_human_need_ledger_has_no_duplicate_regime_charges' (22258) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:738:17:
action_effect duration charge interval is positive

failures:
    no_human_need_ledger_has_no_duplicate_regime_charges
    sleep_spanning_window_boundary_charges_each_tick_once

test result: FAILED. 40 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.64s

*** result: Failure(101)
