*** crates/tracewake-core/src/scheduler.rs:1217:37: replace == with != in no_human::scheduled_completion_tick

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace == with != in no_human::scheduled_completion_tick
@@ -1209,17 +1209,17 @@
             "duration routine step completed with ordinary completion ancestry".to_string();
         event
     }
 
     fn scheduled_completion_tick(event: &EventEnvelope) -> Option<SimTick> {
         event
             .payload
             .iter()
-            .find(|field| field.key == "expected_completion_tick")
+            .find(|field| field.key != /* ~ changed by cargo-mutants ~ */ "expected_completion_tick")
             .and_then(|field| field.value.parse::<u64>().ok())
             .map(SimTick::new)
     }
 
     fn payload_value<'a>(event: &'a EventEnvelope, key: &str) -> Option<&'a str> {
         event
             .payload
             .iter()

---- sleep_spanning_window_boundary_charges_each_tick_once stdout ----

thread 'sleep_spanning_window_boundary_charges_each_tick_once' (26380) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:738:17:
action_effect duration charge interval is positive

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (26353) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

---- no_human_need_ledger_has_no_duplicate_regime_charges stdout ----

thread 'no_human_need_ledger_has_no_duplicate_regime_charges' (26357) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:738:17:
action_effect duration charge interval is positive

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_need_ledger_has_no_duplicate_regime_charges
    sleep_spanning_window_boundary_charges_each_tick_once

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.62s

*** result: Failure(101)
