*** crates/tracewake-core/src/scheduler.rs:1235:9: replace no_human::actor_has_open_body_exclusive_duration -> Result<bool, crate::need_accounting::DuplicateDurationTerminal> with Ok(true)

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace no_human::actor_has_open_body_exclusive_duration -> Result<bool, crate::need_accounting::DuplicateDurationTerminal> with Ok(true)
@@ -1227,28 +1227,17 @@
             .map(|field| field.value.as_str())
     }
 
     fn actor_has_open_body_exclusive_duration(
         log: &EventLog,
         actor_id: &ActorId,
         tick: SimTick,
     ) -> Result<bool, crate::need_accounting::DuplicateDurationTerminal> {
-        Ok(
-            crate::need_accounting::open_body_exclusive_starts(log, actor_id, tick)?
-                .iter()
-                .any(|event_id| {
-                    log.events().iter().any(|event| {
-                        &event.event_id == event_id
-                            && payload_value(event, "body_exclusive") == Some("true")
-                            && scheduled_completion_tick(event)
-                                .is_some_and(|completion| completion > tick)
-                    })
-                }),
-        )
+        Ok(true) /* ~ changed by cargo-mutants ~ */
     }
 
     #[allow(clippy::too_many_arguments)]
     fn append_routine_stuck_diagnostics(
         log: &mut EventLog,
         agent_state: &mut AgentState,
         process_id: &ProcessId,
         actor_id: &ActorId,

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (14339) panicked at crates/tracewake-content/tests/fixtures_load.rs:1217:5:
assertion failed: report.ordinary_pipeline_events > 0

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
