*** crates/tracewake-core/src/scheduler.rs:1235:9: replace no_human::actor_has_open_body_exclusive_duration -> Result<bool, crate::need_accounting::DuplicateDurationTerminal> with Ok(false)

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace no_human::actor_has_open_body_exclusive_duration -> Result<bool, crate::need_accounting::DuplicateDurationTerminal> with Ok(false)
@@ -1227,28 +1227,17 @@
             .map(|field| field.value.as_str())
     }
 
     fn actor_has_open_body_exclusive_duration(
         log: &EventLog,
         actor_id: &ActorId,
         tick: SimTick,
     ) -> Result<bool, crate::need_accounting::DuplicateDurationTerminal> {
-        Ok(
-            crate::need_accounting::open_body_exclusive_starts(log, actor_id, tick)?
-                .iter()
-                .any(|event_id| {
-                    log.events().iter().any(|event| {
-                        &event.event_id == event_id
-                            && payload_value(event, "body_exclusive") == Some("true")
-                            && scheduled_completion_tick(event)
-                                .is_some_and(|completion| completion > tick)
-                    })
-                }),
-        )
+        Ok(false) /* ~ changed by cargo-mutants ~ */
     }
 
     #[allow(clippy::too_many_arguments)]
     fn append_routine_stuck_diagnostics(
         log: &mut EventLog,
         agent_state: &mut AgentState,
         process_id: &ProcessId,
         actor_id: &ActorId,

---- scheduler::no_human::tests::no_human_day_skips_decision_for_open_body_exclusive_duration stdout ----

thread 'scheduler::no_human::tests::no_human_day_skips_decision_for_open_body_exclusive_duration' (18858) panicked at crates/tracewake-core/src/scheduler.rs:3291:13:
assertion `left == right` failed
  left: 3
 right: 0

---- scheduler::no_human::tests::pending_completion_and_open_duration_checks_use_future_completion_tick stdout ----

thread 'scheduler::no_human::tests::pending_completion_and_open_duration_checks_use_future_completion_tick' (18862) panicked at crates/tracewake-core/src/scheduler.rs:3621:13:
assertion failed: actor_has_open_body_exclusive_duration(&log, &actor, SimTick::new(1)).unwrap()

failures:
    scheduler::no_human::tests::no_human_day_skips_decision_for_open_body_exclusive_duration
    scheduler::no_human::tests::pending_completion_and_open_duration_checks_use_future_completion_tick

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
