*** crates/tracewake-core/src/scheduler.rs:1242:29: replace && with || in no_human::actor_has_open_body_exclusive_duration

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace && with || in no_human::actor_has_open_body_exclusive_duration
@@ -1234,17 +1234,17 @@
     ) -> Result<bool, crate::need_accounting::DuplicateDurationTerminal> {
         Ok(
             crate::need_accounting::open_body_exclusive_starts(log, actor_id, tick)?
                 .iter()
                 .any(|event_id| {
                     log.events().iter().any(|event| {
                         &event.event_id == event_id
                             && payload_value(event, "body_exclusive") == Some("true")
-                            && scheduled_completion_tick(event)
+                            || /* ~ changed by cargo-mutants ~ */ scheduled_completion_tick(event)
                                 .is_some_and(|completion| completion > tick)
                     })
                 }),
         )
     }
 
     #[allow(clippy::too_many_arguments)]
     fn append_routine_stuck_diagnostics(

---- scheduler::no_human::tests::pending_completion_and_open_duration_checks_use_future_completion_tick stdout ----

thread 'scheduler::no_human::tests::pending_completion_and_open_duration_checks_use_future_completion_tick' (23421) panicked at crates/tracewake-core/src/scheduler.rs:3633:13:
assertion failed: !actor_has_open_body_exclusive_duration(&log, &actor,
            SimTick::new(2)).unwrap()

failures:
    scheduler::no_human::tests::pending_completion_and_open_duration_checks_use_future_completion_tick

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
