*** crates/tracewake-core/src/scheduler.rs:1243:70: replace > with < in no_human::actor_has_open_body_exclusive_duration

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace > with < in no_human::actor_has_open_body_exclusive_duration
@@ -1235,17 +1235,17 @@
         Ok(
             crate::need_accounting::open_body_exclusive_starts(log, actor_id, tick)?
                 .iter()
                 .any(|event_id| {
                     log.events().iter().any(|event| {
                         &event.event_id == event_id
                             && payload_value(event, "body_exclusive") == Some("true")
                             && scheduled_completion_tick(event)
-                                .is_some_and(|completion| completion > tick)
+                                .is_some_and(|completion| completion < /* ~ changed by cargo-mutants ~ */ tick)
                     })
                 }),
         )
     }
 
     #[allow(clippy::too_many_arguments)]
     fn append_routine_stuck_diagnostics(
         log: &mut EventLog,

---- scheduler::no_human::tests::pending_completion_and_open_duration_checks_use_future_completion_tick stdout ----

thread 'scheduler::no_human::tests::pending_completion_and_open_duration_checks_use_future_completion_tick' (13749) panicked at crates/tracewake-core/src/scheduler.rs:3632:13:
assertion failed: actor_has_open_body_exclusive_duration(&log, &actor, SimTick::new(1)).unwrap()

---- scheduler::no_human::tests::no_human_day_skips_decision_for_open_body_exclusive_duration stdout ----

thread 'scheduler::no_human::tests::no_human_day_skips_decision_for_open_body_exclusive_duration' (13745) panicked at crates/tracewake-core/src/scheduler.rs:3302:13:
assertion `left == right` failed
  left: 3
 right: 0

failures:
    scheduler::no_human::tests::no_human_day_skips_decision_for_open_body_exclusive_duration
    scheduler::no_human::tests::pending_completion_and_open_duration_checks_use_future_completion_tick

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
