*** crates/tracewake-core/src/scheduler.rs:1243:70: replace > with >= in no_human::actor_has_open_body_exclusive_duration

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace > with >= in no_human::actor_has_open_body_exclusive_duration
@@ -1235,17 +1235,17 @@
         Ok(
             crate::need_accounting::open_body_exclusive_starts(log, actor_id, tick)?
                 .iter()
                 .any(|event_id| {
                     log.events().iter().any(|event| {
                         &event.event_id == event_id
                             && payload_value(event, "body_exclusive") == Some("true")
                             && scheduled_completion_tick(event)
-                                .is_some_and(|completion| completion > tick)
+                                .is_some_and(|completion| completion >= /* ~ changed by cargo-mutants ~ */ tick)
                     })
                 }),
         )
     }
 
     #[allow(clippy::too_many_arguments)]
     fn append_routine_stuck_diagnostics(
         log: &mut EventLog,

---- scheduler::no_human::tests::pending_completion_and_open_duration_checks_use_future_completion_tick stdout ----

thread 'scheduler::no_human::tests::pending_completion_and_open_duration_checks_use_future_completion_tick' (18306) panicked at crates/tracewake-core/src/scheduler.rs:3633:13:
assertion failed: !actor_has_open_body_exclusive_duration(&log, &actor,
            SimTick::new(2)).unwrap()

failures:
    scheduler::no_human::tests::pending_completion_and_open_duration_checks_use_future_completion_tick

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
