*** crates/tracewake-core/src/scheduler.rs:1260:9: replace no_human::append_routine_stuck_diagnostics with ()

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace no_human::append_routine_stuck_diagnostics with ()
@@ -1252,35 +1252,17 @@
         agent_state: &mut AgentState,
         process_id: &ProcessId,
         actor_id: &ActorId,
         window: &DayWindow,
         content_manifest_id: &ContentManifestId,
         stuck_diagnostic_event_ids: &mut Vec<EventId>,
         scheduler_errors: &mut Vec<NoHumanSchedulerError>,
     ) {
-        let diagnostics = routine_stuck_diagnostic_kinds(agent_state, actor_id, window);
-        for (kind, execution_id) in diagnostics {
-            let event = append_stuck_diagnostic(
-                log,
-                process_id,
-                actor_id,
-                window,
-                content_manifest_id,
-                kind,
-                Some(execution_id),
-            );
-            match apply_agent_event(agent_state, &event) {
-                Ok(_) => stuck_diagnostic_event_ids.push(event.event_id),
-                Err(error) => scheduler_errors.push(NoHumanSchedulerError::AgentApply {
-                    event_id: event.event_id,
-                    error,
-                }),
-            }
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn routine_stuck_diagnostic_kinds(
         agent_state: &AgentState,
         actor_id: &ActorId,
         window: &DayWindow,
     ) -> Vec<(StuckDiagnosticKind, RoutineExecutionId)> {
         agent_state

---- scheduler::no_human::tests::no_human_day_detects_routine_past_expected_progress_window stdout ----

thread 'scheduler::no_human::tests::no_human_day_detects_routine_past_expected_progress_window' (22853) panicked at crates/tracewake-core/src/scheduler.rs:4182:13:
assertion failed: report.stuck_diagnostic_event_ids.iter().any(|event_id|
        {
            log.events().iter().find(|event|
                        &event.event_id ==
                            event_id).is_some_and(|event|
                    {
                        event.payload.iter().any(|field|
                                {
                                    field.key == "actual_source" &&
                                        field.value ==
                                            "routine_expected_next_progress_stuck_detection"

---- scheduler::no_human::tests::no_human_day_detects_repeated_idle_wait stdout ----

thread 'scheduler::no_human::tests::no_human_day_detects_repeated_idle_wait' (22852) panicked at crates/tracewake-core/src/scheduler.rs:4242:13:
assertion failed: report.stuck_diagnostic_event_ids.iter().any(|event_id|
        {
            log.events().iter().find(|event|
                        &event.event_id ==
                            event_id).is_some_and(|event|
                    {
                        event.payload.iter().any(|field|
                                {
                                    field.key == "actual_source" &&
                                        field.value == "routine_repeated_idle_wait_stuck_detection"
                                })

failures:
    scheduler::no_human::tests::no_human_day_detects_repeated_idle_wait
    scheduler::no_human::tests::no_human_day_detects_routine_past_expected_progress_window

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
