*** crates/tracewake-core/src/scheduler.rs:1286:9: replace no_human::routine_stuck_diagnostic_kinds -> Vec<(StuckDiagnosticKind, RoutineExecutionId)> with vec![]

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace no_human::routine_stuck_diagnostic_kinds -> Vec<(StuckDiagnosticKind, RoutineExecutionId)> with vec![]
@@ -1278,54 +1278,17 @@
         }
     }
 
     fn routine_stuck_diagnostic_kinds(
         agent_state: &AgentState,
         actor_id: &ActorId,
         window: &DayWindow,
     ) -> Vec<(StuckDiagnosticKind, RoutineExecutionId)> {
-        agent_state
-            .routine_executions()
-            .iter()
-            .filter(|(_, execution)| &execution.actor_id == actor_id)
-            .flat_map(|(execution_id, execution)| {
-                let mut diagnostics = Vec::new();
-                if execution
-                    .expected_next_progress_tick
-                    .is_some_and(|expected| {
-                        expected < window.start_tick && execution.last_progress_tick < expected
-                    })
-                {
-                    diagnostics.push((
-                        StuckDiagnosticKind::PastExpectedProgressWindow,
-                        execution_id.clone(),
-                    ));
-                }
-                if execution.step_status == RoutineStepStatus::Waiting
-                    && execution.fallback_attempts > 0
-                    && execution.last_progress_tick < window.start_tick
-                {
-                    diagnostics.push((StuckDiagnosticKind::RepeatedIdleWait, execution_id.clone()));
-                }
-                diagnostics
-            })
-            .filter(|(kind, execution_id)| {
-                !agent_state.stuck_diagnostics().contains_key(
-                    &StuckDiagnosticId::new(format!(
-                        "diagnostic_{}_{}_{}_{}",
-                        kind.stable_id(),
-                        actor_id.as_str(),
-                        window.window_id,
-                        execution_id.as_str()
-                    ))
-                    .unwrap(),
-                )
-            })
-            .collect()
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 
     #[allow(clippy::too_many_arguments)]
     fn append_decision_trace_after_proposal(
         log: &mut EventLog,
         agent_state: &mut AgentState,
         process_id: &ProcessId,
         actor_id: &ActorId,

---- scheduler::no_human::tests::no_human_day_detects_repeated_idle_wait stdout ----

thread 'scheduler::no_human::tests::no_human_day_detects_repeated_idle_wait' (27411) panicked at crates/tracewake-core/src/scheduler.rs:4223:13:
assertion failed: report.stuck_diagnostic_event_ids.iter().any(|event_id|
        {
            log.events().iter().find(|event|
                        &event.event_id ==
                            event_id).is_some_and(|event|
                    {
                        event.payload.iter().any(|field|
                                {
                                    field.key == "actual_source" &&
                                        field.value == "routine_repeated_idle_wait_stuck_detection"
                                })

---- scheduler::no_human::tests::no_human_day_detects_routine_past_expected_progress_window stdout ----

thread 'scheduler::no_human::tests::no_human_day_detects_routine_past_expected_progress_window' (27412) panicked at crates/tracewake-core/src/scheduler.rs:4163:13:
assertion failed: report.stuck_diagnostic_event_ids.iter().any(|event_id|
        {
            log.events().iter().find(|event|
                        &event.event_id ==
                            event_id).is_some_and(|event|
                    {
                        event.payload.iter().any(|field|
                                {
                                    field.key == "actual_source" &&
                                        field.value ==
                                            "routine_expected_next_progress_stuck_detection"

---- scheduler::no_human::tests::routine_stuck_diagnostics_use_actor_window_and_progress_boundaries stdout ----

thread 'scheduler::no_human::tests::routine_stuck_diagnostics_use_actor_window_and_progress_boundaries' (27427) panicked at crates/tracewake-core/src/scheduler.rs:3769:13:
assertion `left == right` failed
  left: []
 right: [(PastExpectedProgressWindow, RoutineExecutionId(StableId("routine_exec_past_due"))), (RepeatedIdleWait, RoutineExecutionId(StableId("routine_exec_waiting_boundary")))]

failures:
    scheduler::no_human::tests::no_human_day_detects_repeated_idle_wait
    scheduler::no_human::tests::no_human_day_detects_routine_past_expected_progress_window
    scheduler::no_human::tests::routine_stuck_diagnostics_use_actor_window_and_progress_boundaries

test result: FAILED. 452 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
