*** crates/tracewake-core/src/scheduler.rs:1295:86: replace < with == in no_human::routine_stuck_diagnostic_kinds

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace < with == in no_human::routine_stuck_diagnostic_kinds
@@ -1287,17 +1287,17 @@
             .routine_executions()
             .iter()
             .filter(|(_, execution)| &execution.actor_id == actor_id)
             .flat_map(|(execution_id, execution)| {
                 let mut diagnostics = Vec::new();
                 if execution
                     .expected_next_progress_tick
                     .is_some_and(|expected| {
-                        expected < window.start_tick && execution.last_progress_tick < expected
+                        expected < window.start_tick && execution.last_progress_tick == /* ~ changed by cargo-mutants ~ */ expected
                     })
                 {
                     diagnostics.push((
                         StuckDiagnosticKind::PastExpectedProgressWindow,
                         execution_id.clone(),
                     ));
                 }
                 if execution.step_status == RoutineStepStatus::Waiting

---- scheduler::no_human::tests::no_human_day_detects_routine_past_expected_progress_window stdout ----

thread 'scheduler::no_human::tests::no_human_day_detects_routine_past_expected_progress_window' (22311) panicked at crates/tracewake-core/src/scheduler.rs:4200:13:
assertion failed: report.stuck_diagnostic_event_ids.iter().any(|event_id|
        {
            log.events().iter().find(|event|
                        &event.event_id ==
                            event_id).is_some_and(|event|
                    {
                        event.payload.iter().any(|field|
                                {
                                    field.key == "actual_source" &&
                                        field.value ==
                                            "routine_expected_next_progress_stuck_detection"

---- scheduler::no_human::tests::routine_stuck_diagnostics_use_actor_window_and_progress_boundaries stdout ----

thread 'scheduler::no_human::tests::routine_stuck_diagnostics_use_actor_window_and_progress_boundaries' (22326) panicked at crates/tracewake-core/src/scheduler.rs:3806:13:
assertion `left == right` failed
  left: [(PastExpectedProgressWindow, RoutineExecutionId(StableId("routine_exec_progressed_at_expected"))), (RepeatedIdleWait, RoutineExecutionId(StableId("routine_exec_waiting_boundary")))]
 right: [(PastExpectedProgressWindow, RoutineExecutionId(StableId("routine_exec_past_due"))), (RepeatedIdleWait, RoutineExecutionId(StableId("routine_exec_waiting_boundary")))]

failures:
    scheduler::no_human::tests::no_human_day_detects_routine_past_expected_progress_window
    scheduler::no_human::tests::routine_stuck_diagnostics_use_actor_window_and_progress_boundaries

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
