*** crates/tracewake-core/src/scheduler.rs:1304:21: replace && with || in no_human::routine_stuck_diagnostic_kinds

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace && with || in no_human::routine_stuck_diagnostic_kinds
@@ -1296,17 +1296,17 @@
                     })
                 {
                     diagnostics.push((
                         StuckDiagnosticKind::PastExpectedProgressWindow,
                         execution_id.clone(),
                     ));
                 }
                 if execution.step_status == RoutineStepStatus::Waiting
-                    && execution.fallback_attempts > 0
+                    || /* ~ changed by cargo-mutants ~ */ execution.fallback_attempts > 0
                     && execution.last_progress_tick < window.start_tick
                 {
                     diagnostics.push((StuckDiagnosticKind::RepeatedIdleWait, execution_id.clone()));
                 }
                 diagnostics
             })
             .filter(|(kind, execution_id)| {
                 !agent_state.stuck_diagnostics().contains_key(

---- scheduler::no_human::tests::routine_stuck_diagnostics_use_actor_window_and_progress_boundaries stdout ----

thread 'scheduler::no_human::tests::routine_stuck_diagnostics_use_actor_window_and_progress_boundaries' (8095) panicked at crates/tracewake-core/src/scheduler.rs:3806:13:
assertion `left == right` failed
 right: [(PastExpectedProgressWindow, RoutineExecutionId(StableId("routine_exec_past_due"))), (RepeatedIdleWait, RoutineExecutionId(StableId("routine_exec_waiting_boundary")))]

failures:
    scheduler::no_human::tests::routine_stuck_diagnostics_use_actor_window_and_progress_boundaries

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
