*** crates/tracewake-core/src/scheduler.rs:1305:53: replace < with == in no_human::routine_stuck_diagnostic_kinds

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace < with == in no_human::routine_stuck_diagnostic_kinds
@@ -1297,17 +1297,17 @@
                 {
                     diagnostics.push((
                         StuckDiagnosticKind::PastExpectedProgressWindow,
                         execution_id.clone(),
                     ));
                 }
                 if execution.step_status == RoutineStepStatus::Waiting
                     && execution.fallback_attempts > 0
-                    && execution.last_progress_tick < window.start_tick
+                    && execution.last_progress_tick == /* ~ changed by cargo-mutants ~ */ window.start_tick
                 {
                     diagnostics.push((StuckDiagnosticKind::RepeatedIdleWait, execution_id.clone()));
                 }
                 diagnostics
             })
             .filter(|(kind, execution_id)| {
                 !agent_state.stuck_diagnostics().contains_key(
                     &StuckDiagnosticId::new(format!(

---- scheduler::no_human::tests::no_human_day_detects_repeated_idle_wait stdout ----

thread 'scheduler::no_human::tests::no_human_day_detects_repeated_idle_wait' (30874) panicked at crates/tracewake-core/src/scheduler.rs:4260:13:
assertion failed: report.stuck_diagnostic_event_ids.iter().any(|event_id|
        {
            log.events().iter().find(|event|
                        &event.event_id ==
                            event_id).is_some_and(|event|
                    {
                        event.payload.iter().any(|field|
                                {
                                    field.key == "actual_source" &&
                                        field.value == "routine_repeated_idle_wait_stuck_detection"
                                })

---- scheduler::no_human::tests::routine_stuck_diagnostics_use_actor_window_and_progress_boundaries stdout ----

thread 'scheduler::no_human::tests::routine_stuck_diagnostics_use_actor_window_and_progress_boundaries' (30890) panicked at crates/tracewake-core/src/scheduler.rs:3806:13:
assertion `left == right` failed
  left: [(RepeatedIdleWait, RoutineExecutionId(StableId("routine_exec_boundary"))), (PastExpectedProgressWindow, RoutineExecutionId(StableId("routine_exec_past_due")))]
 right: [(PastExpectedProgressWindow, RoutineExecutionId(StableId("routine_exec_past_due"))), (RepeatedIdleWait, RoutineExecutionId(StableId("routine_exec_waiting_boundary")))]

failures:
    scheduler::no_human::tests::no_human_day_detects_repeated_idle_wait
    scheduler::no_human::tests::routine_stuck_diagnostics_use_actor_window_and_progress_boundaries

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
