*** crates/tracewake-core/src/scheduler.rs:1312:17: delete ! in no_human::routine_stuck_diagnostic_kinds

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ delete ! in no_human::routine_stuck_diagnostic_kinds
@@ -1304,17 +1304,17 @@
                     && execution.fallback_attempts > 0
                     && execution.last_progress_tick < window.start_tick
                 {
                     diagnostics.push((StuckDiagnosticKind::RepeatedIdleWait, execution_id.clone()));
                 }
                 diagnostics
             })
             .filter(|(kind, execution_id)| {
-                !agent_state.stuck_diagnostics().contains_key(
+                 /* ~ changed by cargo-mutants ~ */agent_state.stuck_diagnostics().contains_key(
                     &StuckDiagnosticId::new(format!(
                         "diagnostic_{}_{}_{}_{}",
                         kind.stable_id(),
                         actor_id.as_str(),
                         window.window_id,
                         execution_id.as_str()
                     ))
                     .unwrap(),

---- scheduler::no_human::tests::no_human_day_detects_repeated_idle_wait stdout ----

thread 'scheduler::no_human::tests::no_human_day_detects_repeated_idle_wait' (12084) panicked at crates/tracewake-core/src/scheduler.rs:4260:13:
assertion failed: report.stuck_diagnostic_event_ids.iter().any(|event_id|
        {
            log.events().iter().find(|event|
                        &event.event_id ==
                            event_id).is_some_and(|event|
                    {
                        event.payload.iter().any(|field|
                                {
                                    field.key == "actual_source" &&
                                        field.value == "routine_repeated_idle_wait_stuck_detection"
                                })

---- scheduler::no_human::tests::no_human_day_detects_routine_past_expected_progress_window stdout ----

thread 'scheduler::no_human::tests::no_human_day_detects_routine_past_expected_progress_window' (12085) panicked at crates/tracewake-core/src/scheduler.rs:4200:13:
assertion failed: report.stuck_diagnostic_event_ids.iter().any(|event_id|
        {
            log.events().iter().find(|event|
                        &event.event_id ==
                            event_id).is_some_and(|event|
                    {
                        event.payload.iter().any(|field|
                                {
                                    field.key == "actual_source" &&
                                        field.value ==
                                            "routine_expected_next_progress_stuck_detection"

---- scheduler::no_human::tests::routine_stuck_diagnostics_use_actor_window_and_progress_boundaries stdout ----

thread 'scheduler::no_human::tests::routine_stuck_diagnostics_use_actor_window_and_progress_boundaries' (12100) panicked at crates/tracewake-core/src/scheduler.rs:3806:13:
assertion `left == right` failed
  left: []
 right: [(PastExpectedProgressWindow, RoutineExecutionId(StableId("routine_exec_past_due"))), (RepeatedIdleWait, RoutineExecutionId(StableId("routine_exec_waiting_boundary")))]

failures:
    scheduler::no_human::tests::no_human_day_detects_repeated_idle_wait
    scheduler::no_human::tests::no_human_day_detects_routine_past_expected_progress_window
    scheduler::no_human::tests::routine_stuck_diagnostics_use_actor_window_and_progress_boundaries

test result: FAILED. 452 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
