*** crates/tracewake-core/src/scheduler.rs:1338:9: replace no_human::append_decision_trace_after_proposal with ()

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace no_human::append_decision_trace_after_proposal with ()
@@ -1330,32 +1330,17 @@
         process_id: &ProcessId,
         actor_id: &ActorId,
         window: &DayWindow,
         proposal: &Proposal,
         decision_trace_record: &DecisionTraceRecord,
         content_manifest_id: &ContentManifestId,
         ordinary_event: Option<&EventEnvelope>,
     ) {
-        let Some(ordinary_event) = ordinary_event else {
-            return;
-        };
-        append_and_apply_agent_event(
-            log,
-            agent_state,
-            build_decision_trace_event(
-                process_id,
-                actor_id,
-                window,
-                proposal,
-                decision_trace_record,
-                content_manifest_id,
-                ordinary_event,
-            ),
-        );
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn build_decision_trace_event(
         process_id: &ProcessId,
         actor_id: &ActorId,
         window: &DayWindow,
         proposal: &Proposal,
         decision_trace_record: &DecisionTraceRecord,

---- no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash stdout ----

thread 'no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash' (16208) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2904:5:
assertion failed: !records.is_empty()

---- severe_safety_with_known_exit_produces_move_and_replays stdout ----

thread 'severe_safety_with_known_exit_produces_move_and_replays' (16230) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1717:5:
assertion failed: log.events().iter().any(|event|
        {
            event.event_type == EventKind::DecisionTraceRecorded &&
                payload(event,
                        "trace_canonical").is_some_and(|canonical|
                        canonical.contains("leave_unsafe_place"))
        })

---- no_human_decision_context_hash_gate_fails_when_source_evidence_tampered stdout ----

thread 'no_human_decision_context_hash_gate_fails_when_source_evidence_tampered' (16209) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:811:5:
fixture contains decision trace event

failures:
    no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash
    no_human_decision_context_hash_gate_fails_when_source_evidence_tampered
    severe_safety_with_known_exit_produces_move_and_replays

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.17s

*** result: Failure(101)
