*** crates/tracewake-core/src/scheduler.rs:1475:26: replace == with != in no_human::append_passive_need_events_before_decision

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace == with != in no_human::append_passive_need_events_before_decision
@@ -1467,17 +1467,17 @@
 
     fn append_passive_need_events_before_decision(
         state: &PhysicalState,
         log: &mut EventLog,
         agent_state: &mut AgentState,
         context: &PassiveNeedDecisionContext<'_>,
         elapsed_ticks: u64,
     ) {
-        if elapsed_ticks == 0 {
+        if elapsed_ticks != /* ~ changed by cargo-mutants ~ */ 0 {
             return;
         }
         let previous_tick = SimTick::new(
             context
                 .window
                 .start_tick
                 .value()
                 .saturating_sub(elapsed_ticks),

---- wait_then_window_passive_charges_each_tick_once stdout ----

thread 'wait_then_window_passive_charges_each_tick_once' (24445) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2604:10:
second window passive hunger delta exists

failures:
    wait_then_window_passive_charges_each_tick_once

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.60s

*** result: Failure(101)
