*** crates/tracewake-core/src/scheduler.rs:1475:9: replace no_human::append_passive_need_events_before_decision with ()

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace no_human::append_passive_need_events_before_decision with ()
@@ -1467,66 +1467,17 @@
 
     fn append_passive_need_events_before_decision(
         state: &PhysicalState,
         log: &mut EventLog,
         agent_state: &mut AgentState,
         context: &PassiveNeedDecisionContext<'_>,
         elapsed_ticks: u64,
     ) {
-        if elapsed_ticks == 0 {
-            return;
-        }
-        let previous_tick = SimTick::new(
-            context
-                .window
-                .start_tick
-                .value()
-                .saturating_sub(elapsed_ticks),
-        );
-        let regime_counts = classify_actor_tick_regimes(
-            log,
-            context.actor_id,
-            previous_tick,
-            context.window.start_tick,
-        );
-        if regime_counts.awake_ticks == 0 {
-            return;
-        }
-        let deltas =
-            crate::time::passive_awake_need_deltas(state.need_model(), regime_counts.awake_ticks);
-        for (need_kind, delta) in [
-            (NeedKind::Hunger, deltas.hunger_delta),
-            (NeedKind::Fatigue, deltas.fatigue_delta),
-        ] {
-            let Some(current_value) = agent_state
-                .needs_by_actor
-                .get(context.actor_id)
-                .and_then(|needs| needs.get(&need_kind))
-                .map(NeedState::value)
-            else {
-                continue;
-            };
-            let events = build_window_passive_need_events(
-                Some(current_value),
-                agent_state
-                    .active_intention_by_actor
-                    .contains_key(context.actor_id),
-                context.process_id,
-                context.actor_id,
-                context.window,
-                context.content_manifest_id,
-                need_kind,
-                delta,
-                regime_counts.awake_ticks,
-            );
-            for event in events {
-                append_and_apply_agent_event(log, agent_state, event);
-            }
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     #[allow(clippy::too_many_arguments)]
     fn build_window_passive_need_events(
         current_value: Option<u16>,
         has_active_intention: bool,
         process_id: &ProcessId,
         actor_id: &ActorId,

---- wait_then_window_passive_charges_each_tick_once stdout ----

thread 'wait_then_window_passive_charges_each_tick_once' (20346) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2604:10:
second window passive hunger delta exists

failures:
    wait_then_window_passive_charges_each_tick_once

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.61s

*** result: Failure(101)
