*** crates/tracewake-core/src/scheduler.rs:1491:38: replace == with != in no_human::append_passive_need_events_before_decision

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace == with != in no_human::append_passive_need_events_before_decision
@@ -1483,17 +1483,17 @@
                 .saturating_sub(elapsed_ticks),
         );
         let regime_counts = classify_actor_tick_regimes(
             log,
             context.actor_id,
             previous_tick,
             context.window.start_tick,
         );
-        if regime_counts.awake_ticks == 0 {
+        if regime_counts.awake_ticks != /* ~ changed by cargo-mutants ~ */ 0 {
             return;
         }
         let deltas =
             crate::time::passive_awake_need_deltas(state.need_model(), regime_counts.awake_ticks);
         for (need_kind, delta) in [
             (NeedKind::Hunger, deltas.hunger_delta),
             (NeedKind::Fatigue, deltas.fatigue_delta),
         ] {

---- wait_then_window_passive_charges_each_tick_once stdout ----

thread 'wait_then_window_passive_charges_each_tick_once' (28544) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2604:10:
second window passive hunger delta exists

---- sleep_spanning_window_boundary_charges_each_tick_once stdout ----

thread 'sleep_spanning_window_boundary_charges_each_tick_once' (28542) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:708:17:
tick_delta charge interval is positive

---- no_human_need_ledger_has_no_duplicate_regime_charges stdout ----

thread 'no_human_need_ledger_has_no_duplicate_regime_charges' (28519) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:708:17:
tick_delta charge interval is positive

failures:
    no_human_need_ledger_has_no_duplicate_regime_charges
    sleep_spanning_window_boundary_charges_each_tick_once
    wait_then_window_passive_charges_each_tick_once

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.61s

*** result: Failure(101)
