*** crates/tracewake-core/src/scheduler.rs:1539:9: replace no_human::build_window_passive_need_events -> Vec<EventEnvelope> with vec![]

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace no_human::build_window_passive_need_events -> Vec<EventEnvelope> with vec![]
@@ -1531,103 +1531,17 @@
         process_id: &ProcessId,
         actor_id: &ActorId,
         window: &DayWindow,
         content_manifest_id: &ContentManifestId,
         need_kind: NeedKind,
         delta: i32,
         elapsed_ticks: u64,
     ) -> Vec<EventEnvelope> {
-        let mut events = build_need_delta_and_threshold_events(
-            NeedDeltaEventSpec {
-                event_id: EventId::new(format!(
-                    "event.no_human_passive_need_delta.{}.{}.{}",
-                    window.window_id,
-                    actor_id.as_str(),
-                    need_kind.stable_id()
-                ))
-                .unwrap(),
-                threshold_event_id: EventId::new(format!(
-                    "event.no_human_need_threshold.{}.{}.{}",
-                    window.window_id,
-                    actor_id.as_str(),
-                    need_kind.stable_id()
-                ))
-                .unwrap(),
-                tick: window.start_tick,
-                ordering_key: OrderingKey::new(
-                    window.start_tick,
-                    SchedulePhase::NoHumanProcess,
-                    SchedulerSourceId::Process(process_id.clone()),
-                    ProposalSequence::new(0),
-                    ActionId::new("passive_need_delta").unwrap(),
-                    vec![
-                        actor_id.as_str().to_string(),
-                        window.window_id.clone(),
-                        need_kind.stable_id().to_string(),
-                    ],
-                    format!(
-                        "before_decision:{}:{}:{}",
-                        window.window_id,
-                        actor_id.as_str(),
-                        need_kind.stable_id()
-                    ),
-                ),
-                content_manifest_id: content_manifest_id.clone(),
-                causes: vec![EventCause::Process(process_id.clone())],
-                actor_id: actor_id.clone(),
-                proposal_id: None,
-                process_id: Some(process_id.clone()),
-                participants: vec![actor_id.to_string()],
-                need_kind,
-                delta,
-                elapsed_ticks,
-                cause_kind: "tick_delta".to_string(),
-                cause_action_id: None,
-                extra_payload: vec![PayloadField::new("window_id", window.window_id.as_str())],
-                delta_effects_summary: format!(
-                    "{} changed by {} before {} decision",
-                    need_kind.stable_id(),
-                    delta,
-                    window.window_id
-                ),
-                threshold_effects_summary: format!(
-                    "{} crossed threshold before {} decision",
-                    need_kind.stable_id(),
-                    window.window_id
-                ),
-            },
-            current_value,
-        );
-        for event in &mut events {
-            if event.event_type != EventKind::NeedThresholdCrossed {
-                continue;
-            }
-            let severe_need_interrupts = event
-                .payload
-                .iter()
-                .any(|field| field.key == "to_band" && field.value == "severe")
-                && has_active_intention;
-            event
-                .payload
-                .push(PayloadField::new("window_id", window.window_id.as_str()));
-            event.payload.push(PayloadField::new(
-                "severe_need_interrupts_active_intention",
-                severe_need_interrupts.to_string(),
-            ));
-            event.payload.push(PayloadField::new(
-                "interruption_cause",
-                if severe_need_interrupts {
-                    "severe_need_pressure"
-                } else {
-                    "none"
-                },
-            ));
-        }
-        events
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 
     fn append_and_apply_agent_event(
         log: &mut EventLog,
         agent_state: &mut AgentState,
         event: EventEnvelope,
     ) -> EventEnvelope {
         let appended = log.append(event).expect("agent event is appendable");

---- wait_then_window_passive_charges_each_tick_once stdout ----

thread 'wait_then_window_passive_charges_each_tick_once' (32643) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2604:10:
second window passive hunger delta exists

failures:
    wait_then_window_passive_charges_each_tick_once

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.60s

*** result: Failure(101)
