*** crates/tracewake-core/src/scheduler.rs:1601:33: replace != with == in no_human::build_window_passive_need_events

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace != with == in no_human::build_window_passive_need_events
@@ -1593,17 +1593,17 @@
                     "{} crossed threshold before {} decision",
                     need_kind.stable_id(),
                     window.window_id
                 ),
             },
             current_value,
         );
         for event in &mut events {
-            if event.event_type != EventKind::NeedThresholdCrossed {
+            if event.event_type == /* ~ changed by cargo-mutants ~ */ EventKind::NeedThresholdCrossed {
                 continue;
             }
             let severe_need_interrupts = event
                 .payload
                 .iter()
                 .any(|field| field.key == "to_band" && field.value == "severe")
                 && has_active_intention;
             event

---- scheduler::no_human::tests::severe_passive_need_interrupt_payload_requires_severe_crossing_and_active_intention stdout ----

thread 'scheduler::no_human::tests::severe_passive_need_interrupt_payload_requires_severe_crossing_and_active_intention' (4716) panicked at crates/tracewake-core/src/scheduler.rs:2594:36:
missing payload field severe_need_interrupts_active_intention

---- scheduler::no_human::tests::severe_need_threshold_marks_active_intention_interruption_cause stdout ----

thread 'scheduler::no_human::tests::severe_need_threshold_marks_active_intention_interruption_cause' (4715) panicked at crates/tracewake-core/src/scheduler.rs:5152:13:
assertion failed: threshold.payload.iter().any(|field|
        {
            field.key == "severe_need_interrupts_active_intention" &&
                field.value == "true"
        })

failures:
    scheduler::no_human::tests::severe_need_threshold_marks_active_intention_interruption_cause
    scheduler::no_human::tests::severe_passive_need_interrupt_payload_requires_severe_crossing_and_active_intention

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
