*** crates/tracewake-core/src/scheduler.rs:1607:53: replace && with || in no_human::build_window_passive_need_events

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace && with || in no_human::build_window_passive_need_events
@@ -1599,17 +1599,17 @@
         );
         for event in &mut events {
             if event.event_type != EventKind::NeedThresholdCrossed {
                 continue;
             }
             let severe_need_interrupts = event
                 .payload
                 .iter()
-                .any(|field| field.key == "to_band" && field.value == "severe")
+                .any(|field| field.key == "to_band" || /* ~ changed by cargo-mutants ~ */ field.value == "severe")
                 && has_active_intention;
             event
                 .payload
                 .push(PayloadField::new("window_id", window.window_id.as_str()));
             event.payload.push(PayloadField::new(
                 "severe_need_interrupts_active_intention",
                 severe_need_interrupts.to_string(),
             ));

---- scheduler::no_human::tests::severe_passive_need_interrupt_payload_requires_severe_crossing_and_active_intention stdout ----

thread 'scheduler::no_human::tests::severe_passive_need_interrupt_payload_requires_severe_crossing_and_active_intention' (13835) panicked at crates/tracewake-core/src/scheduler.rs:2662:13:
assertion `left == right` failed
  left: "true"
 right: "false"

failures:
    scheduler::no_human::tests::severe_passive_need_interrupt_payload_requires_severe_crossing_and_active_intention

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
