*** crates/tracewake-core/src/scheduler.rs:1672:9: replace no_human::latest_action_tick_delta_tick -> Option<SimTick> with None

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace no_human::latest_action_tick_delta_tick -> Option<SimTick> with None
@@ -1664,28 +1664,17 @@
         }
         Ok(appended)
     }
 
     fn latest_action_tick_delta_tick(
         events: &[EventEnvelope],
         actor_id: &ActorId,
     ) -> Option<SimTick> {
-        events
-            .iter()
-            .filter(|event| {
-                event.event_type == EventKind::NeedDeltaApplied
-                    && event.actor_id.as_ref() == Some(actor_id)
-                    && payload_value(event, "cause_kind") == Some("tick_delta")
-                    && event.causes.iter().any(|cause| {
-                        matches!(cause, EventCause::Proposal(_) | EventCause::Event(_))
-                    })
-            })
-            .map(|event| event.sim_tick)
-            .max()
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     #[allow(clippy::too_many_arguments)]
     fn append_intention_lifecycle_after_proposal(
         log: &mut EventLog,
         agent_state: &mut AgentState,
         process_id: &ProcessId,
         actor_id: &ActorId,

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (27077) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:
agent event applies to live state: DuplicateNeedTickCharge { actor_id: ActorId(StableId("actor_anna")), need_kind: Hunger, tick: 1 }

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (27078) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:
agent event applies to live state: DuplicateNeedTickCharge { actor_id: ActorId(StableId("actor_anna")), need_kind: Hunger, tick: 1 }

---- no_human_need_ledger_has_no_duplicate_regime_charges stdout ----

thread 'no_human_need_ledger_has_no_duplicate_regime_charges' (27081) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:
agent event applies to live state: DuplicateNeedTickCharge { actor_id: ActorId(StableId("actor_anna")), need_kind: Hunger, tick: 1 }

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    no_human_decision_context_hash_gate_fails_when_source_evidence_tampered
    no_human_need_ledger_has_no_duplicate_regime_charges
    sleep_spanning_window_boundary_charges_each_tick_once
    wait_then_window_passive_charges_each_tick_once

test result: FAILED. 36 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
