*** crates/tracewake-core/src/scheduler.rs:1675:34: replace == with != in no_human::latest_action_tick_delta_tick

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace == with != in no_human::latest_action_tick_delta_tick
@@ -1667,17 +1667,17 @@
 
     fn latest_action_tick_delta_tick(
         events: &[EventEnvelope],
         actor_id: &ActorId,
     ) -> Option<SimTick> {
         events
             .iter()
             .filter(|event| {
-                event.event_type == EventKind::NeedDeltaApplied
+                event.event_type != /* ~ changed by cargo-mutants ~ */ EventKind::NeedDeltaApplied
                     && event.actor_id.as_ref() == Some(actor_id)
                     && payload_value(event, "cause_kind") == Some("tick_delta")
                     && event.causes.iter().any(|cause| {
                         matches!(cause, EventCause::Proposal(_) | EventCause::Event(_))
                     })
             })
             .map(|event| event.sim_tick)
             .max()

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (16485) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:
agent event applies to live state: DuplicateNeedTickCharge { actor_id: ActorId(StableId("actor_anna")), need_kind: Hunger, tick: 1 }

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (16486) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:
agent event applies to live state: DuplicateNeedTickCharge { actor_id: ActorId(StableId("actor_anna")), need_kind: Hunger, tick: 1 }

---- no_human_decision_context_hash_gate_fails_when_source_evidence_tampered stdout ----

thread 'no_human_decision_context_hash_gate_fails_when_source_evidence_tampered' (16488) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:
agent event applies to live state: DuplicateNeedTickCharge { actor_id: ActorId(StableId("actor_anna")), need_kind: Hunger, tick: 1 }

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    no_human_decision_context_hash_gate_fails_when_source_evidence_tampered
    no_human_need_ledger_has_no_duplicate_regime_charges
    sleep_spanning_window_boundary_charges_each_tick_once
    wait_then_window_passive_charges_each_tick_once

test result: FAILED. 36 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
