*** crates/tracewake-core/src/scheduler.rs:1676:48: replace == with != in no_human::latest_action_tick_delta_tick

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace == with != in no_human::latest_action_tick_delta_tick
@@ -1668,17 +1668,17 @@
     fn latest_action_tick_delta_tick(
         events: &[EventEnvelope],
         actor_id: &ActorId,
     ) -> Option<SimTick> {
         events
             .iter()
             .filter(|event| {
                 event.event_type == EventKind::NeedDeltaApplied
-                    && event.actor_id.as_ref() == Some(actor_id)
+                    && event.actor_id.as_ref() != /* ~ changed by cargo-mutants ~ */ Some(actor_id)
                     && payload_value(event, "cause_kind") == Some("tick_delta")
                     && event.causes.iter().any(|cause| {
                         matches!(cause, EventCause::Proposal(_) | EventCause::Event(_))
                     })
             })
             .map(|event| event.sim_tick)
             .max()
     }

---- no_human_need_ledger_has_no_duplicate_regime_charges stdout ----

thread 'no_human_need_ledger_has_no_duplicate_regime_charges' (20588) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:
agent event applies to live state: DuplicateNeedTickCharge { actor_id: ActorId(StableId("actor_anna")), need_kind: Hunger, tick: 1 }

---- no_human_decision_context_hash_gate_fails_when_source_evidence_tampered stdout ----

thread 'no_human_decision_context_hash_gate_fails_when_source_evidence_tampered' (20587) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:
agent event applies to live state: DuplicateNeedTickCharge { actor_id: ActorId(StableId("actor_anna")), need_kind: Hunger, tick: 1 }

---- wait_then_window_passive_charges_each_tick_once stdout ----

thread 'wait_then_window_passive_charges_each_tick_once' (20613) panicked at crates/tracewake-core/src/scheduler.rs:1634:51:
agent event applies to live state: DuplicateNeedTickCharge { actor_id: ActorId(StableId("actor_tomas")), need_kind: Hunger, tick: 1 }

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    no_human_decision_context_hash_gate_fails_when_source_evidence_tampered
    no_human_need_ledger_has_no_duplicate_regime_charges
    sleep_spanning_window_boundary_charges_each_tick_once
    wait_then_window_passive_charges_each_tick_once

test result: FAILED. 36 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
