*** crates/tracewake-core/src/scheduler.rs:1678:21: replace && with || in no_human::latest_action_tick_delta_tick

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace && with || in no_human::latest_action_tick_delta_tick
@@ -1670,17 +1670,17 @@
         actor_id: &ActorId,
     ) -> Option<SimTick> {
         events
             .iter()
             .filter(|event| {
                 event.event_type == EventKind::NeedDeltaApplied
                     && event.actor_id.as_ref() == Some(actor_id)
                     && payload_value(event, "cause_kind") == Some("tick_delta")
-                    && event.causes.iter().any(|cause| {
+                    || /* ~ changed by cargo-mutants ~ */ event.causes.iter().any(|cause| {
                         matches!(cause, EventCause::Proposal(_) | EventCause::Event(_))
                     })
             })
             .map(|event| event.sim_tick)
             .max()
     }
 
     #[allow(clippy::too_many_arguments)]

---- scheduler::no_human::tests::no_human_log_witness_lookups_require_exact_event_shape stdout ----

thread 'scheduler::no_human::tests::no_human_log_witness_lookups_require_exact_event_shape' (3255) panicked at crates/tracewake-core/src/scheduler.rs:3611:13:
assertion `left == right` failed
  left: Some(SimTick(6))
 right: Some(SimTick(3))

failures:
    scheduler::no_human::tests::no_human_log_witness_lookups_require_exact_event_shape

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
