*** crates/tracewake-core/src/scheduler.rs:1699:9: replace no_human::append_intention_lifecycle_after_proposal with ()

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace no_human::append_intention_lifecycle_after_proposal with ()
@@ -1691,50 +1691,17 @@
         actor_id: &ActorId,
         window: &DayWindow,
         proposal: &Proposal,
         content_manifest_id: &ContentManifestId,
         decision_trace_record: &DecisionTraceRecord,
         active_before_proposal: Option<&Intention>,
         ordinary_event: Option<&EventEnvelope>,
     ) {
-        let Some(ordinary_event) = ordinary_event else {
-            return;
-        };
-        if let Some(active) = active_before_proposal {
-            append_and_apply_agent_event(
-                log,
-                agent_state,
-                build_intention_continued_event(
-                    process_id,
-                    active,
-                    window,
-                    proposal,
-                    content_manifest_id,
-                    ordinary_event,
-                ),
-            );
-            return;
-        }
-        if agent_state.active_intention_by_actor.contains_key(actor_id) {
-            return;
-        }
-        append_and_apply_agent_event(
-            log,
-            agent_state,
-            build_intention_started_event(
-                process_id,
-                actor_id,
-                window,
-                proposal,
-                content_manifest_id,
-                decision_trace_record,
-                ordinary_event,
-            ),
-        );
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn build_intention_started_event(
         process_id: &ProcessId,
         actor_id: &ActorId,
         window: &DayWindow,
         proposal: &Proposal,
         content_manifest_id: &ContentManifestId,

---- scheduler::no_human::tests::no_human_day_starts_continues_and_replays_active_intention stdout ----

thread 'scheduler::no_human::tests::no_human_day_starts_continues_and_replays_active_intention' (29229) panicked at crates/tracewake-core/src/scheduler.rs:4688:18:
first no-human action adopts intention

failures:
    scheduler::no_human::tests::no_human_day_starts_continues_and_replays_active_intention

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
