*** crates/tracewake-core/src/scheduler.rs:1887:9: replace no_human::append_routine_step_events_after_proposal with ()

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace no_human::append_routine_step_events_after_proposal with ()
@@ -1879,83 +1879,17 @@
         agent_state: &mut AgentState,
         process_id: &ProcessId,
         actor_id: &ActorId,
         window: &DayWindow,
         proposal: &Proposal,
         content_manifest_id: &ContentManifestId,
         ordinary_event: Option<&EventEnvelope>,
     ) {
-        let Some(ordinary_event) = ordinary_event else {
-            return;
-        };
-        let Some(execution_id) = active_routine_execution_for_actor(agent_state, actor_id, window)
-        else {
-            return;
-        };
-        let Some(execution) = agent_state.routine_executions.get(&execution_id) else {
-            return;
-        };
-        if matches!(
-            execution.step_status,
-            crate::agent::RoutineStepStatus::Completed
-                | crate::agent::RoutineStepStatus::Failed
-                | crate::agent::RoutineStepStatus::Interrupted
-                | crate::agent::RoutineStepStatus::Abandoned
-        ) {
-            return;
-        }
-        let execution_family = execution.family;
-        let execution_step_status = execution.step_status;
-        if is_routine_failure_event(ordinary_event) {
-            append_and_apply_agent_event(
-                log,
-                agent_state,
-                build_routine_step_failed_event(
-                    process_id,
-                    &execution_id,
-                    actor_id,
-                    window,
-                    proposal,
-                    content_manifest_id,
-                    ordinary_event,
-                ),
-            );
-            return;
-        }
-        if execution_step_status == crate::agent::RoutineStepStatus::NotStarted {
-            append_and_apply_agent_event(
-                log,
-                agent_state,
-                build_routine_step_started_event(
-                    process_id,
-                    &execution_id,
-                    actor_id,
-                    window,
-                    proposal,
-                    content_manifest_id,
-                    ordinary_event,
-                ),
-            );
-        }
-        if is_instant_routine_progress_event(execution_family, proposal, ordinary_event) {
-            append_and_apply_agent_event(
-                log,
-                agent_state,
-                build_routine_step_completed_event(
-                    process_id,
-                    &execution_id,
-                    actor_id,
-                    window,
-                    proposal,
-                    content_manifest_id,
-                    ordinary_event,
-                ),
-            );
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn active_routine_execution_for_actor(
         agent_state: &AgentState,
         actor_id: &ActorId,
         window: &DayWindow,
     ) -> Option<RoutineExecutionId> {
         eligible_routine_execution_for_actor(agent_state, actor_id, window)

---- scheduler::no_human::tests::no_human_day_records_blocked_routine_failure_reason stdout ----

thread 'scheduler::no_human::tests::no_human_day_records_blocked_routine_failure_reason' (1339) panicked at crates/tracewake-core/src/scheduler.rs:4880:13:
assertion failed: log.events().iter().any(|event|
        event.event_type == EventKind::RoutineStepFailed &&
            event.payload.iter().any(|field|
                    {
                        field.key == "reason" && field.value == "work_block_failed"
                    }))

---- scheduler::no_human::tests::work_move_starts_but_non_move_progress_completes_routine_step stdout ----

thread 'scheduler::no_human::tests::work_move_starts_but_non_move_progress_completes_routine_step' (1359) panicked at crates/tracewake-core/src/scheduler.rs:2914:13:
assertion failed: move_log.events().iter().any(|event|
        event.event_type == EventKind::RoutineStepStarted)

---- scheduler::no_human::tests::no_human_day_records_routine_step_ancestry_and_replays_it stdout ----

thread 'scheduler::no_human::tests::no_human_day_records_routine_step_ancestry_and_replays_it' (1341) panicked at crates/tracewake-core/src/scheduler.rs:4747:13:
assertion failed: log.events().iter().any(|event|
        event.event_type == EventKind::RoutineStepStarted &&
            event.causes.iter().any(|cause|
                    matches!(cause, EventCause::Event(_))))

failures:
    scheduler::no_human::tests::no_human_day_records_blocked_routine_failure_reason
    scheduler::no_human::tests::no_human_day_records_routine_step_ancestry_and_replays_it
    scheduler::no_human::tests::work_move_starts_but_non_move_progress_completes_routine_step

test result: FAILED. 452 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
