*** crates/tracewake-core/src/scheduler.rs:1924:34: replace == with != in no_human::append_routine_step_events_after_proposal

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace == with != in no_human::append_routine_step_events_after_proposal
@@ -1916,17 +1916,17 @@
                     window,
                     proposal,
                     content_manifest_id,
                     ordinary_event,
                 ),
             );
             return;
         }
-        if execution_step_status == crate::agent::RoutineStepStatus::NotStarted {
+        if execution_step_status != /* ~ changed by cargo-mutants ~ */ crate::agent::RoutineStepStatus::NotStarted {
             append_and_apply_agent_event(
                 log,
                 agent_state,
                 build_routine_step_started_event(
                     process_id,
                     &execution_id,
                     actor_id,
                     window,

---- scheduler::no_human::tests::no_human_day_records_routine_step_ancestry_and_replays_it stdout ----

thread 'scheduler::no_human::tests::no_human_day_records_routine_step_ancestry_and_replays_it' (5901) panicked at crates/tracewake-core/src/scheduler.rs:4813:13:
assertion failed: log.events().iter().any(|event|
        event.event_type == EventKind::RoutineStepStarted &&
            event.causes.iter().any(|cause|
                    matches!(cause, EventCause::Event(_))))

---- scheduler::no_human::tests::work_move_starts_but_non_move_progress_completes_routine_step stdout ----

thread 'scheduler::no_human::tests::work_move_starts_but_non_move_progress_completes_routine_step' (5919) panicked at crates/tracewake-core/src/scheduler.rs:2980:13:
assertion failed: move_log.events().iter().any(|event|
        event.event_type == EventKind::RoutineStepStarted)

failures:
    scheduler::no_human::tests::no_human_day_records_routine_step_ancestry_and_replays_it
    scheduler::no_human::tests::work_move_starts_but_non_move_progress_completes_routine_step

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
