*** crates/tracewake-core/src/scheduler.rs:1961:9: replace no_human::active_routine_execution_for_actor -> Option<RoutineExecutionId> with None

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace no_human::active_routine_execution_for_actor -> Option<RoutineExecutionId> with None
@@ -1953,18 +1953,17 @@
         }
     }
 
     fn active_routine_execution_for_actor(
         agent_state: &AgentState,
         actor_id: &ActorId,
         window: &DayWindow,
     ) -> Option<RoutineExecutionId> {
-        eligible_routine_execution_for_actor(agent_state, actor_id, window)
-            .map(|(execution_id, _)| execution_id.clone())
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     fn is_routine_failure_event(event: &EventEnvelope) -> bool {
         matches!(
             event.event_type,
             EventKind::ActionRejected
                 | EventKind::EatFailed
                 | EventKind::WorkBlockFailed

---- scheduler::no_human::tests::no_human_day_records_routine_step_ancestry_and_replays_it stdout ----

thread 'scheduler::no_human::tests::no_human_day_records_routine_step_ancestry_and_replays_it' (10460) panicked at crates/tracewake-core/src/scheduler.rs:4812:13:
assertion failed: log.events().iter().any(|event|
        event.event_type == EventKind::RoutineStepStarted &&
            event.causes.iter().any(|cause|
                    matches!(cause, EventCause::Event(_))))

---- scheduler::no_human::tests::no_human_day_records_blocked_routine_failure_reason stdout ----

thread 'scheduler::no_human::tests::no_human_day_records_blocked_routine_failure_reason' (10458) panicked at crates/tracewake-core/src/scheduler.rs:4945:13:
assertion failed: log.events().iter().any(|event|
        event.event_type == EventKind::RoutineStepFailed &&
            event.payload.iter().any(|field|
                    {
                        field.key == "reason" && field.value == "work_block_failed"
                    }))

---- scheduler::no_human::tests::routine_execution_selection_excludes_deadline_expired_execution stdout ----

thread 'scheduler::no_human::tests::routine_execution_selection_excludes_deadline_expired_execution' (10469) panicked at crates/tracewake-core/src/scheduler.rs:4144:13:
assertion `left == right` failed
  left: None
 right: Some(RoutineExecutionId(StableId("routine_exec_live")))

failures:
    scheduler::no_human::tests::no_human_day_records_blocked_routine_failure_reason
    scheduler::no_human::tests::no_human_day_records_routine_step_ancestry_and_replays_it
    scheduler::no_human::tests::routine_execution_selection_excludes_deadline_expired_execution
    scheduler::no_human::tests::work_move_starts_but_non_move_progress_completes_routine_step

test result: FAILED. 451 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
