*** crates/tracewake-core/src/scheduler.rs:1966:9: replace no_human::is_routine_failure_event -> bool with true

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace no_human::is_routine_failure_event -> bool with true
@@ -1958,23 +1958,17 @@
         actor_id: &ActorId,
         window: &DayWindow,
     ) -> Option<RoutineExecutionId> {
         eligible_routine_execution_for_actor(agent_state, actor_id, window)
             .map(|(execution_id, _)| execution_id.clone())
     }
 
     fn is_routine_failure_event(event: &EventEnvelope) -> bool {
-        matches!(
-            event.event_type,
-            EventKind::ActionRejected
-                | EventKind::EatFailed
-                | EventKind::WorkBlockFailed
-                | EventKind::ContinueRoutineRejected
-        )
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     fn is_instant_routine_progress_event(
         execution_family: RoutineFamily,
         proposal: &Proposal,
         event: &EventEnvelope,
     ) -> bool {
         if execution_family == RoutineFamily::WorkBlock && proposal.action_id.as_str() == "move" {

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (14589) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.60s

*** result: Failure(101)
