*** crates/tracewake-core/src/scheduler.rs:1966:9: replace no_human::is_routine_failure_event -> bool with false

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace no_human::is_routine_failure_event -> bool with false
@@ -1958,23 +1958,17 @@
         actor_id: &ActorId,
         window: &DayWindow,
     ) -> Option<RoutineExecutionId> {
         eligible_routine_execution_for_actor(agent_state, actor_id, window)
             .map(|(execution_id, _)| execution_id.clone())
     }
 
     fn is_routine_failure_event(event: &EventEnvelope) -> bool {
-        matches!(
-            event.event_type,
-            EventKind::ActionRejected
-                | EventKind::EatFailed
-                | EventKind::WorkBlockFailed
-                | EventKind::ContinueRoutineRejected
-        )
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     fn is_instant_routine_progress_event(
         execution_family: RoutineFamily,
         proposal: &Proposal,
         event: &EventEnvelope,
     ) -> bool {
         if execution_family == RoutineFamily::WorkBlock && proposal.action_id.as_str() == "move" {

---- scheduler::no_human::tests::no_human_day_records_blocked_routine_failure_reason stdout ----

thread 'scheduler::no_human::tests::no_human_day_records_blocked_routine_failure_reason' (19128) panicked at crates/tracewake-core/src/scheduler.rs:4940:13:
assertion failed: log.events().iter().any(|event|
        event.event_type == EventKind::RoutineStepFailed &&
            event.payload.iter().any(|field|
                    {
                        field.key == "reason" && field.value == "work_block_failed"
                    }))

failures:
    scheduler::no_human::tests::no_human_day_records_blocked_routine_failure_reason

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
