*** crates/tracewake-core/src/scheduler.rs:1980:57: replace && with || in no_human::is_instant_routine_progress_event

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace && with || in no_human::is_instant_routine_progress_event
@@ -1972,17 +1972,17 @@
         )
     }
 
     fn is_instant_routine_progress_event(
         execution_family: RoutineFamily,
         proposal: &Proposal,
         event: &EventEnvelope,
     ) -> bool {
-        if execution_family == RoutineFamily::WorkBlock && proposal.action_id.as_str() == "move" {
+        if execution_family == RoutineFamily::WorkBlock || /* ~ changed by cargo-mutants ~ */ proposal.action_id.as_str() == "move" {
             return false;
         }
         !matches!(
             event.event_type,
             EventKind::SleepStarted | EventKind::WorkBlockStarted
         )
     }

---- scheduler::no_human::tests::work_move_starts_but_non_move_progress_completes_routine_step stdout ----

thread 'scheduler::no_human::tests::work_move_starts_but_non_move_progress_completes_routine_step' (32365) panicked at crates/tracewake-core/src/scheduler.rs:3044:18:
non-move work-family event completes instant progress

failures:
    scheduler::no_human::tests::work_move_starts_but_non_move_progress_completes_routine_step

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
