*** crates/tracewake-core/src/scheduler.rs:1980:88: replace == with != in no_human::is_instant_routine_progress_event

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace == with != in no_human::is_instant_routine_progress_event
@@ -1972,17 +1972,17 @@
         )
     }
 
     fn is_instant_routine_progress_event(
         execution_family: RoutineFamily,
         proposal: &Proposal,
         event: &EventEnvelope,
     ) -> bool {
-        if execution_family == RoutineFamily::WorkBlock && proposal.action_id.as_str() == "move" {
+        if execution_family == RoutineFamily::WorkBlock && proposal.action_id.as_str() != /* ~ changed by cargo-mutants ~ */ "move" {
             return false;
         }
         !matches!(
             event.event_type,
             EventKind::SleepStarted | EventKind::WorkBlockStarted
         )
     }

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (8096) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.61s

*** result: Failure(101)
