*** crates/tracewake-core/src/scheduler.rs:1980:9: replace no_human::is_instant_routine_progress_event -> bool with true

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace no_human::is_instant_routine_progress_event -> bool with true
@@ -1972,23 +1972,17 @@
         )
     }
 
     fn is_instant_routine_progress_event(
         execution_family: RoutineFamily,
         proposal: &Proposal,
         event: &EventEnvelope,
     ) -> bool {
-        if execution_family == RoutineFamily::WorkBlock && proposal.action_id.as_str() == "move" {
-            return false;
-        }
-        !matches!(
-            event.event_type,
-            EventKind::SleepStarted | EventKind::WorkBlockStarted
-        )
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     #[allow(clippy::too_many_arguments)]
     fn build_routine_step_started_event(
         process_id: &ProcessId,
         execution_id: &RoutineExecutionId,
         actor_id: &ActorId,
         window: &DayWindow,

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (23247) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.61s

*** result: Failure(101)
