*** crates/tracewake-core/src/scheduler.rs:1983:9: delete ! in no_human::is_instant_routine_progress_event

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ delete ! in no_human::is_instant_routine_progress_event
@@ -1975,17 +1975,17 @@
     fn is_instant_routine_progress_event(
         execution_family: RoutineFamily,
         proposal: &Proposal,
         event: &EventEnvelope,
     ) -> bool {
         if execution_family == RoutineFamily::WorkBlock && proposal.action_id.as_str() == "move" {
             return false;
         }
-        !matches!(
+         /* ~ changed by cargo-mutants ~ */matches!(
             event.event_type,
             EventKind::SleepStarted | EventKind::WorkBlockStarted
         )
     }
 
     #[allow(clippy::too_many_arguments)]
     fn build_routine_step_started_event(
         process_id: &ProcessId,

---- scheduler::no_human::tests::no_human_day_records_routine_step_ancestry_and_replays_it stdout ----

thread 'scheduler::no_human::tests::no_human_day_records_routine_step_ancestry_and_replays_it' (12637) panicked at crates/tracewake-core/src/scheduler.rs:4819:13:
assertion failed: log.events().iter().any(|event|
        event.event_type == EventKind::RoutineStepCompleted)

---- scheduler::no_human::tests::work_move_starts_but_non_move_progress_completes_routine_step stdout ----

thread 'scheduler::no_human::tests::work_move_starts_but_non_move_progress_completes_routine_step' (12655) panicked at crates/tracewake-core/src/scheduler.rs:3044:18:
non-move work-family event completes instant progress

failures:
    scheduler::no_human::tests::no_human_day_records_routine_step_ancestry_and_replays_it
    scheduler::no_human::tests::work_move_starts_but_non_move_progress_completes_routine_step

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
