*** crates/tracewake-core/src/scheduler.rs:209:9: replace DeterministicScheduler::assign_proposal_sequence -> ProposalSequence with Default::default()

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace DeterministicScheduler::assign_proposal_sequence -> ProposalSequence with Default::default()
@@ -201,17 +201,17 @@
     pub const fn new(current_tick: SimTick) -> Self {
         Self {
             current_tick,
             proposal_sequences: ProposalSequenceAssigner::new(),
         }
     }
 
     pub fn assign_proposal_sequence(&mut self) -> ProposalSequence {
-        self.proposal_sequences.assign_next()
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn advance_one_tick(&mut self) -> SimTick {
         self.current_tick = self.current_tick.next();
         self.current_tick
     }
 }

---- scheduler::tests::scheduler_advance_changes_only_tick_and_sequence_state stdout ----

thread 'scheduler::tests::scheduler_advance_changes_only_tick_and_sequence_state' (6294) panicked at crates/tracewake-core/src/scheduler.rs:5456:9:
assertion `left == right` failed
  left: ProposalSequence(0)
 right: ProposalSequence(1)

failures:
    scheduler::tests::scheduler_advance_changes_only_tick_and_sequence_state

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
