*** crates/tracewake-core/src/scheduler.rs:2138:9: replace no_human::routine_failure_reason -> &'static str with "xyzzy"

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace no_human::routine_failure_reason -> &'static str with "xyzzy"
@@ -2130,23 +2130,17 @@
         event.actor_id = Some(actor_id.clone());
         event.process_id = Some(process_id.clone());
         event.proposal_id = Some(proposal.proposal_id.clone());
         event.participants = vec![actor_id.to_string(), execution_id.to_string()];
         event
     }
 
     fn routine_failure_reason(event: &EventEnvelope) -> &'static str {
-        match event.event_type {
-            EventKind::ActionRejected => "action_rejected",
-            EventKind::EatFailed => "eat_failed",
-            EventKind::WorkBlockFailed => "work_block_failed",
-            EventKind::ContinueRoutineRejected => "continue_routine_rejected",
-            _ => "ordinary_action_failed",
-        }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn advance_no_human(
         state: NoHumanStateMut<'_>,
         log: &mut EventLog,
         registry: &ActionRegistry,
         content_manifest_id: ContentManifestId,
         start_tick: SimTick,

---- scheduler::no_human::tests::no_human_day_records_blocked_routine_failure_reason stdout ----

thread 'scheduler::no_human::tests::no_human_day_records_blocked_routine_failure_reason' (21801) panicked at crates/tracewake-core/src/scheduler.rs:4940:13:
assertion failed: log.events().iter().any(|event|
        event.event_type == EventKind::RoutineStepFailed &&
            event.payload.iter().any(|field|
                    {
                        field.key == "reason" && field.value == "work_block_failed"
                    }))

---- scheduler::no_human::tests::routine_failure_reason_marker_and_stuck_diagnostic_vocabulary_are_stable stdout ----

thread 'scheduler::no_human::tests::routine_failure_reason_marker_and_stuck_diagnostic_vocabulary_are_stable' (21813) panicked at crates/tracewake-core/src/scheduler.rs:3843:17:
assertion `left == right` failed
  left: "xyzzy"
 right: "action_rejected"

failures:
    scheduler::no_human::tests::no_human_day_records_blocked_routine_failure_reason
    scheduler::no_human::tests::routine_failure_reason_marker_and_stuck_diagnostic_vocabulary_are_stable

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
