*** crates/tracewake-core/src/scheduler.rs:213:9: replace DeterministicScheduler::advance_one_tick -> SimTick with Default::default()

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace DeterministicScheduler::advance_one_tick -> SimTick with Default::default()
@@ -205,18 +205,17 @@
         }
     }
 
     pub fn assign_proposal_sequence(&mut self) -> ProposalSequence {
         self.proposal_sequences.assign_next()
     }
 
     pub fn advance_one_tick(&mut self) -> SimTick {
-        self.current_tick = self.current_tick.next();
-        self.current_tick
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 pub mod no_human {
     use std::collections::{BTreeMap, BTreeSet};
 
     use crate::actions::defs::need_events::{
         build_need_delta_and_threshold_events, NeedDeltaEventSpec,

---- scheduler::no_human::tests::advance_catches_up_intervening_ticks_before_later_proposal stdout ----

thread 'scheduler::no_human::tests::advance_catches_up_intervening_ticks_before_later_proposal' (10812) panicked at crates/tracewake-core/src/scheduler.rs:2195:17:
assertion `left == right` failed
  left: SimTick(0)
 right: SimTick(1)

---- scheduler::no_human::tests::continue_routine_marker_only_is_not_ordinary_progress stdout ----

thread 'scheduler::no_human::tests::continue_routine_marker_only_is_not_ordinary_progress' (10815) panicked at crates/tracewake-core/src/scheduler.rs:2240:13:
assertion `left == right` failed
  left: SimTick(0)
 right: SimTick(1)

---- scheduler::no_human::tests::advance_runs_without_controller_and_marks_diagnostic_stream stdout ----

thread 'scheduler::no_human::tests::advance_runs_without_controller_and_marks_diagnostic_stream' (10813) panicked at crates/tracewake-core/src/scheduler.rs:2240:13:
assertion `left == right` failed
  left: SimTick(0)
 right: SimTick(1)

failures:
    scheduler::no_human::tests::advance_catches_up_intervening_ticks_before_later_proposal
    scheduler::no_human::tests::advance_runs_without_controller_and_marks_diagnostic_stream
    scheduler::no_human::tests::continue_routine_marker_only_is_not_ordinary_progress
    scheduler::no_human::tests::diagnostic_markers_are_physical_noops_under_replay
    scheduler::no_human::tests::scheduled_proposal_uses_shared_pipeline
    scheduler::tests::no_human_advance_requires_no_controller_and_emits_diagnostic_markers
    scheduler::tests::no_human_markers_replay_as_physical_noops
    scheduler::tests::no_human_scheduled_actions_use_shared_pipeline
    scheduler::tests::scheduler_advance_changes_only_tick_and_sequence_state

test result: FAILED. 446 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
