*** crates/tracewake-core/src/scheduler.rs:2140:13: delete match arm EventKind::EatFailed in no_human::routine_failure_reason

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ delete match arm EventKind::EatFailed in no_human::routine_failure_reason
@@ -2132,17 +2132,17 @@
         event.proposal_id = Some(proposal.proposal_id.clone());
         event.participants = vec![actor_id.to_string(), execution_id.to_string()];
         event
     }
 
     fn routine_failure_reason(event: &EventEnvelope) -> &'static str {
         match event.event_type {
             EventKind::ActionRejected => "action_rejected",
-            EventKind::EatFailed => "eat_failed",
+             /* ~ changed by cargo-mutants ~ */
             EventKind::WorkBlockFailed => "work_block_failed",
             EventKind::ContinueRoutineRejected => "continue_routine_rejected",
             _ => "ordinary_action_failed",
         }
     }
 
     pub fn advance_no_human(
         state: NoHumanStateMut<'_>,

---- scheduler::no_human::tests::routine_failure_reason_marker_and_stuck_diagnostic_vocabulary_are_stable stdout ----

thread 'scheduler::no_human::tests::routine_failure_reason_marker_and_stuck_diagnostic_vocabulary_are_stable' (30931) panicked at crates/tracewake-core/src/scheduler.rs:3849:17:
assertion `left == right` failed
  left: "ordinary_action_failed"
 right: "eat_failed"

failures:
    scheduler::no_human::tests::routine_failure_reason_marker_and_stuck_diagnostic_vocabulary_are_stable

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
