*** crates/tracewake-core/src/scheduler.rs:2141:13: delete match arm EventKind::WorkBlockFailed in no_human::routine_failure_reason

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ delete match arm EventKind::WorkBlockFailed in no_human::routine_failure_reason
@@ -2133,17 +2133,17 @@
         event.participants = vec![actor_id.to_string(), execution_id.to_string()];
         event
     }
 
     fn routine_failure_reason(event: &EventEnvelope) -> &'static str {
         match event.event_type {
             EventKind::ActionRejected => "action_rejected",
             EventKind::EatFailed => "eat_failed",
-            EventKind::WorkBlockFailed => "work_block_failed",
+             /* ~ changed by cargo-mutants ~ */
             EventKind::ContinueRoutineRejected => "continue_routine_rejected",
             _ => "ordinary_action_failed",
         }
     }
 
     pub fn advance_no_human(
         state: NoHumanStateMut<'_>,
         log: &mut EventLog,

---- scheduler::no_human::tests::no_human_day_records_blocked_routine_failure_reason stdout ----

thread 'scheduler::no_human::tests::no_human_day_records_blocked_routine_failure_reason' (3010) panicked at crates/tracewake-core/src/scheduler.rs:4946:13:
assertion failed: log.events().iter().any(|event|
        event.event_type == EventKind::RoutineStepFailed &&
            event.payload.iter().any(|field|
                    {
                        field.key == "reason" && field.value == "work_block_failed"
                    }))

---- scheduler::no_human::tests::routine_failure_reason_marker_and_stuck_diagnostic_vocabulary_are_stable stdout ----

thread 'scheduler::no_human::tests::routine_failure_reason_marker_and_stuck_diagnostic_vocabulary_are_stable' (3022) panicked at crates/tracewake-core/src/scheduler.rs:3849:17:
assertion `left == right` failed
  left: "ordinary_action_failed"
 right: "work_block_failed"

failures:
    scheduler::no_human::tests::no_human_day_records_blocked_routine_failure_reason
    scheduler::no_human::tests::routine_failure_reason_marker_and_stuck_diagnostic_vocabulary_are_stable

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
