*** crates/tracewake-core/src/scheduler.rs:2142:13: delete match arm EventKind::ContinueRoutineRejected in no_human::routine_failure_reason

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ delete match arm EventKind::ContinueRoutineRejected in no_human::routine_failure_reason
@@ -2134,17 +2134,17 @@
         event
     }
 
     fn routine_failure_reason(event: &EventEnvelope) -> &'static str {
         match event.event_type {
             EventKind::ActionRejected => "action_rejected",
             EventKind::EatFailed => "eat_failed",
             EventKind::WorkBlockFailed => "work_block_failed",
-            EventKind::ContinueRoutineRejected => "continue_routine_rejected",
+             /* ~ changed by cargo-mutants ~ */
             _ => "ordinary_action_failed",
         }
     }
 
     pub fn advance_no_human(
         state: NoHumanStateMut<'_>,
         log: &mut EventLog,
         registry: &ActionRegistry,

---- scheduler::no_human::tests::routine_failure_reason_marker_and_stuck_diagnostic_vocabulary_are_stable stdout ----

thread 'scheduler::no_human::tests::routine_failure_reason_marker_and_stuck_diagnostic_vocabulary_are_stable' (7582) panicked at crates/tracewake-core/src/scheduler.rs:3849:17:
assertion `left == right` failed
  left: "ordinary_action_failed"
 right: "continue_routine_rejected"

failures:
    scheduler::no_human::tests::routine_failure_reason_marker_and_stuck_diagnostic_vocabulary_are_stable

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
