*** crates/tracewake-core/src/scheduler.rs:2225:54: replace == with != in no_human::advance_no_human

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace == with != in no_human::advance_no_human
@@ -2217,17 +2217,17 @@
                 content_manifest_id: content_manifest_id.clone(),
                 ordering_key,
             };
             let result = run_pipeline(&mut context, &proposal);
             pending_sleep_starts.extend(
                 result
                     .appended_events
                     .iter()
-                    .filter(|event| event.event_type == EventKind::SleepStarted)
+                    .filter(|event| event.event_type != /* ~ changed by cargo-mutants ~ */ EventKind::SleepStarted)
                     .cloned(),
             );
             pending_work_starts.extend(
                 result
                     .appended_events
                     .iter()
                     .filter(|event| event.event_type == EventKind::WorkBlockStarted)
                     .cloned(),

---- scheduler::no_human::tests::advance_catches_up_intervening_ticks_before_later_proposal stdout ----

thread 'scheduler::no_human::tests::advance_catches_up_intervening_ticks_before_later_proposal' (12128) panicked at crates/tracewake-core/src/scheduler.rs:3229:18:
sleep completion at tick 2 must fire before tick 3 proposal

failures:
    scheduler::no_human::tests::advance_catches_up_intervening_ticks_before_later_proposal

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
