*** crates/tracewake-core/src/scheduler.rs:2232:54: replace == with != in no_human::advance_no_human

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace == with != in no_human::advance_no_human
@@ -2224,17 +2224,17 @@
                     .iter()
                     .filter(|event| event.event_type == EventKind::SleepStarted)
                     .cloned(),
             );
             pending_work_starts.extend(
                 result
                     .appended_events
                     .iter()
-                    .filter(|event| event.event_type == EventKind::WorkBlockStarted)
+                    .filter(|event| event.event_type != /* ~ changed by cargo-mutants ~ */ EventKind::WorkBlockStarted)
                     .cloned(),
             );
             ordinary_pipeline_events += no_human_progress_event_count(&result.appended_events);
         }
 
         let final_tick = start_tick.advance_by(tick_count);
         for expected_tick in scheduler.current_tick.value().saturating_add(1)..=final_tick.value() {
             let due_tick = scheduler.advance_one_tick();

---- generated_sequences_replay_and_satisfy_metamorphic_locks stdout ----

thread 'generated_sequences_replay_and_satisfy_metamorphic_locks' (16896) panicked at crates/tracewake-core/tests/generative_lock.rs:490:14:
displacement mask emits work terminal caused by work start

failures:
    generated_sequences_replay_and_satisfy_metamorphic_locks

test result: FAILED. 1 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
