*** crates/tracewake-core/src/scheduler.rs:2235:38: replace += with -= in no_human::advance_no_human

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace += with -= in no_human::advance_no_human
@@ -2227,17 +2227,17 @@
             );
             pending_work_starts.extend(
                 result
                     .appended_events
                     .iter()
                     .filter(|event| event.event_type == EventKind::WorkBlockStarted)
                     .cloned(),
             );
-            ordinary_pipeline_events += no_human_progress_event_count(&result.appended_events);
+            ordinary_pipeline_events -= /* ~ changed by cargo-mutants ~ */ no_human_progress_event_count(&result.appended_events);
         }
 
         let final_tick = start_tick.advance_by(tick_count);
         for expected_tick in scheduler.current_tick.value().saturating_add(1)..=final_tick.value() {
             let due_tick = scheduler.advance_one_tick();
             debug_assert_eq!(due_tick, SimTick::new(expected_tick));
             append_due_completions(
                 physical_state,

---- scheduler::no_human::tests::advance_catches_up_intervening_ticks_before_later_proposal stdout ----

thread 'scheduler::no_human::tests::advance_catches_up_intervening_ticks_before_later_proposal' (21392) panicked at crates/tracewake-core/src/scheduler.rs:2235:13:
attempt to subtract with overflow

---- scheduler::no_human::tests::scheduled_proposal_uses_shared_pipeline stdout ----

thread 'scheduler::no_human::tests::scheduled_proposal_uses_shared_pipeline' (21420) panicked at crates/tracewake-core/src/scheduler.rs:2235:13:
attempt to subtract with overflow

---- scheduler::tests::no_human_scheduled_actions_use_shared_pipeline stdout ----

thread 'scheduler::tests::no_human_scheduled_actions_use_shared_pipeline' (21428) panicked at crates/tracewake-core/src/scheduler.rs:2235:13:
attempt to subtract with overflow

failures:
    scheduler::no_human::tests::advance_catches_up_intervening_ticks_before_later_proposal
    scheduler::no_human::tests::scheduled_proposal_uses_shared_pipeline
    scheduler::tests::no_human_scheduled_actions_use_shared_pipeline

test result: FAILED. 452 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
