*** crates/tracewake-core/src/scheduler.rs:2276:9: replace no_human::no_human_progress_event_count -> usize with 0

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace no_human::no_human_progress_event_count -> usize with 0
@@ -2268,20 +2268,17 @@
             final_tick: scheduler.current_tick,
             tick_count,
             marker_event_ids: vec![started.event_id, completed.event_id],
             ordinary_pipeline_events,
         }
     }
 
     fn no_human_progress_event_count(events: &[EventEnvelope]) -> usize {
-        events
-            .iter()
-            .filter(|event| is_no_human_progress_event(event))
-            .count()
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     fn is_no_human_progress_event(event: &EventEnvelope) -> bool {
         if event.event_type == EventKind::ActionRejected {
             return false;
         }
         if event.event_type != EventKind::ContinueRoutineProposed {
             return true;

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (30041) panicked at crates/tracewake-content/tests/fixtures_load.rs:1217:5:
assertion failed: report.ordinary_pipeline_events > 0

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
