*** crates/tracewake-core/src/scheduler.rs:2276:9: replace no_human::no_human_progress_event_count -> usize with 1

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace no_human::no_human_progress_event_count -> usize with 1
@@ -2268,20 +2268,17 @@
             final_tick: scheduler.current_tick,
             tick_count,
             marker_event_ids: vec![started.event_id, completed.event_id],
             ordinary_pipeline_events,
         }
     }
 
     fn no_human_progress_event_count(events: &[EventEnvelope]) -> usize {
-        events
-            .iter()
-            .filter(|event| is_no_human_progress_event(event))
-            .count()
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     fn is_no_human_progress_event(event: &EventEnvelope) -> bool {
         if event.event_type == EventKind::ActionRejected {
             return false;
         }
         if event.event_type != EventKind::ContinueRoutineProposed {
             return true;

---- no_human_workplace_knowledge_requires_notice_channel stdout ----

thread 'no_human_workplace_knowledge_requires_notice_channel' (1652) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:3000:5:
assertion `left == right` failed
  left: 1
 right: 0

---- no_human_sleep_knowledge_requires_observation_or_record_channel stdout ----

thread 'no_human_sleep_knowledge_requires_observation_or_record_channel' (1651) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:3035:5:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    no_human_sleep_knowledge_requires_observation_or_record_channel
    no_human_workplace_knowledge_requires_notice_channel

test result: FAILED. 40 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.62s

*** result: Failure(101)
