*** crates/tracewake-core/src/scheduler.rs:2283:29: replace == with != in no_human::is_no_human_progress_event

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace == with != in no_human::is_no_human_progress_event
@@ -2275,17 +2275,17 @@
     fn no_human_progress_event_count(events: &[EventEnvelope]) -> usize {
         events
             .iter()
             .filter(|event| is_no_human_progress_event(event))
             .count()
     }
 
     fn is_no_human_progress_event(event: &EventEnvelope) -> bool {
-        if event.event_type == EventKind::ActionRejected {
+        if event.event_type != /* ~ changed by cargo-mutants ~ */ EventKind::ActionRejected {
             return false;
         }
         if event.event_type != EventKind::ContinueRoutineProposed {
             return true;
         }
         event
             .payload
             .iter()

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (13834) panicked at crates/tracewake-content/tests/fixtures_load.rs:1217:5:
assertion failed: report.ordinary_pipeline_events > 0

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
