*** crates/tracewake-core/src/scheduler.rs:2283:9: replace no_human::is_no_human_progress_event -> bool with true

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace no_human::is_no_human_progress_event -> bool with true
@@ -2275,26 +2275,17 @@
     fn no_human_progress_event_count(events: &[EventEnvelope]) -> usize {
         events
             .iter()
             .filter(|event| is_no_human_progress_event(event))
             .count()
     }
 
     fn is_no_human_progress_event(event: &EventEnvelope) -> bool {
-        if event.event_type == EventKind::ActionRejected {
-            return false;
-        }
-        if event.event_type != EventKind::ContinueRoutineProposed {
-            return true;
-        }
-        event
-            .payload
-            .iter()
-            .any(|field| field.key == "behavioral_progress" && field.value == "true")
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     fn append_marker(
         log: &mut EventLog,
         kind: EventKind,
         process_id: &ProcessId,
         tick: SimTick,
         sequence: u64,

---- no_human_sleep_knowledge_requires_observation_or_record_channel stdout ----

thread 'no_human_sleep_knowledge_requires_observation_or_record_channel' (5751) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:3035:5:
assertion `left == right` failed
  left: 1
 right: 0

---- no_human_workplace_knowledge_requires_notice_channel stdout ----

thread 'no_human_workplace_knowledge_requires_notice_channel' (5752) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:3000:5:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    no_human_sleep_knowledge_requires_observation_or_record_channel
    no_human_workplace_knowledge_requires_notice_channel

test result: FAILED. 40 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.63s

*** result: Failure(101)
