*** crates/tracewake-core/src/scheduler.rs:2283:9: replace no_human::is_no_human_progress_event -> bool with false

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace no_human::is_no_human_progress_event -> bool with false
@@ -2275,26 +2275,17 @@
     fn no_human_progress_event_count(events: &[EventEnvelope]) -> usize {
         events
             .iter()
             .filter(|event| is_no_human_progress_event(event))
             .count()
     }
 
     fn is_no_human_progress_event(event: &EventEnvelope) -> bool {
-        if event.event_type == EventKind::ActionRejected {
-            return false;
-        }
-        if event.event_type != EventKind::ContinueRoutineProposed {
-            return true;
-        }
-        event
-            .payload
-            .iter()
-            .any(|field| field.key == "behavioral_progress" && field.value == "true")
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     fn append_marker(
         log: &mut EventLog,
         kind: EventKind,
         process_id: &ProcessId,
         tick: SimTick,
         sequence: u64,

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (9803) panicked at crates/tracewake-content/tests/fixtures_load.rs:1217:5:
assertion failed: report.ordinary_pipeline_events > 0

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
