*** crates/tracewake-core/src/scheduler.rs:2330:17: replace == with != in no_human::append_marker

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace == with != in no_human::append_marker
@@ -2322,17 +2322,17 @@
                 vec![tick_count.to_string()],
                 "no_human_advance",
             ),
             content_manifest_id,
         );
         event.process_id = Some(process_id.clone());
         event.causes = vec![EventCause::Process(process_id.clone())];
         event.payload = vec![PayloadField::new("tick_count", tick_count.to_string())];
-        if kind == EventKind::NoHumanDayCompleted {
+        if kind != /* ~ changed by cargo-mutants ~ */ EventKind::NoHumanDayCompleted {
             event.payload.push(PayloadField::new(
                 "metrics_projection",
                 "no_human_day_metrics_v1",
             ));
         }
         event.effects_summary = "no-human advance process marker".to_string();
         log.append(event).expect("no-human marker is versioned")
     }

---- scheduler::no_human::tests::routine_failure_reason_marker_and_stuck_diagnostic_vocabulary_are_stable stdout ----

thread 'scheduler::no_human::tests::routine_failure_reason_marker_and_stuck_diagnostic_vocabulary_are_stable' (3611) panicked at crates/tracewake-core/src/scheduler.rs:3885:13:
assertion failed: day_completed.payload.iter().any(|field|
        {
            field.key == "metrics_projection" &&
                field.value == "no_human_day_metrics_v1"
        })

failures:
    scheduler::no_human::tests::routine_failure_reason_marker_and_stuck_diagnostic_vocabulary_are_stable

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
