*** crates/tracewake-core/src/scheduler.rs:2349:13: replace no_human::StuckDiagnosticKind::stable_id -> &'static str with ""

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace no_human::StuckDiagnosticKind::stable_id -> &'static str with ""
@@ -2341,21 +2341,17 @@
     enum StuckDiagnosticKind {
         WindowNoProgress,
         PastExpectedProgressWindow,
         RepeatedIdleWait,
     }
 
     impl StuckDiagnosticKind {
         const fn stable_id(self) -> &'static str {
-            match self {
-                Self::WindowNoProgress => "window_no_progress",
-                Self::PastExpectedProgressWindow => "past_expected_progress_window",
-                Self::RepeatedIdleWait => "repeated_idle_wait",
-            }
+            "" /* ~ changed by cargo-mutants ~ */
         }
 
         const fn concrete_blocker(self) -> &'static str {
             match self {
                 Self::WindowNoProgress => "no progress recorded in no-human day window",
                 Self::PastExpectedProgressWindow => "no progress past expected progress window",
                 Self::RepeatedIdleWait => "repeated idle/wait without typed progress reason",
             }

---- scheduler::no_human::tests::routine_failure_reason_marker_and_stuck_diagnostic_vocabulary_are_stable stdout ----

thread 'scheduler::no_human::tests::routine_failure_reason_marker_and_stuck_diagnostic_vocabulary_are_stable' (8171) panicked at crates/tracewake-core/src/scheduler.rs:3865:17:
assertion `left == right` failed
  left: ""
 right: "window_no_progress"

failures:
    scheduler::no_human::tests::routine_failure_reason_marker_and_stuck_diagnostic_vocabulary_are_stable

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
