*** crates/tracewake-core/src/scheduler.rs:2357:13: replace no_human::StuckDiagnosticKind::concrete_blocker -> &'static str with "xyzzy"

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace no_human::StuckDiagnosticKind::concrete_blocker -> &'static str with "xyzzy"
@@ -2349,21 +2349,17 @@
             match self {
                 Self::WindowNoProgress => "window_no_progress",
                 Self::PastExpectedProgressWindow => "past_expected_progress_window",
                 Self::RepeatedIdleWait => "repeated_idle_wait",
             }
         }
 
         const fn concrete_blocker(self) -> &'static str {
-            match self {
-                Self::WindowNoProgress => "no progress recorded in no-human day window",
-                Self::PastExpectedProgressWindow => "no progress past expected progress window",
-                Self::RepeatedIdleWait => "repeated idle/wait without typed progress reason",
-            }
+            "xyzzy" /* ~ changed by cargo-mutants ~ */
         }
 
         const fn actual_source(self) -> &'static str {
             match self {
                 Self::WindowNoProgress => "scheduler_no_progress_detection",
                 Self::PastExpectedProgressWindow => {
                     "routine_expected_next_progress_stuck_detection"
                 }

---- scheduler::no_human::tests::routine_failure_reason_marker_and_stuck_diagnostic_vocabulary_are_stable stdout ----

thread 'scheduler::no_human::tests::routine_failure_reason_marker_and_stuck_diagnostic_vocabulary_are_stable' (21848) panicked at crates/tracewake-core/src/scheduler.rs:3866:17:
assertion `left == right` failed
  left: "xyzzy"
 right: "no progress recorded in no-human day window"

failures:
    scheduler::no_human::tests::routine_failure_reason_marker_and_stuck_diagnostic_vocabulary_are_stable

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
