*** crates/tracewake-core/src/scheduler.rs:2365:13: replace no_human::StuckDiagnosticKind::actual_source -> &'static str with "xyzzy"

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace no_human::StuckDiagnosticKind::actual_source -> &'static str with "xyzzy"
@@ -2357,23 +2357,17 @@
             match self {
                 Self::WindowNoProgress => "no progress recorded in no-human day window",
                 Self::PastExpectedProgressWindow => "no progress past expected progress window",
                 Self::RepeatedIdleWait => "repeated idle/wait without typed progress reason",
             }
         }
 
         const fn actual_source(self) -> &'static str {
-            match self {
-                Self::WindowNoProgress => "scheduler_no_progress_detection",
-                Self::PastExpectedProgressWindow => {
-                    "routine_expected_next_progress_stuck_detection"
-                }
-                Self::RepeatedIdleWait => "routine_repeated_idle_wait_stuck_detection",
-            }
+            "xyzzy" /* ~ changed by cargo-mutants ~ */
         }
 
         const fn resulting_status(self) -> StuckResultingStatus {
             match self {
                 Self::WindowNoProgress => StuckResultingStatus::Idle,
                 Self::PastExpectedProgressWindow | Self::RepeatedIdleWait => {
                     StuckResultingStatus::Waiting
                 }

---- scheduler::no_human::tests::no_human_day_detects_routine_past_expected_progress_window stdout ----

thread 'scheduler::no_human::tests::no_human_day_detects_routine_past_expected_progress_window' (30952) panicked at crates/tracewake-core/src/scheduler.rs:4194:13:
assertion failed: report.stuck_diagnostic_event_ids.iter().any(|event_id|
        {
            log.events().iter().find(|event|
                        &event.event_id ==
                            event_id).is_some_and(|event|
                    {
                        event.payload.iter().any(|field|
                                {
                                    field.key == "actual_source" &&
                                        field.value ==
                                            "routine_expected_next_progress_stuck_detection"

---- scheduler::no_human::tests::no_human_day_detects_repeated_idle_wait stdout ----

thread 'scheduler::no_human::tests::no_human_day_detects_repeated_idle_wait' (30951) panicked at crates/tracewake-core/src/scheduler.rs:4254:13:
assertion failed: report.stuck_diagnostic_event_ids.iter().any(|event_id|
        {
            log.events().iter().find(|event|
                        &event.event_id ==
                            event_id).is_some_and(|event|
                    {
                        event.payload.iter().any(|field|
                                {
                                    field.key == "actual_source" &&
                                        field.value == "routine_repeated_idle_wait_stuck_detection"
                                })

failures:
    scheduler::no_human::tests::no_human_day_detects_repeated_idle_wait
    scheduler::no_human::tests::no_human_day_detects_routine_past_expected_progress_window

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
