*** crates/tracewake-core/src/scheduler.rs:278:29: replace <= with > in no_human::DayWindow::contains_tick

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace <= with > in no_human::DayWindow::contains_tick
@@ -270,17 +270,17 @@
         pub start_tick: SimTick,
         pub end_tick: SimTick,
     }
 
     impl DayWindow {
         /// True when `tick` falls within this window's inclusive
         /// `[start_tick, end_tick]` range.
         fn contains_tick(&self, tick: SimTick) -> bool {
-            self.start_tick <= tick && tick <= self.end_tick
+            self.start_tick > /* ~ changed by cargo-mutants ~ */ tick && tick <= self.end_tick
         }
     }
 
     #[derive(Clone, Debug, PartialEq, Eq)]
     pub struct NoHumanDayConfig {
         pub actor_ids: Vec<ActorId>,
         pub windows: Vec<DayWindow>,
     }

---- scheduler::no_human::tests::completion_credit_uses_completion_tick_for_late_processed_duration stdout ----

thread 'scheduler::no_human::tests::completion_credit_uses_completion_tick_for_late_processed_duration' (29050) panicked at crates/tracewake-core/src/scheduler.rs:4084:13:
assertion failed: progress_by_window_actor.contains_key(&("middle".to_string(),
            actor_id.clone()))

---- scheduler::no_human::tests::day_window_contains_tick_uses_inclusive_bounds stdout ----

thread 'scheduler::no_human::tests::day_window_contains_tick_uses_inclusive_bounds' (29052) panicked at crates/tracewake-core/src/scheduler.rs:2535:13:
assertion failed: window.contains_tick(SimTick::new(15))

---- scheduler::no_human::tests::default_day_windows_are_disjoint_and_cover stdout ----

thread 'scheduler::no_human::tests::default_day_windows_are_disjoint_and_cover' (29053) panicked at crates/tracewake-core/src/scheduler.rs:2580:17:
assertion `left == right` failed: tick 0 must belong to exactly one default day window: ["morning", "work_window", "evening", "night"]
  left: 4
 right: 1

failures:
    scheduler::no_human::tests::completion_credit_uses_completion_tick_for_late_processed_duration
    scheduler::no_human::tests::day_window_contains_tick_uses_inclusive_bounds
    scheduler::no_human::tests::default_day_windows_are_disjoint_and_cover

test result: FAILED. 452 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
