*** crates/tracewake-core/src/scheduler.rs:328:9: replace no_human::default_day_windows -> Vec<DayWindow> with vec![]

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace no_human::default_day_windows -> Vec<DayWindow> with vec![]
@@ -320,30 +320,17 @@
                 start_event_id: error.start_event_id,
                 first_terminal_event_id: error.first_terminal_event_id,
                 duplicate_terminal_event_id: error.duplicate_terminal_event_id,
             }
         }
     }
 
     pub fn default_day_windows(start_tick: SimTick) -> Vec<DayWindow> {
-        [
-            ("pre_dawn", 0, 3),
-            ("morning", 4, 9),
-            ("work_window", 10, 17),
-            ("evening", 18, 23),
-            ("night", 24, 32),
-        ]
-        .into_iter()
-        .map(|(window_id, start_offset, end_offset)| DayWindow {
-            window_id: window_id.to_string(),
-            start_tick: start_tick.advance_by(start_offset),
-            end_tick: start_tick.advance_by(end_offset),
-        })
-        .collect()
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn run_no_human_day(
         state: &mut PhysicalState,
         agent_state: &mut AgentState,
         log: &mut EventLog,
         registry: &ActionRegistry,
         content_manifest_id: ContentManifestId,

---- episode_tamper_proration_poisons_replay stdout ----

thread 'episode_tamper_proration_poisons_replay' (5276) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2851:5:
assertion failed: has_event(&log, EventKind::SleepInterrupted)

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (5283) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2154:5:
assertion failed: report.ordinary_pipeline_events > 0

---- no_human_decision_context_hash_gate_fails_when_source_evidence_tampered stdout ----

thread 'no_human_decision_context_hash_gate_fails_when_source_evidence_tampered' (5286) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:811:5:
fixture contains decision trace event

failures:
    episode_tamper_proration_poisons_replay
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    no_human_decision_context_hash_gate_fails_when_source_evidence_tampered
    sleep_spanning_window_boundary_charges_each_tick_once

test result: FAILED. 37 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
