*** crates/tracewake-core/src/scheduler.rs:34:9: replace ProposalSequence::value -> u64 with 0

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace ProposalSequence::value -> u64 with 0
@@ -26,17 +26,17 @@
 pub struct ProposalSequence(u64);
 
 impl ProposalSequence {
     pub const fn new(value: u64) -> Self {
         Self(value)
     }
 
     pub const fn value(self) -> u64 {
-        self.0
+        0 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Debug, Default, PartialEq, Eq)]
 pub struct ProposalSequenceAssigner {
     next: u64,
 }

---- seed_event_log_order_and_projection_provenance_are_causal_and_stable stdout ----

thread 'seed_event_log_order_and_projection_provenance_are_causal_and_stable' (7897) panicked at crates/tracewake-content/tests/fixtures_load.rs:936:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    seed_event_log_order_and_projection_provenance_are_causal_and_stable

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
