*** crates/tracewake-core/src/scheduler.rs:404:20: delete ! in no_human::run_no_human_day

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ delete ! in no_human::run_no_human_day
@@ -396,17 +396,17 @@
         let mut last_decision_tick_by_actor = config
             .actor_ids
             .iter()
             .cloned()
             .map(|actor_id| (actor_id, SimTick::ZERO))
             .collect::<BTreeMap<_, _>>();
         for window in &config.windows {
             for actor_id in &config.actor_ids {
-                if !state.actors.contains_key(actor_id) {
+                if  /* ~ changed by cargo-mutants ~ */state.actors.contains_key(actor_id) {
                     continue;
                 }
                 if let Err(error) = crate::need_accounting::open_body_exclusive_starts(
                     log,
                     actor_id,
                     window.start_tick,
                 ) {
                     scheduler_errors.push(error.into());

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (9365) panicked at crates/tracewake-content/tests/fixtures_load.rs:1217:5:
assertion failed: report.ordinary_pipeline_events > 0

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
