*** crates/tracewake-core/src/scheduler.rs:49:9: replace ProposalSequenceAssigner::assign_next -> ProposalSequence with Default::default()

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace ProposalSequenceAssigner::assign_next -> ProposalSequence with Default::default()
@@ -41,19 +41,17 @@
 }
 
 impl ProposalSequenceAssigner {
     pub const fn new() -> Self {
         Self { next: 0 }
     }
 
     pub fn assign_next(&mut self) -> ProposalSequence {
-        let assigned = ProposalSequence::new(self.next);
-        self.next += 1;
-        assigned
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
 pub struct OrderingKey {
     pub sim_tick: SimTick,
     pub phase: SchedulePhase,
     pub source_id: SchedulerSourceId,

---- scheduler::tests::proposal_sequence_assignment_is_monotonic stdout ----

thread 'scheduler::tests::proposal_sequence_assignment_is_monotonic' (16468) panicked at crates/tracewake-core/src/scheduler.rs:5440:9:
assertion `left == right` failed
  left: ProposalSequence(0)
 right: ProposalSequence(1)

---- scheduler::tests::scheduler_advance_changes_only_tick_and_sequence_state stdout ----

thread 'scheduler::tests::scheduler_advance_changes_only_tick_and_sequence_state' (16470) panicked at crates/tracewake-core/src/scheduler.rs:5454:9:
assertion `left == right` failed
  left: ProposalSequence(0)
 right: ProposalSequence(1)

failures:
    scheduler::tests::proposal_sequence_assignment_is_monotonic
    scheduler::tests::scheduler_advance_changes_only_tick_and_sequence_state

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
