*** crates/tracewake-core/src/scheduler.rs:50:19: replace += with -= in ProposalSequenceAssigner::assign_next

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace += with -= in ProposalSequenceAssigner::assign_next
@@ -42,17 +42,17 @@
 
 impl ProposalSequenceAssigner {
     pub const fn new() -> Self {
         Self { next: 0 }
     }
 
     pub fn assign_next(&mut self) -> ProposalSequence {
         let assigned = ProposalSequence::new(self.next);
-        self.next += 1;
+        self.next -= /* ~ changed by cargo-mutants ~ */ 1;
         assigned
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
 pub struct OrderingKey {
     pub sim_tick: SimTick,
     pub phase: SchedulePhase,

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (20519) panicked at crates/tracewake-core/src/scheduler.rs:50:9:
attempt to subtract with overflow

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
