*** crates/tracewake-core/src/scheduler.rs:553:42: replace += with *= in no_human::run_no_human_day

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace += with *= in no_human::run_no_human_day
@@ -545,17 +545,17 @@
                 pending_work_starts.extend(
                     result
                         .appended_events
                         .iter()
                         .filter(|event| is_due_work_start(event, final_tick))
                         .cloned(),
                 );
                 let progress_events = no_human_progress_event_count(&result.appended_events);
-                ordinary_pipeline_events += progress_events;
+                ordinary_pipeline_events *= /* ~ changed by cargo-mutants ~ */ progress_events;
                 record_window_progress(
                     &mut progress_by_window_actor,
                     &window.window_id,
                     actor_id,
                     progress_events,
                 );
                 append_intention_lifecycle_after_proposal(
                     log,

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (17427) panicked at crates/tracewake-content/tests/fixtures_load.rs:1217:5:
assertion failed: report.ordinary_pipeline_events > 0

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
