*** crates/tracewake-core/src/scheduler.rs:637:20: delete ! in no_human::run_no_human_day

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ delete ! in no_human::run_no_human_day
@@ -629,17 +629,17 @@
                 if !state.actors.contains_key(actor_id) {
                     continue;
                 }
                 if duration_skip_by_window_actor
                     .contains(&(window.window_id.clone(), actor_id.clone()))
                 {
                     continue;
                 }
-                if !progress_by_window_actor
+                if  /* ~ changed by cargo-mutants ~ */progress_by_window_actor
                     .contains_key(&(window.window_id.clone(), actor_id.clone()))
                 {
                     let event = append_stuck_diagnostic(
                         log,
                         &process_id,
                         actor_id,
                         window,
                         &content_manifest_id,

---- no_human_sleep_knowledge_requires_observation_or_record_channel stdout ----

thread 'no_human_sleep_knowledge_requires_observation_or_record_channel' (25604) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:3036:5:
assertion failed: !report.stuck_diagnostic_event_ids.is_empty()

---- no_human_workplace_knowledge_requires_notice_channel stdout ----

thread 'no_human_workplace_knowledge_requires_notice_channel' (25605) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:3001:5:
assertion failed: !report.stuck_diagnostic_event_ids.is_empty()

failures:
    no_human_sleep_knowledge_requires_observation_or_record_channel
    no_human_workplace_knowledge_requires_notice_channel

test result: FAILED. 40 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.68s

*** result: Failure(101)
