*** crates/tracewake-core/src/scheduler.rs:687:9: replace no_human::is_due_sleep_start -> bool with true

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace no_human::is_due_sleep_start -> bool with true
@@ -679,18 +679,17 @@
             marker_event_ids: vec![started.event_id, completed.event_id],
             ordinary_pipeline_events,
             stuck_diagnostic_event_ids,
             scheduler_errors,
         }
     }
 
     fn is_due_sleep_start(event: &EventEnvelope, final_tick: SimTick) -> bool {
-        event.event_type == EventKind::SleepStarted
-            && scheduled_completion_tick(event).is_some_and(|tick| tick <= final_tick)
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     fn is_due_work_start(event: &EventEnvelope, final_tick: SimTick) -> bool {
         event.event_type == EventKind::WorkBlockStarted
             && scheduled_completion_tick(event).is_some_and(|tick| tick <= final_tick)
     }
 
     fn record_window_progress(

---- scheduler::no_human::tests::no_human_day_due_start_filters_and_progress_recording_are_exact stdout ----

thread 'scheduler::no_human::tests::no_human_day_due_start_filters_and_progress_recording_are_exact' (30137) panicked at crates/tracewake-core/src/scheduler.rs:3664:13:
assertion failed: !is_due_sleep_start(&sleep_start, SimTick::new(1))

failures:
    scheduler::no_human::tests::no_human_day_due_start_filters_and_progress_recording_are_exact

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
