*** crates/tracewake-core/src/scheduler.rs:688:73: replace <= with > in no_human::is_due_sleep_start

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace <= with > in no_human::is_due_sleep_start
@@ -680,17 +680,17 @@
             ordinary_pipeline_events,
             stuck_diagnostic_event_ids,
             scheduler_errors,
         }
     }
 
     fn is_due_sleep_start(event: &EventEnvelope, final_tick: SimTick) -> bool {
         event.event_type == EventKind::SleepStarted
-            && scheduled_completion_tick(event).is_some_and(|tick| tick <= final_tick)
+            && scheduled_completion_tick(event).is_some_and(|tick| tick > /* ~ changed by cargo-mutants ~ */ final_tick)
     }
 
     fn is_due_work_start(event: &EventEnvelope, final_tick: SimTick) -> bool {
         event.event_type == EventKind::WorkBlockStarted
             && scheduled_completion_tick(event).is_some_and(|tick| tick <= final_tick)
     }
 
     fn record_window_progress(

---- episode_tamper_proration_poisons_replay stdout ----

thread 'episode_tamper_proration_poisons_replay' (14540) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2851:5:
assertion failed: has_event(&log, EventKind::SleepInterrupted)

---- sleep_spanning_window_boundary_charges_each_tick_once stdout ----

thread 'sleep_spanning_window_boundary_charges_each_tick_once' (14574) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2529:5:
assertion failed: has_event(&log, EventKind::SleepCompleted)

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (14547) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2177:5:
assertion failed: has_no_human_event(&log, EventKind::SleepCompleted)

failures:
    episode_tamper_proration_poisons_replay
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    sleep_spanning_window_boundary_charges_each_tick_once

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.61s

*** result: Failure(101)
