*** crates/tracewake-core/src/scheduler.rs:692:9: replace no_human::is_due_work_start -> bool with true

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace no_human::is_due_work_start -> bool with true
@@ -684,18 +684,17 @@
     }
 
     fn is_due_sleep_start(event: &EventEnvelope, final_tick: SimTick) -> bool {
         event.event_type == EventKind::SleepStarted
             && scheduled_completion_tick(event).is_some_and(|tick| tick <= final_tick)
     }
 
     fn is_due_work_start(event: &EventEnvelope, final_tick: SimTick) -> bool {
-        event.event_type == EventKind::WorkBlockStarted
-            && scheduled_completion_tick(event).is_some_and(|tick| tick <= final_tick)
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     fn record_window_progress(
         progress_by_window_actor: &mut BTreeMap<(String, ActorId), usize>,
         window_id: &str,
         actor_id: &ActorId,
         progress_events: usize,
     ) {

---- scheduler::no_human::tests::no_human_day_due_start_filters_and_progress_recording_are_exact stdout ----

thread 'scheduler::no_human::tests::no_human_day_due_start_filters_and_progress_recording_are_exact' (19085) panicked at crates/tracewake-core/src/scheduler.rs:3665:13:
assertion failed: !is_due_work_start(&sleep_start, SimTick::new(2))

failures:
    scheduler::no_human::tests::no_human_day_due_start_filters_and_progress_recording_are_exact

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
