*** crates/tracewake-core/src/scheduler.rs:692:9: replace no_human::is_due_work_start -> bool with false

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace no_human::is_due_work_start -> bool with false
@@ -684,18 +684,17 @@
     }
 
     fn is_due_sleep_start(event: &EventEnvelope, final_tick: SimTick) -> bool {
         event.event_type == EventKind::SleepStarted
             && scheduled_completion_tick(event).is_some_and(|tick| tick <= final_tick)
     }
 
     fn is_due_work_start(event: &EventEnvelope, final_tick: SimTick) -> bool {
-        event.event_type == EventKind::WorkBlockStarted
-            && scheduled_completion_tick(event).is_some_and(|tick| tick <= final_tick)
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     fn record_window_progress(
         progress_by_window_actor: &mut BTreeMap<(String, ActorId), usize>,
         window_id: &str,
         actor_id: &ActorId,
         progress_events: usize,
     ) {

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (23205) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.61s

*** result: Failure(101)
