*** crates/tracewake-core/src/scheduler.rs:702:28: replace > with < in no_human::record_window_progress

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace > with < in no_human::record_window_progress
@@ -694,17 +694,17 @@
     }
 
     fn record_window_progress(
         progress_by_window_actor: &mut BTreeMap<(String, ActorId), usize>,
         window_id: &str,
         actor_id: &ActorId,
         progress_events: usize,
     ) {
-        if progress_events > 0 {
+        if progress_events < /* ~ changed by cargo-mutants ~ */ 0 {
             progress_by_window_actor
                 .insert((window_id.to_string(), actor_id.clone()), progress_events);
         }
     }
 
     struct BuiltAgentProposal {
         proposal: Proposal,
         decision_trace_record: DecisionTraceRecord,

---- scheduler::no_human::tests::no_human_day_due_start_filters_and_progress_recording_are_exact stdout ----

thread 'scheduler::no_human::tests::no_human_day_due_start_filters_and_progress_recording_are_exact' (16691) panicked at crates/tracewake-core/src/scheduler.rs:3678:13:
assertion `left == right` failed
  left: None
 right: Some(2)

failures:
    scheduler::no_human::tests::no_human_day_due_start_filters_and_progress_recording_are_exact

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
