*** crates/tracewake-core/src/scheduler.rs:702:28: replace > with >= in no_human::record_window_progress

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace > with >= in no_human::record_window_progress
@@ -694,17 +694,17 @@
     }
 
     fn record_window_progress(
         progress_by_window_actor: &mut BTreeMap<(String, ActorId), usize>,
         window_id: &str,
         actor_id: &ActorId,
         progress_events: usize,
     ) {
-        if progress_events > 0 {
+        if progress_events >= /* ~ changed by cargo-mutants ~ */ 0 {
             progress_by_window_actor
                 .insert((window_id.to_string(), actor_id.clone()), progress_events);
         }
     }
 
     struct BuiltAgentProposal {
         proposal: Proposal,
         decision_trace_record: DecisionTraceRecord,

---- no_human_workplace_knowledge_requires_notice_channel stdout ----

thread 'no_human_workplace_knowledge_requires_notice_channel' (20817) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:3001:5:
assertion failed: !report.stuck_diagnostic_event_ids.is_empty()

---- no_human_sleep_knowledge_requires_observation_or_record_channel stdout ----

thread 'no_human_sleep_knowledge_requires_observation_or_record_channel' (20816) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:3036:5:
assertion failed: !report.stuck_diagnostic_event_ids.is_empty()

failures:
    no_human_sleep_knowledge_requires_observation_or_record_channel
    no_human_workplace_knowledge_requires_notice_channel

test result: FAILED. 40 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.60s

*** result: Failure(101)
