*** crates/tracewake-core/src/scheduler.rs:702:9: replace no_human::record_window_progress with ()

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace no_human::record_window_progress with ()
@@ -694,20 +694,17 @@
     }
 
     fn record_window_progress(
         progress_by_window_actor: &mut BTreeMap<(String, ActorId), usize>,
         window_id: &str,
         actor_id: &ActorId,
         progress_events: usize,
     ) {
-        if progress_events > 0 {
-            progress_by_window_actor
-                .insert((window_id.to_string(), actor_id.clone()), progress_events);
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     struct BuiltAgentProposal {
         proposal: Proposal,
         decision_trace_record: DecisionTraceRecord,
     }
 
     fn build_agent_proposal(

---- scheduler::no_human::tests::no_human_day_due_start_filters_and_progress_recording_are_exact stdout ----

thread 'scheduler::no_human::tests::no_human_day_due_start_filters_and_progress_recording_are_exact' (8033) panicked at crates/tracewake-core/src/scheduler.rs:3675:13:
assertion `left == right` failed
  left: None
 right: Some(2)

failures:
    scheduler::no_human::tests::no_human_day_due_start_filters_and_progress_recording_are_exact

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
