*** crates/tracewake-core/src/scheduler.rs:790:9: replace no_human::latest_frame_event_id -> Option<EventId> with None

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace no_human::latest_frame_event_id -> Option<EventId> with None
@@ -782,26 +782,17 @@
             if apply_epistemic_event(&mut projection, event).is_err() {
                 continue;
             }
         }
         projection
     }
 
     fn latest_frame_event_id(log: &EventLog) -> Option<EventId> {
-        log.events()
-            .iter()
-            .rev()
-            .find(|event| {
-                matches!(
-                    event.event_type,
-                    EventKind::NoHumanDayStarted | EventKind::NoHumanAdvanceStarted
-                )
-            })
-            .map(|event| event.event_id.clone())
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     fn latest_current_place_perception_event_id(
         log: &EventLog,
         actor_id: &ActorId,
         tick: SimTick,
         place_id: &PlaceId,
     ) -> Option<EventId> {

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (28923) panicked at crates/tracewake-content/tests/fixtures_load.rs:1217:5:
assertion failed: report.ordinary_pipeline_events > 0

failures:
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
