*** crates/tracewake-core/src/scheduler.rs:813:21: replace && with || in no_human::latest_current_place_perception_event_id

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace && with || in no_human::latest_current_place_perception_event_id
@@ -805,17 +805,17 @@
         tick: SimTick,
         place_id: &PlaceId,
     ) -> Option<EventId> {
         log.events()
             .iter()
             .rev()
             .find(|event| {
                 event.event_type == EventKind::ObservationRecorded
-                    && event.actor_id.as_ref() == Some(actor_id)
+                    || /* ~ changed by cargo-mutants ~ */ event.actor_id.as_ref() == Some(actor_id)
                     && event.sim_tick == tick
                     && event.place_id.as_ref() == Some(place_id)
             })
             .map(|event| event.event_id.clone())
     }
 
     fn latest_need_event_id(log: &EventLog, actor_id: &ActorId) -> Option<EventId> {
         log.events()

---- scheduler::no_human::tests::no_human_log_witness_lookups_require_exact_event_shape stdout ----

thread 'scheduler::no_human::tests::no_human_log_witness_lookups_require_exact_event_shape' (14218) panicked at crates/tracewake-core/src/scheduler.rs:3543:13:
assertion `left == right` failed
  left: "event.obs.exact"
 right: "event.obs.other_place"

failures:
    scheduler::no_human::tests::no_human_log_witness_lookups_require_exact_event_shape

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
