*** crates/tracewake-core/src/scheduler.rs:814:39: replace == with != in no_human::latest_current_place_perception_event_id

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace == with != in no_human::latest_current_place_perception_event_id
@@ -806,17 +806,17 @@
         place_id: &PlaceId,
     ) -> Option<EventId> {
         log.events()
             .iter()
             .rev()
             .find(|event| {
                 event.event_type == EventKind::ObservationRecorded
                     && event.actor_id.as_ref() == Some(actor_id)
-                    && event.sim_tick == tick
+                    && event.sim_tick != /* ~ changed by cargo-mutants ~ */ tick
                     && event.place_id.as_ref() == Some(place_id)
             })
             .map(|event| event.event_id.clone())
     }
 
     fn latest_need_event_id(log: &EventLog, actor_id: &ActorId) -> Option<EventId> {
         log.events()
             .iter()

---- no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash stdout ----

thread 'no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash' (26529) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2907:5:

---- severe_safety_with_known_exit_produces_move_and_replays stdout ----

thread 'severe_safety_with_known_exit_produces_move_and_replays' (26551) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1735:5:

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (26527) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    no_human_decision_actor_known_inputs_cite_log_events_and_recompute_hash
    severe_safety_with_known_exit_produces_move_and_replays

test result: FAILED. 38 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.60s

*** result: Failure(101)
