*** crates/tracewake-core/src/scheduler.rs:821:9: replace no_human::latest_need_event_id -> Option<EventId> with None

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace no_human::latest_need_event_id -> Option<EventId> with None
@@ -813,25 +813,17 @@
                     && event.actor_id.as_ref() == Some(actor_id)
                     && event.sim_tick == tick
                     && event.place_id.as_ref() == Some(place_id)
             })
             .map(|event| event.event_id.clone())
     }
 
     fn latest_need_event_id(log: &EventLog, actor_id: &ActorId) -> Option<EventId> {
-        log.events()
-            .iter()
-            .rev()
-            .find(|event| {
-                event.event_type == EventKind::NeedDeltaApplied
-                    && (event.actor_id.as_ref() == Some(actor_id)
-                        || payload_value(event, "actor_id") == Some(actor_id.as_str()))
-            })
-            .map(|event| event.event_id.clone())
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     fn routine_window_family(
         agent_state: &AgentState,
         actor_id: &ActorId,
         window: &DayWindow,
         actor_known_state: &ActorKnownPlanningContext,
     ) -> Option<RoutineFamily> {

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (2258) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2726:5:

failures:
    no_human_day_real_run_replays_metrics_and_trace_projection

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.57s

*** result: Failure(101)
