*** crates/tracewake-core/src/scheduler.rs:826:49: replace == with != in no_human::latest_need_event_id

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace == with != in no_human::latest_need_event_id
@@ -818,17 +818,17 @@
     }
 
     fn latest_need_event_id(log: &EventLog, actor_id: &ActorId) -> Option<EventId> {
         log.events()
             .iter()
             .rev()
             .find(|event| {
                 event.event_type == EventKind::NeedDeltaApplied
-                    && (event.actor_id.as_ref() == Some(actor_id)
+                    && (event.actor_id.as_ref() != /* ~ changed by cargo-mutants ~ */ Some(actor_id)
                         || payload_value(event, "actor_id") == Some(actor_id.as_str()))
             })
             .map(|event| event.event_id.clone())
     }
 
     fn routine_window_family(
         agent_state: &AgentState,
         actor_id: &ActorId,

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (18991) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2726:5:

failures:
    no_human_day_real_run_replays_metrics_and_trace_projection

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.61s

*** result: Failure(101)
