*** crates/tracewake-core/src/scheduler.rs:827:25: replace || with && in no_human::latest_need_event_id

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace || with && in no_human::latest_need_event_id
@@ -819,17 +819,17 @@
 
     fn latest_need_event_id(log: &EventLog, actor_id: &ActorId) -> Option<EventId> {
         log.events()
             .iter()
             .rev()
             .find(|event| {
                 event.event_type == EventKind::NeedDeltaApplied
                     && (event.actor_id.as_ref() == Some(actor_id)
-                        || payload_value(event, "actor_id") == Some(actor_id.as_str()))
+                        && /* ~ changed by cargo-mutants ~ */ payload_value(event, "actor_id") == Some(actor_id.as_str()))
             })
             .map(|event| event.event_id.clone())
     }
 
     fn routine_window_family(
         agent_state: &AgentState,
         actor_id: &ActorId,
         window: &DayWindow,

---- scheduler::no_human::tests::no_human_log_witness_lookups_require_exact_event_shape stdout ----

thread 'scheduler::no_human::tests::no_human_log_witness_lookups_require_exact_event_shape' (14879) panicked at crates/tracewake-core/src/scheduler.rs:3604:57:
called `Option::unwrap()` on a `None` value

failures:
    scheduler::no_human::tests::no_human_log_witness_lookups_require_exact_event_shape

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
