*** crates/tracewake-core/src/scheduler.rs:838:9: replace no_human::routine_window_family -> Option<RoutineFamily> with None

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace no_human::routine_window_family -> Option<RoutineFamily> with None
@@ -830,28 +830,17 @@
     }
 
     fn routine_window_family(
         agent_state: &AgentState,
         actor_id: &ActorId,
         window: &DayWindow,
         actor_known_state: &ActorKnownPlanningContext,
     ) -> Option<RoutineFamily> {
-        let family = eligible_routine_execution_for_actor(agent_state, actor_id, window)
-            .map(|(_, execution)| execution.family)?;
-        if family == RoutineFamily::WorkBlock
-            && !actor_known_state
-                .known_workplaces()
-                .values()
-                .any(|place_id| place_id == actor_known_state.current_place_id())
-        {
-            Some(RoutineFamily::GoToWork)
-        } else {
-            Some(family)
-        }
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     fn eligible_routine_execution_for_actor<'a>(
         agent_state: &'a AgentState,
         actor_id: &ActorId,
         window: &DayWindow,
     ) -> Option<(&'a RoutineExecutionId, &'a crate::agent::RoutineExecution)> {
         agent_state

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (27188) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (27189) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2714:5:
assertion failed: has_event(&log, EventKind::ActorMoved)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection

test result: FAILED. 40 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.50s

*** result: Failure(101)
