*** crates/tracewake-core/src/scheduler.rs:840:19: replace == with != in no_human::routine_window_family

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace == with != in no_human::routine_window_family
@@ -832,17 +832,17 @@
     fn routine_window_family(
         agent_state: &AgentState,
         actor_id: &ActorId,
         window: &DayWindow,
         actor_known_state: &ActorKnownPlanningContext,
     ) -> Option<RoutineFamily> {
         let family = eligible_routine_execution_for_actor(agent_state, actor_id, window)
             .map(|(_, execution)| execution.family)?;
-        if family == RoutineFamily::WorkBlock
+        if family != /* ~ changed by cargo-mutants ~ */ RoutineFamily::WorkBlock
             && !actor_known_state
                 .known_workplaces()
                 .values()
                 .any(|place_id| place_id == actor_known_state.current_place_id())
         {
             Some(RoutineFamily::GoToWork)
         } else {
             Some(family)

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (2930) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.60s

*** result: Failure(101)
