*** crates/tracewake-core/src/scheduler.rs:857:9: replace no_human::eligible_routine_execution_for_actor -> Option<(&'a RoutineExecutionId, &'a crate::agent::RoutineExecution)> with None

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace no_human::eligible_routine_execution_for_actor -> Option<(&'a RoutineExecutionId, &'a crate::agent::RoutineExecution)> with None
@@ -849,40 +849,17 @@
         }
     }
 
     fn eligible_routine_execution_for_actor<'a>(
         agent_state: &'a AgentState,
         actor_id: &ActorId,
         window: &DayWindow,
     ) -> Option<(&'a RoutineExecutionId, &'a crate::agent::RoutineExecution)> {
-        agent_state
-            .routine_executions
-            .iter()
-            .filter(|(_, execution)| &execution.actor_id == actor_id)
-            .filter(|(_, execution)| {
-                execution.start_tick <= window.start_tick
-                    && execution
-                        .deadline_tick
-                        .is_none_or(|deadline| window.start_tick < deadline)
-            })
-            .filter(|(_, execution)| {
-                !matches!(
-                    execution.step_status,
-                    crate::agent::RoutineStepStatus::Completed
-                        | crate::agent::RoutineStepStatus::Failed
-                        | crate::agent::RoutineStepStatus::Interrupted
-                        | crate::agent::RoutineStepStatus::Abandoned
-                )
-            })
-            .min_by(|(_, left), (_, right)| {
-                left.start_tick
-                    .cmp(&right.start_tick)
-                    .then_with(|| left.execution_id.cmp(&right.execution_id))
-            })
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     fn active_intention_for_actor(
         agent_state: &AgentState,
         actor_id: &ActorId,
     ) -> Option<Intention> {
         let intention_id = agent_state.active_intention_by_actor.get(actor_id)?;
         agent_state.intentions.get(intention_id).cloned()

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (15228) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (15229) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2714:5:
assertion failed: has_event(&log, EventKind::ActorMoved)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection

test result: FAILED. 40 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.51s

*** result: Failure(101)
