*** crates/tracewake-core/src/scheduler.rs:862:38: replace <= with > in no_human::eligible_routine_execution_for_actor

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace <= with > in no_human::eligible_routine_execution_for_actor
@@ -854,17 +854,17 @@
         actor_id: &ActorId,
         window: &DayWindow,
     ) -> Option<(&'a RoutineExecutionId, &'a crate::agent::RoutineExecution)> {
         agent_state
             .routine_executions
             .iter()
             .filter(|(_, execution)| &execution.actor_id == actor_id)
             .filter(|(_, execution)| {
-                execution.start_tick <= window.start_tick
+                execution.start_tick > /* ~ changed by cargo-mutants ~ */ window.start_tick
                     && execution
                         .deadline_tick
                         .is_none_or(|deadline| window.start_tick < deadline)
             })
             .filter(|(_, execution)| {
                 !matches!(
                     execution.step_status,
                     crate::agent::RoutineStepStatus::Completed

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (27997) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.59s

*** result: Failure(101)
