*** crates/tracewake-core/src/scheduler.rs:863:21: replace && with || in no_human::eligible_routine_execution_for_actor

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace && with || in no_human::eligible_routine_execution_for_actor
@@ -855,17 +855,17 @@
         window: &DayWindow,
     ) -> Option<(&'a RoutineExecutionId, &'a crate::agent::RoutineExecution)> {
         agent_state
             .routine_executions
             .iter()
             .filter(|(_, execution)| &execution.actor_id == actor_id)
             .filter(|(_, execution)| {
                 execution.start_tick <= window.start_tick
-                    && execution
+                    || /* ~ changed by cargo-mutants ~ */ execution
                         .deadline_tick
                         .is_none_or(|deadline| window.start_tick < deadline)
             })
             .filter(|(_, execution)| {
                 !matches!(
                     execution.step_status,
                     crate::agent::RoutineStepStatus::Completed
                         | crate::agent::RoutineStepStatus::Failed

---- scheduler::no_human::tests::routine_execution_selection_excludes_deadline_expired_execution stdout ----

thread 'scheduler::no_human::tests::routine_execution_selection_excludes_deadline_expired_execution' (23889) panicked at crates/tracewake-core/src/scheduler.rs:4145:13:
assertion `left == right` failed
  left: Some(RoutineExecutionId(StableId("routine_exec_deadline_expired")))
 right: Some(RoutineExecutionId(StableId("routine_exec_live")))

---- scheduler::no_human::tests::routine_window_family_excludes_not_yet_started_execution_at_window_start stdout ----

thread 'scheduler::no_human::tests::routine_window_family_excludes_not_yet_started_execution_at_window_start' (23892) panicked at crates/tracewake-core/src/scheduler.rs:4027:13:
assertion `left == right` failed
  left: Some(EatMeal)
 right: None

failures:
    scheduler::no_human::tests::routine_execution_selection_excludes_deadline_expired_execution
    scheduler::no_human::tests::routine_window_family_excludes_not_yet_started_execution_at_window_start

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
