*** crates/tracewake-core/src/scheduler.rs:865:66: replace < with <= in no_human::eligible_routine_execution_for_actor

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace < with <= in no_human::eligible_routine_execution_for_actor
@@ -857,17 +857,17 @@
         agent_state
             .routine_executions
             .iter()
             .filter(|(_, execution)| &execution.actor_id == actor_id)
             .filter(|(_, execution)| {
                 execution.start_tick <= window.start_tick
                     && execution
                         .deadline_tick
-                        .is_none_or(|deadline| window.start_tick < deadline)
+                        .is_none_or(|deadline| window.start_tick <= /* ~ changed by cargo-mutants ~ */ deadline)
             })
             .filter(|(_, execution)| {
                 !matches!(
                     execution.step_status,
                     crate::agent::RoutineStepStatus::Completed
                         | crate::agent::RoutineStepStatus::Failed
                         | crate::agent::RoutineStepStatus::Interrupted
                         | crate::agent::RoutineStepStatus::Abandoned

---- scheduler::no_human::tests::routine_execution_selection_excludes_deadline_expired_execution stdout ----

thread 'scheduler::no_human::tests::routine_execution_selection_excludes_deadline_expired_execution' (8278) panicked at crates/tracewake-core/src/scheduler.rs:4145:13:
assertion `left == right` failed
  left: Some(RoutineExecutionId(StableId("routine_exec_deadline_expired")))
 right: Some(RoutineExecutionId(StableId("routine_exec_live")))

failures:
    scheduler::no_human::tests::routine_execution_selection_excludes_deadline_expired_execution

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
