*** crates/tracewake-core/src/scheduler.rs:868:17: delete ! in no_human::eligible_routine_execution_for_actor

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ delete ! in no_human::eligible_routine_execution_for_actor
@@ -860,17 +860,17 @@
             .filter(|(_, execution)| &execution.actor_id == actor_id)
             .filter(|(_, execution)| {
                 execution.start_tick <= window.start_tick
                     && execution
                         .deadline_tick
                         .is_none_or(|deadline| window.start_tick < deadline)
             })
             .filter(|(_, execution)| {
-                !matches!(
+                 /* ~ changed by cargo-mutants ~ */matches!(
                     execution.step_status,
                     crate::agent::RoutineStepStatus::Completed
                         | crate::agent::RoutineStepStatus::Failed
                         | crate::agent::RoutineStepStatus::Interrupted
                         | crate::agent::RoutineStepStatus::Abandoned
                 )
             })
             .min_by(|(_, left), (_, right)| {

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (12386) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (12387) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2714:5:
assertion failed: has_event(&log, EventKind::ActorMoved)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection

test result: FAILED. 40 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.51s

*** result: Failure(101)
