*** crates/tracewake-core/src/scheduler.rs:887:9: replace no_human::active_intention_for_actor -> Option<Intention> with None

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace no_human::active_intention_for_actor -> Option<Intention> with None
@@ -879,18 +879,17 @@
                     .then_with(|| left.execution_id.cmp(&right.execution_id))
             })
     }
 
     fn active_intention_for_actor(
         agent_state: &AgentState,
         actor_id: &ActorId,
     ) -> Option<Intention> {
-        let intention_id = agent_state.active_intention_by_actor.get(actor_id)?;
-        agent_state.intentions.get(intention_id).cloned()
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     enum PendingCompletion {
         Sleep(EventEnvelope),
         Work(EventEnvelope),
     }
 
     impl PendingCompletion {

---- scheduler::no_human::tests::active_intention_lookup_returns_live_actor_intention stdout ----

thread 'scheduler::no_human::tests::active_intention_lookup_returns_live_actor_intention' (16911) panicked at crates/tracewake-core/src/scheduler.rs:4673:13:
assertion `left == right` failed
  left: None

---- scheduler::no_human::tests::no_human_day_starts_continues_and_replays_active_intention stdout ----

thread 'scheduler::no_human::tests::no_human_day_starts_continues_and_replays_active_intention' (16932) panicked at crates/tracewake-core/src/scheduler.rs:4725:18:
later no-human action continues intention

failures:
    scheduler::no_human::tests::active_intention_lookup_returns_live_actor_intention
    scheduler::no_human::tests::no_human_day_starts_continues_and_replays_active_intention

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
