*** crates/tracewake-core/src/scheduler.rs:898:13: replace no_human::PendingCompletion::tick -> Option<SimTick> with None

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace no_human::PendingCompletion::tick -> Option<SimTick> with None
@@ -890,19 +890,17 @@
 
     enum PendingCompletion {
         Sleep(EventEnvelope),
         Work(EventEnvelope),
     }
 
     impl PendingCompletion {
         fn tick(&self) -> Option<SimTick> {
-            match self {
-                Self::Sleep(event) | Self::Work(event) => scheduled_completion_tick(event),
-            }
+            None /* ~ changed by cargo-mutants ~ */
         }
 
         fn event_id(&self) -> &EventId {
             match self {
                 Self::Sleep(event) | Self::Work(event) => &event.event_id,
             }
         }
     }

---- scheduler::no_human::tests::pending_completion_and_open_duration_checks_use_future_completion_tick stdout ----

thread 'scheduler::no_human::tests::pending_completion_and_open_duration_checks_use_future_completion_tick' (21506) panicked at crates/tracewake-core/src/scheduler.rs:3620:13:
assertion `left == right` failed
  left: None
 right: Some(SimTick(2))

failures:
    scheduler::no_human::tests::pending_completion_and_open_duration_checks_use_future_completion_tick

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
