*** crates/tracewake-core/src/scheduler.rs:923:9: replace no_human::append_due_completions -> Vec<(ActorId, SimTick)> with vec![]

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace no_human::append_due_completions -> Vec<(ActorId, SimTick)> with vec![]
@@ -915,56 +915,17 @@
         process_id: &ProcessId,
         scheduler: &mut DeterministicScheduler,
         content_manifest_id: &ContentManifestId,
         pending_sleep_starts: &mut Vec<EventEnvelope>,
         pending_work_starts: &mut Vec<EventEnvelope>,
         due_tick: SimTick,
         scheduler_errors: &mut Vec<NoHumanSchedulerError>,
     ) -> Vec<(ActorId, SimTick)> {
-        let mut due_completions = Vec::new();
-        let mut retained_sleep_starts = Vec::new();
-        for sleep_started in pending_sleep_starts.drain(..) {
-            if scheduled_completion_tick(&sleep_started).is_some_and(|tick| tick <= due_tick) {
-                due_completions.push(PendingCompletion::Sleep(sleep_started));
-            } else {
-                retained_sleep_starts.push(sleep_started);
-            }
-        }
-        *pending_sleep_starts = retained_sleep_starts;
-
-        let mut retained_work_starts = Vec::new();
-        for work_started in pending_work_starts.drain(..) {
-            if scheduled_completion_tick(&work_started).is_some_and(|tick| tick <= due_tick) {
-                due_completions.push(PendingCompletion::Work(work_started));
-            } else {
-                retained_work_starts.push(work_started);
-            }
-        }
-        *pending_work_starts = retained_work_starts;
-
-        due_completions.sort_by(|left, right| {
-            left.tick()
-                .cmp(&right.tick())
-                .then_with(|| left.event_id().cmp(right.event_id()))
-        });
-        let mut completed_durations = Vec::new();
-        for completion in due_completions {
-            completed_durations.extend(append_scheduled_completion(
-                state,
-                log,
-                agent_state,
-                process_id,
-                scheduler,
-                content_manifest_id,
-                completion,
-                scheduler_errors,
-            ));
-        }
-        completed_durations
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 
     #[allow(clippy::too_many_arguments)]
     fn append_scheduled_completion(
         state: &PhysicalState,
         log: &mut EventLog,
         agent_state: &mut AgentState,
         process_id: &ProcessId,

---- episode_tamper_proration_poisons_replay stdout ----

thread 'episode_tamper_proration_poisons_replay' (30178) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2851:5:
assertion failed: has_event(&log, EventKind::SleepInterrupted)

---- sleep_spanning_window_boundary_charges_each_tick_once stdout ----

thread 'sleep_spanning_window_boundary_charges_each_tick_once' (30212) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2529:5:
assertion failed: has_event(&log, EventKind::SleepCompleted)

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (30185) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

failures:
    episode_tamper_proration_poisons_replay
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    sleep_spanning_window_boundary_charges_each_tick_once

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.64s

*** result: Failure(101)
