*** crates/tracewake-core/src/scheduler.rs:926:82: replace <= with > in no_human::append_due_completions

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace <= with > in no_human::append_due_completions
@@ -918,17 +918,17 @@
         pending_sleep_starts: &mut Vec<EventEnvelope>,
         pending_work_starts: &mut Vec<EventEnvelope>,
         due_tick: SimTick,
         scheduler_errors: &mut Vec<NoHumanSchedulerError>,
     ) -> Vec<(ActorId, SimTick)> {
         let mut due_completions = Vec::new();
         let mut retained_sleep_starts = Vec::new();
         for sleep_started in pending_sleep_starts.drain(..) {
-            if scheduled_completion_tick(&sleep_started).is_some_and(|tick| tick <= due_tick) {
+            if scheduled_completion_tick(&sleep_started).is_some_and(|tick| tick > /* ~ changed by cargo-mutants ~ */ due_tick) {
                 due_completions.push(PendingCompletion::Sleep(sleep_started));
             } else {
                 retained_sleep_starts.push(sleep_started);
             }
         }
         *pending_sleep_starts = retained_sleep_starts;
 
         let mut retained_work_starts = Vec::new();

---- episode_tamper_proration_poisons_replay stdout ----

thread 'episode_tamper_proration_poisons_replay' (1821) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2851:5:
assertion failed: has_event(&log, EventKind::SleepInterrupted)

---- sleep_spanning_window_boundary_charges_each_tick_once stdout ----

thread 'sleep_spanning_window_boundary_charges_each_tick_once' (1855) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2529:5:
assertion failed: has_event(&log, EventKind::SleepCompleted)

failures:
    episode_tamper_proration_poisons_replay
    sleep_spanning_window_boundary_charges_each_tick_once

test result: FAILED. 40 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.63s

*** result: Failure(101)
