*** crates/tracewake-core/src/scheduler.rs:95:5: replace sort_scheduled with ()

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace sort_scheduled with ()
@@ -87,17 +87,17 @@
 
 #[derive(Clone, Debug, PartialEq, Eq)]
 pub struct Scheduled<T> {
     pub ordering_key: OrderingKey,
     pub payload: T,
 }
 
 pub fn sort_scheduled<T>(scheduled: &mut [Scheduled<T>]) {
-    scheduled.sort_by(|left, right| left.ordering_key.cmp(&right.ordering_key));
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn build_passive_need_delta_events(
     need_model: &NeedModelState,
     actor_ids: impl IntoIterator<Item = ActorId>,
     process_id: &ProcessId,
     start_tick: SimTick,
     elapsed_ticks: u64,

---- scheduler::tests::ordering_key_sort_is_independent_of_insertion_order stdout ----

thread 'scheduler::tests::ordering_key_sort_is_independent_of_insertion_order' (29615) panicked at crates/tracewake-core/src/scheduler.rs:5433:9:
assertion `left == right` failed

failures:
    scheduler::tests::ordering_key_sort_is_independent_of_insertion_order

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
