*** crates/tracewake-core/src/scheduler.rs:976:9: replace no_human::append_scheduled_completion -> Vec<(ActorId, SimTick)> with vec![]

*** mutation diff:
--- crates/tracewake-core/src/scheduler.rs
+++ replace no_human::append_scheduled_completion -> Vec<(ActorId, SimTick)> with vec![]
@@ -968,132 +968,17 @@
         log: &mut EventLog,
         agent_state: &mut AgentState,
         process_id: &ProcessId,
         scheduler: &mut DeterministicScheduler,
         content_manifest_id: &ContentManifestId,
         completion: PendingCompletion,
         scheduler_errors: &mut Vec<NoHumanSchedulerError>,
     ) -> Vec<(ActorId, SimTick)> {
-        let mut completed_durations = Vec::new();
-        match completion {
-            PendingCompletion::Sleep(sleep_started) => {
-                let Some(completion_tick) = scheduled_completion_tick(&sleep_started) else {
-                    return completed_durations;
-                };
-                let actor_id = sleep_started
-                    .actor_id
-                    .as_ref()
-                    .map(|actor_id| actor_id.as_str().to_string())
-                    .unwrap_or_default();
-                let ordering_key = OrderingKey::new(
-                    completion_tick,
-                    SchedulePhase::NoHumanProcess,
-                    SchedulerSourceId::Process(process_id.clone()),
-                    scheduler.assign_proposal_sequence(),
-                    ActionId::new("sleep_completed").unwrap(),
-                    vec![actor_id],
-                    format!("sleep_completed:{}", sleep_started.event_id.as_str()),
-                );
-                let events = match build_sleep_completion_events(
-                    state,
-                    agent_state,
-                    log,
-                    &sleep_started,
-                    &ordering_key,
-                    content_manifest_id,
-                    completion_tick,
-                ) {
-                    Ok(events) => events,
-                    Err(error) => {
-                        scheduler_errors.push(NoHumanSchedulerError::CompletionBuild {
-                            start_event_id: sleep_started.event_id,
-                            error,
-                        });
-                        return completed_durations;
-                    }
-                };
-                for event in events {
-                    let Ok(appended) =
-                        try_append_and_apply_agent_event(log, agent_state, event, scheduler_errors)
-                    else {
-                        continue;
-                    };
-                    if is_duration_terminal(appended.event_type) {
-                        if let Some(actor_id) = appended.actor_id.clone() {
-                            completed_durations.push((actor_id, appended.sim_tick));
-                        }
-                        append_routine_step_completed_after_duration_completion(
-                            log,
-                            agent_state,
-                            process_id,
-                            content_manifest_id,
-                            &appended,
-                        );
-                    }
-                }
-            }
-            PendingCompletion::Work(work_started) => {
-                let Some(completion_tick) = scheduled_completion_tick(&work_started) else {
-                    return completed_durations;
-                };
-                let actor_id = work_started
-                    .actor_id
-                    .as_ref()
-                    .map(|actor_id| actor_id.as_str().to_string())
-                    .unwrap_or_default();
-                let ordering_key = OrderingKey::new(
-                    completion_tick,
-                    SchedulePhase::NoHumanProcess,
-                    SchedulerSourceId::Process(process_id.clone()),
-                    scheduler.assign_proposal_sequence(),
-                    ActionId::new("work_block_completed").unwrap(),
-                    vec![actor_id],
-                    format!("work_completed:{}", work_started.event_id.as_str()),
-                );
-                let events = match build_work_completion_events(
-                    state,
-                    agent_state,
-                    log,
-                    &work_started,
-                    &ordering_key,
-                    content_manifest_id,
-                    completion_tick,
-                ) {
-                    Ok(events) => events,
-                    Err(error) => {
-                        scheduler_errors.push(NoHumanSchedulerError::CompletionBuild {
-                            start_event_id: work_started.event_id,
-                            error,
-                        });
-                        return completed_durations;
-                    }
-                };
-                for event in events {
-                    let Ok(appended) =
-                        try_append_and_apply_agent_event(log, agent_state, event, scheduler_errors)
-                    else {
-                        continue;
-                    };
-                    if is_duration_terminal(appended.event_type) {
-                        if let Some(actor_id) = appended.actor_id.clone() {
-                            completed_durations.push((actor_id, appended.sim_tick));
-                        }
-                        append_routine_step_completed_after_duration_completion(
-                            log,
-                            agent_state,
-                            process_id,
-                            content_manifest_id,
-                            &appended,
-                        );
-                    }
-                }
-            }
-        }
-        completed_durations
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 
     fn credit_completion(
         progress_by_window_actor: &mut BTreeMap<(String, ActorId), usize>,
         windows: &[DayWindow],
         completed_actor_id: &ActorId,
         completion_tick: SimTick,
     ) {

---- episode_tamper_proration_poisons_replay stdout ----

thread 'episode_tamper_proration_poisons_replay' (10020) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2851:5:
assertion failed: has_event(&log, EventKind::SleepInterrupted)

---- sleep_spanning_window_boundary_charges_each_tick_once stdout ----

thread 'sleep_spanning_window_boundary_charges_each_tick_once' (10054) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2529:5:
assertion failed: has_event(&log, EventKind::SleepCompleted)

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (10027) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

failures:
    episode_tamper_proration_poisons_replay
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    sleep_spanning_window_boundary_charges_each_tick_once

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.62s

*** result: Failure(101)
