*** crates/tracewake-core/src/state.rs:248:9: replace PhysicalState::actors -> &BTreeMap<ActorId, ActorBody> with Box::leak(Box::new(BTreeMap::new()))

*** mutation diff:
--- crates/tracewake-core/src/state.rs
+++ replace PhysicalState::actors -> &BTreeMap<ActorId, ActorBody> with Box::leak(Box::new(BTreeMap::new()))
@@ -240,17 +240,17 @@
             food_supplies,
             workplaces,
             sleep_affordances,
             need_model,
         }
     }
 
     pub fn actors(&self) -> &BTreeMap<ActorId, ActorBody> {
-        &self.actors
+        Box::leak(Box::new(BTreeMap::new())) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn places(&self) -> &BTreeMap<PlaceId, PlaceState> {
         &self.places
     }
 
     pub fn doors(&self) -> &BTreeMap<DoorId, DoorState> {
         &self.doors

---- stale_workplace_notice_superseded_by_newer_001 stdout ----

thread 'stale_workplace_notice_superseded_by_newer_001' (11744) panicked at crates/tracewake-content/tests/fixtures_load.rs:1156:5:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    stale_workplace_notice_superseded_by_newer_001

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
