*** crates/tracewake-core/src/state.rs:252:9: replace PhysicalState::places -> &BTreeMap<PlaceId, PlaceState> with Box::leak(Box::new(BTreeMap::new()))

*** mutation diff:
--- crates/tracewake-core/src/state.rs
+++ replace PhysicalState::places -> &BTreeMap<PlaceId, PlaceState> with Box::leak(Box::new(BTreeMap::new()))
@@ -244,17 +244,17 @@
         }
     }
 
     pub fn actors(&self) -> &BTreeMap<ActorId, ActorBody> {
         &self.actors
     }
 
     pub fn places(&self) -> &BTreeMap<PlaceId, PlaceState> {
-        &self.places
+        Box::leak(Box::new(BTreeMap::new())) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn doors(&self) -> &BTreeMap<DoorId, DoorState> {
         &self.doors
     }
 
     pub fn containers(&self) -> &BTreeMap<ContainerId, ContainerState> {
         &self.containers

---- validate::tests::fixture_schema_v1_golden_bytes_load_001 stdout ----

thread 'validate::tests::fixture_schema_v1_golden_bytes_load_001' (15737) panicked at crates/tracewake-content/src/validate.rs:3090:9:
assertion failed: world.physical_state.places().contains_key(&PlaceId::new("shop_front").unwrap())

---- validate::tests::valid_fixture_produces_initial_world stdout ----

thread 'validate::tests::valid_fixture_produces_initial_world' (15754) panicked at crates/tracewake-content/src/validate.rs:3077:9:
assertion failed: world.physical_state.places().contains_key(&PlaceId::new("shop_front").unwrap())

failures:
    validate::tests::fixture_schema_v1_golden_bytes_load_001
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 34 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
