*** crates/tracewake-core/src/state.rs:256:9: replace PhysicalState::doors -> &BTreeMap<DoorId, DoorState> with Box::leak(Box::new(BTreeMap::new()))

*** mutation diff:
--- crates/tracewake-core/src/state.rs
+++ replace PhysicalState::doors -> &BTreeMap<DoorId, DoorState> with Box::leak(Box::new(BTreeMap::new()))
@@ -248,17 +248,17 @@
         &self.actors
     }
 
     pub fn places(&self) -> &BTreeMap<PlaceId, PlaceState> {
         &self.places
     }
 
     pub fn doors(&self) -> &BTreeMap<DoorId, DoorState> {
-        &self.doors
+        Box::leak(Box::new(BTreeMap::new())) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn containers(&self) -> &BTreeMap<ContainerId, ContainerState> {
         &self.containers
     }
 
     pub fn items(&self) -> &BTreeMap<ItemId, ItemState> {
         &self.items

---- projections::tests::embodied_exit_surfaces_perceived_closed_locked_door_blocker stdout ----

thread 'projections::tests::embodied_exit_surfaces_perceived_closed_locked_door_blocker' (20217) panicked at crates/tracewake-core/src/projections.rs:2023:9:
assertion `left == right` failed
  left: None
 right: Some("door door_shop_back is closed and locked")

failures:
    projections::tests::embodied_exit_surfaces_perceived_closed_locked_door_blocker

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
