*** crates/tracewake-core/src/state.rs:260:9: replace PhysicalState::containers -> &BTreeMap<ContainerId, ContainerState> with Box::leak(Box::new(BTreeMap::new()))

*** mutation diff:
--- crates/tracewake-core/src/state.rs
+++ replace PhysicalState::containers -> &BTreeMap<ContainerId, ContainerState> with Box::leak(Box::new(BTreeMap::new()))
@@ -252,17 +252,17 @@
         &self.places
     }
 
     pub fn doors(&self) -> &BTreeMap<DoorId, DoorState> {
         &self.doors
     }
 
     pub fn containers(&self) -> &BTreeMap<ContainerId, ContainerState> {
-        &self.containers
+        Box::leak(Box::new(BTreeMap::new())) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn items(&self) -> &BTreeMap<ItemId, ItemState> {
         &self.items
     }
 
     pub fn food_supplies(&self) -> &BTreeMap<FoodSupplyId, FoodSupplyState> {
         &self.food_supplies

---- agent::perception::tests::visible_item_perception_reveals_open_container_without_closed_visibility stdout ----

thread 'agent::perception::tests::visible_item_perception_reveals_open_container_without_closed_visibility' (24614) panicked at crates/tracewake-core/src/agent/perception.rs:894:14:
item in an open container at the current place is perceived

---- projections::tests::closed_opaque_container_check_is_disabled_with_validator_reason stdout ----

thread 'projections::tests::closed_opaque_container_check_is_disabled_with_validator_reason' (24781) panicked at crates/tracewake-core/src/projections.rs:2290:14:
called `Option::unwrap()` on a `None` value

---- projections::tests::container_sourced_visible_item_uses_container_take_id stdout ----

thread 'projections::tests::container_sourced_visible_item_uses_container_take_id' (24782) panicked at crates/tracewake-core/src/projections.rs:2263:9:
assertion failed: view.semantic_actions.iter().any(|entry|
        entry.semantic_action_id.as_str() ==
            "take.item.coin_stack_01.from.strongbox_tomas")

failures:
    agent::perception::tests::visible_item_perception_reveals_open_container_without_closed_visibility
    projections::tests::closed_opaque_container_check_is_disabled_with_validator_reason
    projections::tests::container_sourced_visible_item_uses_container_take_id
    projections::tests::embodied_projection_excludes_hidden_and_debug_truth
    projections::tests::locked_container_check_is_disabled_with_validator_reason

test result: FAILED. 450 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
