*** crates/tracewake-core/src/state.rs:264:9: replace PhysicalState::items -> &BTreeMap<ItemId, ItemState> with Box::leak(Box::new(BTreeMap::new()))

*** mutation diff:
--- crates/tracewake-core/src/state.rs
+++ replace PhysicalState::items -> &BTreeMap<ItemId, ItemState> with Box::leak(Box::new(BTreeMap::new()))
@@ -256,17 +256,17 @@
         &self.doors
     }
 
     pub fn containers(&self) -> &BTreeMap<ContainerId, ContainerState> {
         &self.containers
     }
 
     pub fn items(&self) -> &BTreeMap<ItemId, ItemState> {
-        &self.items
+        Box::leak(Box::new(BTreeMap::new())) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn food_supplies(&self) -> &BTreeMap<FoodSupplyId, FoodSupplyState> {
         &self.food_supplies
     }
 
     pub fn workplaces(&self) -> &BTreeMap<WorkplaceId, WorkplaceState> {
         &self.workplaces

---- agent::perception::tests::visible_item_perception_reveals_open_container_without_closed_visibility stdout ----

thread 'agent::perception::tests::visible_item_perception_reveals_open_container_without_closed_visibility' (29185) panicked at crates/tracewake-core/src/agent/perception.rs:894:14:
item in an open container at the current place is perceived

---- agent::perception::tests::visible_item_perception_follows_current_place_match_not_id_prose stdout ----

thread 'agent::perception::tests::visible_item_perception_follows_current_place_match_not_id_prose' (29184) panicked at crates/tracewake-core/src/agent/perception.rs:838:14:
item at the actor's current place is perceived

---- projections::tests::embodied_projection_excludes_hidden_and_debug_truth stdout ----

thread 'projections::tests::embodied_projection_excludes_hidden_and_debug_truth' (29361) panicked at crates/tracewake-core/src/projections.rs:1750:9:
assertion failed: view.visible_items.iter().any(|item| item.item_id == item_id("loose_coin_01"))

failures:
    agent::perception::tests::visible_item_perception_follows_current_place_match_not_id_prose
    agent::perception::tests::visible_item_perception_reveals_open_container_without_closed_visibility
    projections::tests::container_sourced_visible_item_uses_container_take_id
    projections::tests::embodied_projection_excludes_hidden_and_debug_truth
    projections::tests::embodied_projection_renders_observed_carried_item_attributes_not_live_truth
    projections::tests::embodied_projection_separates_carried_items_from_reachable_items

test result: FAILED. 449 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
