*** crates/tracewake-core/src/state.rs:268:9: replace PhysicalState::food_supplies -> &BTreeMap<FoodSupplyId, FoodSupplyState> with Box::leak(Box::new(BTreeMap::new()))

*** mutation diff:
--- crates/tracewake-core/src/state.rs
+++ replace PhysicalState::food_supplies -> &BTreeMap<FoodSupplyId, FoodSupplyState> with Box::leak(Box::new(BTreeMap::new()))
@@ -260,17 +260,17 @@
         &self.containers
     }
 
     pub fn items(&self) -> &BTreeMap<ItemId, ItemState> {
         &self.items
     }
 
     pub fn food_supplies(&self) -> &BTreeMap<FoodSupplyId, FoodSupplyState> {
-        &self.food_supplies
+        Box::leak(Box::new(BTreeMap::new())) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn workplaces(&self) -> &BTreeMap<WorkplaceId, WorkplaceState> {
         &self.workplaces
     }
 
     pub fn sleep_affordances(&self) -> &BTreeMap<SleepAffordanceId, SleepAffordanceState> {
         &self.sleep_affordances

---- fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering stdout ----

thread 'fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering' (1022) panicked at crates/tracewake-content/tests/fixtures_load.rs:1240:5:
assertion failed: loaded.canonical_world.food_supplies().contains_key(&FoodSupplyId::new("food_soup_pot").unwrap())

failures:
    fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
