*** crates/tracewake-core/src/state.rs:272:9: replace PhysicalState::workplaces -> &BTreeMap<WorkplaceId, WorkplaceState> with Box::leak(Box::new(BTreeMap::new()))

*** mutation diff:
--- crates/tracewake-core/src/state.rs
+++ replace PhysicalState::workplaces -> &BTreeMap<WorkplaceId, WorkplaceState> with Box::leak(Box::new(BTreeMap::new()))
@@ -264,17 +264,17 @@
         &self.items
     }
 
     pub fn food_supplies(&self) -> &BTreeMap<FoodSupplyId, FoodSupplyState> {
         &self.food_supplies
     }
 
     pub fn workplaces(&self) -> &BTreeMap<WorkplaceId, WorkplaceState> {
-        &self.workplaces
+        Box::leak(Box::new(BTreeMap::new())) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn sleep_affordances(&self) -> &BTreeMap<SleepAffordanceId, SleepAffordanceState> {
         &self.sleep_affordances
     }
 
     pub const fn need_model(&self) -> &NeedModelState {
         &self.need_model

---- fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering stdout ----

thread 'fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering' (5065) panicked at crates/tracewake-content/tests/fixtures_load.rs:1244:5:
assertion failed: loaded.canonical_world.workplaces().contains_key(&WorkplaceId::new("workplace_shop").unwrap())

failures:
    fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
