*** crates/tracewake-core/src/state.rs:276:9: replace PhysicalState::sleep_affordances -> &BTreeMap<SleepAffordanceId, SleepAffordanceState> with Box::leak(Box::new(BTreeMap::new()))

*** mutation diff:
--- crates/tracewake-core/src/state.rs
+++ replace PhysicalState::sleep_affordances -> &BTreeMap<SleepAffordanceId, SleepAffordanceState> with Box::leak(Box::new(BTreeMap::new()))
@@ -268,17 +268,17 @@
         &self.food_supplies
     }
 
     pub fn workplaces(&self) -> &BTreeMap<WorkplaceId, WorkplaceState> {
         &self.workplaces
     }
 
     pub fn sleep_affordances(&self) -> &BTreeMap<SleepAffordanceId, SleepAffordanceState> {
-        &self.sleep_affordances
+        Box::leak(Box::new(BTreeMap::new())) /* ~ changed by cargo-mutants ~ */
     }
 
     pub const fn need_model(&self) -> &NeedModelState {
         &self.need_model
     }
 }
 
 impl AgentState {

---- agent::perception::tests::current_place_perception_emits_window_keyed_observation_events stdout ----

thread 'agent::perception::tests::current_place_perception_emits_window_keyed_observation_events' (9371) panicked at crates/tracewake-core/src/agent/perception.rs:759:9:
assertion `left == right` failed
  left: {"current_place", "visible_exit", "visible_food_supply"}
 right: {"current_place", "visible_exit", "visible_food_supply", "visible_sleep_affordance"}

---- agent::perception::tests::embodied_context_filters_reclassified_records_by_declared_scope_but_no_human_keeps_memory stdout ----

thread 'agent::perception::tests::embodied_context_filters_reclassified_records_by_declared_scope_but_no_human_keeps_memory' (9372) panicked at crates/tracewake-core/src/agent/perception.rs:1191:14:
shared classifier keeps remembered sleep place

---- agent::perception::tests::current_place_knowledge_context_uses_latest_projection_window_for_sleep_affordances stdout ----

thread 'agent::perception::tests::current_place_knowledge_context_uses_latest_projection_window_for_sleep_affordances' (9367) panicked at crates/tracewake-core/src/agent/perception.rs:1107:9:
assertion failed: stale_context.actor_known_sleep_affordances().iter().any(|fact|
        fact.sleep_affordance_id().as_str() == "bed_tomas")

failures:
    agent::perception::tests::current_place_knowledge_context_uses_latest_projection_window_for_sleep_affordances
    agent::perception::tests::current_place_perception_emits_window_keyed_observation_events
    agent::perception::tests::embodied_context_filters_reclassified_records_by_declared_scope_but_no_human_keeps_memory
    scheduler::no_human::tests::no_human_day_counts_duration_completion_as_window_progress
    scheduler::no_human::tests::no_human_day_records_current_place_perception_before_decision

test result: FAILED. 450 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
