*** crates/tracewake-core/src/state.rs:293:9: replace AgentState::from_seed_parts -> Self with Default::default()

*** mutation diff:
--- crates/tracewake-core/src/state.rs
+++ replace AgentState::from_seed_parts -> Self with Default::default()
@@ -285,29 +285,17 @@
     pub fn from_seed_parts(
         needs_by_actor: BTreeMap<ActorId, BTreeMap<NeedKind, NeedState>>,
         intentions: BTreeMap<IntentionId, Intention>,
         active_intention_by_actor: BTreeMap<ActorId, IntentionId>,
         routine_executions: BTreeMap<RoutineExecutionId, RoutineExecution>,
         decision_traces: BTreeMap<DecisionTraceId, DecisionTraceRecord>,
         stuck_diagnostics: BTreeMap<StuckDiagnosticId, StuckDiagnosticRecord>,
     ) -> Self {
-        Self {
-            needs_by_actor,
-            need_tick_charges: BTreeSet::new(),
-            intentions,
-            active_intention_by_actor,
-            routine_executions,
-            decision_traces,
-            stuck_diagnostics,
-            need_threshold_crossings: BTreeMap::new(),
-            ordinary_life_episodes: BTreeMap::new(),
-            candidate_goal_evaluations: BTreeMap::new(),
-            continue_routine_arbitrations: BTreeMap::new(),
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn needs_by_actor(&self) -> &BTreeMap<ActorId, BTreeMap<NeedKind, NeedState>> {
         &self.needs_by_actor
     }
 
     pub fn intentions(&self) -> &BTreeMap<IntentionId, Intention> {
         &self.intentions

---- fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering stdout ----

thread 'fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering' (13692) panicked at crates/tracewake-content/tests/fixtures_load.rs:1249:54:
no entry found for key

---- seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food stdout ----

thread 'seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food' (13708) panicked at crates/tracewake-content/tests/fixtures_load.rs:1217:5:
assertion failed: report.ordinary_pipeline_events > 0

failures:
    fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering
    seeded_food_source_unknown_to_all_actors_omits_seed_belief_and_actor_known_food

test result: FAILED. 32 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
