*** crates/tracewake-core/src/state.rs:309:9: replace AgentState::needs_by_actor -> &BTreeMap<ActorId, BTreeMap<NeedKind, NeedState>> with Box::leak(Box::new(BTreeMap::new()))

*** mutation diff:
--- crates/tracewake-core/src/state.rs
+++ replace AgentState::needs_by_actor -> &BTreeMap<ActorId, BTreeMap<NeedKind, NeedState>> with Box::leak(Box::new(BTreeMap::new()))
@@ -301,17 +301,17 @@
             need_threshold_crossings: BTreeMap::new(),
             ordinary_life_episodes: BTreeMap::new(),
             candidate_goal_evaluations: BTreeMap::new(),
             continue_routine_arbitrations: BTreeMap::new(),
         }
     }
 
     pub fn needs_by_actor(&self) -> &BTreeMap<ActorId, BTreeMap<NeedKind, NeedState>> {
-        &self.needs_by_actor
+        Box::leak(Box::new(BTreeMap::new())) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn intentions(&self) -> &BTreeMap<IntentionId, Intention> {
         &self.intentions
     }
 
     pub fn active_intention_by_actor(&self) -> &BTreeMap<ActorId, IntentionId> {
         &self.active_intention_by_actor

---- fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering stdout ----

thread 'fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering' (17723) panicked at crates/tracewake-content/tests/fixtures_load.rs:1249:54:
no entry found for key

failures:
    fixtures_load_phase3a_fixture_into_core_shapes_with_canonical_ordering

test result: FAILED. 33 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
