*** crates/tracewake-core/src/state.rs:313:9: replace AgentState::intentions -> &BTreeMap<IntentionId, Intention> with Box::leak(Box::new(BTreeMap::new()))

*** mutation diff:
--- crates/tracewake-core/src/state.rs
+++ replace AgentState::intentions -> &BTreeMap<IntentionId, Intention> with Box::leak(Box::new(BTreeMap::new()))
@@ -305,17 +305,17 @@
         }
     }
 
     pub fn needs_by_actor(&self) -> &BTreeMap<ActorId, BTreeMap<NeedKind, NeedState>> {
         &self.needs_by_actor
     }
 
     pub fn intentions(&self) -> &BTreeMap<IntentionId, Intention> {
-        &self.intentions
+        Box::leak(Box::new(BTreeMap::new())) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn active_intention_by_actor(&self) -> &BTreeMap<ActorId, IntentionId> {
         &self.active_intention_by_actor
     }
 
     pub fn routine_executions(&self) -> &BTreeMap<RoutineExecutionId, RoutineExecution> {
         &self.routine_executions

---- possession_fixture_preserves_intention_needs_and_can_continue stdout ----

thread 'possession_fixture_preserves_intention_needs_and_can_continue' (21850) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1810:5:
assertion failed: agent_state.intentions().contains_key(&intention_id)

failures:
    possession_fixture_preserves_intention_needs_and_can_continue

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.62s

*** result: Failure(101)
