*** crates/tracewake-core/src/state.rs:317:9: replace AgentState::active_intention_by_actor -> &BTreeMap<ActorId, IntentionId> with Box::leak(Box::new(BTreeMap::new()))

*** mutation diff:
--- crates/tracewake-core/src/state.rs
+++ replace AgentState::active_intention_by_actor -> &BTreeMap<ActorId, IntentionId> with Box::leak(Box::new(BTreeMap::new()))
@@ -309,17 +309,17 @@
         &self.needs_by_actor
     }
 
     pub fn intentions(&self) -> &BTreeMap<IntentionId, Intention> {
         &self.intentions
     }
 
     pub fn active_intention_by_actor(&self) -> &BTreeMap<ActorId, IntentionId> {
-        &self.active_intention_by_actor
+        Box::leak(Box::new(BTreeMap::new())) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn routine_executions(&self) -> &BTreeMap<RoutineExecutionId, RoutineExecution> {
         &self.routine_executions
     }
 
     pub fn decision_traces(&self) -> &BTreeMap<DecisionTraceId, DecisionTraceRecord> {
         &self.decision_traces

---- possession_fixture_preserves_intention_needs_and_can_continue stdout ----

thread 'possession_fixture_preserves_intention_needs_and_can_continue' (25961) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1806:5:
assertion `left == right` failed
  left: None
 right: Some(IntentionId(StableId("intention_mara_work")))

failures:
    possession_fixture_preserves_intention_needs_and_can_continue

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.56s

*** result: Failure(101)
