*** crates/tracewake-core/src/state.rs:321:9: replace AgentState::routine_executions -> &BTreeMap<RoutineExecutionId, RoutineExecution> with Box::leak(Box::new(BTreeMap::new()))

*** mutation diff:
--- crates/tracewake-core/src/state.rs
+++ replace AgentState::routine_executions -> &BTreeMap<RoutineExecutionId, RoutineExecution> with Box::leak(Box::new(BTreeMap::new()))
@@ -313,17 +313,17 @@
         &self.intentions
     }
 
     pub fn active_intention_by_actor(&self) -> &BTreeMap<ActorId, IntentionId> {
         &self.active_intention_by_actor
     }
 
     pub fn routine_executions(&self) -> &BTreeMap<RoutineExecutionId, RoutineExecution> {
-        &self.routine_executions
+        Box::leak(Box::new(BTreeMap::new())) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn decision_traces(&self) -> &BTreeMap<DecisionTraceId, DecisionTraceRecord> {
         &self.decision_traces
     }
 
     pub fn stuck_diagnostics(&self) -> &BTreeMap<StuckDiagnosticId, StuckDiagnosticRecord> {
         &self.stuck_diagnostics

---- possession_fixture_preserves_intention_needs_and_can_continue stdout ----

thread 'possession_fixture_preserves_intention_needs_and_can_continue' (30072) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1811:5:
assertion failed: agent_state.routine_executions().contains_key(&routine_execution_id)

failures:
    possession_fixture_preserves_intention_needs_and_can_continue

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.59s

*** result: Failure(101)
