*** crates/tracewake-core/src/state.rs:325:9: replace AgentState::decision_traces -> &BTreeMap<DecisionTraceId, DecisionTraceRecord> with Box::leak(Box::new(BTreeMap::new()))

*** mutation diff:
--- crates/tracewake-core/src/state.rs
+++ replace AgentState::decision_traces -> &BTreeMap<DecisionTraceId, DecisionTraceRecord> with Box::leak(Box::new(BTreeMap::new()))
@@ -317,17 +317,17 @@
         &self.active_intention_by_actor
     }
 
     pub fn routine_executions(&self) -> &BTreeMap<RoutineExecutionId, RoutineExecution> {
         &self.routine_executions
     }
 
     pub fn decision_traces(&self) -> &BTreeMap<DecisionTraceId, DecisionTraceRecord> {
-        &self.decision_traces
+        Box::leak(Box::new(BTreeMap::new())) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn stuck_diagnostics(&self) -> &BTreeMap<StuckDiagnosticId, StuckDiagnosticRecord> {
         &self.stuck_diagnostics
     }
 
     pub fn need_threshold_crossings(
         &self,

---- legacy_decision_trace_without_typed_diagnostic_keys_rebuilds_with_defaults stdout ----

thread 'legacy_decision_trace_without_typed_diagnostic_keys_rebuilds_with_defaults' (2316) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:1465:10:
legacy trace rebuilds

---- replay_rebuild_checksum_matches_original_after_no_human_day stdout ----

thread 'replay_rebuild_checksum_matches_original_after_no_human_day' (2325) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:1080:10:
replay rebuilds decision trace record

failures:
    legacy_decision_trace_without_typed_diagnostic_keys_rebuilds_with_defaults
    replay_rebuild_checksum_matches_original_after_no_human_day

test result: FAILED. 30 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
