*** crates/tracewake-core/src/state.rs:329:9: replace AgentState::stuck_diagnostics -> &BTreeMap<StuckDiagnosticId, StuckDiagnosticRecord> with Box::leak(Box::new(BTreeMap::new()))

*** mutation diff:
--- crates/tracewake-core/src/state.rs
+++ replace AgentState::stuck_diagnostics -> &BTreeMap<StuckDiagnosticId, StuckDiagnosticRecord> with Box::leak(Box::new(BTreeMap::new()))
@@ -321,17 +321,17 @@
         &self.routine_executions
     }
 
     pub fn decision_traces(&self) -> &BTreeMap<DecisionTraceId, DecisionTraceRecord> {
         &self.decision_traces
     }
 
     pub fn stuck_diagnostics(&self) -> &BTreeMap<StuckDiagnosticId, StuckDiagnosticRecord> {
-        &self.stuck_diagnostics
+        Box::leak(Box::new(BTreeMap::new())) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn need_threshold_crossings(
         &self,
     ) -> &BTreeMap<crate::ids::EventId, NeedThresholdCrossingRecord> {
         &self.need_threshold_crossings
     }

---- typed_diagnostic_hidden_truth_true_is_validated_and_replayed stdout ----

thread 'typed_diagnostic_hidden_truth_true_is_validated_and_replayed' (7044) panicked at crates/tracewake-core/tests/event_schema_replay_gates.rs:2661:10:
diagnostic applied

failures:
    typed_diagnostic_hidden_truth_true_is_validated_and_replayed

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
