*** crates/tracewake-core/src/state.rs:335:9: replace AgentState::need_threshold_crossings -> &BTreeMap<crate::ids::EventId, NeedThresholdCrossingRecord> with Box::leak(Box::new(BTreeMap::new()))

*** mutation diff:
--- crates/tracewake-core/src/state.rs
+++ replace AgentState::need_threshold_crossings -> &BTreeMap<crate::ids::EventId, NeedThresholdCrossingRecord> with Box::leak(Box::new(BTreeMap::new()))
@@ -327,17 +327,17 @@
 
     pub fn stuck_diagnostics(&self) -> &BTreeMap<StuckDiagnosticId, StuckDiagnosticRecord> {
         &self.stuck_diagnostics
     }
 
     pub fn need_threshold_crossings(
         &self,
     ) -> &BTreeMap<crate::ids::EventId, NeedThresholdCrossingRecord> {
-        &self.need_threshold_crossings
+        Box::leak(Box::new(BTreeMap::new())) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn ordinary_life_episodes(
         &self,
     ) -> &BTreeMap<crate::ids::EventId, OrdinaryLifeEpisodeRecord> {
         &self.ordinary_life_episodes
     }

---- state::tests::agent_state_accessors_return_materialized_record_maps stdout ----

thread 'state::tests::agent_state_accessors_return_materialized_record_maps' (11599) panicked at crates/tracewake-core/src/state.rs:847:9:
assertion `left == right` failed
  left: None
 right: Some((Hunger, 400, 850, "urgent"))

failures:
    state::tests::agent_state_accessors_return_materialized_record_maps

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
