*** crates/tracewake-core/src/state.rs:341:9: replace AgentState::ordinary_life_episodes -> &BTreeMap<crate::ids::EventId, OrdinaryLifeEpisodeRecord> with Box::leak(Box::new(BTreeMap::new()))

*** mutation diff:
--- crates/tracewake-core/src/state.rs
+++ replace AgentState::ordinary_life_episodes -> &BTreeMap<crate::ids::EventId, OrdinaryLifeEpisodeRecord> with Box::leak(Box::new(BTreeMap::new()))
@@ -333,17 +333,17 @@
         &self,
     ) -> &BTreeMap<crate::ids::EventId, NeedThresholdCrossingRecord> {
         &self.need_threshold_crossings
     }
 
     pub fn ordinary_life_episodes(
         &self,
     ) -> &BTreeMap<crate::ids::EventId, OrdinaryLifeEpisodeRecord> {
-        &self.ordinary_life_episodes
+        Box::leak(Box::new(BTreeMap::new())) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn candidate_goal_evaluations(
         &self,
     ) -> &BTreeMap<crate::ids::EventId, CandidateGoalEvaluationRecord> {
         &self.candidate_goal_evaluations
     }

---- projections::tests::view_models_embodied_phase3a_salient_interruption_is_viewer_scoped stdout ----

thread 'projections::tests::view_models_embodied_phase3a_salient_interruption_is_viewer_scoped' (16107) panicked at crates/tracewake-core/src/projections.rs:2848:14:
called `Option::unwrap()` on a `None` value

failures:
    projections::tests::view_models_embodied_phase3a_salient_interruption_is_viewer_scoped

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
