*** crates/tracewake-core/src/state.rs:347:9: replace AgentState::candidate_goal_evaluations -> &BTreeMap<crate::ids::EventId, CandidateGoalEvaluationRecord> with Box::leak(Box::new(BTreeMap::new()))

*** mutation diff:
--- crates/tracewake-core/src/state.rs
+++ replace AgentState::candidate_goal_evaluations -> &BTreeMap<crate::ids::EventId, CandidateGoalEvaluationRecord> with Box::leak(Box::new(BTreeMap::new()))
@@ -339,17 +339,17 @@
         &self,
     ) -> &BTreeMap<crate::ids::EventId, OrdinaryLifeEpisodeRecord> {
         &self.ordinary_life_episodes
     }
 
     pub fn candidate_goal_evaluations(
         &self,
     ) -> &BTreeMap<crate::ids::EventId, CandidateGoalEvaluationRecord> {
-        &self.candidate_goal_evaluations
+        Box::leak(Box::new(BTreeMap::new())) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn continue_routine_arbitrations(
         &self,
     ) -> &BTreeMap<crate::ids::EventId, ContinueRoutineArbitrationRecord> {
         &self.continue_routine_arbitrations
     }
 }

---- state::tests::agent_state_accessors_return_materialized_record_maps stdout ----

thread 'state::tests::agent_state_accessors_return_materialized_record_maps' (20741) panicked at crates/tracewake-core/src/state.rs:859:9:
assertion `left == right` failed
  left: None
 right: Some((Some("actor_tomas"), Some("proposal_work_shift"), [EventId(StableId("event.need_threshold_crossed.1"))], "work goal considered"))

failures:
    state::tests::agent_state_accessors_return_materialized_record_maps

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
