*** crates/tracewake-core/src/state.rs:353:9: replace AgentState::continue_routine_arbitrations -> &BTreeMap<crate::ids::EventId, ContinueRoutineArbitrationRecord> with Box::leak(Box::new(BTreeMap::new()))

*** mutation diff:
--- crates/tracewake-core/src/state.rs
+++ replace AgentState::continue_routine_arbitrations -> &BTreeMap<crate::ids::EventId, ContinueRoutineArbitrationRecord> with Box::leak(Box::new(BTreeMap::new()))
@@ -345,17 +345,17 @@
         &self,
     ) -> &BTreeMap<crate::ids::EventId, CandidateGoalEvaluationRecord> {
         &self.candidate_goal_evaluations
     }
 
     pub fn continue_routine_arbitrations(
         &self,
     ) -> &BTreeMap<crate::ids::EventId, ContinueRoutineArbitrationRecord> {
-        &self.continue_routine_arbitrations
+        Box::leak(Box::new(BTreeMap::new())) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl PlaceState {
     /// Constructs an in-code place with a visible default for fixture/test assembly
     /// convenience. Authored content must still pass the fail-closed loader
     /// `visibility_default` column; this constructor is not an authoring fallback.
     pub fn new(place_id: PlaceId, display_label: impl Into<String>) -> Self {

---- possession_fixture_preserves_intention_needs_and_can_continue stdout ----

thread 'possession_fixture_preserves_intention_needs_and_can_continue' (24857) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1878:5:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    possession_fixture_preserves_intention_needs_and_can_continue

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.59s

*** result: Failure(101)
