*** crates/tracewake-core/src/state.rs:386:9: replace VisibilityDefault::stable_id -> &'static str with ""

*** mutation diff:
--- crates/tracewake-core/src/state.rs
+++ replace VisibilityDefault::stable_id -> &'static str with ""
@@ -378,20 +378,17 @@
 #[derive(Clone, Debug, PartialEq, Eq)]
 pub enum VisibilityDefault {
     Visible,
     Concealed,
 }
 
 impl VisibilityDefault {
     pub const fn stable_id(&self) -> &'static str {
-        match self {
-            Self::Visible => "visible",
-            Self::Concealed => "concealed",
-        }
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     pub const fn is_visible(&self) -> bool {
         matches!(self, Self::Visible)
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq)]

---- load::tests::shuffled_input_paths_load_to_same_canonical_world stdout ----

thread 'load::tests::shuffled_input_paths_load_to_same_canonical_world' (28848) panicked at crates/tracewake-content/src/load.rs:509:10:
called `Result::unwrap()` on an `Err` value: Validation(ContentValidationFailure { report: ContentValidationReport { status: Rejected, errors: [ContentValidationError { phase: ParseSchema, path: "fixture.line", code: "bad_line", message: "bad fixture line bad place visibility_default " }] } })

---- validate::tests::fixture_schema_v1_golden_bytes_load_001 stdout ----

thread 'validate::tests::fixture_schema_v1_golden_bytes_load_001' (28864) panicked at crates/tracewake-content/src/validate.rs:3087:81:

---- serialization::tests::fixture_serialization_round_trips_byte_identically stdout ----

thread 'serialization::tests::fixture_serialization_round_trips_byte_identically' (28853) panicked at crates/tracewake-content/src/serialization.rs:891:50:
called `Result::unwrap()` on an `Err` value: BadLine("bad place visibility_default ")

failures:
    load::tests::shuffled_input_paths_load_to_same_canonical_world
    serialization::tests::fixture_serialization_round_trips_byte_identically
    validate::tests::fixture_schema_v1_golden_bytes_load_001
    validate::tests::fixture_schema_version_unsupported_rejected_001
    validate::tests::fixture_serialization_golden_bytes_are_pinned_001
    validate::tests::phase3a_sleep_surface_contract_uses_typed_no_sleep_diagnostic
    validate::tests::phase3a_valid_routine_content_is_accepted
    validate::tests::valid_fixture_produces_initial_world

test result: FAILED. 28 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
