*** crates/tracewake-core/src/state.rs:393:9: replace VisibilityDefault::is_visible -> bool with true

*** mutation diff:
--- crates/tracewake-core/src/state.rs
+++ replace VisibilityDefault::is_visible -> bool with true
@@ -385,17 +385,17 @@
     pub const fn stable_id(&self) -> &'static str {
         match self {
             Self::Visible => "visible",
             Self::Concealed => "concealed",
         }
     }
 
     pub const fn is_visible(&self) -> bool {
-        matches!(self, Self::Visible)
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq)]
 pub struct DoorState {
     pub door_id: DoorId,
     pub endpoint_a: PlaceId,
     pub endpoint_b: PlaceId,

---- no_hidden_truth_fixture_keeps_hidden_food_out_of_planner_inputs stdout ----

thread 'no_hidden_truth_fixture_keeps_hidden_food_out_of_planner_inputs' (4477) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1975:9:
assertion failed: !no_human_log.events().iter().any(|event|
            {
                event.ordering_key.target_ids.iter().any(|target|
                                target == forbidden) ||
                        event.participants.iter().any(|participant|
                                participant == forbidden) ||
                    event.payload.iter().any(|field|
                            field.value.contains(forbidden))
            })

failures:
    no_hidden_truth_fixture_keeps_hidden_food_out_of_planner_inputs

test result: FAILED. 41 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.60s

*** result: Failure(101)
