*** crates/tracewake-core/src/state.rs:393:9: replace VisibilityDefault::is_visible -> bool with false

*** mutation diff:
--- crates/tracewake-core/src/state.rs
+++ replace VisibilityDefault::is_visible -> bool with false
@@ -385,17 +385,17 @@
     pub const fn stable_id(&self) -> &'static str {
         match self {
             Self::Visible => "visible",
             Self::Concealed => "concealed",
         }
     }
 
     pub const fn is_visible(&self) -> bool {
-        matches!(self, Self::Visible)
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq)]
 pub struct DoorState {
     pub door_id: DoorId,
     pub endpoint_a: PlaceId,
     pub endpoint_b: PlaceId,

---- severe_safety_with_known_exit_produces_move_and_replays stdout ----

thread 'severe_safety_with_known_exit_produces_move_and_replays' (8602) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1715:10:
severe safety should commit a move

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (8578) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (8579) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2714:5:
assertion failed: has_event(&log, EventKind::ActorMoved)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    severe_safety_with_known_exit_produces_move_and_replays

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.45s

*** result: Failure(101)
