*** crates/tracewake-core/src/state.rs:422:38: replace || with && in DoorState::connects_place

*** mutation diff:
--- crates/tracewake-core/src/state.rs
+++ replace || with && in DoorState::connects_place
@@ -414,17 +414,17 @@
             is_open: false,
             is_locked: false,
             access_key_item_id: None,
             blocks_movement_when_closed: true,
         }
     }
 
     pub fn connects_place(&self, place_id: &PlaceId) -> bool {
-        &self.endpoint_a == place_id || &self.endpoint_b == place_id
+        &self.endpoint_a == place_id && /* ~ changed by cargo-mutants ~ */ &self.endpoint_b == place_id
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq)]
 pub struct ContainerState {
     pub container_id: ContainerId,
     pub location: Location,
     pub is_open: bool,

---- actions::pipeline::tests::open_then_move_log_replays_to_same_state stdout ----

thread 'actions::pipeline::tests::open_then_move_log_replays_to_same_state' (21911) panicked at crates/tracewake-core/src/actions/pipeline.rs:2418:9:
assertion `left == right` failed
  left: Rejected
 right: Accepted

---- location::tests::visibility_excludes_closed_opaque_contents_and_other_places stdout ----

thread 'location::tests::visibility_excludes_closed_opaque_contents_and_other_places' (22162) panicked at crates/tracewake-core/src/location.rs:240:9:
assertion failed: visible.connected_doors.contains(&door_id("door_shop_back"))

---- projections::tests::embodied_exit_surfaces_perceived_closed_locked_door_blocker stdout ----

thread 'projections::tests::embodied_exit_surfaces_perceived_closed_locked_door_blocker' (22177) panicked at crates/tracewake-core/src/projections.rs:2023:9:
assertion `left == right` failed
  left: None
 right: Some("door door_shop_back is closed and locked")

failures:
    actions::pipeline::tests::open_then_move_log_replays_to_same_state
    location::tests::visibility_excludes_closed_opaque_contents_and_other_places
    projections::tests::embodied_exit_surfaces_perceived_closed_locked_door_blocker
    replay::rebuild::tests::rebuild_from_fixture_and_events_equals_live_run
    state::tests::door_connectivity_matches_only_authored_endpoints

test result: FAILED. 450 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
