*** crates/tracewake-core/src/state.rs:422:58: replace == with != in DoorState::connects_place

*** mutation diff:
--- crates/tracewake-core/src/state.rs
+++ replace == with != in DoorState::connects_place
@@ -414,17 +414,17 @@
             is_open: false,
             is_locked: false,
             access_key_item_id: None,
             blocks_movement_when_closed: true,
         }
     }
 
     pub fn connects_place(&self, place_id: &PlaceId) -> bool {
-        &self.endpoint_a == place_id || &self.endpoint_b == place_id
+        &self.endpoint_a == place_id || &self.endpoint_b != /* ~ changed by cargo-mutants ~ */ place_id
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq)]
 pub struct ContainerState {
     pub container_id: ContainerId,
     pub location: Location,
     pub is_open: bool,

---- state::tests::door_connectivity_matches_only_authored_endpoints stdout ----

thread 'state::tests::door_connectivity_matches_only_authored_endpoints' (31383) panicked at crates/tracewake-core/src/state.rs:890:9:
assertion failed: door.connects_place(&back)

failures:
    state::tests::door_connectivity_matches_only_authored_endpoints

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
