*** crates/tracewake-core/src/state.rs:574:23: replace == with != in FoodSupplyState::is_empty

*** mutation diff:
--- crates/tracewake-core/src/state.rs
+++ replace == with != in FoodSupplyState::is_empty
@@ -566,17 +566,17 @@
             food_supply_id,
             location,
             servings,
             hunger_reduction_per_serving,
         }
     }
 
     pub fn is_empty(&self) -> bool {
-        self.servings == 0
+        self.servings != /* ~ changed by cargo-mutants ~ */ 0
     }
 }
 
 impl ItemState {
     pub fn new(item_id: ItemId, location: Location) -> Self {
         Self {
             item_id,
             portable: true,

---- food_unavailable_fixture_records_typed_failure_without_refill stdout ----

thread 'food_unavailable_fixture_records_typed_failure_without_refill' (11211) panicked at crates/tracewake-core/src/actions/defs/eat.rs:67:9:
attempt to subtract with overflow

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (11215) panicked at crates/tracewake-core/src/actions/defs/eat.rs:67:9:
attempt to subtract with overflow

---- no_human_need_ledger_has_no_duplicate_regime_charges stdout ----

thread 'no_human_need_ledger_has_no_duplicate_regime_charges' (11219) panicked at crates/tracewake-core/src/actions/defs/eat.rs:67:9:
attempt to subtract with overflow

failures:
    food_unavailable_fixture_records_typed_failure_without_refill
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    no_human_decision_context_hash_gate_fails_when_source_evidence_tampered
    no_human_need_ledger_has_no_duplicate_regime_charges
    sleep_eat_work_fixture_logs_need_effects_and_replays

test result: FAILED. 36 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
