*** crates/tracewake-core/src/state.rs:574:9: replace FoodSupplyState::is_empty -> bool with true

*** mutation diff:
--- crates/tracewake-core/src/state.rs
+++ replace FoodSupplyState::is_empty -> bool with true
@@ -566,17 +566,17 @@
             food_supply_id,
             location,
             servings,
             hunger_reduction_per_serving,
         }
     }
 
     pub fn is_empty(&self) -> bool {
-        self.servings == 0
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl ItemState {
     pub fn new(item_id: ItemId, location: Location) -> Self {
         Self {
             item_id,
             portable: true,

---- sleep_eat_work_fixture_logs_need_effects_and_replays stdout ----

thread 'sleep_eat_work_fixture_logs_need_effects_and_replays' (3042) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:1270:5:
assertion failed: has_event(&log, EventKind::FoodConsumed)

---- no_human_day_fixture_has_roster_activity_and_metrics_envelope stdout ----

thread 'no_human_day_fixture_has_roster_activity_and_metrics_envelope' (3016) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2176:5:
assertion failed: has_no_human_event(&log, EventKind::WorkBlockCompleted)

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (3017) panicked at crates/tracewake-content/tests/golden_fixtures_run.rs:2714:5:
assertion failed: has_event(&log, EventKind::ActorMoved)

failures:
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    sleep_eat_work_fixture_logs_need_effects_and_replays

test result: FAILED. 39 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.50s

*** result: Failure(101)
