*** crates/tracewake-core/src/state.rs:574:9: replace FoodSupplyState::is_empty -> bool with false

*** mutation diff:
--- crates/tracewake-core/src/state.rs
+++ replace FoodSupplyState::is_empty -> bool with false
@@ -566,17 +566,17 @@
             food_supply_id,
             location,
             servings,
             hunger_reduction_per_serving,
         }
     }
 
     pub fn is_empty(&self) -> bool {
-        self.servings == 0
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl ItemState {
     pub fn new(item_id: ItemId, location: Location) -> Self {
         Self {
             item_id,
             portable: true,

---- food_unavailable_fixture_records_typed_failure_without_refill stdout ----

thread 'food_unavailable_fixture_records_typed_failure_without_refill' (7112) panicked at crates/tracewake-core/src/actions/defs/eat.rs:67:9:
attempt to subtract with overflow

---- no_human_day_real_run_replays_metrics_and_trace_projection stdout ----

thread 'no_human_day_real_run_replays_metrics_and_trace_projection' (7117) panicked at crates/tracewake-core/src/actions/defs/eat.rs:67:9:
attempt to subtract with overflow

---- no_human_decision_context_hash_gate_fails_when_source_evidence_tampered stdout ----

thread 'no_human_decision_context_hash_gate_fails_when_source_evidence_tampered' (7119) panicked at crates/tracewake-core/src/actions/defs/eat.rs:67:9:
attempt to subtract with overflow

failures:
    food_unavailable_fixture_records_typed_failure_without_refill
    no_human_day_fixture_has_roster_activity_and_metrics_envelope
    no_human_day_real_run_replays_metrics_and_trace_projection
    no_human_decision_context_hash_gate_fails_when_source_evidence_tampered
    no_human_need_ledger_has_no_duplicate_regime_charges

test result: FAILED. 37 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
