*** crates/tracewake-core/src/state.rs:58:9: replace EntityId::as_str -> &str with "xyzzy"

*** mutation diff:
--- crates/tracewake-core/src/state.rs
+++ replace EntityId::as_str -> &str with "xyzzy"
@@ -50,28 +50,17 @@
             EntityId::Workplace(_) => EntityKind::Workplace,
             EntityId::SleepAffordance(_) => EntityKind::SleepAffordance,
             EntityId::InstitutionPlaceholder(_) => EntityKind::InstitutionPlaceholder,
             EntityId::RecordPlaceholder(_) => EntityKind::RecordPlaceholder,
         }
     }
 
     pub fn as_str(&self) -> &str {
-        match self {
-            EntityId::Actor(id) => id.as_str(),
-            EntityId::Place(id) => id.as_str(),
-            EntityId::Door(id) => id.as_str(),
-            EntityId::Container(id) => id.as_str(),
-            EntityId::Item(id) => id.as_str(),
-            EntityId::FoodSupply(id) => id.as_str(),
-            EntityId::Workplace(id) => id.as_str(),
-            EntityId::SleepAffordance(id) => id.as_str(),
-            EntityId::InstitutionPlaceholder(id) => id.as_str(),
-            EntityId::RecordPlaceholder(id) => id.as_str(),
-        }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq)]
 pub struct EntityHeader {
     pub id: EntityId,
     pub kind: EntityKind,
     pub display_label: String,

---- state::tests::entity_header_kind_follows_typed_entity_id stdout ----

thread 'state::tests::entity_header_kind_follows_typed_entity_id' (7672) panicked at crates/tracewake-core/src/state.rs:708:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "strongbox_tomas"

failures:
    state::tests::entity_header_kind_follows_typed_entity_id

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
