*** crates/tracewake-core/src/view_models.rs:290:9: replace ActionAvailability::is_available -> bool with true

*** mutation diff:
--- crates/tracewake-core/src/view_models.rs
+++ replace ActionAvailability::is_available -> bool with true
@@ -282,17 +282,17 @@
             reason_codes,
             actor_safe_summary: actor_safe_summary.into(),
             provenance_refs,
             debug_only_diagnostics,
         }
     }
 
     pub const fn is_available(&self) -> bool {
-        matches!(self, Self::Available)
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn reason_codes(&self) -> &[ReasonCode] {
         match self {
             Self::Available => &[],
             Self::Disabled { reason_codes, .. } => reason_codes,
         }
     }

---- projections::tests::closed_blocking_door_move_is_disabled_with_validator_reason stdout ----

thread 'projections::tests::closed_blocking_door_move_is_disabled_with_validator_reason' (24866) panicked at crates/tracewake-core/src/projections.rs:2324:9:
assertion failed: !entry.enabled

---- projections::tests::closed_opaque_container_check_is_disabled_with_validator_reason stdout ----

thread 'projections::tests::closed_opaque_container_check_is_disabled_with_validator_reason' (24867) panicked at crates/tracewake-core/src/projections.rs:2292:9:
assertion failed: !entry.enabled

---- projections::tests::phase3a_workplace_semantic_actions_require_place_access_and_provenance stdout ----

thread 'projections::tests::phase3a_workplace_semantic_actions_require_place_access_and_provenance' (24893) panicked at crates/tracewake-core/src/projections.rs:1891:9:
assertion failed: !elsewhere.enabled

failures:
    projections::tests::closed_blocking_door_move_is_disabled_with_validator_reason
    projections::tests::closed_opaque_container_check_is_disabled_with_validator_reason
    projections::tests::locked_container_check_is_disabled_with_validator_reason
    projections::tests::phase3a_semantic_actions_include_disabled_empty_food_and_known_sleep
    projections::tests::phase3a_workplace_semantic_actions_require_place_access_and_provenance
    view_models::tests::action_availability_carries_typed_reason_and_provenance

test result: FAILED. 449 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
