*** crates/tracewake-core/src/view_models.rs:290:9: replace ActionAvailability::is_available -> bool with false

*** mutation diff:
--- crates/tracewake-core/src/view_models.rs
+++ replace ActionAvailability::is_available -> bool with false
@@ -282,17 +282,17 @@
             reason_codes,
             actor_safe_summary: actor_safe_summary.into(),
             provenance_refs,
             debug_only_diagnostics,
         }
     }
 
     pub const fn is_available(&self) -> bool {
-        matches!(self, Self::Available)
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn reason_codes(&self) -> &[ReasonCode] {
         match self {
             Self::Available => &[],
             Self::Disabled { reason_codes, .. } => reason_codes,
         }
     }

---- projections::tests::phase3a_workplace_semantic_actions_require_place_access_and_provenance stdout ----

thread 'projections::tests::phase3a_workplace_semantic_actions_require_place_access_and_provenance' (29452) panicked at crates/tracewake-core/src/projections.rs:1883:9:
assertion failed: here.enabled

---- view_models::tests::semantic_action_id_is_stable_and_target_specific stdout ----

thread 'view_models::tests::semantic_action_id_is_stable_and_target_specific' (29539) panicked at crates/tracewake-core/src/view_models.rs:773:9:
assertion failed: entry.availability.is_available()

failures:
    projections::tests::phase3a_workplace_semantic_actions_require_place_access_and_provenance
    view_models::tests::semantic_action_id_is_stable_and_target_specific

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
