*** crates/tracewake-core/src/view_models.rs:294:9: replace ActionAvailability::reason_codes -> &[ReasonCode] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/tracewake-core/src/view_models.rs
+++ replace ActionAvailability::reason_codes -> &[ReasonCode] with Vec::leak(Vec::new())
@@ -286,20 +286,17 @@
         }
     }
 
     pub const fn is_available(&self) -> bool {
         matches!(self, Self::Available)
     }
 
     pub fn reason_codes(&self) -> &[ReasonCode] {
-        match self {
-            Self::Available => &[],
-            Self::Disabled { reason_codes, .. } => reason_codes,
-        }
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn actor_safe_summary(&self) -> Option<&str> {
         match self {
             Self::Available => None,
             Self::Disabled {
                 actor_safe_summary, ..
             } => Some(actor_safe_summary),

---- projections::tests::closed_opaque_container_check_is_disabled_with_validator_reason stdout ----

thread 'projections::tests::closed_opaque_container_check_is_disabled_with_validator_reason' (1517) panicked at crates/tracewake-core/src/projections.rs:2293:9:
assertion `left == right` failed
  left: []
 right: [ContainerClosed]

---- projections::tests::closed_blocking_door_move_is_disabled_with_validator_reason stdout ----

thread 'projections::tests::closed_blocking_door_move_is_disabled_with_validator_reason' (1516) panicked at crates/tracewake-core/src/projections.rs:2325:9:
assertion `left == right` failed
  left: []
 right: [DoorClosedBlocksMovement]

---- projections::tests::locked_container_check_is_disabled_with_validator_reason stdout ----

thread 'projections::tests::locked_container_check_is_disabled_with_validator_reason' (1535) panicked at crates/tracewake-core/src/projections.rs:2445:9:
assertion `left == right` failed
  left: []
 right: [ContainerLocked]

failures:
    projections::tests::closed_blocking_door_move_is_disabled_with_validator_reason
    projections::tests::closed_opaque_container_check_is_disabled_with_validator_reason
    projections::tests::locked_container_check_is_disabled_with_validator_reason
    view_models::tests::action_availability_carries_typed_reason_and_provenance
    view_models::tests::availability_and_why_not_snapshots_preserve_typed_debug_values

test result: FAILED. 450 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
