*** crates/tracewake-core/src/view_models.rs:301:9: replace ActionAvailability::actor_safe_summary -> Option<&str> with Some("xyzzy")

*** mutation diff:
--- crates/tracewake-core/src/view_models.rs
+++ replace ActionAvailability::actor_safe_summary -> Option<&str> with Some("xyzzy")
@@ -293,22 +293,17 @@
     pub fn reason_codes(&self) -> &[ReasonCode] {
         match self {
             Self::Available => &[],
             Self::Disabled { reason_codes, .. } => reason_codes,
         }
     }
 
     pub fn actor_safe_summary(&self) -> Option<&str> {
-        match self {
-            Self::Available => None,
-            Self::Disabled {
-                actor_safe_summary, ..
-            } => Some(actor_safe_summary),
-        }
+        Some("xyzzy") /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn provenance_refs(&self) -> &[ActionAvailabilityProvenance] {
         match self {
             Self::Available => &[],
             Self::Disabled {
                 provenance_refs, ..
             } => provenance_refs,

---- projections::tests::closed_opaque_container_check_is_disabled_with_validator_reason stdout ----

thread 'projections::tests::closed_opaque_container_check_is_disabled_with_validator_reason' (15207) panicked at crates/tracewake-core/src/projections.rs:2297:9:
assertion `left == right` failed
  left: Some("xyzzy")
 right: Some("The container is closed.")

---- projections::tests::closed_blocking_door_move_is_disabled_with_validator_reason stdout ----

thread 'projections::tests::closed_blocking_door_move_is_disabled_with_validator_reason' (15206) panicked at crates/tracewake-core/src/projections.rs:2329:9:
assertion `left == right` failed
  left: Some("xyzzy")
 right: Some("The door is closed.")

---- projections::tests::locked_container_check_is_disabled_with_validator_reason stdout ----

thread 'projections::tests::locked_container_check_is_disabled_with_validator_reason' (15225) panicked at crates/tracewake-core/src/projections.rs:2449:9:
assertion `left == right` failed
  left: Some("xyzzy")
 right: Some("The container is locked.")

failures:
    projections::tests::closed_blocking_door_move_is_disabled_with_validator_reason
    projections::tests::closed_opaque_container_check_is_disabled_with_validator_reason
    projections::tests::locked_container_check_is_disabled_with_validator_reason
    view_models::tests::action_availability_carries_typed_reason_and_provenance
    view_models::tests::action_availability_reason_codes_do_not_depend_on_display_text

test result: FAILED. 450 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
