*** crates/tracewake-core/src/view_models.rs:310:9: replace ActionAvailability::provenance_refs -> &[ActionAvailabilityProvenance] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/tracewake-core/src/view_models.rs
+++ replace ActionAvailability::provenance_refs -> &[ActionAvailabilityProvenance] with Vec::leak(Vec::new())
@@ -302,22 +302,17 @@
             Self::Available => None,
             Self::Disabled {
                 actor_safe_summary, ..
             } => Some(actor_safe_summary),
         }
     }
 
     pub fn provenance_refs(&self) -> &[ActionAvailabilityProvenance] {
-        match self {
-            Self::Available => &[],
-            Self::Disabled {
-                provenance_refs, ..
-            } => provenance_refs,
-        }
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn debug_only_diagnostics(&self) -> &[String] {
         match self {
             Self::Available => &[],
             Self::Disabled {
                 debug_only_diagnostics,
                 ..

---- projections::tests::closed_opaque_container_check_is_disabled_with_validator_reason stdout ----

thread 'projections::tests::closed_opaque_container_check_is_disabled_with_validator_reason' (19766) panicked at crates/tracewake-core/src/projections.rs:2301:9:
assertion failed: entry.availability.provenance_refs().iter().any(|source|
        {
            source.kind ==
                ActionAvailabilityProvenanceKind::HolderKnownContext
        })

---- projections::tests::disabled_embodied_availability_provenance_uses_actor_visible_facts_only stdout ----

thread 'projections::tests::disabled_embodied_availability_provenance_uses_actor_visible_facts_only' (19770) panicked at crates/tracewake-core/src/projections.rs:2416:9:
disabled availability must carry provenance

---- view_models::tests::action_availability_carries_typed_reason_and_provenance stdout ----

thread 'view_models::tests::action_availability_carries_typed_reason_and_provenance' (19871) panicked at crates/tracewake-core/src/view_models.rs:799:13:
index out of bounds: the len is 0 but the index is 0

failures:
    projections::tests::closed_opaque_container_check_is_disabled_with_validator_reason
    projections::tests::disabled_embodied_availability_provenance_uses_actor_visible_facts_only
    view_models::tests::action_availability_carries_typed_reason_and_provenance
    view_models::tests::availability_and_why_not_snapshots_preserve_typed_debug_values

test result: FAILED. 451 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
