*** crates/tracewake-core/src/view_models.rs:319:9: replace ActionAvailability::debug_only_diagnostics -> &[String] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/tracewake-core/src/view_models.rs
+++ replace ActionAvailability::debug_only_diagnostics -> &[String] with Vec::leak(Vec::new())
@@ -311,23 +311,17 @@
             Self::Available => &[],
             Self::Disabled {
                 provenance_refs, ..
             } => provenance_refs,
         }
     }
 
     pub fn debug_only_diagnostics(&self) -> &[String] {
-        match self {
-            Self::Available => &[],
-            Self::Disabled {
-                debug_only_diagnostics,
-                ..
-            } => debug_only_diagnostics,
-        }
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq, PartialOrd, Ord)]
 pub struct ActionAvailabilityProvenance {
     pub kind: ActionAvailabilityProvenanceKind,
     pub reference: String,
 }

---- view_models::tests::availability_and_why_not_snapshots_preserve_typed_debug_values stdout ----

thread 'view_models::tests::availability_and_why_not_snapshots_preserve_typed_debug_values' (24444) panicked at crates/tracewake-core/src/view_models.rs:1007:9:
assertion `left == right` failed
  left: ["reason:target_not_reachable", "provenance:holder_known_context:hkc.actor_tomas.7", "provenance:source_event:event_visible_route", "provenance:validation_report:report.move.back_room", "provenance:validator_fact:door_id=door_shop_back"]

failures:
    view_models::tests::availability_and_why_not_snapshots_preserve_typed_debug_values

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
