*** crates/tracewake-core/src/view_models.rs:354:9: replace ActionAvailabilityProvenanceKind::stable_id -> &'static str with "xyzzy"

*** mutation diff:
--- crates/tracewake-core/src/view_models.rs
+++ replace ActionAvailabilityProvenanceKind::stable_id -> &'static str with "xyzzy"
@@ -346,22 +346,17 @@
     HolderKnownContext,
     SourceEvent,
     ValidationReport,
     ValidatorFact,
 }
 
 impl ActionAvailabilityProvenanceKind {
     pub const fn stable_id(self) -> &'static str {
-        match self {
-            Self::HolderKnownContext => "holder_known_context",
-            Self::SourceEvent => "source_event",
-            Self::ValidationReport => "validation_report",
-            Self::ValidatorFact => "validator_fact",
-        }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Debug, PartialEq, Eq)]
 pub enum DebugViewModel {
     ControllerBinding(DebugControllerBindingView),
     EventLog(DebugEventLogView),
     ItemLocation(DebugItemLocationView),

---- view_models::tests::availability_and_why_not_snapshots_preserve_typed_debug_values stdout ----

thread 'view_models::tests::availability_and_why_not_snapshots_preserve_typed_debug_values' (10213) panicked at crates/tracewake-core/src/view_models.rs:1008:9:
assertion `left == right` failed

failures:
    view_models::tests::availability_and_why_not_snapshots_preserve_typed_debug_values

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
