*** crates/tracewake-core/src/view_models.rs:533:9: replace DebugActionRejectionView::debug_only -> bool with false

*** mutation diff:
--- crates/tracewake-core/src/view_models.rs
+++ replace DebugActionRejectionView::debug_only -> bool with false
@@ -525,17 +525,17 @@
     pub fn new(report: ValidationReport) -> Self {
         Self {
             debug_capability: DebugCapability::mint(),
             report,
         }
     }
 
     pub fn debug_only(&self) -> bool {
-        self.debug_capability.debug_only()
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl DebugProjectionRebuildView {
     pub fn new(summary: impl Into<String>) -> Self {
         Self {
             debug_capability: DebugCapability::mint(),
             summary: summary.into(),

---- view_models::tests::debug_view_channel_routing_rejects_forged_non_debug_capability stdout ----

thread 'view_models::tests::debug_view_channel_routing_rejects_forged_non_debug_capability' (14233) panicked at crates/tracewake-core/src/view_models.rs:958:9:
assertion `left == right` failed
  left: [Some("debug:controller_binding"), Some("debug:event_log"), Some("debug:item_location"), None, Some("debug:projection_rebuild"), Some("debug:replay_report"), Some("debug:epistemics"), Some("debug:beliefs"), Some("debug:observations"), Some("debug:truth_belief_mismatch")]

failures:
    view_models::tests::debug_view_channel_routing_rejects_forged_non_debug_capability

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
