*** crates/tracewake-core/src/view_models.rs:624:9: replace DebugObservationsView::non_diegetic_marker -> &'static str with "xyzzy"

*** mutation diff:
--- crates/tracewake-core/src/view_models.rs
+++ replace DebugObservationsView::non_diegetic_marker -> &'static str with "xyzzy"
@@ -616,17 +616,17 @@
         }
     }
 
     pub fn debug_only(&self) -> bool {
         self.debug_capability.debug_only()
     }
 
     pub fn non_diegetic_marker(&self) -> &'static str {
-        DEBUG_EPISTEMICS_MARKER
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl DebugTruthBeliefMismatchView {
     pub fn new(
         item_id: ItemId,
         ground_truth_location: impl Into<String>,
         held_belief_summary: impl Into<String>,

---- view_models::tests::debug_view_channel_routing_rejects_forged_non_debug_capability stdout ----

thread 'view_models::tests::debug_view_channel_routing_rejects_forged_non_debug_capability' (22243) panicked at crates/tracewake-core/src/view_models.rs:958:9:
assertion `left == right` failed
  left: [Some("debug:controller_binding"), Some("debug:event_log"), Some("debug:item_location"), Some("debug:action_rejection"), Some("debug:projection_rebuild"), Some("debug:replay_report"), Some("debug:epistemics"), Some("debug:beliefs"), None, Some("debug:truth_belief_mismatch")]

---- view_models::tests::focused_debug_views_are_marked_non_diegetic stdout ----

thread 'view_models::tests::focused_debug_views_are_marked_non_diegetic' (22244) panicked at crates/tracewake-core/src/view_models.rs:935:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "DEBUG NON-DIEGETIC: Epistemics"

failures:
    view_models::tests::debug_view_channel_routing_rejects_forged_non_debug_capability
    view_models::tests::focused_debug_views_are_marked_non_diegetic

test result: FAILED. 453 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
