*** crates/tracewake-core/src/view_models.rs:649:9: replace DebugTruthBeliefMismatchView::non_diegetic_marker -> &'static str with ""

*** mutation diff:
--- crates/tracewake-core/src/view_models.rs
+++ replace DebugTruthBeliefMismatchView::non_diegetic_marker -> &'static str with ""
@@ -641,17 +641,17 @@
         }
     }
 
     pub fn debug_only(&self) -> bool {
         self.debug_capability.debug_only()
     }
 
     pub fn non_diegetic_marker(&self) -> &'static str {
-        DEBUG_EPISTEMICS_MARKER
+        "" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 fn classify_why_not(report: &ValidationReport) -> WhyNotFailureKind {
     if report.reason_codes.iter().any(|reason| {
         matches!(
             reason,
             ReasonCode::KnowledgePreconditionNotMet

---- view_models::tests::debug_view_channel_routing_rejects_forged_non_debug_capability stdout ----

thread 'view_models::tests::debug_view_channel_routing_rejects_forged_non_debug_capability' (3452) panicked at crates/tracewake-core/src/view_models.rs:958:9:
assertion `left == right` failed
  left: [Some("debug:controller_binding"), Some("debug:event_log"), Some("debug:item_location"), Some("debug:action_rejection"), Some("debug:projection_rebuild"), Some("debug:replay_report"), Some("debug:epistemics"), Some("debug:beliefs"), Some("debug:observations"), None]

failures:
    view_models::tests::debug_view_channel_routing_rejects_forged_non_debug_capability

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
