*** crates/tracewake-core/src/view_models.rs:79:9: replace WhyNotFailureKind::stable_id -> &'static str with "xyzzy"

*** mutation diff:
--- crates/tracewake-core/src/view_models.rs
+++ replace WhyNotFailureKind::stable_id -> &'static str with "xyzzy"
@@ -71,24 +71,17 @@
     Access,
     ReservationOrBodyConstraint,
     AuthoredContentInvalidity,
     UnsupportedAction,
 }
 
 impl WhyNotFailureKind {
     pub const fn stable_id(self) -> &'static str {
-        match self {
-            Self::ActorKnownUncertainty => "actor_known_uncertainty",
-            Self::GroundTruthValidationFailure => "ground_truth_validation_failure",
-            Self::Access => "access",
-            Self::ReservationOrBodyConstraint => "reservation_or_body_constraint",
-            Self::AuthoredContentInvalidity => "authored_content_invalidity",
-            Self::UnsupportedAction => "unsupported_action",
-        }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl From<&ValidationReport> for WhyNotView {
     fn from(report: &ValidationReport) -> Self {
         Self {
             failure_kind: classify_why_not(report),
             actor_known_summary: report.actor_visible_summary.clone(),

---- view_models::tests::availability_and_why_not_snapshots_preserve_typed_debug_values stdout ----

thread 'view_models::tests::availability_and_why_not_snapshots_preserve_typed_debug_values' (20367) panicked at crates/tracewake-core/src/view_models.rs:1025:9:
assertion `left == right` failed
  left: "why_not:xyzzy:target_not_reachable"
 right: "why_not:actor_known_uncertainty:target_not_reachable"

failures:
    view_models::tests::availability_and_why_not_snapshots_preserve_typed_debug_values

test result: FAILED. 454 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
