*** crates/tracewake-tui/src/app.rs:134:9: replace TuiApp::bind_actor -> Result<(), AppError> with Ok(())

*** mutation diff:
--- crates/tracewake-tui/src/app.rs
+++ replace TuiApp::bind_actor -> Result<(), AppError> with Ok(())
@@ -126,17 +126,17 @@
             content_version: loaded.manifest.content_version,
             scheduler: DeterministicScheduler::new(SimTick::ZERO),
             last_rejection: None,
             epistemic_projection,
         })
     }
 
     pub fn bind_actor(&mut self, actor_id: ActorId) -> Result<(), AppError> {
-        self.bind_actor_with_mode(actor_id, ControllerMode::Embodied)
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn bind_debug_actor(&mut self, actor_id: ActorId) -> Result<(), AppError> {
         self.bind_actor_with_mode(actor_id, ControllerMode::Debug)
     }
 
     fn bind_actor_with_mode(
         &mut self,

---- app::tests::app_binds_renders_submits_and_rerenders stdout ----

thread 'app::tests::app_binds_renders_submits_and_rerenders' (4141) panicked at crates/tracewake-tui/src/app.rs:480:37:
called `Result::unwrap()` on an `Err` value: ActorNotBound

---- app::tests::controller_mode_debug_availability_decision_is_explicit stdout ----

thread 'app::tests::controller_mode_debug_availability_decision_is_explicit' (4144) panicked at crates/tracewake-tui/src/app.rs:701:37:
called `Result::unwrap()` on an `Err` value: ActorNotBound

---- app::tests::rejected_action_surfaces_why_not_from_validation_report stdout ----

thread 'app::tests::rejected_action_surfaces_why_not_from_validation_report' (4146) panicked at crates/tracewake-tui/src/app.rs:621:14:
called `Result::unwrap()` on an `Err` value: ActorNotBound

failures:
    app::tests::app_binds_renders_submits_and_rerenders
    app::tests::controller_mode_debug_availability_decision_is_explicit
    app::tests::rejected_action_surfaces_why_not_from_validation_report
    debug_panels::tests::action_rejection_panel_renders_validation_report
    debug_panels::tests::debug_panels_are_marked_non_diegetic_and_do_not_change_embodied_view_or_checksum
    transcript::tests::representative_transcript_is_deterministic

test result: FAILED. 38 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
