*** crates/tracewake-tui/src/app.rs:138:9: replace TuiApp::bind_debug_actor -> Result<(), AppError> with Ok(())

*** mutation diff:
--- crates/tracewake-tui/src/app.rs
+++ replace TuiApp::bind_debug_actor -> Result<(), AppError> with Ok(())
@@ -130,17 +130,17 @@
         })
     }
 
     pub fn bind_actor(&mut self, actor_id: ActorId) -> Result<(), AppError> {
         self.bind_actor_with_mode(actor_id, ControllerMode::Embodied)
     }
 
     pub fn bind_debug_actor(&mut self, actor_id: ActorId) -> Result<(), AppError> {
-        self.bind_actor_with_mode(actor_id, ControllerMode::Debug)
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn bind_actor_with_mode(
         &mut self,
         actor_id: ActorId,
         mode: ControllerMode,
     ) -> Result<(), AppError> {
         if !self.state.actors().contains_key(&actor_id) {

---- app::tests::app_debug_overlay_renders_only_for_bound_debug_controller stdout ----

thread 'app::tests::app_debug_overlay_renders_only_for_bound_debug_controller' (6977) panicked at crates/tracewake-tui/src/app.rs:513:60:
called `Result::unwrap()` on an `Err` value: ActorNotBound

---- app::tests::app_runs_no_human_day_into_real_log_metrics stdout ----

thread 'app::tests::app_runs_no_human_day_into_real_log_metrics' (6978) panicked at crates/tracewake-tui/src/app.rs:636:45:
called `Result::unwrap()` on an `Err` value: DebugUnavailable

---- app::tests::controller_mode_debug_availability_decision_is_explicit stdout ----

thread 'app::tests::controller_mode_debug_availability_decision_is_explicit' (6979) panicked at crates/tracewake-tui/src/app.rs:705:9:
assertion failed: app.current_view().unwrap().debug_available

failures:
    app::tests::app_debug_overlay_renders_only_for_bound_debug_controller
    app::tests::app_runs_no_human_day_into_real_log_metrics
    app::tests::controller_mode_debug_availability_decision_is_explicit
    run::tests::scripted_loop_dispatches_commands_and_exits_cleanly
    run::tests::wait_alias_resolves_only_from_current_view_actions

test result: FAILED. 39 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
