*** crates/tracewake-tui/src/app.rs:146:12: delete ! in TuiApp::bind_actor_with_mode

*** mutation diff:
--- crates/tracewake-tui/src/app.rs
+++ delete ! in TuiApp::bind_actor_with_mode
@@ -138,17 +138,17 @@
         self.bind_actor_with_mode(actor_id, ControllerMode::Debug)
     }
 
     fn bind_actor_with_mode(
         &mut self,
         actor_id: ActorId,
         mode: ControllerMode,
     ) -> Result<(), AppError> {
-        if !self.state.actors().contains_key(&actor_id) {
+        if  /* ~ changed by cargo-mutants ~ */self.state.actors().contains_key(&actor_id) {
             return Err(AppError::ActorNotFound(actor_id));
         }
         self.controller_bindings.attach(
             self.controller_id.clone(),
             actor_id.clone(),
             mode,
             self.scheduler.current_tick,
             &mut self.log,

---- app::tests::rejected_action_surfaces_why_not_from_validation_report stdout ----

thread 'app::tests::rejected_action_surfaces_why_not_from_validation_report' (12649) panicked at crates/tracewake-tui/src/app.rs:617:61:
called `Result::unwrap()` on an `Err` value: ActorNotFound(ActorId(StableId("actor_sena")))

---- app::tests::app_binds_renders_submits_and_rerenders stdout ----

thread 'app::tests::app_binds_renders_submits_and_rerenders' (12644) panicked at crates/tracewake-tui/src/app.rs:479:14:
called `Result::unwrap()` on an `Err` value: ActorNotFound(ActorId(StableId("actor_tomas")))

---- app::tests::app_debug_overlay_renders_only_for_bound_debug_controller stdout ----

thread 'app::tests::app_debug_overlay_renders_only_for_bound_debug_controller' (12645) panicked at crates/tracewake-tui/src/app.rs:511:14:
called `Result::unwrap()` on an `Err` value: ActorNotFound(ActorId(StableId("actor_tomas")))

failures:
    app::tests::app_binds_renders_submits_and_rerenders
    app::tests::app_debug_overlay_renders_only_for_bound_debug_controller
    app::tests::app_runs_no_human_day_into_real_log_metrics
    app::tests::controller_mode_debug_availability_decision_is_explicit
    app::tests::rejected_action_surfaces_why_not_from_validation_report
    debug_panels::tests::action_rejection_panel_renders_validation_report
    debug_panels::tests::debug_panels_are_marked_non_diegetic_and_do_not_change_embodied_view_or_checksum
    run::tests::scripted_loop_dispatches_commands_and_exits_cleanly
    run::tests::wait_alias_resolves_only_from_current_view_actions
    transcript::tests::representative_transcript_is_deterministic

test result: FAILED. 34 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
