*** crates/tracewake-tui/src/app.rs:146:9: replace TuiApp::bind_actor_with_mode -> Result<(), AppError> with Ok(())

*** mutation diff:
--- crates/tracewake-tui/src/app.rs
+++ replace TuiApp::bind_actor_with_mode -> Result<(), AppError> with Ok(())
@@ -138,39 +138,17 @@
         self.bind_actor_with_mode(actor_id, ControllerMode::Debug)
     }
 
     fn bind_actor_with_mode(
         &mut self,
         actor_id: ActorId,
         mode: ControllerMode,
     ) -> Result<(), AppError> {
-        if !self.state.actors().contains_key(&actor_id) {
-            return Err(AppError::ActorNotFound(actor_id));
-        }
-        self.controller_bindings.attach(
-            self.controller_id.clone(),
-            actor_id.clone(),
-            mode,
-            self.scheduler.current_tick,
-            &mut self.log,
-            self.content_manifest_id.clone(),
-        );
-        record_current_place_perception_and_project(
-            &mut self.log,
-            &mut self.state,
-            &mut self.agent_state,
-            &mut self.epistemic_projection,
-            &actor_id,
-            self.scheduler.current_tick,
-            &self.content_manifest_id,
-        );
-        self.bound_actor_id = Some(actor_id);
-        self.last_rejection = None;
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn current_view(&self) -> Result<EmbodiedViewModel, AppError> {
         let actor_id = self
             .bound_actor_id
             .as_ref()
             .ok_or(AppError::ActorNotBound)?;
         let context = self.current_view_context(actor_id);

---- app::tests::rejected_action_surfaces_why_not_from_validation_report stdout ----

thread 'app::tests::rejected_action_surfaces_why_not_from_validation_report' (9815) panicked at crates/tracewake-tui/src/app.rs:599:14:
called `Result::unwrap()` on an `Err` value: ActorNotBound

---- app::tests::controller_mode_debug_availability_decision_is_explicit stdout ----

thread 'app::tests::controller_mode_debug_availability_decision_is_explicit' (9813) panicked at crates/tracewake-tui/src/app.rs:679:37:
called `Result::unwrap()` on an `Err` value: ActorNotBound

---- app::tests::app_binds_renders_submits_and_rerenders stdout ----

thread 'app::tests::app_binds_renders_submits_and_rerenders' (9810) panicked at crates/tracewake-tui/src/app.rs:458:37:
called `Result::unwrap()` on an `Err` value: ActorNotBound

failures:
    app::tests::app_binds_renders_submits_and_rerenders
    app::tests::app_debug_overlay_renders_only_for_bound_debug_controller
    app::tests::app_runs_no_human_day_into_real_log_metrics
    app::tests::controller_mode_debug_availability_decision_is_explicit
    app::tests::rejected_action_surfaces_why_not_from_validation_report
    debug_panels::tests::action_rejection_panel_renders_validation_report
    debug_panels::tests::debug_panels_are_marked_non_diegetic_and_do_not_change_embodied_view_or_checksum
    run::tests::scripted_loop_dispatches_commands_and_exits_cleanly
    run::tests::wait_alias_resolves_only_from_current_view_actions
    transcript::tests::representative_transcript_is_deterministic

test result: FAILED. 34 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
