*** crates/tracewake-tui/src/app.rs:194:9: replace TuiApp::debug_available_for -> bool with true

*** mutation diff:
--- crates/tracewake-tui/src/app.rs
+++ replace TuiApp::debug_available_for -> bool with true
@@ -186,22 +186,17 @@
             build_embodied_view_model(&context, &source, &preflight, self.last_rejection.as_ref())
                 .map_err(AppError::from)?;
         view.notebook = Some(build_notebook_view(&self.epistemic_projection, &context));
         view.debug_available = self.debug_available_for(actor_id);
         Ok(view)
     }
 
     fn debug_available_for(&self, actor_id: &ActorId) -> bool {
-        self.controller_bindings
-            .binding(&self.controller_id)
-            .is_some_and(|binding| {
-                binding.binding.bound_actor_id.as_ref() == Some(actor_id)
-                    && matches!(binding.binding.mode, ControllerMode::Debug)
-            })
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn debug_available(&self) -> bool {
         self.bound_actor_id
             .as_ref()
             .is_some_and(|actor_id| self.debug_available_for(actor_id))
     }

---- app::tests::controller_mode_debug_availability_decision_is_explicit stdout ----

thread 'app::tests::controller_mode_debug_availability_decision_is_explicit' (15790) panicked at crates/tracewake-tui/src/app.rs:696:9:
assertion failed: !app.current_view().unwrap().debug_available

---- app::tests::app_binds_renders_submits_and_rerenders stdout ----

thread 'app::tests::app_binds_renders_submits_and_rerenders' (15787) panicked at crates/tracewake-tui/src/app.rs:475:9:
assertion failed: !app.current_view().unwrap().debug_available

---- app::tests::app_debug_overlay_renders_only_for_bound_debug_controller stdout ----

thread 'app::tests::app_debug_overlay_renders_only_for_bound_debug_controller' (15788) panicked at crates/tracewake-tui/src/app.rs:519:9:
assertion `left == right` failed
  left: Some("DEBUG NON-DIEGETIC: Embodied Overlay\nKnowledge context: id=hkc.actor_tomas.0.8 hash=hkc1-c7f72b03888977a4 tick=0 frontier=8 sources=allowed=5 provenance=5\nDebug: available=true")
 right: None

failures:
    app::tests::app_binds_renders_submits_and_rerenders
    app::tests::app_debug_overlay_renders_only_for_bound_debug_controller
    app::tests::controller_mode_debug_availability_decision_is_explicit

test result: FAILED. 41 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.16s

*** result: Failure(101)
