*** crates/tracewake-tui/src/app.rs:194:9: replace TuiApp::debug_available_for -> bool with false

*** mutation diff:
--- crates/tracewake-tui/src/app.rs
+++ replace TuiApp::debug_available_for -> bool with false
@@ -186,22 +186,17 @@
             build_embodied_view_model(&context, &source, &preflight, self.last_rejection.as_ref())
                 .map_err(AppError::from)?;
         view.notebook = Some(build_notebook_view(&self.epistemic_projection, &context));
         view.debug_available = self.debug_available_for(actor_id);
         Ok(view)
     }
 
     fn debug_available_for(&self, actor_id: &ActorId) -> bool {
-        self.controller_bindings
-            .binding(&self.controller_id)
-            .is_some_and(|binding| {
-                binding.binding.bound_actor_id.as_ref() == Some(actor_id)
-                    && matches!(binding.binding.mode, ControllerMode::Debug)
-            })
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn debug_available(&self) -> bool {
         self.bound_actor_id
             .as_ref()
             .is_some_and(|actor_id| self.debug_available_for(actor_id))
     }

---- app::tests::app_debug_overlay_renders_only_for_bound_debug_controller stdout ----

thread 'app::tests::app_debug_overlay_renders_only_for_bound_debug_controller' (18622) panicked at crates/tracewake-tui/src/app.rs:508:69:
called `Option::unwrap()` on a `None` value

---- app::tests::app_runs_no_human_day_into_real_log_metrics stdout ----

thread 'app::tests::app_runs_no_human_day_into_real_log_metrics' (18623) panicked at crates/tracewake-tui/src/app.rs:631:45:
called `Result::unwrap()` on an `Err` value: DebugUnavailable

---- app::tests::controller_mode_debug_availability_decision_is_explicit stdout ----

thread 'app::tests::controller_mode_debug_availability_decision_is_explicit' (18624) panicked at crates/tracewake-tui/src/app.rs:700:9:
assertion failed: app.current_view().unwrap().debug_available

failures:
    app::tests::app_debug_overlay_renders_only_for_bound_debug_controller
    app::tests::app_runs_no_human_day_into_real_log_metrics
    app::tests::controller_mode_debug_availability_decision_is_explicit
    run::tests::scripted_loop_dispatches_commands_and_exits_cleanly

test result: FAILED. 40 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
