*** crates/tracewake-tui/src/app.rs:198:21: replace && with || in TuiApp::debug_available_for

*** mutation diff:
--- crates/tracewake-tui/src/app.rs
+++ replace && with || in TuiApp::debug_available_for
@@ -190,17 +190,17 @@
         Ok(view)
     }
 
     fn debug_available_for(&self, actor_id: &ActorId) -> bool {
         self.controller_bindings
             .binding(&self.controller_id)
             .is_some_and(|binding| {
                 binding.binding.bound_actor_id.as_ref() == Some(actor_id)
-                    && matches!(binding.binding.mode, ControllerMode::Debug)
+                    || /* ~ changed by cargo-mutants ~ */ matches!(binding.binding.mode, ControllerMode::Debug)
             })
     }
 
     pub fn debug_available(&self) -> bool {
         self.bound_actor_id
             .as_ref()
             .is_some_and(|actor_id| self.debug_available_for(actor_id))
     }

---- app::tests::app_binds_renders_submits_and_rerenders stdout ----

thread 'app::tests::app_binds_renders_submits_and_rerenders' (21455) panicked at crates/tracewake-tui/src/app.rs:480:9:
assertion failed: !app.current_view().unwrap().debug_available

---- app::tests::controller_mode_debug_availability_decision_is_explicit stdout ----

thread 'app::tests::controller_mode_debug_availability_decision_is_explicit' (21458) panicked at crates/tracewake-tui/src/app.rs:701:9:
assertion failed: !app.current_view().unwrap().debug_available

failures:
    app::tests::app_binds_renders_submits_and_rerenders
    app::tests::controller_mode_debug_availability_decision_is_explicit

test result: FAILED. 42 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.16s

*** result: Failure(101)
