*** crates/tracewake-tui/src/app.rs:203:9: replace TuiApp::debug_available -> bool with true

*** mutation diff:
--- crates/tracewake-tui/src/app.rs
+++ replace TuiApp::debug_available -> bool with true
@@ -195,19 +195,17 @@
             .binding(&self.controller_id)
             .is_some_and(|binding| {
                 binding.binding.bound_actor_id.as_ref() == Some(actor_id)
                     && matches!(binding.binding.mode, ControllerMode::Debug)
             })
     }
 
     pub fn debug_available(&self) -> bool {
-        self.bound_actor_id
-            .as_ref()
-            .is_some_and(|actor_id| self.debug_available_for(actor_id))
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     fn current_view_context(&self, actor_id: &ActorId) -> KnowledgeContext {
         current_place_knowledge_context(
             &self.state,
             Some(&self.epistemic_projection),
             actor_id,
             self.scheduler.current_tick,

---- app::tests::controller_mode_debug_availability_decision_is_explicit stdout ----

thread 'app::tests::controller_mode_debug_availability_decision_is_explicit' (27126) panicked at crates/tracewake-tui/src/app.rs:700:9:
assertion failed: !app.debug_available()

---- run::tests::debug_commands_refuse_without_debug_availability stdout ----

thread 'run::tests::debug_commands_refuse_without_debug_availability' (27162) panicked at crates/tracewake-tui/src/run.rs:256:74:
called `Result::unwrap()` on an `Err` value: Custom { kind: Other, error: "ActorNotBound" }

---- app::tests::run_no_human_day_refuses_intrinsically_without_debug_availability stdout ----

thread 'app::tests::run_no_human_day_refuses_intrinsically_without_debug_availability' (27131) panicked at crates/tracewake-tui/src/app.rs:649:9:
assertion failed: matches!(result, Err(AppError::DebugUnavailable))

failures:
    app::tests::controller_mode_debug_availability_decision_is_explicit
    app::tests::run_no_human_day_refuses_intrinsically_without_debug_availability
    run::tests::debug_commands_refuse_without_debug_availability

test result: FAILED. 41 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.16s

*** result: Failure(101)
