*** crates/tracewake-tui/src/app.rs:203:9: replace TuiApp::debug_available -> bool with false

*** mutation diff:
--- crates/tracewake-tui/src/app.rs
+++ replace TuiApp::debug_available -> bool with false
@@ -195,19 +195,17 @@
             .binding(&self.controller_id)
             .is_some_and(|binding| {
                 binding.binding.bound_actor_id.as_ref() == Some(actor_id)
                     && matches!(binding.binding.mode, ControllerMode::Debug)
             })
     }
 
     pub fn debug_available(&self) -> bool {
-        self.bound_actor_id
-            .as_ref()
-            .is_some_and(|actor_id| self.debug_available_for(actor_id))
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     fn current_view_context(&self, actor_id: &ActorId) -> KnowledgeContext {
         current_place_knowledge_context(
             &self.state,
             Some(&self.epistemic_projection),
             actor_id,
             self.scheduler.current_tick,

---- app::tests::app_runs_no_human_day_into_real_log_metrics stdout ----

thread 'app::tests::app_runs_no_human_day_into_real_log_metrics' (29959) panicked at crates/tracewake-tui/src/app.rs:634:45:
called `Result::unwrap()` on an `Err` value: DebugUnavailable

---- app::tests::controller_mode_debug_availability_decision_is_explicit stdout ----

thread 'app::tests::controller_mode_debug_availability_decision_is_explicit' (29960) panicked at crates/tracewake-tui/src/app.rs:704:9:
assertion failed: app.debug_available()

---- run::tests::scripted_loop_dispatches_commands_and_exits_cleanly stdout ----

thread 'run::tests::scripted_loop_dispatches_commands_and_exits_cleanly' (29998) panicked at crates/tracewake-tui/src/run.rs:234:9:
assertion failed: rendered.contains("DEBUG NON-DIEGETIC: Action Rejection")

failures:
    app::tests::app_runs_no_human_day_into_real_log_metrics
    app::tests::controller_mode_debug_availability_decision_is_explicit
    run::tests::scripted_loop_dispatches_commands_and_exits_cleanly

test result: FAILED. 41 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
