*** crates/tracewake-tui/src/app.rs:220:9: replace TuiApp::render_current_view -> Result<String, AppError> with Ok(String::new())

*** mutation diff:
--- crates/tracewake-tui/src/app.rs
+++ replace TuiApp::render_current_view -> Result<String, AppError> with Ok(String::new())
@@ -212,17 +212,17 @@
             actor_id,
             self.scheduler.current_tick,
             &self.content_manifest_id,
             self.log.events().len() as u64,
         )
     }
 
     pub fn render_current_view(&self) -> Result<String, AppError> {
-        Ok(render_embodied_view(&self.current_view()?))
+        Ok(String::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn render_debug_embodied_overlay(&self) -> Result<Option<String>, AppError> {
         let view = self.current_view()?;
         if view.debug_available {
             Ok(Some(render_debug_overlay(&view)))
         } else {
             Ok(None)

---- app::tests::rejected_action_surfaces_why_not_from_validation_report stdout ----

thread 'app::tests::rejected_action_surfaces_why_not_from_validation_report' (637) panicked at crates/tracewake-tui/src/app.rs:625:9:
assertion failed: rendered.contains("Why-not:")

---- app::tests::app_binds_renders_submits_and_rerenders stdout ----

thread 'app::tests::app_binds_renders_submits_and_rerenders' (632) panicked at crates/tracewake-tui/src/app.rs:482:9:
assertion failed: before.contains("strongbox_tomas")

---- app::tests::render_functions_have_production_callers_or_documented_allowlist stdout ----

thread 'app::tests::render_functions_have_production_callers_or_documented_allowlist' (638) panicked at crates/tracewake-tui/src/app.rs:535:9:
assertion failed: render_reachability_errors(&[render_source, debug_panels_source],
        &[production_source(app_source), production_source(run_source),
                    production_source(transcript_source)]).is_empty()

failures:
    app::tests::app_binds_renders_submits_and_rerenders
    app::tests::rejected_action_surfaces_why_not_from_validation_report
    app::tests::render_functions_have_production_callers_or_documented_allowlist
    run::tests::scripted_loop_dispatches_commands_and_exits_cleanly
    transcript::tests::representative_transcript_is_deterministic

test result: FAILED. 39 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
