*** crates/tracewake-tui/src/app.rs:224:9: replace TuiApp::render_debug_embodied_overlay -> Result<Option<String>, AppError> with Ok(Some("xyzzy".into()))

*** mutation diff:
--- crates/tracewake-tui/src/app.rs
+++ replace TuiApp::render_debug_embodied_overlay -> Result<Option<String>, AppError> with Ok(Some("xyzzy".into()))
@@ -216,22 +216,17 @@
         )
     }
 
     pub fn render_current_view(&self) -> Result<String, AppError> {
         Ok(render_embodied_view(&self.current_view()?))
     }
 
     pub fn render_debug_embodied_overlay(&self) -> Result<Option<String>, AppError> {
-        let view = self.current_view()?;
-        if view.debug_available {
-            Ok(Some(render_debug_overlay(&view)))
-        } else {
-            Ok(None)
-        }
+        Ok(Some("xyzzy".into())) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn submit_semantic_action(
         &mut self,
         semantic_action_id: &SemanticActionId,
     ) -> Result<PipelineResult, AppError> {
         let view = self.current_view()?;
         let entry = view

---- app::tests::app_debug_overlay_renders_only_for_bound_debug_controller stdout ----

thread 'app::tests::app_debug_overlay_renders_only_for_bound_debug_controller' (11970) panicked at crates/tracewake-tui/src/app.rs:509:9:
assertion failed: rendered.contains("DEBUG NON-DIEGETIC: Embodied Overlay")

---- app::tests::render_functions_have_production_callers_or_documented_allowlist stdout ----

thread 'app::tests::render_functions_have_production_callers_or_documented_allowlist' (11975) panicked at crates/tracewake-tui/src/app.rs:530:9:
assertion failed: render_reachability_errors(&[render_source, debug_panels_source],
        &[production_source(app_source), production_source(run_source),
                    production_source(transcript_source)]).is_empty()

---- run::tests::scripted_loop_dispatches_commands_and_exits_cleanly stdout ----

thread 'run::tests::scripted_loop_dispatches_commands_and_exits_cleanly' (12010) panicked at crates/tracewake-tui/src/run.rs:235:9:
assertion failed: rendered.contains("DEBUG NON-DIEGETIC: Embodied Overlay")

failures:
    app::tests::app_debug_overlay_renders_only_for_bound_debug_controller
    app::tests::render_functions_have_production_callers_or_documented_allowlist
    run::tests::scripted_loop_dispatches_commands_and_exits_cleanly

test result: FAILED. 41 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
