*** crates/tracewake-tui/src/app.rs:240:53: replace == with != in TuiApp::submit_semantic_action

*** mutation diff:
--- crates/tracewake-tui/src/app.rs
+++ replace == with != in TuiApp::submit_semantic_action
@@ -232,17 +232,17 @@
     pub fn submit_semantic_action(
         &mut self,
         semantic_action_id: &SemanticActionId,
     ) -> Result<PipelineResult, AppError> {
         let view = self.current_view()?;
         let entry = view
             .semantic_actions
             .iter()
-            .find(|entry| &entry.semantic_action_id == semantic_action_id)
+            .find(|entry| &entry.semantic_action_id != /* ~ changed by cargo-mutants ~ */ semantic_action_id)
             .cloned()
             .ok_or_else(|| AppError::SemanticActionNotFound(semantic_action_id.to_string()))?;
         self.submit_entry(&entry, &view)
     }
 
     fn submit_entry(
         &mut self,
         entry: &SemanticActionEntry,

---- app::tests::app_binds_renders_submits_and_rerenders stdout ----

thread 'app::tests::app_binds_renders_submits_and_rerenders' (15112) panicked at crates/tracewake-tui/src/app.rs:499:9:
assertion `left == right` failed
  left: Rejected
 right: Accepted

---- debug_panels::tests::action_rejection_panel_renders_validation_report stdout ----

thread 'debug_panels::tests::action_rejection_panel_renders_validation_report' (15123) panicked at crates/tracewake-tui/src/debug_panels.rs:281:9:
assertion `left == right` failed
  left: Accepted
 right: Rejected

---- app::tests::rejected_action_surfaces_why_not_from_validation_report stdout ----

thread 'app::tests::rejected_action_surfaces_why_not_from_validation_report' (15117) panicked at crates/tracewake-tui/src/app.rs:622:9:
assertion `left == right` failed
  left: Accepted
 right: Rejected

failures:
    app::tests::app_binds_renders_submits_and_rerenders
    app::tests::rejected_action_surfaces_why_not_from_validation_report
    debug_panels::tests::action_rejection_panel_renders_validation_report
    run::tests::scripted_loop_dispatches_commands_and_exits_cleanly
    transcript::tests::representative_transcript_is_deterministic

test result: FAILED. 39 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
