*** crates/tracewake-tui/src/app.rs:282:33: replace == with != in TuiApp::submit_entry

*** mutation diff:
--- crates/tracewake-tui/src/app.rs
+++ replace == with != in TuiApp::submit_entry
@@ -274,17 +274,17 @@
             agent_state: &mut self.agent_state,
             log: &mut self.log,
             controller_bindings: Some(&self.controller_bindings),
             epistemic_projection: Some(&mut self.epistemic_projection),
             content_manifest_id: self.content_manifest_id.clone(),
             ordering_key,
         };
         let result = run_pipeline(&mut context, &proposal);
-        if result.report.status == ReportStatus::Rejected {
+        if result.report.status != /* ~ changed by cargo-mutants ~ */ ReportStatus::Rejected {
             self.last_rejection = Some(result.report.clone());
         } else {
             self.last_rejection = None;
             if let Some(last_event) = result.appended_events.last() {
                 self.scheduler.current_tick = last_event.sim_tick;
             }
             if let Some(actor_id) = self.bound_actor_id.clone() {
                 record_current_place_perception_and_project(

---- app::tests::rejected_action_surfaces_why_not_from_validation_report stdout ----

thread 'app::tests::rejected_action_surfaces_why_not_from_validation_report' (18261) panicked at crates/tracewake-tui/src/app.rs:625:9:
assertion failed: rendered.contains("Why-not:")

---- debug_panels::tests::action_rejection_panel_renders_validation_report stdout ----

thread 'debug_panels::tests::action_rejection_panel_renders_validation_report' (18267) panicked at crates/tracewake-tui/src/debug_panels.rs:283:63:
called `Option::unwrap()` on a `None` value

---- app::tests::app_binds_renders_submits_and_rerenders stdout ----

thread 'app::tests::app_binds_renders_submits_and_rerenders' (18256) panicked at crates/tracewake-tui/src/app.rs:503:9:
assertion failed: after.contains("coin_stack_01")

failures:
    app::tests::app_binds_renders_submits_and_rerenders
    app::tests::rejected_action_surfaces_why_not_from_validation_report
    debug_panels::tests::action_rejection_panel_renders_validation_report
    transcript::tests::representative_transcript_is_deterministic

test result: FAILED. 40 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
