*** crates/tracewake-tui/src/app.rs:305:9: replace TuiApp::event_count -> usize with 0

*** mutation diff:
--- crates/tracewake-tui/src/app.rs
+++ replace TuiApp::event_count -> usize with 0
@@ -297,17 +297,17 @@
                     &self.content_manifest_id,
                 );
             }
         }
         Ok(result)
     }
 
     pub fn event_count(&self) -> usize {
-        self.log.events().len()
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn run_no_human_day(&mut self) -> Result<NoHumanDayReport, AppError> {
         if !self.debug_available() {
             return Err(AppError::DebugUnavailable);
         }
         let windows = default_day_windows(self.scheduler.current_tick);
         let report = run_no_human_day(

---- app::tests::app_binds_renders_submits_and_rerenders stdout ----

thread 'app::tests::app_binds_renders_submits_and_rerenders' (21090) panicked at crates/tracewake-tui/src/app.rs:504:9:
assertion failed: app.event_count() >= 2

---- app::tests::app_runs_no_human_day_into_real_log_metrics stdout ----

thread 'app::tests::app_runs_no_human_day_into_real_log_metrics' (21092) panicked at crates/tracewake-tui/src/app.rs:639:9:
assertion failed: app.event_count() > before_events

failures:
    app::tests::app_binds_renders_submits_and_rerenders
    app::tests::app_runs_no_human_day_into_real_log_metrics

test result: FAILED. 42 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
