*** crates/tracewake-tui/src/app.rs:309:12: delete ! in TuiApp::run_no_human_day

*** mutation diff:
--- crates/tracewake-tui/src/app.rs
+++ delete ! in TuiApp::run_no_human_day
@@ -301,17 +301,17 @@
         Ok(result)
     }
 
     pub fn event_count(&self) -> usize {
         self.log.events().len()
     }
 
     pub fn run_no_human_day(&mut self) -> Result<NoHumanDayReport, AppError> {
-        if !self.debug_available() {
+        if  /* ~ changed by cargo-mutants ~ */self.debug_available() {
             return Err(AppError::DebugUnavailable);
         }
         let windows = default_day_windows(self.scheduler.current_tick);
         let report = run_no_human_day(
             &mut self.state,
             &mut self.agent_state,
             &mut self.log,
             &self.registry,

---- app::tests::app_runs_no_human_day_into_real_log_metrics stdout ----

thread 'app::tests::app_runs_no_human_day_into_real_log_metrics' (27069) panicked at crates/tracewake-tui/src/app.rs:636:45:
called `Result::unwrap()` on an `Err` value: DebugUnavailable

---- app::tests::run_no_human_day_refuses_intrinsically_without_debug_availability stdout ----

thread 'app::tests::run_no_human_day_refuses_intrinsically_without_debug_availability' (27075) panicked at crates/tracewake-tui/src/app.rs:651:9:
assertion failed: matches!(result, Err(AppError::DebugUnavailable))

failures:
    app::tests::app_runs_no_human_day_into_real_log_metrics
    app::tests::run_no_human_day_refuses_intrinsically_without_debug_availability

test result: FAILED. 42 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
