*** crates/tracewake-tui/src/app.rs:350:46: replace == with != in TuiApp::checksum_context

*** mutation diff:
--- crates/tracewake-tui/src/app.rs
+++ replace == with != in TuiApp::checksum_context
@@ -342,17 +342,17 @@
         ChecksumContext {
             fixture_id: self.fixture_id.clone(),
             content_version: self.content_version.clone(),
             sim_tick: self.scheduler.current_tick,
             world_stream_position_applied: self
                 .log
                 .events()
                 .iter()
-                .filter(|event| event.stream == tracewake_core::events::EventStream::World)
+                .filter(|event| event.stream != /* ~ changed by cargo-mutants ~ */ tracewake_core::events::EventStream::World)
                 .count()
                 .saturating_sub(1) as u64,
         }
     }
 
     pub fn render_debug_event_log_panel(&self) -> String {
         render_event_log_panel(&build_debug_event_log_view(&self.log))
     }

---- adversarial_gates_stale_view_token_fails_after_state_change stdout ----

thread 'adversarial_gates_stale_view_token_fails_after_state_change' (30572) panicked at crates/tracewake-tui/tests/adversarial_gates.rs:264:5:
assertion `left == right` failed
  left: PhysicalChecksum("twc1-18df473b547a229f")
 right: PhysicalChecksum("twc1-2d77bc07e734cf6c")

---- adversarial_gates_possession_rebind_does_not_transfer_notebook_or_debug_truth stdout ----

thread 'adversarial_gates_possession_rebind_does_not_transfer_notebook_or_debug_truth' (30568) panicked at crates/tracewake-tui/tests/adversarial_gates.rs:440:5:
assertion `left == right` failed
  left: PhysicalChecksum("twc1-c0af0b156a97076f")
 right: PhysicalChecksum("twc1-cecc85dff400e9bf")

---- tui_current_view_submission_rejects_stale_selection stdout ----

thread 'tui_current_view_submission_rejects_stale_selection' (30578) panicked at crates/tracewake-tui/tests/adversarial_gates.rs:327:5:
assertion `left == right` failed
  left: PhysicalChecksum("twc1-18df473b547a229f")
 right: PhysicalChecksum("twc1-2d77bc07e734cf6c")

failures:
    adversarial_gates_possession_rebind_does_not_transfer_notebook_or_debug_truth
    adversarial_gates_stale_view_token_fails_after_state_change
    tui_current_view_submission_rejects_stale_selection

test result: FAILED. 12 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
