*** crates/tracewake-tui/src/app.rs:357:9: replace TuiApp::render_debug_event_log_panel -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-tui/src/app.rs
+++ replace TuiApp::render_debug_event_log_panel -> String with "xyzzy".into()
@@ -349,17 +349,17 @@
                 .iter()
                 .filter(|event| event.stream == tracewake_core::events::EventStream::World)
                 .count()
                 .saturating_sub(1) as u64,
         }
     }
 
     pub fn render_debug_event_log_panel(&self) -> String {
-        render_event_log_panel(&build_debug_event_log_view(&self.log))
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn render_debug_controller_binding_panel(&self) -> String {
         let report = controller_binding_report(
             DebugReportId::new("debug.controller_bindings").unwrap(),
             &self.controller_bindings,
         );
         render_controller_binding_panel(&report)

---- app::tests::render_functions_have_production_callers_or_documented_allowlist stdout ----

thread 'app::tests::render_functions_have_production_callers_or_documented_allowlist' (3742) panicked at crates/tracewake-tui/src/app.rs:535:9:
assertion failed: render_reachability_errors(&[render_source, debug_panels_source],
        &[production_source(app_source), production_source(run_source),
                    production_source(transcript_source)]).is_empty()

---- debug_panels::tests::debug_panels_are_marked_non_diegetic_and_do_not_change_embodied_view_or_checksum stdout ----

thread 'debug_panels::tests::debug_panels_are_marked_non_diegetic_and_do_not_change_embodied_view_or_checksum' (3748) panicked at crates/tracewake-tui/src/debug_panels.rs:268:13:
assertion failed: panel.contains(DEBUG_MARKER)

---- run::tests::scripted_loop_dispatches_commands_and_exits_cleanly stdout ----

thread 'run::tests::scripted_loop_dispatches_commands_and_exits_cleanly' (3777) panicked at crates/tracewake-tui/src/run.rs:236:9:
assertion failed: rendered.contains("DEBUG NON-DIEGETIC: Event Log")

failures:
    app::tests::render_functions_have_production_callers_or_documented_allowlist
    debug_panels::tests::debug_panels_are_marked_non_diegetic_and_do_not_change_embodied_view_or_checksum
    run::tests::scripted_loop_dispatches_commands_and_exits_cleanly

test result: FAILED. 41 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
