*** crates/tracewake-tui/src/app.rs:369:9: replace TuiApp::render_debug_item_location_panel -> String with String::new()

*** mutation diff:
--- crates/tracewake-tui/src/app.rs
+++ replace TuiApp::render_debug_item_location_panel -> String with String::new()
@@ -361,19 +361,17 @@
         let report = controller_binding_report(
             DebugReportId::new("debug.controller_bindings").unwrap(),
             &self.controller_bindings,
         );
         render_controller_binding_panel(&report)
     }
 
     pub fn render_debug_item_location_panel(&self, item_id: &ItemId) -> String {
-        let report =
-            item_location_report(&self.state, &self.log, item_id, &self.checksum_context());
-        render_item_location_panel(&report)
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn render_debug_action_rejection_panel(&self) -> Option<String> {
         let report = self.last_rejection.as_ref()?;
         Some(render_action_rejection_panel(&action_rejection_report(
             report,
             &self.state,
             &self.checksum_context(),

---- app::tests::render_functions_have_production_callers_or_documented_allowlist stdout ----

thread 'app::tests::render_functions_have_production_callers_or_documented_allowlist' (12243) panicked at crates/tracewake-tui/src/app.rs:533:9:
assertion failed: render_reachability_errors(&[render_source, debug_panels_source],
        &[production_source(app_source), production_source(run_source),
                    production_source(transcript_source)]).is_empty()

---- debug_panels::tests::debug_panels_are_marked_non_diegetic_and_do_not_change_embodied_view_or_checksum stdout ----

thread 'debug_panels::tests::debug_panels_are_marked_non_diegetic_and_do_not_change_embodied_view_or_checksum' (12249) panicked at crates/tracewake-tui/src/debug_panels.rs:268:13:
assertion failed: panel.contains(DEBUG_MARKER)

failures:
    app::tests::render_functions_have_production_callers_or_documented_allowlist
    debug_panels::tests::debug_panels_are_marked_non_diegetic_and_do_not_change_embodied_view_or_checksum

test result: FAILED. 42 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.16s

*** result: Failure(101)
