*** crates/tracewake-tui/src/app.rs:375:9: replace TuiApp::render_debug_action_rejection_panel -> Option<String> with None

*** mutation diff:
--- crates/tracewake-tui/src/app.rs
+++ replace TuiApp::render_debug_action_rejection_panel -> Option<String> with None
@@ -367,22 +367,17 @@
 
     pub fn render_debug_item_location_panel(&self, item_id: &ItemId) -> String {
         let report =
             item_location_report(&self.state, &self.log, item_id, &self.checksum_context());
         render_item_location_panel(&report)
     }
 
     pub fn render_debug_action_rejection_panel(&self) -> Option<String> {
-        let report = self.last_rejection.as_ref()?;
-        Some(render_action_rejection_panel(&action_rejection_report(
-            report,
-            &self.state,
-            &self.checksum_context(),
-        )))
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn render_debug_projection_rebuild_panel(&self) -> String {
         let report = rebuild_projection(
             &self.initial_state,
             &self.initial_agent_state,
             &self.log,
             &self.checksum_context(),

---- debug_panels::tests::action_rejection_panel_renders_validation_report stdout ----

thread 'debug_panels::tests::action_rejection_panel_renders_validation_report' (17915) panicked at crates/tracewake-tui/src/debug_panels.rs:283:63:
called `Option::unwrap()` on a `None` value

---- app::tests::render_functions_have_production_callers_or_documented_allowlist stdout ----

thread 'app::tests::render_functions_have_production_callers_or_documented_allowlist' (17910) panicked at crates/tracewake-tui/src/app.rs:530:9:
assertion failed: render_reachability_errors(&[render_source, debug_panels_source],
        &[production_source(app_source), production_source(run_source),
                    production_source(transcript_source)]).is_empty()

failures:
    app::tests::render_functions_have_production_callers_or_documented_allowlist
    debug_panels::tests::action_rejection_panel_renders_validation_report

test result: FAILED. 42 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
