*** crates/tracewake-tui/src/app.rs:384:9: replace TuiApp::render_debug_projection_rebuild_panel -> String with String::new()

*** mutation diff:
--- crates/tracewake-tui/src/app.rs
+++ replace TuiApp::render_debug_projection_rebuild_panel -> String with String::new()
@@ -376,27 +376,17 @@
         Some(render_action_rejection_panel(&action_rejection_report(
             report,
             &self.state,
             &self.checksum_context(),
         )))
     }
 
     pub fn render_debug_projection_rebuild_panel(&self) -> String {
-        let report = rebuild_projection(
-            &self.initial_state,
-            &self.initial_agent_state,
-            &self.log,
-            &self.checksum_context(),
-            Some(&self.state),
-        );
-        render_projection_rebuild_panel(&projection_rebuild_debug_report(
-            DebugReportId::new("debug.projection_rebuild").unwrap(),
-            report,
-        ))
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn render_debug_replay_panel(&self) -> String {
         let expected_checksum = self.physical_checksum();
         let expected_agent_checksum =
             compute_agent_state_checksum(&self.agent_state, &self.checksum_context()).checksum;
         let report = run_replay(
             &self.initial_state,

---- app::tests::render_functions_have_production_callers_or_documented_allowlist stdout ----

thread 'app::tests::render_functions_have_production_callers_or_documented_allowlist' (26410) panicked at crates/tracewake-tui/src/app.rs:525:9:
assertion failed: render_reachability_errors(&[render_source, debug_panels_source],
        &[production_source(app_source), production_source(run_source),
                    production_source(transcript_source)]).is_empty()

---- debug_panels::tests::debug_panels_are_marked_non_diegetic_and_do_not_change_embodied_view_or_checksum stdout ----

thread 'debug_panels::tests::debug_panels_are_marked_non_diegetic_and_do_not_change_embodied_view_or_checksum' (26416) panicked at crates/tracewake-tui/src/debug_panels.rs:268:13:
assertion failed: panel.contains(DEBUG_MARKER)

failures:
    app::tests::render_functions_have_production_callers_or_documented_allowlist
    debug_panels::tests::debug_panels_are_marked_non_diegetic_and_do_not_change_embodied_view_or_checksum

test result: FAILED. 42 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
