*** crates/tracewake-tui/src/app.rs:417:9: replace TuiApp::render_debug_needs_panel -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-tui/src/app.rs
+++ replace TuiApp::render_debug_needs_panel -> String with "xyzzy".into()
@@ -409,17 +409,17 @@
         );
         render_replay_panel(&replay_debug_report(
             DebugReportId::new("debug.replay").unwrap(),
             report,
         ))
     }
 
     pub fn render_debug_needs_panel(&self) -> String {
-        render_phase3a_debug_panel(&phase3a_needs_report(&self.agent_state))
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn render_debug_routines_panel(&self) -> String {
         render_phase3a_debug_panel(&phase3a_routines_report(&self.agent_state))
     }
 
     pub fn render_debug_planner_panel(&self, actor_id: &ActorId) -> String {
         render_phase3a_debug_panel(&phase3a_planner_report(&self.agent_state, actor_id))

---- phase3a_debug_snapshot_is_byte_identical_across_runs stdout ----

thread 'phase3a_debug_snapshot_is_byte_identical_across_runs' (8240) panicked at crates/tracewake-tui/tests/transcript_snapshot.rs:45:5:
assertion failed: first.contains("DEBUG NON-DIEGETIC: Needs")

failures:
    phase3a_debug_snapshot_is_byte_identical_across_runs

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
