*** crates/tracewake-tui/src/app.rs:421:9: replace TuiApp::render_debug_routines_panel -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-tui/src/app.rs
+++ replace TuiApp::render_debug_routines_panel -> String with "xyzzy".into()
@@ -413,17 +413,17 @@
         ))
     }
 
     pub fn render_debug_needs_panel(&self) -> String {
         render_phase3a_debug_panel(&phase3a_needs_report(&self.agent_state))
     }
 
     pub fn render_debug_routines_panel(&self) -> String {
-        render_phase3a_debug_panel(&phase3a_routines_report(&self.agent_state))
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn render_debug_planner_panel(&self, actor_id: &ActorId) -> String {
         render_phase3a_debug_panel(&phase3a_planner_report(&self.agent_state, actor_id))
     }
 
     pub fn render_debug_stuck_panel(&self) -> String {
         render_phase3a_debug_panel(&phase3a_stuck_report(&self.agent_state))

---- no_human_day_command_loop_renders_phase3a_behavior_rows stdout ----

thread 'no_human_day_command_loop_renders_phase3a_behavior_rows' (13963) panicked at crates/tracewake-tui/tests/command_loop_session.rs:118:5:
assertion failed: output.contains("routine_exec_mara_eat")

failures:
    no_human_day_command_loop_renders_phase3a_behavior_rows

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.25s

*** result: Failure(101)
