*** crates/tracewake-tui/src/app.rs:425:9: replace TuiApp::render_debug_planner_panel -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-tui/src/app.rs
+++ replace TuiApp::render_debug_planner_panel -> String with "xyzzy".into()
@@ -417,17 +417,17 @@
         render_phase3a_debug_panel(&phase3a_needs_report(&self.agent_state))
     }
 
     pub fn render_debug_routines_panel(&self) -> String {
         render_phase3a_debug_panel(&phase3a_routines_report(&self.agent_state))
     }
 
     pub fn render_debug_planner_panel(&self, actor_id: &ActorId) -> String {
-        render_phase3a_debug_panel(&phase3a_planner_report(&self.agent_state, actor_id))
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn render_debug_stuck_panel(&self) -> String {
         render_phase3a_debug_panel(&phase3a_stuck_report(&self.agent_state))
     }
 
     pub fn render_debug_no_human_day_panel(&self) -> String {
         render_no_human_day_panel(&no_human_day_debug_report(&self.log))

---- adversarial_gates_debug_truth_does_not_enter_actor_surfaces stdout ----

thread 'adversarial_gates_debug_truth_does_not_enter_actor_surfaces' (19662) panicked at crates/tracewake-tui/tests/adversarial_gates.rs:83:5:
assertion failed: planner.contains("DEBUG NON-DIEGETIC")

failures:
    adversarial_gates_debug_truth_does_not_enter_actor_surfaces

test result: FAILED. 14 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
