*** crates/tracewake-tui/src/app.rs:429:9: replace TuiApp::render_debug_stuck_panel -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-tui/src/app.rs
+++ replace TuiApp::render_debug_stuck_panel -> String with "xyzzy".into()
@@ -421,17 +421,17 @@
         render_phase3a_debug_panel(&phase3a_routines_report(&self.agent_state))
     }
 
     pub fn render_debug_planner_panel(&self, actor_id: &ActorId) -> String {
         render_phase3a_debug_panel(&phase3a_planner_report(&self.agent_state, actor_id))
     }
 
     pub fn render_debug_stuck_panel(&self) -> String {
-        render_phase3a_debug_panel(&phase3a_stuck_report(&self.agent_state))
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn render_debug_no_human_day_panel(&self) -> String {
         render_no_human_day_panel(&no_human_day_debug_report(&self.log))
     }
 
     pub fn render_debug_actor_panel(&self, actor_id: &ActorId) -> String {
         render_phase3a_debug_panel(&phase3a_actor_report(&self.agent_state, actor_id))

---- phase3a_debug_snapshot_is_byte_identical_across_runs stdout ----

thread 'phase3a_debug_snapshot_is_byte_identical_across_runs' (25434) panicked at crates/tracewake-tui/tests/transcript_snapshot.rs:48:5:
assertion failed: first.contains("DEBUG NON-DIEGETIC: Stuck")

failures:
    phase3a_debug_snapshot_is_byte_identical_across_runs

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
