*** crates/tracewake-tui/src/app.rs:433:9: replace TuiApp::render_debug_no_human_day_panel -> String with String::new()

*** mutation diff:
--- crates/tracewake-tui/src/app.rs
+++ replace TuiApp::render_debug_no_human_day_panel -> String with String::new()
@@ -425,17 +425,17 @@
         render_phase3a_debug_panel(&phase3a_planner_report(&self.agent_state, actor_id))
     }
 
     pub fn render_debug_stuck_panel(&self) -> String {
         render_phase3a_debug_panel(&phase3a_stuck_report(&self.agent_state))
     }
 
     pub fn render_debug_no_human_day_panel(&self) -> String {
-        render_no_human_day_panel(&no_human_day_debug_report(&self.log))
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn render_debug_actor_panel(&self, actor_id: &ActorId) -> String {
         render_phase3a_debug_panel(&phase3a_actor_report(&self.agent_state, actor_id))
     }
 
     pub fn notebook_view(&self) -> Result<NotebookView, AppError> {
         self.current_view()?.notebook.ok_or(AppError::ActorNotBound)

---- app::tests::render_functions_have_production_callers_or_documented_allowlist stdout ----

thread 'app::tests::render_functions_have_production_callers_or_documented_allowlist' (28233) panicked at crates/tracewake-tui/src/app.rs:535:9:
assertion failed: render_reachability_errors(&[render_source, debug_panels_source],
        &[production_source(app_source), production_source(run_source),
                    production_source(transcript_source)]).is_empty()

---- app::tests::app_runs_no_human_day_into_real_log_metrics stdout ----

thread 'app::tests::app_runs_no_human_day_into_real_log_metrics' (28229) panicked at crates/tracewake-tui/src/app.rs:640:9:
assertion failed: app.render_debug_no_human_day_panel().contains("events=")

failures:
    app::tests::app_runs_no_human_day_into_real_log_metrics
    app::tests::render_functions_have_production_callers_or_documented_allowlist

test result: FAILED. 42 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.16s

*** result: Failure(101)
