*** crates/tracewake-tui/src/app.rs:437:9: replace TuiApp::render_debug_actor_panel -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-tui/src/app.rs
+++ replace TuiApp::render_debug_actor_panel -> String with "xyzzy".into()
@@ -429,17 +429,17 @@
         render_phase3a_debug_panel(&phase3a_stuck_report(&self.agent_state))
     }
 
     pub fn render_debug_no_human_day_panel(&self) -> String {
         render_no_human_day_panel(&no_human_day_debug_report(&self.log))
     }
 
     pub fn render_debug_actor_panel(&self, actor_id: &ActorId) -> String {
-        render_phase3a_debug_panel(&phase3a_actor_report(&self.agent_state, actor_id))
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn notebook_view(&self) -> Result<NotebookView, AppError> {
         self.current_view()?.notebook.ok_or(AppError::ActorNotBound)
     }
 
     pub fn debug_epistemics_view(&self) -> DebugEpistemicsView {
         self.epistemic_projection.debug_epistemics_view()

---- phase3a_debug_surfaces_render_deterministically_and_read_only stdout ----

thread 'phase3a_debug_surfaces_render_deterministically_and_read_only' (4413) panicked at crates/tracewake-tui/tests/tui_acceptance.rs:604:9:
assertion failed: panel.contains("DEBUG NON-DIEGETIC")

---- phase3a_possess_continue_and_debug_transcript_is_deterministic stdout ----

thread 'phase3a_possess_continue_and_debug_transcript_is_deterministic' (4414) panicked at crates/tracewake-tui/tests/tui_acceptance.rs:732:5:
assertion failed: first.contains("DEBUG NON-DIEGETIC: Actor")

failures:
    phase3a_debug_surfaces_render_deterministically_and_read_only
    phase3a_possess_continue_and_debug_transcript_is_deterministic

test result: FAILED. 9 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.32s

*** result: Failure(101)
