*** crates/tracewake-tui/src/app.rs:461:12: delete ! in TuiApp::debug_observations_view

*** mutation diff:
--- crates/tracewake-tui/src/app.rs
+++ delete ! in TuiApp::debug_observations_view
@@ -453,17 +453,17 @@
             .epistemic_projection
             .debug_beliefs_view(actor_id.clone()))
     }
 
     pub fn debug_observations_view(
         &self,
         actor_id: &ActorId,
     ) -> Result<DebugObservationsView, AppError> {
-        if !self.state.actors().contains_key(actor_id) {
+        if  /* ~ changed by cargo-mutants ~ */self.state.actors().contains_key(actor_id) {
             return Err(AppError::ActorNotFound(actor_id.clone()));
         }
         Ok(self
             .epistemic_projection
             .debug_observations_view(actor_id.clone()))
     }
 }

---- transcript::tests::representative_transcript_is_deterministic stdout ----

thread 'transcript::tests::representative_transcript_is_deterministic' (11325) panicked at crates/tracewake-tui/src/transcript.rs:111:75:
called `Result::unwrap()` on an `Err` value: ActorNotFound(ActorId(StableId("actor_sena")))

---- run::tests::scripted_loop_dispatches_commands_and_exits_cleanly stdout ----

thread 'run::tests::scripted_loop_dispatches_commands_and_exits_cleanly' (11323) panicked at crates/tracewake-tui/src/run.rs:226:62:
called `Result::unwrap()` on an `Err` value: Custom { kind: Other, error: "ActorNotFound(ActorId(StableId(\"actor_tomas\")))" }

failures:
    run::tests::scripted_loop_dispatches_commands_and_exits_cleanly
    transcript::tests::representative_transcript_is_deterministic

test result: FAILED. 42 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.17s

*** result: Failure(101)
