*** crates/tracewake-tui/src/debug_panels.rs:103:5: replace render_replay_panel -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-tui/src/debug_panels.rs
+++ replace render_replay_panel -> String with "xyzzy".into()
@@ -95,35 +95,17 @@
             ),
             format!("checksum={}", report.rebuild.final_checksum.as_str()),
             format!("diffs={}", report.rebuild.state_diff.len()),
         ],
     )
 }
 
 pub fn render_replay_panel(report: &ReplayDebugReport) -> String {
-    assert!(report.debug_only());
-    lines(
-        "Replay",
-        vec![
-            format!("fixture={}", report.replay.fixture_id.as_str()),
-            format!("events={}", report.replay.event_count),
-            format!("diagnostic_events={}", report.replay.diagnostic_event_count),
-            format!("matches_expected={}", report.replay.matches_expected),
-            format!(
-                "agent_checksum_matches={}",
-                report.replay.agent_checksum_matches
-            ),
-            format!("final_checksum={}", report.replay.final_checksum.as_str()),
-            format!(
-                "final_agent_checksum={}",
-                report.replay.final_agent_checksum.as_str()
-            ),
-        ],
-    )
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn render_debug_epistemics_panel(view: &DebugEpistemicsView) -> String {
     assert!(view.debug_only());
     assert_eq!(view.non_diegetic_marker(), DEBUG_EPISTEMICS_MARKER);
     let mut rows = vec![
         format!("context_mode={}", view.context_mode),
         format!("projection={}", view.projection_summary),

---- debug_panels::tests::debug_panels_are_marked_non_diegetic_and_do_not_change_embodied_view_or_checksum stdout ----

thread 'debug_panels::tests::debug_panels_are_marked_non_diegetic_and_do_not_change_embodied_view_or_checksum' (11025) panicked at crates/tracewake-tui/src/debug_panels.rs:250:13:
assertion failed: panel.contains(DEBUG_MARKER)

failures:
    debug_panels::tests::debug_panels_are_marked_non_diegetic_and_do_not_change_embodied_view_or_checksum

test result: FAILED. 43 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
