*** crates/tracewake-tui/src/debug_panels.rs:125:5: replace render_debug_epistemics_panel -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-tui/src/debug_panels.rs
+++ replace render_debug_epistemics_panel -> String with "xyzzy".into()
@@ -117,53 +117,17 @@
                 "final_agent_checksum={}",
                 report.replay.final_agent_checksum.as_str()
             ),
         ],
     )
 }
 
 pub fn render_debug_epistemics_panel(view: &DebugEpistemicsView) -> String {
-    assert!(view.debug_only());
-    assert_eq!(view.non_diegetic_marker(), DEBUG_EPISTEMICS_MARKER);
-    let mut rows = vec![
-        format!("context_mode={}", view.context_mode),
-        format!("projection={}", view.projection_summary),
-        format!("observation_count={}", view.observations.len()),
-        format!("holder_count={}", view.beliefs_by_holder.len()),
-        format!("contradiction_count={}", view.contradictions.len()),
-    ];
-    rows.extend(view.observations.iter().map(|observation| {
-        format!(
-            "observation={} actor={} channel={} confidence={} source={}",
-            observation.observation_id,
-            observation.observer_actor_id.as_str(),
-            observation.channel,
-            observation.confidence,
-            observation.source
-        )
-    }));
-    rows.extend(view.beliefs_by_holder.iter().map(|holder| {
-        format!(
-            "holder={} belief_count={}",
-            holder.holder_actor_id.as_str(),
-            holder.beliefs.len()
-        )
-    }));
-    rows.extend(view.contradictions.iter().map(|contradiction| {
-        format!(
-            "contradiction={} holder={} expectation={} observation={} summary={}",
-            contradiction.contradiction_id,
-            contradiction.holder_actor_id.as_str(),
-            contradiction.expectation_belief_id,
-            contradiction.observation_id,
-            contradiction.summary
-        )
-    }));
-    lines("Epistemics", rows)
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn render_debug_beliefs_panel(view: &DebugBeliefsView) -> String {
     assert!(view.debug_only());
     assert_eq!(view.non_diegetic_marker(), DEBUG_EPISTEMICS_MARKER);
     let mut rows = vec![
         format!("actor={}", view.holder_actor_id.as_str()),
         format!("belief_count={}", view.beliefs.len()),

---- run::tests::scripted_loop_dispatches_commands_and_exits_cleanly stdout ----

thread 'run::tests::scripted_loop_dispatches_commands_and_exits_cleanly' (16394) panicked at crates/tracewake-tui/src/run.rs:237:9:
assertion failed: rendered.contains("DEBUG NON-DIEGETIC: Epistemics")

failures:
    run::tests::scripted_loop_dispatches_commands_and_exits_cleanly

test result: FAILED. 43 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
