*** crates/tracewake-tui/src/debug_panels.rs:13:5: replace render_item_location_panel -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-tui/src/debug_panels.rs
+++ replace render_item_location_panel -> String with "xyzzy".into()
@@ -5,37 +5,17 @@
 use tracewake_core::view_models::DebugEventLogView;
 use tracewake_core::view_models::{
     DebugBeliefsView, DebugEpistemicsView, DebugObservationsView, DEBUG_EPISTEMICS_MARKER,
 };
 
 const DEBUG_MARKER: &str = "DEBUG NON-DIEGETIC";
 
 pub fn render_item_location_panel(report: &ItemLocationDebugReport) -> String {
-    assert!(report.debug_only());
-    lines(
-        "Item Location",
-        vec![
-            format!("item={}", report.item_id.as_str()),
-            format!("exists={}", report.exists),
-            format!(
-                "current_location={}",
-                report.current_location.as_deref().unwrap_or("missing")
-            ),
-            format!(
-                "last_location_event={}",
-                report
-                    .last_location_event_id
-                    .as_ref()
-                    .map(|id| id.as_str())
-                    .unwrap_or("none")
-            ),
-            format!("checksum={}", report.physical_checksum.as_str()),
-        ],
-    )
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn render_action_rejection_panel(report: &ActionRejectionDebugReport) -> String {
     assert!(report.debug_only());
     lines(
         "Action Rejection",
         vec![
             format!("proposal={}", report.proposal_id.as_str()),

---- debug_panels::tests::debug_panels_are_marked_non_diegetic_and_do_not_change_embodied_view_or_checksum stdout ----

thread 'debug_panels::tests::debug_panels_are_marked_non_diegetic_and_do_not_change_embodied_view_or_checksum' (16798) panicked at crates/tracewake-tui/src/debug_panels.rs:248:13:
assertion failed: panel.contains(DEBUG_MARKER)

failures:
    debug_panels::tests::debug_panels_are_marked_non_diegetic_and_do_not_change_embodied_view_or_checksum

test result: FAILED. 43 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
