*** crates/tracewake-tui/src/debug_panels.rs:165:5: replace render_debug_beliefs_panel -> String with String::new()

*** mutation diff:
--- crates/tracewake-tui/src/debug_panels.rs
+++ replace render_debug_beliefs_panel -> String with String::new()
@@ -157,29 +157,17 @@
             contradiction.observation_id,
             contradiction.summary
         )
     }));
     lines("Epistemics", rows)
 }
 
 pub fn render_debug_beliefs_panel(view: &DebugBeliefsView) -> String {
-    assert!(view.debug_only());
-    assert_eq!(view.non_diegetic_marker(), DEBUG_EPISTEMICS_MARKER);
-    let mut rows = vec![
-        format!("actor={}", view.holder_actor_id.as_str()),
-        format!("belief_count={}", view.beliefs.len()),
-    ];
-    rows.extend(view.beliefs.iter().map(|belief| {
-        format!(
-            "belief={} stance={} confidence={} source={} :: {}",
-            belief.belief_id, belief.stance, belief.confidence, belief.source, belief.proposition
-        )
-    }));
-    lines("Beliefs", rows)
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn render_debug_observations_panel(view: &DebugObservationsView) -> String {
     assert!(view.debug_only());
     assert_eq!(view.non_diegetic_marker(), DEBUG_EPISTEMICS_MARKER);
     let mut rows = vec![
         format!("actor={}", view.observer_actor_id.as_str()),
         format!("observation_count={}", view.observations.len()),

---- run::tests::scripted_loop_dispatches_commands_and_exits_cleanly stdout ----

thread 'run::tests::scripted_loop_dispatches_commands_and_exits_cleanly' (19064) panicked at crates/tracewake-tui/src/run.rs:238:9:
assertion failed: rendered.contains("DEBUG NON-DIEGETIC: Beliefs")

failures:
    run::tests::scripted_loop_dispatches_commands_and_exits_cleanly

test result: FAILED. 43 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.16s

*** result: Failure(101)
