*** crates/tracewake-tui/src/debug_panels.rs:200:5: replace render_phase3a_debug_panel -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-tui/src/debug_panels.rs
+++ replace render_phase3a_debug_panel -> String with "xyzzy".into()
@@ -192,23 +192,17 @@
             observation.confidence,
             observation.source
         )
     }));
     lines("Observations", rows)
 }
 
 pub fn render_phase3a_debug_panel(report: &Phase3ADebugReport) -> String {
-    assert!(report.debug_only());
-    let mut rows = vec![
-        format!("typed_decision_traces={}", report.decision_traces.len()),
-        format!("typed_stuck_diagnostics={}", report.stuck_diagnostics.len()),
-    ];
-    rows.extend(report.rows.clone());
-    lines(&report.title, rows)
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn render_no_human_day_panel(report: &NoHumanDayDebugReport) -> String {
     assert!(report.debug_only());
     lines(
         "No Human Day",
         vec![
             format!("projection={}", report.metrics.projection_version),

---- adversarial_gates_debug_truth_does_not_enter_actor_surfaces stdout ----

thread 'adversarial_gates_debug_truth_does_not_enter_actor_surfaces' (32436) panicked at crates/tracewake-tui/tests/adversarial_gates.rs:83:5:
assertion failed: planner.contains("DEBUG NON-DIEGETIC")

failures:
    adversarial_gates_debug_truth_does_not_enter_actor_surfaces

test result: FAILED. 14 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.16s

*** result: Failure(101)
