*** crates/tracewake-tui/src/debug_panels.rs:210:5: replace render_no_human_day_panel -> String with String::new()

*** mutation diff:
--- crates/tracewake-tui/src/debug_panels.rs
+++ replace render_no_human_day_panel -> String with String::new()
@@ -202,40 +202,17 @@
         format!("typed_decision_traces={}", report.decision_traces.len()),
         format!("typed_stuck_diagnostics={}", report.stuck_diagnostics.len()),
     ];
     rows.extend(report.rows.clone());
     lines(&report.title, rows)
 }
 
 pub fn render_no_human_day_panel(report: &NoHumanDayDebugReport) -> String {
-    assert!(report.debug_only());
-    lines(
-        "No Human Day",
-        vec![
-            format!("projection={}", report.metrics.projection_version),
-            format!("events={}", report.metrics.events_per_day),
-            format!("routine_events={}", report.metrics.routine_event_count),
-            format!("meals_completed={}", report.metrics.meals_completed),
-            format!("meals_missed={}", report.metrics.meals_missed),
-            format!("sleep_completed={}", report.metrics.sleep_completed),
-            format!("sleep_interrupted={}", report.metrics.sleep_interrupted),
-            format!("work_completed={}", report.metrics.work_blocks_completed),
-            format!("work_failed={}", report.metrics.work_blocks_failed),
-            format!("need_crossings={}", report.metrics.need_threshold_crossings),
-            format!(
-                "routine_interruptions={}",
-                report.metrics.routine_interruptions
-            ),
-            format!("planner_failures={}", report.metrics.planner_failures),
-            format!("stuck_actors={}", report.metrics.stuck_actor_count),
-            format!("replay_failures={}", report.metrics.replay_failure_count),
-            format!("canonical={}", report.canonical_summary),
-        ],
-    )
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 fn lines(title: &str, rows: Vec<String>) -> String {
     let mut output = vec![format!("{DEBUG_MARKER}: {title}")];
     output.extend(rows);
     output.join("\n")
 }

---- app::tests::app_runs_no_human_day_into_real_log_metrics stdout ----

thread 'app::tests::app_runs_no_human_day_into_real_log_metrics' (2611) panicked at crates/tracewake-tui/src/app.rs:640:9:
assertion failed: app.render_debug_no_human_day_panel().contains("events=")

failures:
    app::tests::app_runs_no_human_day_into_real_log_metrics

test result: FAILED. 43 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
