*** crates/tracewake-tui/src/debug_panels.rs:237:5: replace lines -> String with String::new()

*** mutation diff:
--- crates/tracewake-tui/src/debug_panels.rs
+++ replace lines -> String with String::new()
@@ -229,19 +229,17 @@
             format!("stuck_actors={}", report.metrics.stuck_actor_count),
             format!("replay_failures={}", report.metrics.replay_failure_count),
             format!("canonical={}", report.canonical_summary),
         ],
     )
 }
 
 fn lines(title: &str, rows: Vec<String>) -> String {
-    let mut output = vec![format!("{DEBUG_MARKER}: {title}")];
-    output.extend(rows);
-    output.join("\n")
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::app::TuiApp;
     use tracewake_core::actions::ReportStatus;
     use tracewake_core::ids::{ActorId, ItemId, SemanticActionId};

---- debug_panels::tests::action_rejection_panel_renders_validation_report stdout ----

thread 'debug_panels::tests::action_rejection_panel_renders_validation_report' (7961) panicked at crates/tracewake-tui/src/debug_panels.rs:283:9:
assertion failed: panel.contains(DEBUG_MARKER)

---- debug_panels::tests::debug_panels_are_marked_non_diegetic_and_do_not_change_embodied_view_or_checksum stdout ----

thread 'debug_panels::tests::debug_panels_are_marked_non_diegetic_and_do_not_change_embodied_view_or_checksum' (7962) panicked at crates/tracewake-tui/src/debug_panels.rs:266:13:
assertion failed: panel.contains(DEBUG_MARKER)

---- run::tests::scripted_loop_dispatches_commands_and_exits_cleanly stdout ----

thread 'run::tests::scripted_loop_dispatches_commands_and_exits_cleanly' (7991) panicked at crates/tracewake-tui/src/run.rs:234:9:
assertion failed: rendered.contains("DEBUG NON-DIEGETIC: Action Rejection")

failures:
    app::tests::app_runs_no_human_day_into_real_log_metrics
    debug_panels::tests::action_rejection_panel_renders_validation_report
    debug_panels::tests::debug_panels_are_marked_non_diegetic_and_do_not_change_embodied_view_or_checksum
    run::tests::scripted_loop_dispatches_commands_and_exits_cleanly

test result: FAILED. 40 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
