*** crates/tracewake-tui/src/debug_panels.rs:37:5: replace render_action_rejection_panel -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-tui/src/debug_panels.rs
+++ replace render_action_rejection_panel -> String with "xyzzy".into()
@@ -29,39 +29,17 @@
                     .unwrap_or("none")
             ),
             format!("checksum={}", report.physical_checksum.as_str()),
         ],
     )
 }
 
 pub fn render_action_rejection_panel(report: &ActionRejectionDebugReport) -> String {
-    assert!(report.debug_only());
-    lines(
-        "Action Rejection",
-        vec![
-            format!("proposal={}", report.proposal_id.as_str()),
-            format!("validation={}", report.validation_report_id.as_str()),
-            format!("failed_stage={:?}", report.failed_stage),
-            format!(
-                "reason_codes={}",
-                report
-                    .reason_codes
-                    .iter()
-                    .map(|reason| reason.stable_id())
-                    .collect::<Vec<_>>()
-                    .join(",")
-            ),
-            format!("actor_summary={}", report.actor_visible_summary),
-            format!("debug_summary={}", report.debug_summary),
-            format!("actor_fact_count={}", report.actor_visible_facts.len()),
-            format!("debug_fact_count={}", report.debug_only_facts.len()),
-            format!("mutation_attempted={}", report.mutation_attempted),
-        ],
-    )
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn render_event_log_panel(view: &DebugEventLogView) -> String {
     assert!(view.debug_only());
     let mut rows = vec![format!("event_count={}", view.events.len())];
     rows.extend(view.events.iter().map(|event| {
         format!(
             "{}:{}:{}:{:?}",

---- debug_panels::tests::action_rejection_panel_renders_validation_report stdout ----

thread 'debug_panels::tests::action_rejection_panel_renders_validation_report' (22135) panicked at crates/tracewake-tui/src/debug_panels.rs:263:9:
assertion failed: panel.contains(DEBUG_MARKER)

---- run::tests::scripted_loop_dispatches_commands_and_exits_cleanly stdout ----

thread 'run::tests::scripted_loop_dispatches_commands_and_exits_cleanly' (22165) panicked at crates/tracewake-tui/src/run.rs:234:9:
assertion failed: rendered.contains("DEBUG NON-DIEGETIC: Action Rejection")

failures:
    debug_panels::tests::action_rejection_panel_renders_validation_report
    run::tests::scripted_loop_dispatches_commands_and_exits_cleanly

test result: FAILED. 42 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
