*** crates/tracewake-tui/src/debug_panels.rs:63:5: replace render_event_log_panel -> String with String::new()

*** mutation diff:
--- crates/tracewake-tui/src/debug_panels.rs
+++ replace render_event_log_panel -> String with String::new()
@@ -55,25 +55,17 @@
             format!("actor_fact_count={}", report.actor_visible_facts.len()),
             format!("debug_fact_count={}", report.debug_only_facts.len()),
             format!("mutation_attempted={}", report.mutation_attempted),
         ],
     )
 }
 
 pub fn render_event_log_panel(view: &DebugEventLogView) -> String {
-    assert!(view.debug_only());
-    let mut rows = vec![format!("event_count={}", view.events.len())];
-    rows.extend(view.events.iter().map(|event| {
-        format!(
-            "{}:{}:{}:{:?}",
-            event.global_order, event.stream_position, event.event_type, event.stream
-        )
-    }));
-    lines("Event Log", rows)
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn render_controller_binding_panel(report: &ControllerBindingDebugReport) -> String {
     assert!(report.debug_only());
     let mut rows = vec![format!("binding_count={}", report.bindings.len())];
     rows.extend(report.bindings.iter().cloned());
     lines("Controller Binding", rows)
 }

---- debug_panels::tests::debug_panels_are_marked_non_diegetic_and_do_not_change_embodied_view_or_checksum stdout ----

thread 'debug_panels::tests::debug_panels_are_marked_non_diegetic_and_do_not_change_embodied_view_or_checksum' (24806) panicked at crates/tracewake-tui/src/debug_panels.rs:260:13:
assertion failed: panel.contains(DEBUG_MARKER)

---- run::tests::scripted_loop_dispatches_commands_and_exits_cleanly stdout ----

thread 'run::tests::scripted_loop_dispatches_commands_and_exits_cleanly' (24835) panicked at crates/tracewake-tui/src/run.rs:236:9:
assertion failed: rendered.contains("DEBUG NON-DIEGETIC: Event Log")

failures:
    debug_panels::tests::debug_panels_are_marked_non_diegetic_and_do_not_change_embodied_view_or_checksum
    run::tests::scripted_loop_dispatches_commands_and_exits_cleanly

test result: FAILED. 42 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
