*** crates/tracewake-tui/src/debug_panels.rs:75:5: replace render_controller_binding_panel -> String with String::new()

*** mutation diff:
--- crates/tracewake-tui/src/debug_panels.rs
+++ replace render_controller_binding_panel -> String with String::new()
@@ -67,20 +67,17 @@
             "{}:{}:{}:{:?}",
             event.global_order, event.stream_position, event.event_type, event.stream
         )
     }));
     lines("Event Log", rows)
 }
 
 pub fn render_controller_binding_panel(report: &ControllerBindingDebugReport) -> String {
-    assert!(report.debug_only());
-    let mut rows = vec![format!("binding_count={}", report.bindings.len())];
-    rows.extend(report.bindings.iter().cloned());
-    lines("Controller Binding", rows)
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn render_projection_rebuild_panel(report: &ProjectionRebuildDebugReport) -> String {
     assert!(report.debug_only());
     lines(
         "Projection Rebuild",
         vec![
             format!("events_applied={}", report.rebuild.event_count_applied),

---- debug_panels::tests::debug_panels_are_marked_non_diegetic_and_do_not_change_embodied_view_or_checksum stdout ----

thread 'debug_panels::tests::debug_panels_are_marked_non_diegetic_and_do_not_change_embodied_view_or_checksum' (30144) panicked at crates/tracewake-tui/src/debug_panels.rs:265:13:
assertion failed: panel.contains(DEBUG_MARKER)

failures:
    debug_panels::tests::debug_panels_are_marked_non_diegetic_and_do_not_change_embodied_view_or_checksum

test result: FAILED. 43 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
