*** crates/tracewake-tui/src/debug_panels.rs:82:5: replace render_projection_rebuild_panel -> String with String::new()

*** mutation diff:
--- crates/tracewake-tui/src/debug_panels.rs
+++ replace render_projection_rebuild_panel -> String with String::new()
@@ -74,34 +74,17 @@
 pub fn render_controller_binding_panel(report: &ControllerBindingDebugReport) -> String {
     assert!(report.debug_only());
     let mut rows = vec![format!("binding_count={}", report.bindings.len())];
     rows.extend(report.bindings.iter().cloned());
     lines("Controller Binding", rows)
 }
 
 pub fn render_projection_rebuild_panel(report: &ProjectionRebuildDebugReport) -> String {
-    assert!(report.debug_only());
-    lines(
-        "Projection Rebuild",
-        vec![
-            format!("events_applied={}", report.rebuild.event_count_applied),
-            format!(
-                "last_event={}",
-                report
-                    .rebuild
-                    .last_event_id
-                    .as_ref()
-                    .map(|id| id.as_str())
-                    .unwrap_or("none")
-            ),
-            format!("checksum={}", report.rebuild.final_checksum.as_str()),
-            format!("diffs={}", report.rebuild.state_diff.len()),
-        ],
-    )
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn render_replay_panel(report: &ReplayDebugReport) -> String {
     assert!(report.debug_only());
     lines(
         "Replay",
         vec![
             format!("fixture={}", report.replay.fixture_id.as_str()),

---- debug_panels::tests::debug_panels_are_marked_non_diegetic_and_do_not_change_embodied_view_or_checksum stdout ----

thread 'debug_panels::tests::debug_panels_are_marked_non_diegetic_and_do_not_change_embodied_view_or_checksum' (3014) panicked at crates/tracewake-tui/src/debug_panels.rs:251:13:
assertion failed: panel.contains(DEBUG_MARKER)

failures:
    debug_panels::tests::debug_panels_are_marked_non_diegetic_and_do_not_change_embodied_view_or_checksum

test result: FAILED. 43 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
