*** crates/tracewake-tui/src/render.rs:13:5: replace render_embodied_view -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-tui/src/render.rs
+++ replace render_embodied_view -> String with "xyzzy".into()
@@ -5,154 +5,17 @@
 pub const DEBUG_TOKENS: &[&str] = &[
     "DEBUG NON-DIEGETIC",
     "Knowledge context",
     "Debug:",
     "debug_diagnostics",
 ];
 
 pub fn render_embodied_view(view: &EmbodiedViewModel) -> String {
-    let mut lines = Vec::new();
-    lines.push(format!(
-        "Actor: {} | Tick: {}",
-        view.viewer_actor_id.as_str(),
-        view.sim_tick.value()
-    ));
-    lines.push(format!(
-        "Place: {} ({})",
-        view.place_label,
-        view.place_id.as_str()
-    ));
-
-    if let Some(why_not) = &view.last_rejection_why_not {
-        lines.push(format!(
-            "Why-not: {} kind={} reasons={}",
-            why_not.actor_known_summary,
-            why_not.failure_kind.stable_id(),
-            why_not.reason_codes.join(",")
-        ));
-        if !why_not.actor_visible_facts.is_empty() {
-            lines.push(format!(
-                "Why-not facts: {}",
-                why_not.actor_visible_facts.join(",")
-            ));
-        }
-    } else if let Some(summary) = &view.last_rejection_summary {
-        lines.push(format!("Why-not: {summary}"));
-    }
-    if let Some(status) = &view.phase3a_status {
-        lines.push("Needs:".to_string());
-        if status.need_summaries.is_empty() {
-            lines.push("- none known".to_string());
-        }
-        for need in &status.need_summaries {
-            lines.push(format!(
-                "- {}: band={} cause={}",
-                need.kind, need.band_label, need.last_cause
-            ));
-        }
-        lines.push(format!(
-            "Intention: {}",
-            status.intention_summary.as_deref().unwrap_or("none")
-        ));
-        lines.push(format!(
-            "Routine: {}",
-            status.routine_summary.as_deref().unwrap_or("none")
-        ));
-        if let Some(interruption) = &status.salient_interruption {
-            lines.push(format!("Interruption: {interruption}"));
-        }
-    }
-
-    lines.push("Exits:".to_string());
-    for exit in &view.visible_exits {
-        let blocker = exit
-            .blocker_summary
-            .as_ref()
-            .map(|summary| format!(" blocked: {summary}"))
-            .unwrap_or_default();
-        lines.push(format!(
-            "- {}{}",
-            exit.destination_place_id.as_str(),
-            blocker
-        ));
-    }
-
-    lines.push("Doors:".to_string());
-    for door in &view.visible_doors {
-        lines.push(format!(
-            "- {} open={} locked={} endpoints={}<->{}",
-            door.door_id.as_str(),
-            door.is_open,
-            door.is_locked,
-            door.endpoint_a.as_str(),
-            door.endpoint_b.as_str()
-        ));
-    }
-
-    lines.push("Containers:".to_string());
-    for container in &view.visible_containers {
-        lines.push(format!(
-            "- {} open={} locked={}",
-            container.container_id.as_str(),
-            container.is_open,
-            container.is_locked
-        ));
-    }
-
-    lines.push("Items:".to_string());
-    for item in &view.visible_items {
-        lines.push(format!(
-            "- {} portable={} source={}",
-            item.item_id.as_str(),
-            item.portable,
-            visible_item_source_label(&item.source)
-        ));
-    }
-
-    lines.push("Inventory:".to_string());
-    for item in &view.carried_items {
-        lines.push(format!(
-            "- {} portable={} source={}",
-            item.item_id.as_str(),
-            item.portable,
-            visible_item_source_label(&item.source)
-        ));
-    }
-
-    lines.push("Actors:".to_string());
-    for actor in &view.local_actors {
-        lines.push(format!("- {}", actor.actor_id.as_str()));
-    }
-
-    lines.push("Actions:".to_string());
-    for (index, action) in view.semantic_actions.iter().enumerate() {
-        let disabled = action
-            .availability
-            .actor_safe_summary()
-            .map(|summary| {
-                let reason_codes = action
-                    .availability
-                    .reason_codes()
-                    .iter()
-                    .map(|reason| reason.stable_id())
-                    .collect::<Vec<_>>()
-                    .join(",");
-                format!(" disabled: {summary} reasons={reason_codes}")
-            })
-            .unwrap_or_default();
-        lines.push(format!(
-            "{}. {} [{}]{}",
-            index + 1,
-            action.label,
-            action.semantic_action_id.as_str(),
-            disabled
-        ));
-    }
-    lines.join("\n")
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn render_debug_overlay(view: &EmbodiedViewModel) -> String {
     let mut lines = Vec::new();
     if !view.debug_available {
         return lines.join("\n");
     }
     lines.push(format!("{}: Embodied Overlay", DEBUG_TOKENS[0]));

---- embodied_view_option_and_collection_fields_have_reachable_producers stdout ----

thread 'embodied_view_option_and_collection_fields_have_reachable_producers' (14562) panicked at crates/tracewake-core/tests/anti_regression_guards.rs:6899:5:
dead embodied surface field sweep found missing producers: [
    "EmbodiedViewModel.carried_items (Vec<VisibleItem>) has no embodied render/app consumer or cited deferral",
    "EmbodiedViewModel.last_rejection_summary (Option<String>) has no embodied render/app consumer or cited deferral",
    "EmbodiedViewModel.last_rejection_why_not (Option<WhyNotView>) has no embodied render/app consumer or cited deferral",
    "EmbodiedViewModel.local_actors (Vec<VisibleActor>) has no embodied render/app consumer or cited deferral",
    "EmbodiedViewModel.phase3a_status (Option<Phase3AEmbodiedStatus>) has no embodied render/app consumer or cited deferral",

failures:
    embodied_view_option_and_collection_fields_have_reachable_producers

test result: FAILED. 79 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.38s

*** result: Failure(101)
