*** crates/tracewake-tui/src/render.rs:155:8: delete ! in render_debug_overlay

*** mutation diff:
--- crates/tracewake-tui/src/render.rs
+++ delete ! in render_debug_overlay
@@ -147,17 +147,17 @@
             disabled
         ));
     }
     lines.join("\n")
 }
 
 pub fn render_debug_overlay(view: &EmbodiedViewModel) -> String {
     let mut lines = Vec::new();
-    if !view.debug_available {
+    if  /* ~ changed by cargo-mutants ~ */view.debug_available {
         return lines.join("\n");
     }
     lines.push(format!("{}: Embodied Overlay", DEBUG_TOKENS[0]));
     lines.push(format!(
         "{}: id={} hash={} tick={} frontier={} sources={}",
         DEBUG_TOKENS[1],
         view.holder_known_context_id.as_str(),
         view.holder_known_context_hash.as_str(),

---- app::tests::app_debug_overlay_renders_only_for_bound_debug_controller stdout ----

thread 'app::tests::app_debug_overlay_renders_only_for_bound_debug_controller' (24217) panicked at crates/tracewake-tui/src/app.rs:514:9:
assertion failed: rendered.contains("DEBUG NON-DIEGETIC: Embodied Overlay")

---- render::tests::debug_overlay_marks_knowledge_context_frontier_non_diegetic stdout ----

thread 'render::tests::debug_overlay_marks_knowledge_context_frontier_non_diegetic' (24244) panicked at crates/tracewake-tui/src/render.rs:757:9:
assertion failed: rendered.contains("DEBUG NON-DIEGETIC: Embodied Overlay")

---- render::tests::renderer_prints_debug_only_action_diagnostics_when_present stdout ----

thread 'render::tests::renderer_prints_debug_only_action_diagnostics_when_present' (24249) panicked at crates/tracewake-tui/src/render.rs:443:9:
assertion failed: overlay.contains("debug_diagnostics action=open.door_market_store")

failures:
    app::tests::app_debug_overlay_renders_only_for_bound_debug_controller
    render::tests::debug_overlay_marks_knowledge_context_frontier_non_diegetic
    render::tests::renderer_prints_debug_only_action_diagnostics_when_present
    run::tests::scripted_loop_dispatches_commands_and_exits_cleanly

test result: FAILED. 40 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
