*** crates/tracewake-tui/src/render.rs:174:12: delete ! in render_debug_overlay

*** mutation diff:
--- crates/tracewake-tui/src/render.rs
+++ delete ! in render_debug_overlay
@@ -166,17 +166,17 @@
         view.holder_known_context_source_summary
     ));
     lines.push(format!(
         "{} available={}",
         DEBUG_TOKENS[2], view.debug_available
     ));
     for action in &view.semantic_actions {
         let diagnostics = action.availability.debug_only_diagnostics();
-        if !diagnostics.is_empty() {
+        if  /* ~ changed by cargo-mutants ~ */diagnostics.is_empty() {
             lines.push(format!(
                 "{} action={} values={}",
                 DEBUG_TOKENS[3],
                 action.semantic_action_id.as_str(),
                 diagnostics.join(",")
             ));
         }
     }

---- render::tests::renderer_prints_debug_only_action_diagnostics_when_present stdout ----

thread 'render::tests::renderer_prints_debug_only_action_diagnostics_when_present' (27083) panicked at crates/tracewake-tui/src/render.rs:443:9:
assertion failed: overlay.contains("debug_diagnostics action=open.door_market_store")

failures:
    render::tests::renderer_prints_debug_only_action_diagnostics_when_present

test result: FAILED. 43 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
