*** crates/tracewake-tui/src/render.rs:187:5: replace visible_item_source_label -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-tui/src/render.rs
+++ replace visible_item_source_label -> String with "xyzzy".into()
@@ -179,23 +179,17 @@
                 diagnostics.join(",")
             ));
         }
     }
     lines.join("\n")
 }
 
 fn visible_item_source_label(source: &VisibleItemSource) -> String {
-    match source {
-        VisibleItemSource::Place => "place".to_string(),
-        VisibleItemSource::Container(container_id) => {
-            format!("container:{}", container_id.as_str())
-        }
-        VisibleItemSource::Carried => "carried".to_string(),
-    }
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn render_notebook(view: &NotebookView) -> String {
     let mut lines = vec![format!("Notebook: {}", view.viewer_actor_id.as_str())];
     lines.push("Beliefs:".to_string());
     if view.source_bound_beliefs.is_empty() {
         lines.push("- none".to_string());
     }

---- render::tests::renderer_prints_door_endpoints_and_item_sources stdout ----

thread 'render::tests::renderer_prints_door_endpoints_and_item_sources' (32752) panicked at crates/tracewake-tui/src/render.rs:390:9:
assertion failed: rendered.contains("- apple_01 portable=true source=container:crate_01")

failures:
    render::tests::renderer_prints_door_endpoints_and_item_sources

test result: FAILED. 43 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
