*** crates/tracewake-tui/src/render.rs:197:5: replace render_notebook -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-tui/src/render.rs
+++ replace render_notebook -> String with "xyzzy".into()
@@ -189,92 +189,17 @@
         VisibleItemSource::Container(container_id) => {
             format!("container:{}", container_id.as_str())
         }
         VisibleItemSource::Carried => "carried".to_string(),
     }
 }
 
 pub fn render_notebook(view: &NotebookView) -> String {
-    let mut lines = vec![format!("Notebook: {}", view.viewer_actor_id.as_str())];
-    lines.push("Beliefs:".to_string());
-    if view.source_bound_beliefs.is_empty() {
-        lines.push("- none".to_string());
-    }
-    for belief in &view.source_bound_beliefs {
-        let contradictions = if belief.contradiction_ids.is_empty() {
-            "none".to_string()
-        } else {
-            belief.contradiction_ids.join(",")
-        };
-        lines.push(format!(
-            "- {} confidence={} source={} tick={} contradictions={} :: {}",
-            belief.belief_id,
-            belief.confidence_label,
-            belief.source_summary,
-            belief.acquired_tick,
-            contradictions,
-            belief.summary
-        ));
-    }
-
-    lines.push("Observations:".to_string());
-    if view.recent_observations.is_empty() {
-        lines.push("- none".to_string());
-    }
-    for observation in &view.recent_observations {
-        lines.push(format!(
-            "- {} channel={} confidence={} tick={} :: {}",
-            observation.observation_id,
-            observation.channel,
-            observation.confidence_label,
-            observation.observed_tick,
-            observation.summary
-        ));
-    }
-
-    lines.push("Contradictions:".to_string());
-    if view.known_contradictions.is_empty() {
-        lines.push("- none".to_string());
-    }
-    for contradiction in &view.known_contradictions {
-        lines.push(format!(
-            "- {} :: {}",
-            contradiction.contradiction_id, contradiction.summary
-        ));
-    }
-
-    lines.push("Leads:".to_string());
-    if view.typed_leads.is_empty() && view.possible_leads.is_empty() {
-        lines.push("- none".to_string());
-    }
-    for lead in &view.typed_leads {
-        lines.push(format!(
-            "- {} contradiction={} belief={} observation={} source_kind={} source={} confidence={} detected_tick={} staleness={} wrong_if={} next_actions={} :: {}",
-            lead.lead_id,
-            lead.contradiction_id,
-            lead.belief_id,
-            lead.observation_id,
-            lead.source_kind,
-            lead.source_summary,
-            lead.confidence_label,
-            lead.detected_tick,
-            lead.staleness_label,
-            lead.how_this_may_be_wrong,
-            lead.possible_next_actions.join(","),
-            lead.summary
-        ));
-    }
-    if view.typed_leads.is_empty() {
-        for lead in &view.possible_leads {
-            lines.push(format!("- {lead}"));
-        }
-    }
-
-    lines.join("\n")
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn render_rejection(report: &ValidationReport) -> String {
     format!(
         "Why-not: {} ({})",
         report.actor_visible_summary,
         report
             .reason_codes

---- embodied_view_option_and_collection_fields_have_reachable_producers stdout ----

thread 'embodied_view_option_and_collection_fields_have_reachable_producers' (4192) panicked at crates/tracewake-core/tests/anti_regression_guards.rs:6899:5:
dead embodied surface field sweep found missing producers: [
    "NotebookBeliefEntry.contradiction_ids (Vec<String>) has no embodied render/app consumer or cited deferral",
    "NotebookLeadEntry.belief_id (String) has no embodied render/app consumer or cited deferral",
    "NotebookLeadEntry.confidence_label (String) has no embodied render/app consumer or cited deferral",
    "NotebookLeadEntry.contradiction_id (String) has no embodied render/app consumer or cited deferral",
    "NotebookLeadEntry.detected_tick (u64) has no embodied render/app consumer or cited deferral",
    "NotebookLeadEntry.how_this_may_be_wrong (String) has no embodied rende

failures:
    embodied_view_option_and_collection_fields_have_reachable_producers

test result: FAILED. 79 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.35s

*** result: Failure(101)
