*** crates/tracewake-tui/src/render.rs:246:36: replace && with || in render_notebook

*** mutation diff:
--- crates/tracewake-tui/src/render.rs
+++ replace && with || in render_notebook
@@ -238,17 +238,17 @@
     for contradiction in &view.known_contradictions {
         lines.push(format!(
             "- {} :: {}",
             contradiction.contradiction_id, contradiction.summary
         ));
     }
 
     lines.push("Leads:".to_string());
-    if view.typed_leads.is_empty() && view.possible_leads.is_empty() {
+    if view.typed_leads.is_empty() || /* ~ changed by cargo-mutants ~ */ view.possible_leads.is_empty() {
         lines.push("- none".to_string());
     }
     for lead in &view.typed_leads {
         lines.push(format!(
             "- {} contradiction={} belief={} observation={} source_kind={} source={} confidence={} detected_tick={} staleness={} wrong_if={} next_actions={} :: {}",
             lead.lead_id,
             lead.contradiction_id,
             lead.belief_id,

---- render::tests::render_notebook_prints_typed_lead_anatomy stdout ----

thread 'render::tests::render_notebook_prints_typed_lead_anatomy' (7078) panicked at crates/tracewake-tui/src/render.rs:524:9:
assertion failed: !rendered.lines().skip_while(|line|
                *line != "Leads:").any(|line| line == "- none")

failures:
    render::tests::render_notebook_prints_typed_lead_anatomy

test result: FAILED. 43 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.16s

*** result: Failure(101)
