*** crates/tracewake-tui/src/render.rs:276:5: replace render_rejection -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-tui/src/render.rs
+++ replace render_rejection -> String with "xyzzy".into()
@@ -268,26 +268,17 @@
             lines.push(format!("- {lead}"));
         }
     }
 
     lines.join("\n")
 }
 
 pub fn render_rejection(report: &ValidationReport) -> String {
-    format!(
-        "Why-not: {} ({})",
-        report.actor_visible_summary,
-        report
-            .reason_codes
-            .iter()
-            .map(|reason| reason.stable_id())
-            .collect::<Vec<_>>()
-            .join(",")
-    )
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use tracewake_core::actions::report::ReasonCode;
     use tracewake_core::epistemics::KnowledgeContext;
     use tracewake_core::ids::{

---- adversarial_gates_why_not_actor_surface_uses_typed_non_leaking_facts stdout ----

thread 'adversarial_gates_why_not_actor_surface_uses_typed_non_leaking_facts' (12790) panicked at crates/tracewake-tui/tests/adversarial_gates.rs:653:5:
assertion failed: rendered_rejection.contains("Why-not:")

failures:
    adversarial_gates_why_not_actor_surface_uses_typed_non_leaking_facts

test result: FAILED. 14 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
