*** crates/tracewake-tui/src/render.rs:32:12: delete ! in render_embodied_view

*** mutation diff:
--- crates/tracewake-tui/src/render.rs
+++ delete ! in render_embodied_view
@@ -24,17 +24,17 @@
 
     if let Some(why_not) = &view.last_rejection_why_not {
         lines.push(format!(
             "Why-not: {} kind={} reasons={}",
             why_not.actor_known_summary,
             why_not.failure_kind.stable_id(),
             why_not.reason_codes.join(",")
         ));
-        if !why_not.actor_visible_facts.is_empty() {
+        if  /* ~ changed by cargo-mutants ~ */why_not.actor_visible_facts.is_empty() {
             lines.push(format!(
                 "Why-not facts: {}",
                 why_not.actor_visible_facts.join(",")
             ));
         }
     } else if let Some(summary) = &view.last_rejection_summary {
         lines.push(format!("Why-not: {summary}"));
     }

---- render::tests::renderer_prints_typed_why_not_facts_from_view_model stdout ----

thread 'render::tests::renderer_prints_typed_why_not_facts_from_view_model' (17455) panicked at crates/tracewake-tui/src/render.rs:488:9:
assertion failed: rendered.contains("Why-not facts: door_id=door_market_store,to_place_id=store_room")

failures:
    render::tests::renderer_prints_typed_why_not_facts_from_view_model

test result: FAILED. 43 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
