*** crates/tracewake-tui/src/transcript.rs:14:5: replace capture_representative_transcript -> Result<String, AppError> with Ok(String::new())

*** mutation diff:
--- crates/tracewake-tui/src/transcript.rs
+++ replace capture_representative_transcript -> Result<String, AppError> with Ok(String::new())
@@ -6,19 +6,17 @@
 
 #[derive(Clone, Debug, PartialEq, Eq, PartialOrd, Ord)]
 pub struct TranscriptSection {
     pub name: String,
     pub body: String,
 }
 
 pub fn capture_representative_transcript() -> Result<String, AppError> {
-    Ok(render_transcript_sections(
-        &capture_representative_transcript_sections()?,
-    ))
+    Ok(String::new()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn capture_representative_transcript_sections() -> Result<Vec<TranscriptSection>, AppError> {
     let mut app = TuiApp::from_golden(fixtures::door_access_001())?;
     app.bind_actor(ActorId::new("actor_sena").unwrap())?;
 
     let mut sections = Vec::new();
     sections.push(section("view.initial", app.render_current_view()?));

---- tui_transcript_marks_debug_sections_non_diegetic stdout ----

thread 'tui_transcript_marks_debug_sections_non_diegetic' (15645) panicked at crates/tracewake-tui/tests/adversarial_gates.rs:841:9:
transcript missing debug marker DEBUG NON-DIEGETIC: Event Log

failures:
    tui_transcript_marks_debug_sections_non_diegetic

test result: FAILED. 14 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
