*** crates/tracewake-tui/src/transcript.rs:42:50: replace == with != in capture_representative_transcript_sections

*** mutation diff:
--- crates/tracewake-tui/src/transcript.rs
+++ replace == with != in capture_representative_transcript_sections
@@ -34,17 +34,17 @@
         "notebook.actor_sena",
         crate::render::render_notebook(&app.notebook_view()?),
     ));
 
     let wait_action_id = app
         .current_view()?
         .semantic_actions
         .iter()
-        .find(|action| action.action_id.as_str() == "wait")
+        .find(|action| action.action_id.as_str() != /* ~ changed by cargo-mutants ~ */ "wait")
         .map(|action| action.semantic_action_id.clone())
         .ok_or_else(|| AppError::SemanticActionNotFound("wait".to_string()))?;
     app.submit_semantic_action(&wait_action_id)?;
     sections.push(section("view.after_wait", app.render_current_view()?));
 
     sections.push(section(
         "debug.event_log",
         app.render_debug_event_log_panel(),

---- transcript::tests::representative_transcript_is_deterministic stdout ----

thread 'transcript::tests::representative_transcript_is_deterministic' (23816) panicked at crates/tracewake-tui/src/transcript.rs:144:9:
assertion failed: after_wait.body.contains("Tick: 1")

failures:
    transcript::tests::representative_transcript_is_deterministic

test result: FAILED. 43 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.15s

*** result: Failure(101)
