*** crates/tracewake-tui/src/transcript.rs:91:5: replace render_transcript_sections -> String with "xyzzy".into()

*** mutation diff:
--- crates/tracewake-tui/src/transcript.rs
+++ replace render_transcript_sections -> String with "xyzzy".into()
@@ -83,21 +83,17 @@
             &app.debug_observations_view(&ActorId::new("actor_sena").unwrap())?,
         ),
     ));
 
     Ok(sections)
 }
 
 pub fn render_transcript_sections(sections: &[TranscriptSection]) -> String {
-    sections
-        .iter()
-        .map(|section| format!("== {} ==\n{}", section.name, section.body))
-        .collect::<Vec<_>>()
-        .join("\n\n")
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 fn section(name: &str, body: String) -> TranscriptSection {
     TranscriptSection {
         name: name.to_string(),
         body,
     }
 }

---- transcript::tests::representative_transcript_is_deterministic stdout ----

thread 'transcript::tests::representative_transcript_is_deterministic' (29160) panicked at crates/tracewake-tui/src/transcript.rs:141:9:
assertion failed: first.contains("== view.initial ==")

failures:
    transcript::tests::representative_transcript_is_deterministic

test result: FAILED. 43 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.14s

*** result: Failure(101)
